{"ANU": {"name": "Abdel Latif Mohamed", "link": "https://researchers.anu.edu.au/researchers/mohamed-a", "colleges": "College of Health & Medicine", "email": "Abdel-Latif.Mohamed@anu.edu.au", "phone": "+612 6174 7565", "expertise": ["Paediatrics", "Intensive Care", "Foetal Development And Medicine", "Epidemiology", "Biostatistics"], "interest": ["Neonatal and perinatal medicine,Epidemiology of prematurity,Quality of care in neonatal intensive care units,Neurodevelopmental outcome of premature infantsNeonatal abstinence syndrome"], "biography": "Dr Abdel-Latif Mohamed is a Professor of Neonatology at Australian National University and Senior Neonatologist at Canberra Hospital, Australia. His research interests include epidemiology of prematurity, quality of care, neurodevelopmental outcome and neonatal abstinence syndrome. He is expert in clinical and epidemiological research design and advanced statistical modelling. He has published widely in peer-reviewed journals. He is actively involved in undergraduate teaching and postgraduate supervision.", "project": [], "publication": [{"title": "Epidemiological Evidence for a Decreasing Incidence of Neonatal Abstinence Syndrome, 2000-11", "year": "2016", "source": "Paediatric and Perinatal Epidemiology, vol. 30, no. 3, pp. 267-273", "authors": ["Uebel H", "Wright I", "Burns L", "Abdel Latif Mohamed"]}, {"title": "CeasIng Cpap At standarD criteriA (CICADA): predicting a successful outcome", "year": "2016", "source": "European Journal of Pediatrics, vol. 175, no. 1, pp. 81-87", "authors": ["Yin Y", "Broom M", "Wright A", "Abdel Latif Mohamed"]}, {"title": "Population study of neurodevelopmental outcomes of extremely premature infants admitted after office hours", "year": "2014", "source": "Journal of Paediatrics and Child Health, vol. 50, no. 10, pp. E45-E54", "authors": ["Abdel Latif Mohamed", "Oei J"]}, {"title": "The association between maternal country of birth and neonatal intensive care unit outcomes", "year": "2013", "source": "Early Human Development, vol. 89, no. 8, pp. 607-614", "authors": ["Uppal P", "Holland A", "Bajuk B", "Abdel Latif Mohamed"]}, {"title": "Neurodevelopmental outcomes of extremely premature infants conceived after assisted conception: a population based cohort study", "year": "2012", "source": "Archives of Disease in Childhood. Fetal and Neonatal Edition, vol. 98, no. 3, pp. F205-11. doi: 10.1136/archdischild-2012-302040. [Epub 2012 Nov 15]", "authors": ["Abdel Latif Mohamed", "Ward M"]}, {"title": "Profile of infants born to drug-using mothers: A state-wide audit", "year": "2013", "source": "Journal of Paediatrics and Child Health, vol. 49, no. 1, pp. E80-E86", "authors": ["Abdel Latif Mohamed", "Craig F"]}, {"title": "Causes of death in infants admitted to Australian neonatal intensive care units between 1995 and 2006", "year": "2013", "source": "Acta Paediatrica, vol. 102, no. 1, pp. e17-e23", "authors": ["Feng Y", "Abdel Latif Mohamed"]}, {"title": "Effect of a multifaceted intervention on documentation of vital signs and staff communication regarding deteriorating paediatric patients", "year": "2013", "source": "Journal of Paediatrics and Child Health, vol. 49, no. 1, pp. 48-56", "authors": ["McKay H", "Mitchell I", "Sinn K", "Abdel Latif Mohamed"]}, {"title": "Perinatal outcomes of Australian buprenorphine-exposed mothers and their newborn infants", "year": "2013", "source": "Journal of Paediatrics and Child Health, vol. 49, no. 9, pp. 746-753", "authors": ["Patel P", "Abdel Latif Mohamed"]}, {"title": "mphetamines, the pregnant woman and her children: a review", "year": "2012", "source": "Journal of Perinatology, vol. 32, no. 10, pp. 737-747", "authors": ["Oei J", "Kingsbury A", "Dhawan A", "Abdel Latif Mohamed"]}, {"title": "Drugs of Dependency: The Pregnant Woman and Her Infant", "year": "2012", "source": "International Journal of Pediatrics, vol. 2011, no. Article ID 719894, pp. 1-2", "authors": ["Oei J", "Bartu A", "Burns L", "Abdel Latif Mohamed"]}, {"title": "Nebulised surfactant in preterm infants with or at risk of respiratory distress syndrome [Review]", "year": "2012", "source": ". Cochrane Database of Systemic Reviews. 2012 Oct 17;10:CD008310. doi: 10.1002/14651858.CD008310.pub2", "authors": ["Abdel Latif Mohamed"]}, {"title": "Can the early condition at admission of a high-risk infant aid in the prediction of mortality and poor neurodevelopmental outcome? A population study in Australia", "year": "2012", "source": "Journal of Paediatrics and Child Health, vol. 48, no. 7, pp. 588-595", "authors": ["Greenwood S", "Abdel Latif Mohamed"]}, {"title": "Insulin infusion for hyperglycaemia in very preterm infants appears safe with no effect on morbidity, mortality and long-term neurodevelopmental outcome", "year": "2012", "source": "Journal of Maternal - Fetal & Neonatal Medicine, The, vol. 25, no. 11, pp. 2415-2418", "authors": ["Heald A", "Abdel Latif Mohamed"]}, {"title": "Prevalance of stress among international post-graduate doctors at the University Malaya Medical Centre (UMMC), Kuala Lumpur", "year": "2012", "source": "Journal of Clinical and Diagnostic Research, vol. 6, no. 5, pp. 859-862", "authors": ["Hussein O", "Zainal N", "Abdel Latif Mohamed"]}, {"title": "Mortality and Adverse Neurologic Outcomes Are Greater in Preterm Male Infants", "year": "2012", "source": "Pediatrics, vol. 129, no. 1, pp. 124-131", "authors": ["Kent A", "Wright I", "Abdel Latif Mohamed"]}, {"title": "Breast milk banking: Current opinion and practice in Australian neonatal intensive care units", "year": "2012", "source": "Journal of Paediatrics and Child Health, vol. 48, no. 9, pp. 833-839", "authors": ["Lam Y", "Kecskes Z", "Abdel Latif Mohamed"]}, {"title": "Dopamine D2 receptor gene polymorphisms in newborn infants of drug-using women", "year": "2012", "source": "Archives of Disease in Childhood Fetal and Neonatal Edition, vol. 97, no. 3, pp. F193-F198", "authors": ["Oei J", "Xu H", "Abdel Latif Mohamed"]}, {"title": "The associations between ethnicity and outcomes of infants in neonatal intensive care units", "year": "2012", "source": "Archives of Disease in Childhood Fetal and Neonatal Edition, vol. 97, no. 2, pp. F133-F138", "authors": ["Ruan S", "Abdel Latif Mohamed", "Bajuk B"]}, {"title": "Intratracheal Clara cell secretory protein (CCSP) administration in preterm infants with or at risk of respiratory distress syndrome [Review]", "year": "2011", "source": ". Cochrane Database of Systemic Reviews 2011Issue 5. Art. No.: CD008308. DOI: 10.1002/14651858.CD008308.pub2", "authors": ["Abdel Latif Mohamed"]}, {"title": "Pharyngeal instillation of surfactant before the first breath for prevention of morbidity and mortality in preterm infants at risk of respiratory distress syndrome [Review]. Cochrane Database of Systematic Reviews 2011", "year": "2011", "source": "Issue 3. Art. No.: CD008311. DOI: 10.1002/14651858.CD008311.pub2", "authors": ["Abdel Latif Mohamed"]}, {"title": "Noninvasive ventilation in a tertiary pediatric intensive care unit in a middle-income country", "year": "2011", "source": "Pediatric Critical Care Medicine, vol. 12, no. 1, pp. e7-e13", "authors": ["Lum L", "Abdel Latif Mohamed"]}, {"title": "Congenital cytomegalovirus infection", "year": "2010", "source": "New England Journal of Medicine, vol. 362, no. 9, pp. 833-", "authors": ["Abdel Latif Mohamed"]}, {"title": "nalysis of the retrieval times of a centralised transport service, New South Wales, Australia", "year": "2009", "source": "Archives of Disease in Childhood, vol. 94, no. 4, pp. 282-286", "authors": ["Abdel Latif Mohamed"]}]}, "Microsoft-Academic": [{"title": "transport du fer chez les bacteries fixatrices d azote structure tridimensionnelle en solution des pyoverdines de pseudomonas putida g4r synthese d analogues photoactivables de siderophores", "year": 1998, "source": "", "authors": [{"name": "salah el din"}, {"name": "abdel latif mohamed"}]}], "ANDS-Grants": []}