{"ANU": {"name": "Adam Masters", "link": "https://researchers.anu.edu.au/researchers/masters-ab", "colleges": "College of Arts and Social Sciences", "email": "adam.masters@anu.edu.au", "phone": "", "expertise": ["International Relations", "Police Administration Procedures And Practice", "Causes And Prevention Of Crime", "Public Administration"], "interest": [], "biography": "Dr Adam Masters comes to the Australian National University following a 24-year career with the Australian government. His public sector career included time at the Department of Defence, the Australian Taxation Office and 18 years with the Australian Federal Police. While at the AFP, Adam spent close to a decade as team leader with Interpol Canberra and two years teaching counter-terrorism investigations at the AFP College. In mid-2009, Adam changed direction to pursue an academic career and, since 2010, he has worked with the ANU Transnational Research Institute on Corruption (TRIC). Dr Masters' current research and teaching focuses on corruption and anti-corruption, particularly in rich countries, transnational organized crime and the influence of culture on international organisations.", "project": ["Adam has two current research projects. The first - union corruption - explores alternatives to controlling corruption in the union movement using non-traditional (i.e. legal or political) means of addressing the issue. Union corruption in Australia persists despite numerous Royal Commissions, political will and legislative changes in recent decades. Alternatives under consideration include codes of conduct and other internally generated governance mechanisms.", "His second project - Intergenerational organised crime - explores multi-generational criminal activity within families. The question motivating this research is whether family-based organised crime groups are ‘going legit’.", "Previously, Dr Masters contributed research for two significant projects commissioned by anti-corruption agencies in Australia. The first was his contribution to the report commissioned by the Victorian Independent Broad-based Anti-corruption Commission. Chapter two of the report Perception of Corruption in Victoria dealt with the manner in which the media reported on corruption. In this chapter, media perceptions were contrasted with the narrower legal definition provided by the IBAC Act.In 2015, Adam was lead author on the report for the Western Australia Corruption and Crime Commission's Project to review corruption prevention theory and practice: Towards a new model for the Corruption and Crime Commission. The report provided the Commission with a conceptual model of corruption prevention grounded in theory and practice."], "publication": [{"title": "Quality of Governance: Values and Violations", "year": "2020", "source": "Palgrave MacmillanCham, Switzerland", "authors": ["Huberts L", "Adam Masters", "Paanakker H", "eds"]}, {"title": "Reviewing Quality of Governance: New Perspectives and Future Research", "year": "2020", "source": "in H Paanakker, A Masters, L Huberts (ed.), Quality of Governance: Values and Violations, Palgrave Macmillan, Cham, Switzerland, pp. 237-247", "authors": ["Adam Masters", "Paanakker H", "Huberts L"]}, {"title": "Quality of Governance: Values and Violations", "year": "2020", "source": "in Dieter Plehwe, Quinn Slobodian, Philip Mirowski (ed.), Nine Lives of Neoliberalism, Verso Books, London, United Kingdom, pp. 3-24", "authors": ["Paanakker H", "Adam Masters", "Huberts L"]}, {"title": "Robustness and the Governance Sin of Bureaucratic Animosity", "year": "2020", "source": "in H Paanakker, A Masters, L Huberts (ed.), Quality of Governance: Values and Violations, Palgrave Macmillan, Cham, Switzerland, pp. 215-234", "authors": ["Adam Masters"]}, {"title": "Corruption in Australia and New Zealand", "year": "2020", "source": "in M Powell, D Wafa, T A Mau (ed.), Corruption in a Global Context: Restoring Public Trust, Integrity and Accountability, Routledge, United Kingdom, pp. 155-176", "authors": ["Adam Masters", "Hall K"]}, {"title": "Tax Havens and Grand Corruption", "year": "2019", "source": "in Philip L Reichel (ed.), Global Crime: An Encyclopedia of Cyber Theft, Weapon Sales, and Other Illegal Activities, ABC-Clio Inc, Santa Barbara, USA, pp. 547-549", "authors": ["Adam Masters"]}, {"title": "Sport Corruption and Match Fixing", "year": "2019", "source": "in Philip L Reichel (ed.), Global Crime: An Encyclopedia of Cyber Theft, Weapon Sales, and Other Illegal Activities, ABC-Clio Inc, Santa Barbara, USA, pp. 535-539", "authors": ["Adam Masters"]}, {"title": "Where is the love? Considering Compassion", "year": "2019", "source": "s role in public values scholarship'in Gjalt De Graaf (ed.), It is all about integrity, stupid: Studies on, about or inspired by the work of Leo Huberts, Eleven International Publishing, The Netherlands, pp. 151-162", "authors": ["Adam Masters"]}, {"title": "Meet Reece Kershaw, the new AFP commissioner. He", "year": "2019", "source": "s confronted superiors beforeand will need to again. The Conversatio", "authors": ["Adam Masters"]}, {"title": "Cultural Influences on Public-Private Partnerships in Global Governance", "year": "2019", "source": "Palgrave MacmillanLondon", "authors": ["Adam Masters"]}, {"title": "Preventing malfeasance in low corruption environments: twenty public administration responses", "year": "2018", "source": "Journal of Financial Crime, vol. 25, no. 1, pp. 170-186", "authors": ["Graycar A", "Adam Masters"]}, {"title": "How the transnational crime of corruption impacts global security", "year": "2018", "source": "in Philip Reichel and Ryan Randa (ed.), Transnational Crime and Global Security, Praeger Publishers, Santa Barbara, pp. 253-280", "authors": ["Adam Masters"]}, {"title": "The who, not the what”analysing public knowledge on\r\norganised criminals", "year": "2018", "source": "in R. G. Smith (ed.), Organised crime research in Australia 2018, Australian Institute of Criminology, Canberra, pp. 25-33pp", "authors": ["Adam Masters"]}, {"title": "The state of organised crime research in Australia", "year": "2018", "source": "'in R. G. Smith (ed.), Organised crime research in Autralia 2018, Australian Institute of Criminology, Canberra, pp. 1-8", "authors": ["Broadhurst R", "Master A", "Smith R and Brown R", "Adam Masters"]}, {"title": "Corruption: What everyone needs to know® by Ray Fisman and Miriam A. Golden. (Oxford University Press, New York 2017), pp. xviii + 316", "year": "2018", "source": ". Economic Record DOI 10.1111/1475-4932.1243", "authors": ["Adam Masters"]}, {"title": "Leadership Performance and Rhetoric", "year": "2017", "source": "Palgrave MacmillanUK", "authors": ["Adam Masters", "Uhr J"]}, {"title": "Making Corruption Disappear in Local Government", "year": "2016", "source": "Public Integrity, vol. 18, no. 1, pp. 42-58", "authors": ["Adam Masters", "Graycar A"]}, {"title": "New Victorian Era: Getting Crime Out of Commercial Sex", "year": "2017", "source": "in LeClerc, Benoit, Savona, Ernesto U. (Eds.) (ed.), Crime Prevention in the 21st Century: Insightful approaches for crime prevention initiatives, Springer International Publishing Switzerland, Switzerland, pp. 293-315", "authors": ["Adam Masters", "Graycar A"]}, {"title": "Public Corruption", "year": "2016", "source": "in Ali Farazmand (ed.), Global Encyclopedia of Public Administration, Public Policy, and Governance, Springer International Publishing Switzerland, Switzerland, pp. 1-7", "authors": ["Adam Masters"]}, {"title": "Quality of governance in Australian unions", "year": "2016", "source": "International Institute of Administrative Sciences (IIAS) and the International Association of Schools and Institutes of Administration (IASIA) Joint Congress, International Institute of Administrative Sciences, Belgium, p. 32", "authors": ["Adam Masters"]}, {"title": "voiding the pitfalls of union corruption", "year": "2017", "source": "3rd International Conference on Democratic Governance in the Developing World, ed. Ignacio Carolos Pezo Salazar, Syracuse University, USA, pp. 684-711", "authors": ["Adam Masters"]}, {"title": "Submission to the Inquiry into Illicit Tobacco", "year": "2016", "source": ". Parliamentary Joint Committee on Law Enforcemen", "authors": ["Adam Masters"]}, {"title": "Corruption in sport: a new field for public policy", "year": "2015", "source": "SYMPOSIUM of the Anti - Corruption Academic (ACAD) Initiative, ed. R. O'Laire, UNODC United Nations Office on Drugs and Crime, Vienna, pp. 56-67", "authors": ["Adam Masters", "Graycar A"]}, {"title": "Corruption in sport: From the playing field to the field of policy", "year": "2015", "source": "Policy & Society: journal of public, foreign and global policy, vol. 34, no. 2, pp. 111-123", "authors": ["Adam Masters"]}, {"title": "Media reporting of corruption: policy implications", "year": "2015", "source": "Crime, Law and Social Change, vol. 64, no. 2-3, pp. 153-175pp", "authors": ["Adam Masters", "Graycar A"]}, {"title": "Making Corruption Disappear in Local Government", "year": "2014", "source": "International Symposium on Ethical Leadership (II), ed. A. Podger and D.C. Menzel, University of Electronic Science and Technology of China, China, pp. 27pp", "authors": ["Adam Masters", "Graycar A"]}, {"title": "Prime ministerial rhetoric and recession politics: Meaning making in economic crisis management", "year": "2012", "source": "Public Administration, vol. 90, no. 3, pp. 759-780", "authors": ["Adam Masters", "'t Hart P"]}, {"title": "INTERPOL: From Vienna to Canberra - The evolution of Australia", "year": "2011", "source": "s relationship with INTERPOL (1923-1975)'Australian Police Journal, vol. 65, no. 2, pp. 58-67", "authors": ["Adam Masters"]}, {"title": "Privatizing policing on a global scale? Interpol", "year": "2011", "source": "s new partnership'Australasian Political Studies Association Conference (APSA 2011), Conference Organising Committee, Canberra Australia, pp. 1-13", "authors": ["Adam Masters"]}, {"title": "Republic of Ireland: from Celtic tiger to recession victim", "year": "2009", "source": "in t Hart, Paul and Tindall, Karen (ed.), Framing the global economic downturn: Crisis rhetoric and the politics of recessions, ANU ePress, Canberra, pp. 127-155", "authors": ["Adam Masters"]}]}, "Microsoft-Academic": [{"title": "particle acceleration during interactions between transient ion foreshock phenomena and earth s bow shock", "year": 2014, "source": "", "authors": [{"name": "d l turner"}, {"name": "v angelopoulos"}, {"name": "l b wilson"}, {"name": "heli hietala"}, {"name": "nick omidi"}, {"name": "adam masters"}]}, {"title": "the state of organised crime research in australia", "year": 2018, "source": "", "authors": [{"name": "roderic broadhurst"}, {"name": "adam masters"}, {"name": "russell g smith", "affiliation": "australian institute of criminology"}, {"name": "rick brown", "affiliation": "australian institute of criminology"}]}, {"title": "a different nature of solar wind interaction at the ice giant magnetospheres", "year": 2018, "source": "", "authors": [{"name": "adam masters"}]}, {"title": "where is the love considering compasion s role in public values scholarship", "year": 2019, "source": "", "authors": [{"name": "adam masters"}]}], "ANDS-Grants": []}