{"ANU": {"name": "Aditya Balasubramanian", "link": "https://researchers.anu.edu.au/researchers/balasubramanian-a", "colleges": "College of Arts and Social Sciences", "email": "aditya.balasubramanian@anu.edu.au", "phone": "6125 5114", "expertise": [], "interest": ["history of modern South and Southeast Asia; history of economic thought; material histories of consumption and culture; energy and environmental history; international history"], "biography": "-\"A More Indian Path to Prosperity? Hindu Nationalism and Development in the mid-20th century, and beyond\"", "project": ["Free Economy and Opposition Politics in India: A History", "Procedural democracy and the escape from the colonial growth trap define India’s postcolonial history (1947-). However, the challenges of working with fragmentary archives have generally turned historians away from studying these simultaneous, interrelated processes. Stepping into this void, my project considers how changing social and economic structure shaped the emergence of a powerful current of right-wing politics in India, expressed in an idiom of ‘free economy.’ It was opposed to the developmental state directed by the dominant Indian National Congress Party (Congress) and driven by regional actors hailing from southern and western India, regions with traditions of overseas trade and landowning proprietorship. These actors, hailing from powerful landed and mercantile communities transitioning to capitalism, had by the 1960s made the most successful attempt to bring India a two-party system through their conservative Swatantra (‘Freedom’) Party. Swatantra was broadly secular, distinguishing it both from its contemporary Jana Sangh and today’s ascendant Hindu nationalist Bharatiya Janata Party (BJP). Drawing upon eighteen months of archival research across three continents and sources ranging from comic strips to gramophone recordings in English, Gujarati, Hindi, and Tamil, I recover this important but largely unacknowledged phenomenon in Indian history.", "My study makes three principal contributions. First, departing from the conventional focus of the global historiography of postwar market advocacy on professional economists and international economic institutions, it studies politicians and publicists.  It captures how informal thinkers in the decolonizing world conceived of alternative political economies to India’s statist developmental model and yoked them to their immediate electoral objectives. By showing how these actors were influenced by community and region, it unearths social and political dimensions of the ideological embedding of market advocacy in India several decades before the 1991 economic liberalization reforms. Second, my project foregrounds how local actors carried out a Cold War battle for ideas in the ostensibly non-aligned world. It reconstructs how they generated a critique of planned economic development in an anticommunist network of periodicals and associations, conversing with but independent of foreign interlocutors. Finally it shows how rather than paving the way for the rise of postcolonial authoritarianism, the splintering of factions comprising a flagship anticolonial nationalist party can instead deepen democracy by pluralizing voter choice, reshaping public discourse, and creating pressure for administrative reform.", "", "Commerce between Modern South and Southeast Asia: A Micro-Macro History", "This project is an inter-Asian, inter-imperial history of commerce and the law in South and Southeast Asia, from the mid-19th century to the 1950s. Building upon the burgeoning history of the Indian Ocean world, it has two key objectives. First, it will examine how the British, Dutch, and French Empires structured legal regimes to govern and tax small indigenous family businesses as well as facilitate capital accumulation for European-owned joint stock firms and outposts of metropolitan companies. In that sense, this is a history of how everyday bureaucratic procedure regulates the movement of people and commodities, and how this is navigated, subverted, and reformed in response. Second, it will consider how minor colonial officials, company clerks, and small businesspeople, experienced and navigated economic change during this period. How did people experience the volatility of global market integration? What financial products were developed for new forms of exchange over longer time horizons and to mitigate risk? How did races mix and resist each other? What were the effects of prosperity in the port cities of Southeast Asia on rural hinterlands of origin via remittances of money and expanded flows of commodities?", "Labour migration and the histories of specific merchant communities in the Indian Ocean region have attracted major attention in recent times. But the economic lives of professionals and small businesses suffer from comparative neglect. And although overseas Chinese commerce in southeast Asia have attracted major historiographical interest, their Indian counterparts of the Chettiar, Parsi, Marakkayar, and Sindhi communities remain mainly unexplored. This project tries to understand the experience of globalisation and capitalism from a connected but comparative viewpoint in the Southern Hemisphere. It is a macro-micro history, alternating between the scales of individuals, families, communities, and regions.", "This project will use a range of sources in multiple languages. Collections across India, Indonesia, Malaysia, Myanmar, Singapore, and Sri Lanka have been identified for consultation. Apart from conventional archives of the colonial state, these also include bank records, court cases, permit applications, and family collections. One such collection located is over 400 pages of letters between a South Indian typist working at an English shipping firm in Batavia (today’s Jakarta) and remitting money home to pay off the family’s debts during the Great Depression and his family members.", "", "", ""], "publication": [{"title": "Contesting \"Permit-and-Licence Raj\": Economic Conservatism and the Idea of Democracy in 1950s India", "year": "2021", "source": "Past and Present, vol. 251, no. 1, pp. 189-227.\r\n\r\nAvailable at https://academic.oup.com/past/article/251/1/189/5954184?guestAccessKey=8b6e6607-04d6-4887-a1fd-49428705ced", "authors": ["Aditya Balasubramanian"]}, {"title": "Present at the Creation: India, the Global Economy, and the Bretton Woods Conference", "year": "2018", "source": "Journal of World History, vol. 29, no. 1, pp. 65-94 (with Srinath Raghavan)", "authors": ["Aditya Balasubramanian"]}]}, "Microsoft-Academic": [{"title": "biologically derived soft conducting hydrogels using heparin doped polymer networks", "year": 2014, "source": "acs nano", "authors": [{"name": "hangjun ding", "affiliation": "university of science and technology beijing"}, {"name": "mingjiang zhong"}, {"name": "young jo kim"}, {"name": "pitirat pholpabu"}, {"name": "aditya balasubramanian"}, {"name": "chin ming hui"}, {"name": "hongkun he"}, {"name": "huai yang"}, {"name": "krzysztof matyjaszewski"}, {"name": "christopher j bettinger"}], "id": 145476921}, {"title": "microfluidic thermally activated materials for rapid control of macroscopic compliance", "year": 2014, "source": "advanced functional materials", "authors": [{"name": "aditya balasubramanian", "affiliation": "carnegie mellon university"}, {"name": "mike standish", "affiliation": "carnegie mellon university"}, {"name": "christopher j bettinger", "affiliation": "carnegie mellon university"}], "id": 135204980}, {"title": "reconfigurable topography for rapid solution processing of transparent conductors", "year": 2014, "source": "advanced materials", "authors": [{"name": "haosheng wu", "affiliation": "carnegie mellon university"}, {"name": "monisha menon", "affiliation": "carnegie mellon university"}, {"name": "evan m gates", "affiliation": "carnegie mellon university"}, {"name": "aditya balasubramanian", "affiliation": "carnegie mellon university"}, {"name": "christopher j bettinger", "affiliation": "carnegie mellon university"}], "id": 99352657}, {"title": "lithography free fabrication of reconfigurable substrate topography for contact guidance", "year": 2015, "source": "biomaterials", "authors": [{"name": "pitirat pholpabu", "affiliation": "carnegie mellon university"}, {"name": "stephen kustra", "affiliation": "carnegie mellon university"}, {"name": "haosheng wu", "affiliation": "carnegie mellon university"}, {"name": "aditya balasubramanian", "affiliation": "carnegie mellon university"}, {"name": "christopher j bettinger", "affiliation": "carnegie mellon university"}], "id": 163807576}, {"title": "shape recovery kinetics in vascularized 3d printed polymeric actuators", "year": 2015, "source": "advanced engineering materials", "authors": [{"name": "aditya balasubramanian"}, {"name": "christopher j bettinger"}], "id": 156255550}, {"title": "shape memory materials shape memory microfluidics adv funct mater 38 2013", "year": 2013, "source": "advanced functional materials", "authors": [{"name": "aditya balasubramanian"}, {"name": "robert morhard"}, {"name": "christopher j bettinger"}], "id": 135204980}, {"title": "shape memory microfluidics", "year": 2013, "source": "advanced functional materials", "authors": [{"name": "aditya balasubramanian"}, {"name": "robert morhard"}, {"name": "christopher j bettinger"}], "id": 135204980}, {"title": "developing a hardware platform for a low power low cost size constrained biomechanical telemetry system", "year": 2014, "source": "", "authors": [{"name": "aditya balasubramanian"}]}, {"title": "lithography free microfabrication of electrode arrays with 2 μm electrode gaps using topographic templates", "year": 2014, "source": "advanced materials interfaces", "authors": [{"name": "haosheng wu", "affiliation": "carnegie mellon university"}, {"name": "monisha menon", "affiliation": "carnegie mellon university"}, {"name": "congcong zhu", "affiliation": "carnegie mellon university"}, {"name": "aditya balasubramanian", "affiliation": "carnegie mellon university"}, {"name": "christopher j bettinger", "affiliation": "carnegie mellon university"}], "id": 2764385675}, {"title": "contesting permit and licence raj economic conservatism and the idea of democracy in 1950s india", "year": 2021, "source": "past & present", "authors": [{"name": "aditya balasubramanian", "affiliation": "australian national university"}], "id": 42922845}], "ANDS-Grants": []}