{"ANU": {"name": "Adrian Mackenzie", "link": "https://researchers.anu.edu.au/researchers/mackenzie-a", "colleges": "College of Arts and Social Sciences", "email": "Adrian.Mackenzie@anu.edu.au", "phone": "", "expertise": ["Sociology And Social Studies Of Science And Technology", "Communication Technology And Digital Media Studies", "Screen And Media Culture", "History And Philosophy Of Engineering And Technology"], "interest": ["I research how contemporary cultures affect and  are affected by technologies in a broad sense. My research is sociological in that it  draws  on approaches from the social studies of science and technology, media and cultural studies,  with a particular commitment to studies of software.My current research projects focus on platforms and platform sociology in the context of science and media, on biosensors and biosensing practices in the context of health and illness, and on data science-related transformations in knowledge in the sciences, education and government.My recent work has been concerned with platform capitalisation and machine learning. I examine linkages between platforms and prediction in much of this work, including projects focused on large image collections, and projects focused on platform infrastructures. I am currently working with Anna Munster (UNSW) and Kynan Tan on an ARC Discovery Project 'Re-imaging the Empirical' (2017-2021) that tracks changes in visual cultures of machine learning.IN 2019-2020, I've been working with CSIRO Land & Water and Data61 on platform urbanism.  Ashlin Lee, Paul Box, Andrew Rees,  Gavin Smith (Sociology, ANU) and I have been mapped several hundred smart city projects, leading to reports and journal articles.I'm excited to be working with Gavin Smith, Celia Roberts, Adrian Manning (Fenner Schoo, ANUl), Sujatha Raman (CPAS, ANU) and Jason Cummings (Woodlands and Wetlands Trust) as well as Mitchell Whitelaw (School of Art and Design, ANU) on biodiversities and Australian urban fringes. We have recruited PhD students to work on the biosocial dynamics of sanctuaries on urban fringes.I'm  interested in methodological developments associated with platforms. I view and participate in these developments mainly in the form of digital sociology, but also by continuing work that has long been part of actor network theory-guided approaches in science studies.I have long-standing interests in the social, cultural and political theory, particularly in conceptual developments around materialities, publics, embodiment and experience.  Some of my research has been published as books.Mackenzie, A. (2002) Transductions: Bodies and Machines at Speed. Continuum International Publishing Group. Mackenzie, A. (2006) Cutting Code: Software and Sociality. New York: Peter Lang. Mackenzie, A. (2010) Wirelessness: Radical Network Empiricism. Cambridge, MA: MIT Press. Mackenzie, A. (2017) Machine Learners:  Archaeology of a Data Practice. Cambridge, MA: MIT Press. Roberts, C., Mackenzie, A., and Mort, M. (2019) Living Data: Making Sense of Health Bio-Sensing. Bristol University Press.Some has been published as chapters in books. Mackenzie, A. (1997) From Theodolite to Satellite: Land, Technology and Power in the Rangelands. In Agricultural Extension and Rural Development Breaking out of Traditions. Cambridge, New York: Cambridge University Press. Mackenzie, A. (2007a) Protocols and the irreducible traces of embodiment: the Viterbi algorithm and the mosaic of machine time. In 24/7 Network Time. Palo Alto: Stanford University Press. Mackenzie, A. (2007b) Introduction. In Cinema and Technology. London: Palgrave MacMillan. Mackenzie, A. (2008a) Stars, meshes, grids: urban network-images and the embodiment of wireless infrastructures. In The Enterprise City. London & New York: Routledge. Mackenzie, A. (2008b) Internationalization. In Software Studies. Cambridge, MA: MIT Press. Mackenzie, A. (2008c) Codecs. In Software Studies. Cambridge, MA: MIT Press. Mackenzie, A. (2009) Centres of Envelopment and intensive movement in digital signal processing. In Tracks in Electronic Fields. Brussels: Constant. Mackenzie, A. (2012) Sets. In Lury, C. and Wakeford, N. (Eds.), Devices and the Happening of the Social. Routledge. Mackenzie, A. (2014a) UseR! Aggression, Alterity and Unbound Affects in Statistical Programming. In Goriunova, O. (Ed.), Fun and Software: Exploring Pleasure, Paradox and Pain in Computing. New York: Bloomsbury Academic. Mackenzie, A. (2014b) Idempotent, pluripotent, biodigital: objects in the ‘biological century’. In Harvey, P. and Thoburn, N. (Eds.), Objects and Materials: A Routledge Companion. London & New York: Routledge. Mackenzie, A. (2015) Machine Learning and Genomic Dimensionality: from Features to Landscapes. In Stevens, H. and Richardson, S. (Eds.), Postgenomics: Perspectives on Biology After the Genome. Durham, N.C.: Duke University Press. Mackenzie, A. (2016a) Distributive numbers: a post-demographic perspective on probability. In Law, J. and Ruppert, E. (Eds.), Modes of Knowing: Resources from the Baroque. Manchester: Mattering Press. Mackenzie, A. (2016b) 28 Infrastructures in name only? In Harvey, P. and Jensen, C. B. (Eds.), Infrastructures and Social Complexity: A Companion. London & New York: Routledge and K. Paul. Mackenzie, A. (2017) Infrastructures in name only? In Infrastructures and Social Complexity (Vol. 379). ROUTLEDGE in association with GSE Research. Mackenzie, A. (2018) Operative ethnographies and large numbers. In Knox, H. and Nafus, D. (Eds.), Ethnography for a Data-Saturated World. Manchester University Press. Mackenzie, A. (2019) How to make ANT concepts more real? In The Routledge Companion to Actor-Network Theory. Routledge. Mackenzie, A., Fuller, M., Goffey, A., Mills, Richard, and Sharples, S. (2016) Code repositories as expressions of urban life. In Kitchin, R. (Ed.), Code and the City. London: Routledge. Mackenzie, A., Mills, R., Sharples, S., Fuller, M., and Goffey, A. (2016) Digital Sociology in the Field of Devices. In Savage, M. and Hanquinet, L. (Eds.), Handbook of Sociology of the Arts and Culture. London & New York: Routledge. McNeil, M., Haran, J., Mackenzie, A., and Tutton, R. (2016) The Concept of Imaginaries in Science and Technology Studies. In Felt, Ulrike (Ed.), Handbook of Science and Technology Studies (3rd ed.). London & Thousand Oaks, CA: SAGE Publications Ltd. Mort, M., Mary Roberts, C., Furbo, M. K., Wilkinson, J., and Mackenzie, A. (2016) Biosensing: how citizens’ views illuminate emerging health and social risks. Health, Risk & Society 17(7–8): 605–623. Kragh-Furbo, M., Mackenzie, A., Mort, M., and  Roberts, C. (2016) Do Biosensors Biomedicalize? Sites of Negotiation in  DNA-Based Biosensing Data Practices. Quantified: Biosensing Technologies in Everyday Life : 5. Kragh-Furbo, M., Wilkinson, J., Mort, M. M. E.,  Roberts, C. M., and Mackenzie, A. B. (2017) Biosensing networks: sense  making in consumer genomics and ovulation tracking. In Farringon, C. and  Lynch, R. (Eds.), Personal Medical Devices: New Conceptual Approaches in the Social Sciences and Humanities. Basingstoke: Palgrave-Macmillan.And some has been published as articles:Mackenzie, A. (1996) God has no allergies: an immanent ethics of the immune system. Postmodern Culture 6(2). Mackenzie, A. (1997) The mortality of the virtual: real-time, archive and dead-time in information networks. Convergence. The Journal of Research into New Media Technologies 3(2): 59–71. Mackenzie, A. (1999) Technological materialisations & the politics of radical contingency. Australian Feminist Studies 14(29): 105–118. Mackenzie, A. (2000) Losing time at the PlayStation: realtime and the whatever body. Cultural Values 4(3): 257–278. Mackenzie, A. (2001) From 1.0 to 9,192,667 Hz: the technicity of time. Time and Society 10(2/3): 235–257. Mackenzie, A. (2003a) These Things Called Systems. Collective Imaginings and Infrastructural Software. Social Studies of Science 33(3): 385–387. Mackenzie, A. (2003b) The Infrastructural-Political. Forms of Attachment and Sites of Differentiation. M/C: A Journal of Media and Culture 6(4). Mackenzie, A. (2003c) Stelarc: Alternate Interfaces. Culture Machine http://culturemachine.tees.ac.uk/frm_f1.htm. Mackenzie, A. (2004) Has the cyborg been domesticated? (Or, is Lolo a disappointing cyborg?). Metascience 13(2): 153–163. Mackenzie, A. (2005a) Untangling the unwired: Wi-Fi and the cultural inversion of infrastructure. Space and culture 8(3): 269–285. Mackenzie, A. (2005b) The problem of the technological: event and excess relationality. Social Epistemology 19(2/3): 1–19. Mackenzie, A. (2005c) The Problem of the Attractor: A Singular Generality Between Sciences and Social Theory. Theory, Culture & Society 22(5): 45–66. Mackenzie, A. (2005d) Is the actual world all that must explained? The sciences and cultural theory. Cultural Values 9(1): 101–116. Mackenzie, A. (2006a) The meshing of impersonal and personal forces in technological action. Culture, Theory & Critique 47(2): 197–212. Mackenzie, A. (2006b) Java: the virtuality of Internet programming. New Media & Society 8(2): 441–66. Mackenzie, A. (2007) Wireless networks and the problem of over-connectedness. Media International Australia (125): 94–105. Mackenzie, A. (2008a) Wirelessness as experience of transition. FibreCulture 13. Mackenzie, A. (2008b) Thinking animality and neurocultural selfhood. South Atlantic Quarterly 107(1): 145–164. Mackenzie, A. (2012) More parts than elements: how databases multiply. Environment and Planning D: Society and Space 30(2): 335–350. Mackenzie, A. (2013a) ‘Wonderful people’: programmers in the regime of anticipation. Subjectivity 6(4): 391–405. Mackenzie, A. (2013b) The economic principles of industrial synthetic biology: cosmogony, metabolism and commodities. Engineering Studies 5(1): 74–89. Mackenzie, A. (2013c) Synthetic biology and the technicity of biofuels. Studies in History and Philosophy of Science Part C: Studies in History and Philosophy of Biological and Biomedical Sciences 44(2): 190–198. Mackenzie, A. (2013d) Realizing the promise of biotechnology: Infrastructural-icons in synthetic biology. Futures 48(April): 5–12. Mackenzie, A. (2013e) From Validating to Verifying: Public Appeals in Synthetic Biology. Science as Culture 22(4): 476–496. Mackenzie, A. (2014) Multiplying numbers differently: an epidemiology of contagious convolution. Distinktion: Scandinavian Journal of Social Theory 15(2): 189–207. Mackenzie, A. (2018) From API to AI: platforms and their opacities. Information, Communication & Society : 1–18. doi:https://doi.org/10.1080/1369118X.2018.1476569. Mackenzie, A. (2019) The Marketisation of Calculation. Economy and Society TBA. Mackenzie, A., and McNally, R. (2013) Methods of the multiple: how large-scale scientific data-mining pursues identity and differences. Theory, Culture and Society 30(4): 70–89. Mackenzie, A., McNally, Ruth M., Mills, R., and Sharples, S. (2016) The logistics of post-archival genomics. BioSocieties 11(1): 82–105. Mackenzie, A., and Monk, S. (2004) From cards to code: How extreme programming re-embodies programming as a collective practice. Computer Supported Cooperative Work (CSCW) 13(1): 91–117. Mackenzie, A., and Munster, A. (2019) Platform Seeing: Image Ensembles and Their Invisualities. Theory, Culture & Society : 0263276419847508. doi:10.1177/0263276419847508. Mackenzie, A., and Roberts, C. (2017) Adopting neuroscience: parenting and affective indeterminacy. Body & Society 23(3): 130–155. Mackenzie, A., Sutton, D., and Patton, P. (1996) Phantoms of Individuality: Technology and Our Right to Privacy. Polemic 7(1): 20–25. Mackenzie, A., Waterton, C., Ellis, R., Frow, E. K., McNally, R., Busch, L., and Wynne, B. (2013) Classifying, Constructing, and Identifying Life Standards as Transformations of “The Biological”. Science, Technology & Human Values 38(5): 701–722. Marsden, A., Nock, H., Mackenzie, A., Coleman, J., Lindsday, A., and Kochanski, G. (2007) ICT Tools for Searching, Annotation and Analysis of Speech, Music, Film and Video: Prospects for Research in the Arts and Humanities. Journal of Literary and Linguistic Computing 22(4): 469–488. McNally, R., Mackenzie, A., Tomomitsu, J., and Hui, A. (2012) Understanding the ‘Intensive’ in ‘Data Intensive Research’: Data Flows in Next Generation Sequencing and Environmental Networked Sensors. International Journal of Digital Curation 7(1): 81–94. Mort, M., Mary Roberts, C., Furbo, M. K., Wilkinson, J., and Mackenzie, A. (2016) Biosensing: how citizens’ views illuminate emerging health and social risks. Health, Risk & Society 17(7–8): 605–623. Pidd, M., Mackenzie, A., Rooksby, J., Sommerville, I., Warren, I., and Westcombe, M. (2006) Wisdom, decision support and paradigms of decision making. European Journal of Operations Research 70(1): 156–171. Balmer, A., Calvert, Jane, Marris, Claire, Molyneux-Hodgson, Susan,  Frow, E., Mackenzie, A., and Martin, P. (2016) Taking Roles in  Interdisciplinary Collaborations: Reflections on Working in Post-ELSI  Spaces in the UK Synthetic Biology Community | Science & Technology  Studies. Science and Technology Studies 28(3). Lee, A., Mackenzie, A., and Smith, G. (2020) Apps, Repositories and Platforms: Recognising the Dimensions of Urban Platforms. Urban Planning. doi:DOI: 10.17645/up.vXiX.2545."], "biography": "I studied physics at UNSW. My first publication concerned the AC susceptibility of a holmium crystall at low temperature. I studied Arts/Law at the University of Sydney,  and did my PhD in philosophy at the University of Sydney. After a German Academic Exchange Fellowship at Humboldt University, Berlin in 1996-1996, I took up an Australian Research Council Fellowship at the University of Sydney 1997-2000. In 2001, after overpaid work as an eCommerce software developer,  I moved to Computer Science, Lancaster University, UK. Teaching and research in computer science led indirectly to  a lecturship in  the Institute for Cultural Research, Lancaster, 2003. I held a research position as  Reader in  the UK Economic and Social Research Council-funded CESAGEN, Lancaster, 2007-2012. From 2013-2018, I was Professor of Technological Cultures, Sociology Department, Lancaster, as well as a Villum Foundation Fellow at ITU Copenhagen (2015). I joined ANU in September 2018 as a Professor in the School of Sociology.", "project": [], "publication": [{"title": "Mapping Platform Urbanism: Charting the Nuance of the Platform Pivot", "year": "2020", "source": "Urban Planningvol. 5, no. 1, pp. 116-128", "authors": ["Lee A", "Adrian Mackenzie", "Smith GJD Box P ("]}, {"title": "Living Data: Making sense of health biosensing", "year": "2019", "source": "Bristol University PressBristol", "authors": ["Roberts C", "Adrian Mackenzie", "Mort M"]}, {"title": "Platform Seeing: Image Ensembles and Their Invisualities", "year": "2019", "source": "Theory, Culture and Society, vol. 36, no. 5, pp. 3-22", "authors": ["Adrian Mackenzie", "Munster A"]}, {"title": "million configurations and counting: platform numbers and their capitalization", "year": "2018", "source": "Journal of Cultural Economy, vol. 11, no. 1, pp. 36-53", "authors": ["Adrian Mackenzie"]}, {"title": "Five rules of thumb for post-ELSI interdisciplinary collaborations", "year": "2016", "source": "Journal of Responsible Innovation, vol. 3, no. 1, pp. 73-80", "authors": ["Balmer A", "Calvert J", "Marris C", "Adrian Mackenzie"]}]}, "Microsoft-Academic": [{"title": "the epidemiology of inflammatory bowel disease in canada a population based study", "year": 2006, "source": "the american journal of gastroenterology", "authors": [{"name": "charles n bernstein", "affiliation": "university of manitoba"}, {"name": "andre wajda"}, {"name": "lawrence w svenson"}, {"name": "adrian mackenzie"}, {"name": "mieke koehoorn"}, {"name": "maureen jackson"}, {"name": "richard n fedorak"}, {"name": "david m israel"}, {"name": "james f blanchard"}], "id": 66441642}, {"title": "the production of prediction what does machine learning want", "year": 2015, "source": "european journal of cultural studies", "authors": [{"name": "adrian mackenzie", "affiliation": "lancaster university"}], "id": 44753038}, {"title": "cutting code software and sociality", "year": 2006, "source": "", "authors": [{"name": "adrian mackenzie"}]}, {"title": "human resources planning and the production of health a needs based analytical framework", "year": 2007, "source": "canadian public policy analyse de politiques", "authors": [{"name": "stephen birch"}, {"name": "george kephart"}, {"name": "gail tomblinmurphy"}, {"name": "linda obrienpallas"}, {"name": "rob alder"}, {"name": "adrian mackenzie"}], "id": 49494758}, {"title": "wirelessness radical empiricism in network cultures", "year": 2010, "source": "", "authors": [{"name": "adrian mackenzie"}]}, {"title": "transductions bodies and machines at speed", "year": 2002, "source": "", "authors": [{"name": "adrian mackenzie"}]}, {"title": "taking roles in interdisciplinary collaborations reflections on working in post elsi spaces in the uk synthetic biology community", "year": 2015, "source": "science and technology studies", "authors": [{"name": "andrew balmer", "affiliation": "university of manchester"}, {"name": "jane calvert", "affiliation": "university of edinburgh"}, {"name": "claire marris", "affiliation": "king s college london"}, {"name": "susan molyneuxhodgson", "affiliation": "university of sheffield"}, {"name": "emma frow"}, {"name": "matthew kearnes", "affiliation": "university of new south wales"}, {"name": "kate bulpin", "affiliation": "university of manchester"}, {"name": "pablo schyfter", "affiliation": "university of edinburgh"}, {"name": "adrian mackenzie", "affiliation": "lancaster university"}, {"name": "paul martin", "affiliation": "university of sheffield"}], "id": 2764652270}, {"title": "health human resources planning and the production of health development of an extended analytical framework for needs based health human resources planning", "year": 2009, "source": "journal of public health management and practice", "authors": [{"name": "stephen birch", "affiliation": "mcmaster university"}, {"name": "george kephart"}, {"name": "gail tomblin murphy"}, {"name": "linda obrienpallas"}, {"name": "rob alder"}, {"name": "adrian mackenzie"}], "id": 146663148}, {"title": "health worker migration from south africa causes consequences and policy responses", "year": 2015, "source": "human resources for health", "authors": [{"name": "ronald labonte", "affiliation": "university of ottawa"}, {"name": "david sanders", "affiliation": "university of the western cape"}, {"name": "thubelihle mathole", "affiliation": "university of the western cape"}, {"name": "jonathan crush", "affiliation": "balsillie school of international affairs"}, {"name": "jonathan crush", "affiliation": "university of cape town"}, {"name": "abel chikanda", "affiliation": "university of kansas"}, {"name": "yoswa m dambisya"}, {"name": "vivien runnels", "affiliation": "university of ottawa"}, {"name": "corinne packer", "affiliation": "university of ottawa"}, {"name": "adrian mackenzie", "affiliation": "dalhousie university"}, {"name": "gail tomblin murphy", "affiliation": "dalhousie university"}, {"name": "ivy lynn bourgeault", "affiliation": "university of ottawa"}], "id": 75242794}, {"title": "programming subjects in the regime of anticipation software studies and subjectivity", "year": 2013, "source": "subjectivity", "authors": [{"name": "adrian mackenzie", "affiliation": "lancaster university"}], "id": 180098382}], "ANDS-Grants": [{"description": "This project aims to investigate how statistical images re-shape diverse knowledge domains and practices from facial recognition to medical diagnosis to video-tagging, and how arts-led visualisation changes statistical image conventions and techniques. The overlap of popular, scientific and aesthetic dimensions of visual culture with data analytical techniques is creating a new kind of statistical visual culture. However, there is scant literacy or understanding of statistical visualisation's role in empirical domains today. This project aims to improve visual literacies and dialogue across communities of practice in art and science, and to communicate the value and role of statistics today.", "title": "Discovery Projects - Grant ID: DP170100825", "id": "943264", "institutions": ["University of New South Wales"], "key": "http://purl.org/au-research/grants/arc/DP170100825", "researchers": ["A/Prof Anna Munster", "Prof Adrian MacKenzie"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 177000, "fundingScheme": "Discovery Projects", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:36Z", "dateTimeCreated": "2017-07-04T23:45:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of New South Wales"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP170100825", "identifiers": ["http://purl.org/au-research/grants/arc/DP170100825", "DP170100825"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/943264"}]}]}