{"ANU": {"name": "Ailén Cruz", "link": "https://researchers.anu.edu.au/researchers/cruz-a", "colleges": "College of Arts and Social Sciences", "email": "ailen.cruz@anu.edu.au", "phone": "", "expertise": [], "interest": ["I investigate the resurgence of the medieval bestiary—defined as short, animal-centered texts, often illustrated, used for Christian indoctrination of medieval society—in contemporary Hispanic literature. I am particularly interested in how literary genres are defined, how their socio-political influences and compromises adjust overtime, and how much change can occur before they become different entities altogether. Currently, I am researching the implications of traditionally marginalized groups (i.e., women, indigenous peoples) taking up the bestiary, traditionally reserved for Christian, European purposes. This investigation hinges upon an original corpus of over eighty bestiaries curated through research trips to Argentina, Mexico, and Spain (www.bestiassueltas.net)Because of the various interpretations of contemporary authors, the bestiary has proliferated text/image dynamics, leading to new possibilities of image working with, for, and against text. As a post-doctoral research fellow at Mount Allison University’s Centre for Early Modern Visual Culture (CEMVC), I analyzed the significance of more traditional book illustrations, ranging from works like Don Quijote and El Cid to European depictions of American Indigenous populations. At the CEMVC, I also supervised the production of metadata for a database containing over 20,000 early modern book illustrations, ensuring metadata accuracy, database searchability, and the de-colonization of language. The goal of this database (www.cemvc.ca) is to encourage researchers to re-visit the western visual canon and investigate voices historically marginalized due to factors like race and gender.Beyond these projects, I am interested in ecocritical and bioethical discourse, as well as ontological perspectives on human/animal interaction. Because of my study of the bestiary genre and its centuries-long trajectory (from 200 A.D. onwards!) I have broad interests, ranging from medieval narrative frameworks to Golden Age poetry to contemporary subversion of Latin American classics, although I most enjoy the Latin American avant-garde and Boom periods."], "biography": "", "project": ["In preparation. Cruz, Ailén. From the Griffin to the Axolotl: The Resurgence of the Medieval Bestiary in Contemporary Hispanic Literature.", "In preparation. Eds. Beck, Lauren & Cruz, Ailén. The Return to Medievalism in the 21st Century.", ""], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}