{"ANU": {"name": "Alam Saleh", "link": "https://researchers.anu.edu.au/researchers/saleh-a", "colleges": "College of Arts and Social Sciences", "email": "Alam.Saleh@anu.edu.au", "phone": "", "expertise": ["International Relations", "Political Science"], "interest": ["Dr Saleh’s research concentrates on exploring the evolution of the concept of security from its traditional ‘realist’ base through to more ‘broadened’ approaches, especially to study societal security issues in the Middle East with a key focus being upon understanding Iran’s position in the region. Since Dr Saleh’s research has its roots in both Iranian Studies and the broader international relations of the Middle East, it increasingly seeks to examine the intersection between country-specific studies and a wider understanding of the regional system in order to examine the kinds of challenges faced in the region in terms of a range of “softer” security concerns, which are often felt most acutely in the domestic politics of individual states. Other research projects, currently in the planning stage, address the role of transitional identities in security and identity production in the Middle East."], "biography": "Dr Alam Saleh is Lecturer in Iranian Studies at the Centre for Arab and Islamic Studies at the Australian National University. Dr Saleh is also a Council Member of the British Society for Middle Eastern Studies (BRISMES) and Reviews Editor for the British Journal of Middle Eastern Studies. He received his PhD, MA and BA from the School of Politics and International Studies at the University of Leeds. Dr Saleh is Fellow of Higher Education Academy and he has previously taught undergraduate and graduate courses on International Relations, Security Studies and Middle East Politics at Lancaster, Exeter, Durham, Leeds, and Bradford Universities. Dr Saleh has also been engaged with policy practitioners and external professional bodies such as the UK Ministry of Defence, NATO, European Council on Foreign Relations, and has also consulted for Transparency International Defence & Security, UNICEF, and the BBC.", "project": ["Dr Saleh, along with his co-researcher Dr James Worrall, is engaged in research project, exploring issues such as identity formation and presence of Persian speakers in the UAE and what this can mean for Persian speakers’ positioning within the UAE's cosmopolitan given the perceived threat from Iran and its nuclear programme. There is a large Iranian diaspora in the Persian Gulf States and this has an important role to play in the geo-politics of the region, and for Iran specifically. So far one of their articles has been published by International Migration Review titled: ‘Persian Pride and Prejudice: Identity Maintenance and Interest Calculations Among Iranians in the United Arab Emirates’. They have signed book contract with Cambridge University Press, titled: ‘Being Persian in the Gulf: Identity, Security and Belonging among the UAE's Iranian Diaspora’.", "Dr Saleh and Dr Worrall have also signed a book contract with Manchester University Press to work on Qassim Soleimani and the concept of nation branding. This research explores the multiple dimensions of Soleimani’s image, its construction, use and reception among different audiences. Bridging the gap between a traditional political biography and a work of comparative and regional politics, it places Soleimani within multiple frames of resonance, examining how his image and persona have been shaped by himself, by the regime and by outsiders to create a powerful and increasingly essential narrative which has over time placed Soleimani as a key powerbroker in Iranian and regional politics.", ""], "publication": [{"title": "Persian Pride and Prejudice: Identity Maintenance and Interest Calculations among Iranians in the United Arab\r\nEmirates\"", "year": "2020", "source": "International Migration ReviewVol 54, No 2, pp. 496-526", "authors": ["Alam Saleh", "Worrall J"]}, {"title": "Political Parties and Secular-Islamist Polarisation in Post-Mubarak Egypt", "year": "2018", "source": "in Kraetzschmar, H., and Rivetti, P. (ed.), Islamists and the Politics of the Arab Uprisings: Governance, Pluralisation and Contention, Edinburgh University Press, Edinburgh. pp. 221-241", "authors": ["Alam Saleh", "Kraetzschmar H"]}, {"title": "Governing after Protests. The Case for Political Participation in Post-2009 Iran", "year": "2018", "source": "in KraetzschmarH., and Rivetti, P. (ed.), Islamists and the Politics of the Arab Uprisings: Governance, Pluralisation and Contention, Edinburgh University Press, Edinburgh, pp. pp 36-53", "authors": ["Alam Saleh", "Rivetti P"]}, {"title": "Nationalism and Islamism as Opposing Determinants of Iranian National Identity", "year": "2017", "source": "in Demichelis, M., and Maggiolini, P.  (ed.), The Struggle to Define a Nation. Rethinking Religious Nationalism in the Contemporary Islamic World, Gorgias Press, USA, pp. 311-339", "authors": ["Alam Saleh"]}, {"title": "Ethnic Minorities and the Politics of Identity in Iran\"", "year": "2016", "source": "Iranian Studiesvol. Vol 49, No 1, pp. 159-171", "authors": ["Alam Saleh", "Elling  R"]}, {"title": "Politicized Identities, Securitized Politics: Sunni-Shia Politics in Egypt", "year": "2015", "source": "'Middle East Journal, Vol 69, No 4, pp. 545-562", "authors": ["Alam Saleh", "Hendrik K"]}, {"title": "ndalusiasation: Is Iran on the Trajectory of De-Islamisation?\"", "year": "2015", "source": "British Journal of Middle Eastern Studiesvol. 42, no. 4, pp. 500-519", "authors": ["Alam Saleh", "Shahi A"]}, {"title": "Between Darius and Khomeini: Exploring Iran Identity Problematique\"", "year": "2015", "source": "National Identitiesvol. 17, no. 1, pp. 73-97", "authors": ["Alam Saleh", "Worrall J"]}, {"title": "Relative Deprivation Theory, Nationalism, Ethnicity\r\nand Identity Conflicts", "year": "2013", "source": "Geopolitics Quarterly, vol. 8, no. 4, pp. 156-174", "authors": ["Alam Saleh"]}, {"title": "Broadening the Concept of Security: Identity and Societal Security\"", "year": "2011", "source": "Geopolitics Quarterlyvol. 6, no. 4, pp. 228-241", "authors": ["Alam Saleh"]}]}, "Microsoft-Academic": [{"title": "between darius and khomeini exploring iran s national identity problematique", "year": 2015, "source": "national identities", "authors": [{"name": "alam saleh", "affiliation": "university of bradford"}, {"name": "james worrall", "affiliation": "university of leeds"}], "id": 91034359}, {"title": "ethnic identity and the state in iran", "year": 2013, "source": "", "authors": [{"name": "alam saleh"}]}, {"title": "politicized identities securitized politics sunni shi a politics in egypt", "year": 2015, "source": "middle east journal", "authors": [{"name": "alam saleh"}, {"name": "hendrik kraetzschmar"}], "id": 184885884}, {"title": "relative deprivation theory nationalism ethnicity and identity conflicts", "year": 2013, "source": "", "authors": [{"name": "alam saleh"}]}, {"title": "ethnic minorities and the politics of identity in iran", "year": 2016, "source": "iranian studies", "authors": [{"name": "rasmus christian elling", "affiliation": "university of copenhagen"}, {"name": "alam saleh", "affiliation": "university of exeter"}], "id": 97342212}, {"title": "broadening the concept of security identity and societal security", "year": 2011, "source": "", "authors": [{"name": "alam saleh"}]}, {"title": "persian pride and prejudice identity maintenance and interest calculations among iranians in the united arab emirates", "year": 2020, "source": "international migration review", "authors": [{"name": "james worrall", "affiliation": "university of leeds"}, {"name": "alam saleh", "affiliation": "lancaster university"}], "id": 90857023}, {"title": "the kurds in iran the past present and future", "year": 2011, "source": "british journal of middle eastern studies", "authors": [{"name": "alam saleh", "affiliation": "university of leeds"}], "id": 199726014}, {"title": "andalusiasation is iran on the trajectory of de islamisation", "year": 2015, "source": "british journal of middle eastern studies", "authors": [{"name": "afshin shahi"}, {"name": "alam saleh"}], "id": 199726014}, {"title": "ethnic minorities in iran", "year": 2013, "source": "", "authors": [{"name": "alam saleh"}]}], "ANDS-Grants": []}