{"ANU": {"name": "Alison Behie", "link": "https://researchers.anu.edu.au/researchers/behie-am", "colleges": "College of Arts and Social Sciences", "email": "alison.behie@anu.edu.au", "phone": "", "expertise": [], "interest": ["Pregnancy, birth and stress - The impacts of prenatal stress caused by disasters and environmental changes on pregnancy and birthPrimate behaviour and conservation - 1. Understanding animal adapation to anthropogenic threats from logging and hunting. 2. Understanding the impact of environmental disasters on primate behaviour, ecology, conservation and physiology"], "biography": "In addition to her interests in studying the impact of environmental change on non-human primates, Alison also explores similar interests in humans particularly focussing on how stress during pregnancy impacts birth outcomes and early childhood development in populations in the Asia-Pacific region.", "project": ["Impacts of prenatal stress on reproduction and childhood development: Alison is investigating how stress expreienced in utero and in early childhood impacts bith condition and development of children into adolescence and adulthood. Some examples of the sorts of work she does have to do with how pregnany women exposed to disasters experience birth and how lifestyle choices during pregnancy impact foetal development.", "The effect of environmental disasters on non-human primates: Alison continues to monitor the long-term recovery of a howler monkey population in Southern Belize to Hurricane Iris, which struck in 2001. She is also using this information to investigate post-disturbance community ecology including new mechanisms of parasite exposure related to changes in forest composition. She is also exploring how cyclones impact lemur reproduction and distribution at a longer timescale.", "Socioecology of  crested yellow-cheeked gibbons in Cambodia: Working in conjunction with Conservation International, Alison is working on research projects investigating behaviour, nutrition, and habitat use of these two endangered primate species in Northeastern Cambodia including how animals respond to anthropogenic threats of logging and hunting.", "", ""], "publication": [{"title": "Cafeteria‐style feeding trials provide new insights into the diet and nutritional strategies of the black snub‐nosed monkey(Rhinopithecus strykeri):Implications for conservation", "year": "2020", "source": "American Journal of Primatology, vol. 82, no. 3", "authors": ["Yang Y", "Li Q", "Li Q", "Alison Behie"]}, {"title": "Primate Research and Conservation in the Anthropocene", "year": "2019", "source": "Cambridge University PressCambridge, UK", "authors": ["Alison Behie", "Teichroeb J", "Malone N", "eds"]}, {"title": "Does higher access ensure greater wellbeing? - In the perspective of forest ecosystem services of the Sundarbans mangrove forest, Bangladesh", "year": "2019", "source": "Ocean and Coastal Management, vol. 177, pp. 22-30", "authors": ["Kibria A", "Costanza R", "Groves C", "Alison Behie"]}, {"title": "First insights intoï¿½theï¿½feeding habits ofï¿½theï¿½Critically Endangered black snub‑nosed monkey, Rhinopithecus strykeri (Colobinae, Primates)", "year": "2019", "source": "Primates, vol. 60, pp. 143-153", "authors": ["Yang Y", "Groves C", "Garber P", "Alison Behie"]}, {"title": "Natal-to-juvenile pelage change in free-living Franï¿½oisï¿½(Trachypithecus francoisi) and Cat Ba langurs (T. poliocephalus)", "year": "2019", "source": "Vietnamese Journal of Primatology, vol. 3, no. 1, pp. 55-69", "authors": ["Hendershott R", "Hu G", "Groves C", "Alison Behie"]}, {"title": "Enamel neonatal line thickness in deciduous teeth of Australian children from known maternal health and pregnancy conditions. Early Human Development", "year": "2019", "source": "137: 104821", "authors": ["Alison Behie"]}, {"title": "Primates", "year": "2018", "source": "in Jennifer Vonk & Todd Shackelford (ed.), Encyclopedia of Animal Cognition and Behavior, Springer Link, Switzerland, pp. 1-11", "authors": ["Alison Behie"]}, {"title": "Remembering an amazing scientist and friend, Colin Groves (1942 - 2017)", "year": "2018", "source": "Evolutionary Anthropology, vol. 27, no. 2, pp. 62-63pp", "authors": ["Alison Behie"]}, {"title": "Effects of prenatal maternal stress on birth outcomes following tropical cyclone Yasi in Queensland, Australia (2011)", "year": "2018", "source": "International Journal of Disaster Risk Reduction, vol. 28, pp. 768-775pp", "authors": ["Parayiwa C", "Alison Behie"]}, {"title": "Nutritional composition of the diet of the northern yellow-cheeked crested gibbon (Nomascus annamensis) in northeastern Cambodia", "year": "2018", "source": "Primates, vol. 59, no. 4, pp. 339-346", "authors": ["Hon N", "Alison Behie", "Rothman J"]}, {"title": "The interactions between livelihood capitals and access of local communities to the forest provisioning services of the Sundarbans Mangrove Forest, Bangladesh", "year": "2018", "source": "Ecosystem Services, vol. 32, pp. 41-49pp", "authors": ["Kibria A", "Costanza R", "Groves C", "Alison Behie"]}, {"title": "Home Range Size and Habitat use by Cat Ba Langurs (Trachypithecus poliocephalus) in a Disturbed and Fragmented Habitat", "year": "2018", "source": "International Journal of Primatology, vol. 39, no. 4, pp. 547-566", "authors": ["Hendershott R", "Rawson B", "Alison Behie"]}, {"title": "Seasonal variation in the diet and activity budget of the northern yellow-cheeked crested gibbon Nomascus annamensis", "year": "2017", "source": "Cambodian Journal of Natural History, vol. 2017, no. 2, pp. 168-178", "authors": ["Frechette J", "Hon N", "Alison Behie"]}, {"title": "Erratum to: Seasonal Variation in the Activity and Dietary Budgets of Cat Ba Langurs (Trachypithecus poliocephalus)", "year": "2017", "source": "International Journal of Primatology, vol. online, pp. 1-10", "authors": ["Hendershott R", "Alison Behie", "Rawson B"]}, {"title": "The value of ecosystem services obtained from the protected forest of Cambodia: The case of Veun Sai-Siem Pang National Park", "year": "2017", "source": "Ecosystem Services, vol. 26, pp. 27-36", "authors": ["Kibria A", "Alison Behie", "Costanza R"]}, {"title": "HIGHER PARENTAL PERCEPTIONS OF WEALTH ASSOCIATED WITH THE BIRTH OF MORE SONS IN AN AUSTRALIAN POPULATION", "year": "2017", "source": "Journal of Biosocial Science, vol. 50, pp. 569-572pp", "authors": ["Alison Behie", "O'Donnell M"]}, {"title": "Is interactive technology a relevant and effective enrichment for captive great apes?", "year": "2016", "source": "Applied Animal Behaviour Science, vol. 185, pp. 1-8", "authors": ["Kim-McCormack N", "Smith C", "Alison Behie"]}, {"title": "Seasonal Variation in the Activity and Dietary Budgets of Cat Ba Langurs (Trachypithecus poliocephalus)", "year": "2016", "source": "International Journal of Primatology, vol. 37, no. 4-5, pp. 586-604", "authors": ["Hendershott R", "Alison Behie", "Rawson B"]}, {"title": "Patterns of salt lick use by mammals and birds in northeastern Cambodia", "year": "2016", "source": "Cambodian Journal of Natural History, vol. 2016, no. 01, pp. 40-50", "authors": ["King A", "Alison Behie", "Naven H"]}, {"title": "China", "year": "2016", "source": "s primates: Preserve wild species'Nature, vol. 534, no. 7606, pp. 179-179", "authors": ["Alison Behie", "Groves C"]}, {"title": "Hurricanes and Coastlines: The role of natural disasters in the speciation of howler monkeys", "year": "2015", "source": "in Alison M. Behie and Marc F. Oxenham (ed.), Taxonomic Tapestries: The Threads of Evolutionary, Behavioural and Conservation Research, ANU Press, Canberra, Australia, pp. 75-91", "authors": ["Alison Behie", "Steffens T", "Wyman T"]}, {"title": "The Groves effect: 50 years of influence on behaviour, evolution and conservation research", "year": "2015", "source": "in Alison M. Behie and Marc F. Oxenham (ed.), Taxonomic Tapestries: The Threads of Evolutionary, Behavioural and Conservation Research, ANU Press, Canberra, Australia, pp. 3-9", "authors": ["Alison Behie", "Oxenham M"]}, {"title": "Effects of wildfire disaster exposure on male birth weight in an Australian population", "year": "2015", "source": "Evolution, Medicine, and Public Health, vol. 2015, no. 1, pp. 344-354", "authors": ["O'Donnell M", "Alison Behie"]}, {"title": "Taxonomic Tapestries : The threads of evolutionary", "year": "2015", "source": "behavioural and conservation researchANU Press, Canberra, Australia", "authors": ["Alison Behie", "Oxenham M", "eds"]}, {"title": "The warp and weft: Synthesising our taxonomic tapestry", "year": "2015", "source": "in Alison M. Behie and Marc F. Oxenham (ed.), Taxonomic Tapestries: The Threads of Evolutionary, Behavioural and Conservation Research, ANU Press, Canberra, Australia, pp. 373-380", "authors": ["Oxenham M", "Alison Behie"]}, {"title": "Fruit as a key factor in howler monkey population density: conservation implications.", "year": "2015", "source": "in M.M Kowalewskim, P.A Garber, L Cortes-Ortiz (ed.), Howler Monkeys: Behavior, Ecology, and Conservation, Springer New York, Unknown, pp. 357-382", "authors": ["Alison Behie", "PavelKa M"]}, {"title": "dapting to Disaster? A commentary on Hamamatsu Et Al (2014)", "year": "2015", "source": "Journal of Biosocial Science, vol. 47, no. 3, pp. 413-416", "authors": ["O'Donnell M", "Alison Behie"]}, {"title": "dapting to disaster? A commentary on Hamamatsu et al (2014) - A brief Reply", "year": "2015", "source": "Journal of Biosocial Science, vol. 47, no. 3, pp. 421-422", "authors": ["O'Donnell M", "Alison Behie"]}, {"title": "Prenatal smoking and age at menarche: Influence of the prenatal environment on the timing of puberty", "year": "2015", "source": "Human Reproduction, vol. 30, no. 4, pp. 957-962", "authors": ["Alison Behie", "O'Donnell M"]}, {"title": "Cascading Effects of Climate Change: Do Hurricane-damaged Forests Increase Risk of Exposure to Parasites?", "year": "2014", "source": "Biotropica, vol. 46, no. 1, pp. 25-31", "authors": ["Alison Behie", "Kutz S", "PavelKa M"]}, {"title": "Fruit as a key factor in howler monkey population density: conservation implications. In Howler monkeys: Examining the biology", "year": "2014", "source": "adaptive radiationand behavioral ecology of the most widely distributed Genus of Neotropical Primate. Kowalewski M, Garber PA, Cortes-Ortiz L, Urbani B and Youlatos D (eds). Springer Press.", "authors": ["Alison Behie"]}, {"title": "Interacting roles of diet, cortisol levels, and parasites in determining population density of Belizean howler monkeys in a hurricane damaged forest fragment", "year": "2013", "source": "in Marsh L.K and Chapman C.A (ed.), Primates in fragments: complexity and resilience, Springer New York, New York, pp. 447-456", "authors": ["Alison Behie", "PavelKa M"]}, {"title": "Effects of bushfire stress on birth outcomes: A cohort study of the 2009 Victorian Black Saturday bushfires", "year": "2013", "source": "International Journal of Disaster Risk Reduction, vol. 5, pp. 98-106", "authors": ["O'Donnell M", "Alison Behie"]}, {"title": "Food selection in the black howler monkey following habitat disturbance: Implications for the importance of mature leaves", "year": "2012", "source": "Journal of Tropical Ecology, vol. 28, no. 2, pp. 153-160", "authors": ["Alison Behie", "PavelKa M"]}, {"title": "Book Review: Peter M. Kappeler and David P. Watts (eds):Long-Term Field Studies of Primates", "year": "2012", "source": "International Journal of Primatology, vol. 33, no. 6, pp. 1511-1515", "authors": ["Alison Behie"]}, {"title": "The Role of Minerals in Food Selection in a Black Howler Monkey (Alouatta Pigra) Population in Belize Following a Major Hurricane", "year": "2012", "source": "American Journal of Primatology, vol. 74, no. 11, pp. 1054-1063", "authors": ["Alison Behie", "PavelKa M"]}, {"title": "Sources of Variation in Fecal Cortisol Levels in Howler Monkeys in Belize", "year": "2010", "source": "American Journal of Primatology, vol. 72, pp. 600-606", "authors": ["Alison Behie", "PavelKa M", "Chapman C"]}, {"title": "Parasites", "year": "2010", "source": "Primates and Ant-Plants: Clues to the lifecycle of Controrchis sp. in black howler monkeysAlouatta pigra, in Southern Belize. Journal of Wildlife Disease 46 (4): 1330-133", "authors": ["Kowalzik B", "Alison Behie"]}, {"title": "The short-term effect of Hurricane Iris on the diet and activity budget of black howlers (Alouatta pigra) in Monkey River", "year": "2005", "source": "Belize.  Folia Primatologica 76(1): 1-9", "authors": ["Alison Behie"]}, {"title": "", "year": "2005", "source": "The effect of Hurricane Iris on the food supply of black howlers (Alouatta pigra) in southern Belize.  Biotropica 37(1): 102-108.", "authors": ["Alison Behie"]}]}, "Microsoft-Academic": [{"title": "matched retrospective cohort study", "year": 2018, "source": "", "authors": [{"name": "geoff kushnick"}, {"name": "alison behie"}]}, {"title": "sinabung evacuee study", "year": 2018, "source": "", "authors": [{"name": "geoff kushnick"}, {"name": "alison behie"}]}, {"title": "the effect of a major hurricane on the diet activity and food supply of alouatta pigra in southern belize", "year": 2003, "source": "", "authors": [{"name": "alison behie"}]}], "ANDS-Grants": [{"description": "This project aims to study how natural disasters affect animal distribution and behaviour and to predict effects of future disasters. Despite recent increases in environmental disasters, no research has considered their effect on wildlife behaviour and distribution using quantitative methods. This project will create quantitative, multilayered models of climate tolerances and in relation to the effects of natural disasters and behavioural adaptations of affected animals. Anticipated outcomes include improved conservation programmes that reduce the effect of severe weather on wildlife when formulating conservation policy in the face of increasing environmental disasters.", "title": "Discovery Early Career Researcher Award - Grant ID: DE170100578", "id": "942589", "key": "http://purl.org/au-research/grants/arc/DE170100578", "researchers": ["Dr Alison Behie"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 364257, "fundingScheme": "Discovery Early Career Researcher Award", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:27Z", "dateTimeCreated": "2017-07-04T23:44:57Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DE170100578", "identifiers": ["http://purl.org/au-research/grants/arc/DE170100578", "DE170100578"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/942589"}]}]}