{"ANU": {"name": "Alyssa Morse", "link": "https://researchers.anu.edu.au/researchers/morse-ar", "colleges": "College of Health & Medicine", "email": "alyssa.morse@anu.edu.au", "phone": "(02) 6125 6167", "expertise": ["Mental Health"], "interest": ["Lived experience involvement in research, health services and health policy Empathy, social support, social strain and their impacts on health and wellbeing Mental health service and intervention design and evaluation"], "biography": "", "project": ["Understanding Participation: Measuring the value and impact of consumer and carer voices in services and policy", "The Understanding Participation project is being conducted in partnership with a working group of representatives from Health Care Consumers’ Association (HCCA), The ACT Mental Health Consumer Network (ACTMHCN), Carers ACT, the ACT Health Directorate, and independent consumer and carer representatives from the ACACIA Advisory Group. Using grounded theory methods, the project aims to understand the nature of consumer and carer participation in health services and policy in the ACT, including recent changes in the participatory environment and the responses to those changes. It will determine what existing mechanisms are used in the ACT to demonstrate how consumer and carer participation is impacting on policy and services. Finally, the project will explore the concept of ‘value’, investigating how consumer and carer voices are valued and the meaning of ‘value’ in the participatory environment from multiple stakeholder perspectives. These concepts will be explored in a series of interviews with lived experience representatives, policy makers and service providers and a multi-stakeholder roundtable. The ultimate goal of the project is to create a set of consumer- and carer-developed principles for participation, value and impact, and an accompanying set of indicators to be used by the health sector for measurement.", "This project is funded by an RSPH Excellence in Population Health Research Award.", "Whose story is it?", "This project explored mental health consumer and carer perspectives on procedural research ethics and shared story-telling in research settings. The project had a particular focus on mental health research involving carers and stories of their lived experience. A discussion forum and in-depth interviews with consumers, carers and lived-experience researchers from the ACT were conducted and analysed to explore these issues. The next stage of the project will use the findings from this data to develop practice recommendations for researchers and Human Research Ethics Committees."], "publication": [{"title": "Peer-Led Electronic Mental Health Recovery App in a Community-Based Public Mental Health Service: Pilot Trial", "year": "2019", "source": "JMIR Formative Research, vol. 3, no. 2, pp. 1-9", "authors": ["Gulliver A", "Banfield M", "Alyssa Morse"]}, {"title": "Evaluation of the Music Engagement Program for people with Alzheimer", "year": "2019", "source": "s disease and dementia: Study protocol for a pilot trial'Contemporary Clinical Trials Communications, vol. 15, no. 100419, pp. 1-7", "authors": ["Gulliver A", "Pike G", "Banfield M", "Alyssa Morse"]}, {"title": "Whose story is it? Mental health consumer and carer views on carer participation in research [IN PRESS]", "year": "2019", "source": "Health Expectations, vol. Online, pp. 1-7", "authors": ["Alyssa Morse", "Forbes O", "Jones B"]}, {"title": "ustralian Mental Health Consumer and Carer Perspectives on Ethics in Adult Mental Health Research", "year": "2019", "source": "Journal of Empirical Research on Human Research Ethics, vol. 14, no. 3, pp. 234-242", "authors": ["Alyssa Morse", "Forbes O", "Jones B"]}, {"title": "Mental health research priorities in Australia: a consumer and carer agenda", "year": "2018", "source": "Health Research Policy and Systems, vol. 16, no. 119, pp. 11pp", "authors": ["Banfield M", "Alyssa Morse", "Gulliver A"]}, {"title": "n evaluation of a tailored care program for complex and persistent mental health problems: Partners in Recovery program", "year": "2018", "source": "Evaluation and Program Planning, vol. 68, pp. 99-107pp", "authors": ["Gulliver A", "Alyssa Morse", "Wilson N"]}, {"title": "Lived experience researchers partnering with consumers and carers to improve mental health research: Reflections from an Australian initiative", "year": "2018", "source": "International Journal of Mental Health Nursing, vol. 27, no. 4, pp. 1219-1229pp", "authors": ["Banfield M", "Randall R", "O'Brien M", "Alyssa Morse"]}, {"title": "Peer-Led Electronic Mental Health Recovery App in an Adult Mental Health Service: Study Protocol for a Pilot Trial", "year": "2017", "source": "JMIR Research Protocols, vol. 6, no. 12, pp. e248", "authors": ["Gulliver A", "Banfield M", "Reynolds J", "Alyssa Morse"]}, {"title": "Silence is deadly: a cluster-randomised controlled trial of a mental health help-seeking intervention for young men", "year": "2017", "source": "BMC Public Health, vol. 17, no. 834, pp. 1-8", "authors": ["Calear A", "Banfield M", "Batterham P", "Alyssa Morse"]}]}, "Microsoft-Academic": [{"title": "measuring development of adolescent and young adult cancer patients an integrative review of available instruments", "year": 2018, "source": "journal of adolescent and young adult oncology", "authors": [{"name": "cynthia j bell", "affiliation": "wayne state university"}, {"name": "ryan a bell"}, {"name": "brad zebrack", "affiliation": "university of michigan"}, {"name": "ikuko kato", "affiliation": "wayne state university"}, {"name": "alyssa morse", "affiliation": "wayne state university"}, {"name": "scott c borinstein", "affiliation": "vanderbilt university medical center"}], "id": 2764449829}], "ANDS-Grants": []}