{"ANU": {"name": "Ami Drory", "link": "https://researchers.anu.edu.au/researchers/drory-a", "colleges": "College of Engineering & Computer Science", "email": "Ami.Drory@anu.edu.au", "phone": "", "expertise": ["Biomechanics", "Computer Vision", "Biomedical Engineering", "Artificial Intelligence And Image Processing", "Biomechanical Engineering", "Rehabilitation Engineering", "Biomedical Instrumentation", "Image Processing"], "interest": ["My principal research interests lie in  developing solutions that enable in-natura markerless motion capture for  biomechanical modelling in Biomedical and Sports Engineering.  Specifically, I am interested in the reconstruction of person-specific  human pose, kinematics, and surface geometry to enhance our  understanding of the non-linear behaviour of human motion,  musculoskeletal injury and disease and enable modelling of soft-tissue  dynamics. I specialise in translational applied research to develop  innovative, highly accurate and tailored deployable evidence-based  decision support tools for optimising sporting performance, diagnosis  and treatment, improved neuromotor disorder identification using  mobility degeneration classification models, and unimpeded patient  monitoring of postural control, ambulatory activities and assisted  living.Biomedical EngineeringDvelopment of automated diagnosis and monitoring systems for  quantification of Dyskinesia in patients with Parkinson's Disease from  image sequencesEstimation of pose and surface geometry in general movement  assessment of infants with high risk of Cerebral Palsy using  convolutional neural network approachDevelopment of motor function classification models for the evaluation of rehabilitation outcomes efficacy in stroke patientsSports EngineeringMarkerless pose estimationAutomated event detectionSurface geometry estimation of cyclists for minimisation of aerodynamic dragHuman-instrument interface design for kayakingActivity recognition and motion tracking using convolutional neural networksOn-water boat instrumentation for rowing and kayakin"], "biography": "Ami Drory is an assistant professor in the Faculty of Engineering at the University of Nottingham UK. He earned a PhD in Engineering and Computer Science under Richard Hartley and Hongdong Li at one of the world's leading computer vision labs at the Australian National University (ANU). Through this work he developed techniques for markerless pose and surface geometry estimation, activity recognition and tracking for biomechanics applications. Prior to joining the University of Nottingham he was a Biomedical Engineering research fellow at the Centre for Bionic Medicine at the Department of Physical Medicine & Rehabilitation at Northwestern University US, where he undertook research in assistive technology and using wearable sensors, computer vision and machine learning techniques to make clinical predictions and diagnostics in rehabilitation. Previously, he also held a five year biomechanist position with the Australian Institute of Sport tasked with improving the performance of Australian national athletes in preparation for the Olympics and World championships. In this role, he led research projects that include venue instrumentation, musculoskeletal testing, windtunnel testing and person-equipment interface design. Earlier, he researched the use of IMU-based sensor networks for motion capture at the University of Sydney with Professor Richard Smith.", "project": [], "publication": [{"title": "utomated detection and tracking of slalom paddlers from broadcast image sequences using cascade classifiers and discriminative correlation filters", "year": "2017", "source": "Computer Vision and Image Understanding, vol. 159, pp. 116-127", "authors": ["Ami Drory", "Zhu G", "Li H"]}, {"title": "learning-based markerless approach for full-body kinematics estimation in-natura from a single image", "year": "2017", "source": "Journal of Biomechanics, vol. 55, no. -, pp. 1-10", "authors": ["Ami Drory", "Li H", "Hartley R"]}, {"title": "Estimating the projected frontal surface area of cyclists from images using a variational framework and statistical shape and appearance models", "year": "2017", "source": "Scopus Journal JBioMec, vol. 231, no. 3, pp. 169-183", "authors": ["Ami Drory", "Li H", "Hartley R"]}, {"title": "Predictive mathematical model of time saved on descents in road cycling achieved through reduction in aerodynamic drag area", "year": "2012", "source": "Journal of Sports Engineering and Technology, vol. 226, no. P2, pp. 152-160", "authors": ["Ami Drory", "Yanagisawa M"]}]}, "Microsoft-Academic": [{"title": "a learning based markerless approach for full body kinematics estimation in natura from a single image", "year": 2017, "source": "journal of biomechanics", "authors": [{"name": "ami drory", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "vision australia"}, {"name": "richard hartley", "affiliation": "australian national university"}, {"name": "richard hartley", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "richard hartley", "affiliation": "vision australia"}], "id": 181675524}, {"title": "automated detection and tracking of slalom paddlers from broadcast image sequences using cascade classifiers and discriminative correlation filters", "year": 2017, "source": "computer vision and image understanding", "authors": [{"name": "ami drory", "affiliation": "australian national university"}, {"name": "gao zhu", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "vision australia"}, {"name": "richard hartley", "affiliation": "australian national university"}, {"name": "richard hartley", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "richard hartley", "affiliation": "vision australia"}], "id": 185008460}, {"title": "estimating the projected frontal surface area of cyclists from images using a variational framework and statistical shape and appearance models", "year": 2017, "source": "", "authors": [{"name": "ami drory", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "australian national university"}, {"name": "hongdong li", "affiliation": "vision australia"}, {"name": "richard hartley", "affiliation": "australian national university"}, {"name": "richard hartley", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "richard hartley", "affiliation": "vision australia"}]}, {"title": "how to write a manuscript for sports engineering", "year": 2020, "source": "sports engineering", "authors": [{"name": "tom allen", "affiliation": "manchester metropolitan university"}, {"name": "bert blocken", "affiliation": "eindhoven university of technology"}, {"name": "bert blocken", "affiliation": "katholieke universiteit leuven"}, {"name": "ami drory", "affiliation": "university of nottingham"}, {"name": "hugo g espinosa", "affiliation": "griffith university"}], "id": 99453086}, {"title": "unobtrusive estimation of in stroke boat rotation in rowing using wearable sensors", "year": 2019, "source": "", "authors": [{"name": "benjamin h groh", "affiliation": "university of erlangen nuremberg"}, {"name": "julia schottenhamml", "affiliation": "university of erlangen nuremberg"}, {"name": "bjoern m eskofier", "affiliation": "university of erlangen nuremberg"}, {"name": "ami drory", "affiliation": "university of nottingham"}]}, {"title": "predictive mathematical model of time saved on descents in road cycling achieved through reduction in aerodynamic drag area", "year": 2012, "source": "", "authors": [{"name": "ami drory", "affiliation": "australian institute of sport"}, {"name": "ami drory", "affiliation": "australian national university"}, {"name": "masahiro yanagisawa", "affiliation": "australian defence force academy"}]}, {"title": "computer vision and machine learning for biomechanics applications human detection pose and shape estimation and tracking in unconstrained environment from uncalibrated images videos and depth", "year": 2017, "source": "", "authors": [{"name": "ami drory"}]}], "ANDS-Grants": []}