{"ANU": {"name": "Andrew Bowerman", "link": "https://researchers.anu.edu.au/researchers/bowerman-a", "colleges": "College of Science", "email": "andrew.bowerman@anu.edu.au", "phone": "", "expertise": ["Plant Cell And Molecular Biology", "Genetics", "Plant Developmental And Reproductive Biology"], "interest": ["Yield and energy use efficiency of wheatWheat geneticsStarch biochemistry and physicochemical propertiesGrain germination, early growth and establishmentGrain size and yield"], "biography": "His undergraduate studies were completed at Charles Sturt University in Wagga Wagga, NSW, gaining a BAppSc in Medical and Applied Biotechnology and Honours. His Honours project involved molecular characterisation of cervical cancer development, under the supervision of Professor Todd Walker and Dr Wouter Kalle.", "project": [], "publication": [{"title": "Suppression of glucan, water dikinase in the endosperm alters wheat grain properties, germination and coleoptile growth", "year": "2016", "source": "Plant Biotechnology Journal, 14, p 398-408", "authors": ["Andrew Bowerman", "Newberry M", "Dielen A"]}, {"title": "Engineering a-amylase levels in wheat grain suggests a highly sophisticated level of carbohydrate regulation during development", "year": "2014", "source": "Journal of Experimental Botany, vol. 65, no. 18, pp. 5443-5457", "authors": ["Whan A", "Dielen A", "Mieog J", "Andrew Bowerman"]}, {"title": "Down-regulation of Glucan, Water-Dikinase activity in wheat endosperm increases vegetative biomass and yield", "year": "2012", "source": "Plant Biotechnology Journal, vol. 10, no. 7, pp. 871-882", "authors": ["Ral J", "Andrew Bowerman"]}, {"title": "lternative splicing, activation of cryptic exons and amino acid substitutions in carotenoid biosynthetic genes are associated with lutein accumulation in wheat endosperm", "year": "2009", "source": "Functional & Integrative Genomics, vol. 9, pp. 363-376", "authors": ["Howitt C", "Cavanagh C", "Andrew Bowerman"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}