{"ANU": {"name": "Anita Pisch", "link": "https://researchers.anu.edu.au/researchers/pisch-ae", "colleges": "College of Arts and Social Sciences", "email": "Anita.Pisch@anu.edu.au", "phone": "0488494753", "expertise": ["Art Theory And Criticism", "Psychology", "Special Education And Disability"], "interest": ["Research at the Australian National University examines the  personality cult of Iosif Stalin and takes an iconographic approach to  Stalinist propaganda, focussing specifically on visual topoi in the  image of Stalin on propaganda posters of the Soviet era. While firmly  entrenched within the discipline of art history, the research also  traverses the domains of history, political science, political economy,  psychology, theatre studies, sociology and literature.Inspiration Wild: Historical Perspectives and Future Challenges, produced for the Wildlife Art Museum of Australia, explores the relationship between science and art as expressed in wildlife art through the ages from cave painting to contemporary practice, with a focus on Australia, and promotes the upcoming Wildlife Art Museum of Australia as a valuable venue for conservation, education and art appreciation in an era where ever fewer people are able to experience wilderness and nature firsthand.Other research interests in the field of art and design are contemporary Australian art, printmaking, graphic arts and the poster, contemporary Cuban art, public art, environmental art, art as propaganda, Socialist Realism, and fashion and subculture."], "biography": "", "project": [], "publication": [{"title": "The Personality Cult of Stalin in Soviet Posters", "year": "2016", "source": "1929-1953: ArchetypesInventions & Fabrications, ANU Press, Canberra Australia", "authors": ["Anita Pisch"]}, {"title": "Crossing the Cultural Divide: the Collaborative Public Art Projects of Australian Sculptor Velislav Georgiev", "year": "2015", "source": "Izkustvovedski Cheteniya 2014, no. 9, pp. 453-461", "authors": ["Anita Pisch"]}, {"title": "Inspiration Wild: Historical Perspectives and Future Challenges", "year": "2014", "source": "Wildlife Art Museum of AustraliaAustralia", "authors": ["Anita Pisch", "Grishin A"]}, {"title": "Stalin saves the world! The use of the warrior and saviour archetypes to portray Stalin in Soviet political posters", "year": "2014", "source": "in Zoran M. Jovanovic, Oliver Toshkovic, Jasmila Petrovic, Vladan Virijevic  (ed.), Art and its role in the history: between durability and transient -isms, Kosovska Mitrovitsa, Belgrade Serbia, pp. 407-429pp", "authors": ["Anita Pisch"]}, {"title": "Stalin Takes Care of Each of Us from the Kremlin: Obligation and Gratitude in Stalinist Political Posters", "year": "2013", "source": "Modern History of Russia (Noveishaya Istoriya Rossii), vol. 3, pp. 37-54", "authors": ["Anita Pisch"]}, {"title": "Made in Cuba:", "year": "2012", "source": "Contemporary Cuban Art in Australia' exhibition", "authors": ["Anita Pisch"]}]}, "Microsoft-Academic": [{"title": "inspiration wild historical perspectives and future challenges", "year": 2014, "source": "", "authors": [{"name": "anita pisch"}, {"name": "alexander grishin"}]}], "ANDS-Grants": []}