{"ANU": {"name": "Ann McGrath", "link": "https://researchers.anu.edu.au/researchers/mcgrath-a", "colleges": "College of Arts and Social Sciences", "email": "ann.mcgrath@anu.edu.au", "phone": "", "expertise": ["Aboriginal And Torres Strait Islander History", "Australian History Excl. Aboriginal And Torres Strait Islander History", "Aboriginal And Torres Strait Islander Law", "North American History", "Multicultural Intercultural And Cross Cultural Studies", "Other History And Archaeology", "Historical Studies"], "interest": ["Deep History, Landscape History, Gender and Colonialism; Australian indigenous history; Comparative and trans-national history of frontiers in Australia and North America; Birth, Love, Marriage and Intermarriage; Law, Justice and History; Museums, Museology and Public History; Art and Visual Evidence in History."], "biography": "My current interests are deep history in global context, spatial history and scale. I have a longstanding interst in the history of gender and colonialism, the history of Indigenous relations and intermarriage in Australia and North America. My latest project is 'Rediscovering the Deep Human Past: Global Networks, Future Opportunities'. My publications include 'Illicit Love: Interracial Sex and Marriage in the United States and Australia' (University of Nebraska, 2015) which won the NSW Premiers History Prize and 'Born in the Cattle' (Allen & Unwin 1987), winner of inaugural Hancock Prize. I am interested in presenting scholarly history in a range of genres. Exhibitions curated include one on Women and Childbirth during the Federation era and one on International Outlaws as national heroes. I produced the film 'A Frontier Conversation' (Wonderland Productions, Ronin distributors, 2006) and with Andrew Pike, co-directed and produced the prize-winning 'Message from Mungo' (Ronin, 2014); I have worked as an advisor on various television and film projects. My consultancy and outreach work have included co-ordinating the history project of the Royal Commission into Aboriginal Deaths in Custody, working as an expert witness in the Gunner & Cubillo case and on various Northern Territory land claims.  I was accepted as a Fellow of the Academy of Social Sciences and the Academy of Humanities was awarded Membership of the Order of Australia Medal (AM) for services to history, especially Indigenous history. My work has also been recognized by the award of the Inaugural W.K. Hancock prize, the Human Rights Award for non-fiction, the John Barrett Prize, the Archibald Hannah Junior Fellowship at the Beinecke Library, Yale, Membership of the Institute of Advanced Study, Durham and Membership of the School of Social Sciences, Institute for Advanced Study, Princeton, a Rockefeller Foundation Scholarly Residency at Bellagio, an Honorary Doctorate at Linneaus University, Sweden and the 2017 Kathleen Fitzpatrick Australian Laureate Fellowship.", "project": ["", "Kathleen Fitzpatrick Australian Laureate Fellowship", "Project Title: Rediscovering the deep human past: global networks, future opportunities (ARC FL170100121)", "This project will analyse Australia's epic Indigenous narratives alongside relevant new scientific evidence in order to create a big picture history of Greater Australia/Sahul, and as a result transform the scale and scope of history.  Fresh periodisations and understandings will reorient this history in its wider global context.  Through critiquing the evolution of disciplines, especially the world history/prehistory divide and the Cambridge training nexus, the project will develop future-oriented transdisciplinary techniques for researching the deep human past.  As part of the project, a diverse generation of early career scholars will join top international networks and be trained in digital research techniques and delivery platforms for researching this exceptional human history.", "The additional named award, the Kathleen Fitzpatrick Fellowship, recognizes mentoring achievement and capacity; it provides additional support for a mentoring program for early career women.", "Further information can be found at: http://www.arc.gov.au/2017-laureate-profile-professor-ann-mcgrath-kathleen-fitzpatrick-australian-laureate-fellow", "Further information about the project and Laureate scheme can be found at: http://www.arc.gov.au/2017-laureate-profile-professor-ann-mcgrath-kathleen-fitzpatrick-australian-laureate-fellow", "DEEPENING HISTORIES OF PLACE: EXPLORING INDIGENOUS LANDSCAPES OF NATIONAL AND INTERNATIONAL SIGNIFICANCE.  ARC Linkage Project with National Parks, Australia, Dept Environment, Climate Change and Water, NSW, Ronin Films, National Film and Sound Archives, AIATSIS and University of Sydney.", "Through researching the Indigenous histories of selected sites in New South Wales and Northern Territory landscapes, this project will investigate the social and environmental links that create historical 'highways' of understanding, including song-lines, tracks, exploration, trade, pastoral and tourism routes.  By researching written texts, art, film and sound evidence, this project will develop innovative models for comprehensive, indigenous and landscape-focused historical interpretation.  Bringing together a unique interdisciplinary and industry team, its publications, pod-streaming and other history delivery strategies will deepen understandings of internationally significant Australian landscapes.", "Our website contains numerous digital histories and videos.", "http://www.deepeninghistories.anu.edu.au/", "Other projects: History of Intermarriage on Australian and North American FrontiersThe History of Archaeology and of Lake Mungo"], "publication": [{"title": "Confident, Thwarted Modernizers", "year": "2019", "source": "Reviews in American history, vol. 47, no. 2, pp. 184pp-189pp", "authors": ["Ann McGrath"]}, {"title": "Indigenous Prosperity and American Conquest: Indian Women of the Ohio River Valley, 1690-1792", "year": "2019", "source": "Reviews in American history, vol. 47, no. 2, pp. 184-188", "authors": ["Ann McGrath"]}, {"title": "Museums are terrific, especially for historians!", "year": "2019", "source": "The many legacies of Mickey Dewar (1 January 1956 - 23 April 2017)'in Ann McGrath (ed.), In Search of the Never-Never - Mickey Dewar: Champion of History across many genres, ANU Press, Canberra, pp. 1-19", "authors": ["Ann McGrath"]}, {"title": "In Search of the Never-Never\r\nMickey Dewar: Champion of History across many genres", "year": "2019", "source": "ANU PressCanberra", "authors": ["Ann McGrath", "ed"]}, {"title": "Response to Forum on", "year": "2019", "source": "Illicit Love: Interracial Sex and Marriage in the United States and Australia'Women's History Review, vol. 28, no. 3, pp. 508-516", "authors": ["Ann McGrath"]}, {"title": "Life Sentences: Aborigines more popular than Captain Cook", "year": "2018", "source": "pp. 1pp-2pp", "authors": ["Ann McGrath"]}, {"title": "OBITUARIES: Mickey Sue Dewar OAM (1956-2017)", "year": "2018", "source": "Australian Historical Studies, vol. 49, no. 3, pp. 413-415", "authors": ["Ann McGrath"]}, {"title": "lan Powell: Historical Navigator of the Far Country", "year": "2018", "source": "in Dr Samantha Wells (ed.), Beyond the Far Country, Historical Society of the Northern Territory, Northern Territory, pp. 58-70pp", "authors": ["Ann McGrath"]}, {"title": "ustralia: Abiding Injustice", "year": "2017", "source": "World Policy Journal, vol. 34, no. 2, pp. 5-6pp.", "authors": ["Ann McGrath"]}, {"title": "The Big Question: What legacies of colonialism prevent indigenous peoples from achieving justice?", "year": "2017", "source": "World Policy Journal, vol. 34, no. 2, pp. 3-7pp", "authors": ["Ann McGrath"]}, {"title": "Xavier Herbert: Forgotten or Repressed?", "year": "2017", "source": "Cultural Studies Review, vol. 23, no. 2, pp. 62-69", "authors": ["Conor L", "Ann McGrath"]}, {"title": "On the Sacred clay of Botany Bay: Landings, National Memorialization, and Multiple Sovereignties", "year": "2017", "source": "New Diversities, vol. 19, no. 2, pp. 85-102pp", "authors": ["Ann McGrath"]}, {"title": "ncient", "year": "2017", "source": "Evidence' for a Modern Sacred", "authors": ["Ann McGrath"]}, {"title": "Review: Rohwer Reconstructed: Interpreting Place through Experience", "year": "2016", "source": "The Public Historian, vol. 38, no. 4, pp. 322-324", "authors": ["Ann McGrath"]}, {"title": "Going Against History?", "year": "2016", "source": "The Institute Letter, vol. Summer 2016, pp. 1pp", "authors": ["Ann McGrath"]}, {"title": "Secrets of Nation", "year": "2016", "source": "Inside Story, vol. online, pp. 4pp", "authors": ["Ann McGrath"]}, {"title": "Roundtable: Message from Mungo and the Scales of Memory", "year": "2016", "source": "Australian Humanities Review, vol. 59, no. 59, pp. 247-259", "authors": ["Kennedy R", "Leane J", "Ann McGrath"]}, {"title": "In Choosing to be Cherokee", "year": "2016", "source": "She was Forced to Renounce the US", "authors": ["Ann McGrath"]}, {"title": "Camping with a Bush Legend", "year": "2016", "source": "ANU Reporte", "authors": ["Ann McGrath"]}, {"title": "Collaborative Histories of the Willandra Lakes. Deepening histories and the deep past.", "year": "2015", "source": "in Ann McGrath and Mary Anne Jebb (ed.), Long History, Deep Time: Deepening Histories of Place, ANU Press, Canberra, Australian Capital Territory, pp. 241-252", "authors": ["Allbrook M", "Ann McGrath"]}, {"title": "BLOG - A Tale of Three Book Launches", "year": "2015", "source": "", "authors": ["Ann McGrath"]}, {"title": "Celebrating White Men and Their Black Lovers", "year": "2016", "source": "The Age, no. Feb 26, pp. online", "authors": ["Ann McGrath"]}, {"title": "Conquering Sacred Ground? Climbing Uluru and Devil", "year": "2016", "source": "s Tower'in Howkins, Orsi and Fiege (ed.), National Parks Beyond the Nation, University of Oklahoma Press, USA", "authors": ["Ann McGrath"]}, {"title": "Making Love and Nations", "year": "2016", "source": "Sapiens. \r\nw.sapiens.org/culture/making-love-and-nations", "authors": ["Ann McGrath"]}, {"title": "Illicit Love: Interracial Sex and Marriage in the United States and Australia", "year": "2015", "source": "University of Nebraska PressLincoln and London", "authors": ["Ann McGrath"]}, {"title": "Deep Histories in Time or Crossing the Great Divide?", "year": "2015", "source": "in Ann McGrath and Mary Anne Jebb (ed.), Long History, Deep Time: Deepening Histories of Place, ANU Press, Canberra, Australian Capital Territory, pp. 1-31", "authors": ["Ann McGrath"]}, {"title": "Long History", "year": "2015", "source": "Deep Time: Deepening Histories of PlaceANU Press, Canberra, Australian Capital Territory", "authors": ["Ann McGrath", "Jebb M", "eds"]}, {"title": "Crossing history", "year": "2015", "source": "s mountains: the historic values of the Greater Blue Mountains'in Doug Benson (ed.), Values for a New Generation, Greater Blue Mountains World Heritage Area Advisory Committee, Katoomba, pp. 95-133", "authors": ["Ann McGrath"]}, {"title": "Paperbark and pinard: A historical account of maternity care in one remote Australian Aboriginal town", "year": "2015", "source": "Women and Birth, vol. 28, no. 4, pp. 293-302", "authors": ["Ann McGrath", "Ireland S", "Saggers S"]}, {"title": "Minoru Hokari 1971-2004", "year": "2004", "source": "Aboriginal History, vol. 28, pp. 235-238", "authors": ["Ann McGrath"]}, {"title": "Book Review: Matters of the Heart: A History of Interracial Marriage in New Zealand. By Angela Wanhalla, Auckland: Auckland University Press, pp 231", "year": "2014", "source": "Australian Historical Studies, vol. 45, no. 2, pp. 267-268", "authors": ["Ann McGrath"]}, {"title": "The Loneliness of the Feminist Historian", "year": "2014", "source": "Australian Feminist Studies, vol. 29, no. 80, pp. 204-214", "authors": ["Ann McGrath"]}, {"title": "Jumping around", "year": "2015", "source": ": exploring young women's behaviour and knowledge in relation to sexual health in a remote Aboriginal Australian community'Culture, Health and Sexuality, vol. 17, no. 1, pp. 1-16", "authors": ["Ireland S", "Narjic C", "Belton S", "Ann McGrath"]}, {"title": "Is history good medicine?", "year": "2014", "source": "Journal of Australian Studies, vol. 38, no. 4, pp. 396-414", "authors": ["Ann McGrath"]}, {"title": "", "year": "2014", "source": "Message from Mungo", "authors": ["Ann McGrath", "Pike A"]}, {"title": "Shamrock Aborigines: The Irish, the Aboriginal Australians, and Their Children", "year": "2013", "source": "in Graeme Morton and David A. Wilson (ed.), Irish and Scottish Encounters with Indigenous Peoples, McGill-Queen's University Press, Montreal and Kingston, pp. 108-144", "authors": ["Ann McGrath"]}, {"title": "Book review - Indigenous Women and Work: From Labor to Activism by Carol Williams", "year": "2013", "source": "Western Historical Quarterly, vol. 44, no. 4, pp. 478-479", "authors": ["Ann McGrath"]}, {"title": "HR Conversation How Size Matters: The Question of Scale in History", "year": "2013", "source": "American Historical Review, vol. 118, no. 5, pp. 1431-1472", "authors": ["Aslanian S", "Chaplin J", "Ann McGrath"]}, {"title": "Book Review: A Different Inequality: The Politics of Debates about Remote Aboriginal Australia", "year": "2012", "source": "Aboriginal History, vol. 36, pp. 173-176", "authors": ["Ann McGrath"]}, {"title": "Book Review - A Different Inequality: The Politics of Debates about Remote Aboriginal Australia by Diana Austin-Broos", "year": "2012", "source": "Aboriginal History, vol. 36, pp. 173-176", "authors": ["Ann McGrath"]}, {"title": "Historical Panorama", "year": "2012", "source": "Canadian Historical Review, vol. 93, no. 2, pp. 278-283", "authors": ["Ann McGrath"]}, {"title": "ustralia", "year": "2012", "source": "in James E. Bennett, Rebecca Beirne (ed.), Making Film and Television Histories: Australia and New Zealand, I B Tauris & Co Ltd, New York, USA, pp. 31-35pp.", "authors": ["Ann McGrath"]}, {"title": "ustralia", "year": "2012", "source": "s Occluded Voices: Ned Kelly's History Wars'in Micheal O hAodha and John O'Callaghan (ed.), Narratives of the Occluded Irish Diaspora, International Academic Publishers, Bern, pp. 7-36pp.", "authors": ["Ann McGrath"]}, {"title": "Supervisor", "year": "2011", "source": "s reflection'in   (ed.), Gurindji journey: a Japanese historian in the outback, UNSW Press, Sydney Australia, pp. 1-11", "authors": ["Ann McGrath"]}, {"title": "Book Review: End of an era: Aboriginal labour in the Northern Territory", "year": "2011", "source": "Aboriginal History, vol. 13, no. 1, pp. 159-161", "authors": ["Ann McGrath"]}, {"title": "History as literature", "year": "2010", "source": "Agora, vol. 45, no. 2, pp. 25-30pp", "authors": ["Ann McGrath", "Curthoys A"]}, {"title": "Book review: Ochre and Rust: Aretfacts and Encounters on Australian Frontiers by Philip Jones", "year": "2010", "source": "Aboriginal History, vol. 33, pp. 270-271", "authors": ["Ann McGrath"]}, {"title": "Book review: Taking Assimilation to Heart: Marriages of White Women & Indigenous Men in the United States & Australia 1887-1937 by Katherine Ellinghaus", "year": "2010", "source": "Aboriginal History, vol. 34, pp. 313-316", "authors": ["Ann McGrath"]}, {"title": "Shamrock Aborigines: the Irish, the Aboriginal Australians and their children", "year": "2010", "source": "Aboriginal History, vol. 34, pp. 55-84", "authors": ["Ann McGrath"]}, {"title": "Film Review: Modern Monsters and the Martu", "year": "2010", "source": "History Australia, vol. 7, no. 3, pp. 65.1-65.3", "authors": ["Ann McGrath"]}, {"title": "Bad", "year": "2010", "source": "HistoryGood Intentions and Australia's National Apology', in Helga Ramsey-Kurz and Ulla Ratheiser (ed.), Antipodean Childhood: Growing Up in Australia and New Zealand, Cambridge Scholars Publishing, Newcastle upon Tyne, UK, pp. 47-67", "authors": ["Ann McGrath"]}, {"title": "Preface", "year": "2006", "source": "Aboriginal History, vol. 30, pp. v-x", "authors": ["Ann McGrath"]}, {"title": "Book review: Shared landscapes: archaeologies of attachment and the pastoral industry in New South Wales", "year": "2005", "source": "Aboriginal History, vol. 29, pp. 226-229", "authors": ["Ann McGrath"]}, {"title": "Gallery, Museum and Other Exercises for Writing History", "year": "2009", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories Imagination and Narration (2nd edition), Monash University ePress, Clayton Victoria, pp. 10.1-10.4", "authors": ["Ann McGrath", "Curthoys A"]}, {"title": "Reflexivity and the Self-Line", "year": "2009", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories Imagination and Narration (2nd edition), Monash University ePress, Clayton Victoria, pp. 7.1-7.11", "authors": ["Ann McGrath"]}, {"title": "Must film be fiction?", "year": "2009", "source": "Griffith Review, no. Winter 2009, pp. 191-199", "authors": ["Ann McGrath"]}, {"title": "Writing Histories Imagination and Narration (new ed)", "year": "2009", "source": "Monash University ePressClayton Victoria", "authors": ["Ann McGrath", "Curthoys A", "eds"]}, {"title": "Introduction [Writing Histories Imagination and Narration]", "year": "2009", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories Imagination and Narration (2nd edition), Monash University ePress, Clayton Victoria, pp. viii-xvi", "authors": ["Ann McGrath", "Curthoys A"]}, {"title": "How to Workshop Your Writing", "year": "2009", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories Imagination and Narration (2nd edition), Monash University ePress, Clayton Victoria, pp. 11.1-11.4", "authors": ["Ann McGrath", "Curthoys A"]}, {"title": "How to write History that people want to read", "year": "2009", "source": "UNSW PressSydney Australia", "authors": ["Ann McGrath", "Curthoys A"]}, {"title": "Writing Readable History", "year": "2009", "source": "pp. Online", "authors": ["Ann McGrath"]}, {"title": "Naked Shame: Nation, Science and Indigenous Knowledge in Walter Roth", "year": "2008", "source": "s Interventions into Frontier Sexualities'in Russell McDougall and Iain Davidson (ed.), The Roth Family, Anthropology, and Colonial Administration, Left Coast Press, California, pp. 193-209", "authors": ["Ann McGrath"]}, {"title": "Translating Histories: Australian Aboriginal Narratives, History and Literature", "year": "2008", "source": "The Southern Hemisphere Review, vol. 24, pp. 34-47", "authors": ["Ann McGrath"]}, {"title": "Reconciliation requires an Aborigine for head of state", "year": "2008", "source": "Sydney Morning Herald", "authors": ["Ann McGrath"]}, {"title": "Being Annie Oakley: Modern Girls, New World Woman", "year": "2007", "source": "Frontiers: A Journal of Women Studies, vol. 28, no. 1 & 2, pp. 203-231", "authors": ["Ann McGrath"]}, {"title": "Creating a Nation 1788-2007", "year": "2006", "source": "Australian Scholarly Publishing Pty LtdPerth", "authors": ["Ann McGrath", "Grimshaw P", "Lake M"]}, {"title": "Preface: Exchanging Histories, in special edition of Aboriginal History vol 30", "year": "2006", "source": "Aboriginal History, vol. 30", "authors": ["Peters-Little F", "Ann McGrath", "Macfarlane I"]}, {"title": "Frontier Conversation", "year": "2006", "source": "Ronin Films", "authors": ["Ann McGrath"]}, {"title": "Consent, Marriage and Colonialism: Indigenous Australian Women and Colonizer Marriages", "year": "2005", "source": "Journal of Colonialism and Colonial History, vol. 6, no. 3, p. 16", "authors": ["Ann McGrath"]}, {"title": "The history Phoenix? Inventing a History Tradition in the Northern Territory", "year": "2004", "source": "in David Carment (ed.), NORTHERN ENCOUNTERS New Directions in North Australian History, Charles Darwin University Press, Darwin N.T., p. 219", "authors": ["Ann McGrath"]}, {"title": "ustralian Centre for Indigenous History", "year": "2003", "source": "Australian Historical Association Bulletin, vol. 96, no. June 2003, pp. 7-11", "authors": ["Ann McGrath"]}, {"title": "Proof and Truth: The Humanist as Expert", "year": "2003", "source": "Australian Academy of the HumanitiesCanberra ACT", "authors": ["Ann McGrath"]}, {"title": "Introduction [to Proof and Truth]", "year": "2003", "source": "in I McCalman and A McGrath (ed.), Proof and Truth: The Humanist as Expert, Australian Academy of the Humanities, Canberra ACT, pp. 1-12", "authors": ["Ann McGrath", "McCalman I"]}, {"title": "Stories for Country: Aboriginal History and Land Claims", "year": "2003", "source": "in I McCalman and A McGrath (ed.), Proof and Truth: The Humanist as Expert, Australian Academy of the Humanities, Canberra ACT, pp. 251-262", "authors": ["Ann McGrath"]}, {"title": "The Golden Thread of Kinship: Mixed Marriages Between Asians and Aboriginal Women during Australia", "year": "2003", "source": "s Federation Era'in Penny Edwards & Shen Yuanfang (ed.), Lost in the Whitewash, Australian National University, Canberra, pp. 37-58", "authors": ["Ann McGrath"]}, {"title": "History and Land Rights", "year": "2003", "source": "in I McCalman and A McGrath (ed.), Proof and Truth: The Humanist as Expert, Australian Academy of the Humanities, Canberra ACT, pp. 233-248", "authors": ["Ann McGrath"]}, {"title": "White Brides: Images of Marriage across Colonizing Boundaries", "year": "2002", "source": "Frontiers: A Journal of Women Studies, vol. 23, no. 3, pp. 76-108", "authors": ["Ann McGrath"]}, {"title": "Playing Colonial: Cowgirls, Cowboys, and Indians in Australia and North America", "year": "2001", "source": "Journal of Colonialism and Colonial History, vol. 2, no. 1, pp. 1-19", "authors": ["Ann McGrath"]}, {"title": "Writing Histories: Imagination and Narration", "year": "2000", "source": "Monash UniversityVictoria", "authors": ["Curthoys A", "Ann McGrath", "eds"]}, {"title": "Introduction", "year": "2000", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories: Imagination and Narration, Monash University, Victoria, pp. vii-xiv", "authors": ["Curthoys A", "Ann McGrath"]}, {"title": "Gallery, museum and other exercises for writing history", "year": "2000", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories: Imagination and Narration, Monash University, Victoria, pp. 82-85", "authors": ["Curthoys A", "Ann McGrath"]}, {"title": "Guerilla Fighters", "year": "2000", "source": "in Kleinert, S.; Neale, M. (ed.), The Oxford Companion to Aboriginal Art and Culture, Oxford University Press, Melbourne, pp. 599-600", "authors": ["Ann McGrath"]}, {"title": "How to workshop your writing", "year": "2000", "source": "in Ann Curthoys and Ann McGrath (ed.), Writing Histories: Imagination and Narration, Monash University, Victoria, pp. 90-96", "authors": ["Curthoys A", "Ann McGrath"]}, {"title": "Massacres", "year": "2000", "source": "in Kleinert, S.; Neale, M. (ed.), The Oxford Companion to Aboriginal Art and Culture, Oxford University Press, Melbourne, p. 641", "authors": ["Ann McGrath"]}, {"title": "Book Review: White Flour, White Power: From Rations to Citizenship in Central Australia by of Tim Rowse", "year": "1999", "source": "Australian Humanities Review, vol. 30, no. 113", "authors": ["Ann McGrath"]}]}, "Microsoft-Academic": [{"title": "jumping around exploring young women s behaviour and knowledge in relation to sexual health in a remote aboriginal australian community", "year": 2015, "source": "culture health & sexuality", "authors": [{"name": "sarah ireland"}, {"name": "concepta wulili narjic"}, {"name": "suzanne belton"}, {"name": "sherry saggers", "affiliation": "curtin university"}, {"name": "ann mcgrath", "affiliation": "australian national university"}], "id": 126467296}, {"title": "illicit love interracial sex and marriage in the united states and australia", "year": 2015, "source": "", "authors": [{"name": "ann mcgrath", "affiliation": "australian national university"}]}, {"title": "creating a nation", "year": 1994, "source": "", "authors": [{"name": "patricia grimshaw"}, {"name": "marilyn lake"}, {"name": "ann mcgrath"}, {"name": "marian quartly"}]}, {"title": "ahr conversation how size matters the question of scale in history", "year": 2013, "source": "the american historical review", "authors": [{"name": "sebouh david aslanian"}, {"name": "joyce e chaplin"}, {"name": "ann mcgrath"}, {"name": "kristin mann"}], "id": 197437610}, {"title": "response to h1n1 influenza outbreak in a pediatric children s hospital challenges faced and lessons learned", "year": 2010, "source": "journal of pediatric nursing", "authors": [{"name": "paul cannava", "affiliation": "long island jewish medical center"}, {"name": "dina cicillini", "affiliation": "long island jewish medical center"}, {"name": "marybeth higgins", "affiliation": "long island jewish medical center"}, {"name": "ann mcgrath", "affiliation": "long island jewish medical center"}, {"name": "jerry oleary", "affiliation": "long island jewish medical center"}], "id": 119745230}, {"title": "how to write history that people want to read", "year": 2011, "source": "", "authors": [{"name": "ann curthoys"}, {"name": "ann mcgrath"}]}, {"title": "privatization illumination and validation in identity making within a teacher educator research collective", "year": 2011, "source": "studying teacher education", "authors": [{"name": "ronnie davey", "affiliation": "university of canterbury"}, {"name": "vince ham", "affiliation": "university of canterbury"}, {"name": "fiona gilmore", "affiliation": "university of canterbury"}, {"name": "gina haines", "affiliation": "university of canterbury"}, {"name": "ann mcgrath", "affiliation": "university of canterbury"}, {"name": "donna morrow", "affiliation": "university of canterbury"}, {"name": "robyn robinson", "affiliation": "university of canterbury"}], "id": 161887014}, {"title": "creating a nation a dramatic new history that challenges the conventional view of australia s past as a creation of white men of british descent", "year": 1997, "source": "pacific affairs", "authors": [{"name": "michael roe"}, {"name": "patricia grimshaw"}, {"name": "marilyn lake"}, {"name": "ann mcgrath"}, {"name": "marian quartly"}], "id": 22496335}, {"title": "born in the cattle aborigines in cattle country", "year": 1987, "source": "", "authors": [{"name": "ann mcgrath"}]}, {"title": "livebirths with placental hemorrhagic endovasculitis interlesional relationships and perinatal outcomes", "year": 2002, "source": "archives of pathology & laboratory medicine", "authors": [{"name": "c maureen sander", "affiliation": "michigan state university"}, {"name": "dennis gilliland"}, {"name": "cheryl akers"}, {"name": "ann mcgrath"}, {"name": "tarek a bismar"}, {"name": "laura a swarthills"}], "id": 139062638}], "ANDS-Grants": [{"description": "This project will analyse Australia's epic Indigenous narratives alongside relevant new scientific evidence in order to create a big picture history of Greater Australia/Sahul, and as a result transform the scale and scope of history. Fresh periodisations and understandings will reorient this history in its wider global context. Through critiquing the evolution of disciplines, especially the world history/prehistory divide and the Cambridge training nexus, the project will develop future-oriented transdisciplinary techniques for researching the deep human past. As part of the project, a diverse generation of early career scholars will join top international networks and be trained in digital research techniques and delivery platforms for researching this exceptional human history.", "title": "Australian Laureate Fellowships - Grant ID: FL170100121", "id": "1317304", "key": "http://purl.org/au-research/grants/arc/FL170100121", "researchers": ["Prof Ann McGrath"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 2845869, "fundingScheme": "Australian Laureate Fellowships", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:51Z", "dateTimeCreated": "2018-03-06T23:37:38Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/FL170100121", "identifiers": ["http://purl.org/au-research/grants/arc/FL170100121", "FL170100121"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1317304"}]}, {"description": "This project researches the history of Aboriginal and Torres Strait Islander people in the defence of Australia. The project will provide authoritative accounts of their contributions to nation.", "title": "Serving our country: a history of Aboriginal and Torres Strait Islander people in the defence of Australia", "id": "533625", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP120200327", "researchers": ["Prof Ann McGrath", "Prof Mick Dodson", "Prof John Maynard", "Dr Noah Riseman", "Dr Geoffrey Gray", "Dr Samuel Furphy"], "status": "closed", "fundingAmount": 1024275, "fundingScheme": "Linkage Projects", "startDate": 2012, "endDate": 2016, "dateTimeModified": "2016-05-29T08:53:43Z", "dateTimeCreated": "2015-04-15T05:07:39Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP120200327", "identifiers": ["http://purl.org/au-research/grants/arc/LP120200327", "LP120200327"], "subjects": ["HISTORICAL STUDIES", "HISTORY AND ARCHAEOLOGY", "citizenship & nation", "collections", "defence", "indigenous history", "memory", "women's service"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/533625"}]}]}