{"ANU": {"name": "Anna Sophie Jurgens", "link": "https://researchers.anu.edu.au/researchers/jurgens-a", "colleges": "College of Science", "email": "anna-sophie.jurgens@anu.edu.au", "phone": "", "expertise": [], "interest": ["Popular Entertainment StudiesCircus, science and technologyPerformance histories of mad scientists, clown robots and violent clowns in cultureIntersections between science and art / Artistic ResearchAvant-Gardes"], "biography": "", "project": ["I am a Lecturer (Assistant Professor) in Popular Entertainment Studies at the Australian National Centre for the Public Awareness of Science of the Australian National University. I was an Alexander von Humboldt Fellow at the ANU and the Free University of Berlin, Germany from 2017 to 2020. I have published on the history of violent clowns, comic mad scientists, the Joker, and comic performance and technology in culture in numerous academic journals. I am the guest editor of two special themed journal issues published in 2020 with the Journal of Science & Popular Culture (on popular performance and science) and Comedy Studies (on violent clowns). My recent books include Circus, Science and Technology: Dramatising Innovation (editor, Palgrave Macmillan 2020) and Manegenkünste: Zirkus als ästhetisches Modell (coeditor, transcript 2020).", "My primary research focus is on the popular arts of the late nineteenth and early twentieth centuries. I seek to get a better understanding of how they were, and are, formative for the present. I am particularly interested in the richness and multidimensionality of the cultural and aesthetic capital of the circus in fiction and other media (embodied, for instance, in violent and cannibal clowns, epileptic dancers and freak performers), on the one hand, and of pathological body aesthetics oscillating between humour and violence (as typified by Frankenstein-clowns and mad scientists), on the other. Over the last few years, I have developed a special interest in the relationship between popular entertainment, fictional literature and science and technology (regarded as a kind of cultural practice), and therefore in the links between scientific research and creative imagination. I am currently exploring the interplay and relationship between comic performance and technology in culture.", "I am a Fellow of the Alexander von Humboldt Foundation and can act as a potential host for Feodor Lynen Postdoctoral Fellowships, applications are welcome!", "", ""], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}