{"ANU": {"name": "Anna Wierzbicka", "link": "https://researchers.anu.edu.au/researchers/wierzbicka-a", "colleges": "College of Arts and Social Sciences", "email": "Anna.Wierzbicka@anu.edu.au", "phone": "", "expertise": ["Philosophical Psychology Incl. Moral Psychology And Philosophy Of Action", "Jewish Studies", "Organisational Interpersonal And Intercultural Communication", "Culture Gender Sexuality", "Language In Time And Space Incl. Historical Linguistics Dialectology", "Language Studies", "Linguistic Structures Incl. Grammar Phonology Lexicon Semantics", "Cultural Theory", "Translation And Interpretation Studies", "Language In Culture And Society Sociolinguistics", "Lote Esl And Tesol Curriculum And Pedagogy Excl. Maori", "Migrant Cultural Studies", "Philosophy Of Language", "Comparative Language Studies", "Linguistic Anthropology", "Other European Languages", "Biography", "Christian Studies Incl. Biblical Studies And Church History", "Multicultural Intercultural And Cross Cultural Studies", "Discourse And Pragmatics", "English Language", "Central And Eastern European Languages Incl. Russian", "Cultural Studies", "Other Psychology And Cognitive Sciences", "Linguistics"], "interest": [], "biography": "Professor Anna Wierzbicka is a Professor in the Linguistics Program, School of Language Studies, Arts. In her 1972 book \"Semantic Primitives\" she launched a theory now known under the acronym \"NSM\" (Natural Semantic Metalanguage), which is now internationally recognized as one of the world's leading theories of language and meaning. This approach has been used in hundreads of semantic studies across many languages and cultures (NSM homepage, http://www.griffith.edu.au/humanities-languages/school-languages-linguistics/research/natural-semantic-metalanguage-homepage). She has published over twenty books and edited or co-edited several others. Her work spans a number of disciplines, including anthropology, psychology, cognitive science, philosophy and religious studies as well as linguistics, and has been published in many journals across all these disciplines (e.g., Language, American Anthropologist, Man, Anthropological Linguistics, Cognition and Emotion, Culture and Psychology, Ethos, Philosophica, Brain and Behaviourial Sciences, The Journal of Cognition and Culture etc). Professor Wierzbicka is a Fellow of the Australian Academy of the Humanities, the Australian Academy of Social Sciences, and of the Russian Academy of Sciences, and the Polish Academy of Arts and Sciences. She has two Honorary Doctorates, one from Marie  Curie-Sklodowska University, Poland (2004) and one from Warsaw University,  Poland (2006). She is the winner of the Dobrushin Prize for 2010 (established in Russia in honour of the Russian mathematician Roland Lvovich Dobrushin) and of the Polish Science Foundation’s 2010 prize for the humanities and social sciences.", "project": [], "publication": [{"title": "", "year": "2019", "source": "What Christians Believe: The Story of God and People", "authors": ["Anna Wierzbicka"]}, {"title": "Reported speech as a pivotal human phenomenon: Commentary on Spronck and Nikitina", "year": "2019", "source": "Linguistic Typology, vol. 23, no. 1, pp. 167-175", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "From", "year": "2019", "source": "Consciousness' to I ThinkI Feel, I Know'', Journal of Consciousness Studies, vol. 26, no. 9-10, pp. 257-269", "authors": ["Anna Wierzbicka"]}, {"title": "Direct and indirect speech revisited: Semantic universals and semantic diversity", "year": "2019", "source": "in Alessandro Capone, Manuel Garcia-Carpintero and Alessandra Falzone (ed.), Indirect Reports and Pragmatics in the World Languages, Springer International Publishing, Switzerland, pp. 173-199", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Speaking about God in universal words, thinking about God outside English", "year": "2018", "source": "in Paul Chilton and Monika Kopytowska (ed.), Religion, Language, and the Human Mind, Oxford University Press, United States, pp. 19-51", "authors": ["Anna Wierzbicka"]}, {"title": "How much longer can the Berlin and Kay paradigm dominate visual semantics", "year": "2018", "source": "in Diana Young (ed.), Rematerializing Colour: From Concept to Substance, Sean Kingston Publishing, United Kingdom, pp. 67-90", "authors": ["Anna Wierzbicka"]}, {"title": "Sense of Entitlement", "year": "2018", "source": "encoded in English Grammar'Etnolingwistyka, vol. 30, pp. 133-143", "authors": ["Anna Wierzbicka"]}, {"title": "EMOTIONS OF JESUS", "year": "2018", "source": "Rossiiskii Universitet Druzhby Narodov. Vestnik. Seriya Lingvistika - Russian Journal of Linguistics, vol. 22, no. 1, pp. 38-53pp", "authors": ["Anna Wierzbicka"]}, {"title": "Minimal English and How It Can Add to Global English", "year": "2018", "source": "in Cliff Goddard (ed.), Minimal English for a Global World: Improved Communication Using Fewer Words, Palgrave Macmillan, Basingstoke United Kingdom, pp. 5-27pp", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Charter of Global Ethic in Minimal English", "year": "2018", "source": "in Cliff Goddard (ed.), Minimal English for a Global World: Improved Communication Using Fewer Words, Palgrave Macmillan, Basingstoke United Kingdom, pp. 113-141pp", "authors": ["Anna Wierzbicka"]}, {"title": "I KNOW: A Human Universal", "year": "2018", "source": "in Masaharu Mizumoto, Stephen Stich and Eric McCready (ed.), Epistemology for the Rest of the World, Oxford University Press, United States, pp. 215-250", "authors": ["Anna Wierzbicka"]}, {"title": "Talking about our Bodies and their Parts in Warlpiri", "year": "2018", "source": "Australian Journal of Linguistics, vol. 38, no. 1, pp. 31-62pp", "authors": ["Anna Wierzbicka", "Goddard C"]}, {"title": "Talking About the Universe in Minimal English: Teaching Science Through Words That Children Can Understand", "year": "2017", "source": "in Cliff Goddard (ed.), Minimal English for a Global World: Improved Communication Using Fewer Words, Palgrave Macmillan, Basingstoke United Kingdom, pp. 169-200pp", "authors": ["Anna Wierzbicka"]}, {"title": "W co wierza chrzescijanie? Opowiesc o Bogu i o ludziach (What Christians Believe: The Story of God and People)", "year": "2017", "source": "ZnakPoland", "authors": ["Anna Wierzbicka"]}, {"title": "Kinship Terminologies: Cognitive Truth or Hocus-Pocus? A Reply to Kronenfeld", "year": "2017", "source": "Current Anthropology, vol. 58, no. 2, pp. 287-288", "authors": ["Anna Wierzbicka"]}, {"title": "The meaning of kinship terms: A developmental and cross-linguistic perspective", "year": "2017", "source": "in Zhengdao Ye (ed.), The Semantics of Nouns, Oxford University Press, United Kingdom, pp. 19-62pp", "authors": ["Anna Wierzbicka"]}, {"title": "", "year": "2017", "source": "Between Cultures: Cultural Keywords", "authors": ["Anna Wierzbicka"]}, {"title": "Karta etyki globalnej w slowach uniwersalnych (A charter of global ethics in universal words)", "year": "2017", "source": "in J Bartminski, S Niebrzegowska-Bartminska, M Nowosad-Bakalarczyk, J Puzynina (ed.), Etyka Slowa: Wybor opracowan (The Ethics of speech: elaborated choice), UMCS (Maria Curie-SkÅ‚odowska University), Lublin Poland, pp. 523-538", "authors": ["Anna Wierzbicka"]}, {"title": "Trzy zasady etyki slowa (Three principle of ethical speech)", "year": "2017", "source": "in J Bartminski, S Niebrzegowska-Bartminska, M Nowosad-Bakalarczyk, J Puzynina (ed.), Etyka Slowa: Wybor opracowan (The Ethics of speech: elaborated choice), UMCS (Maria Curie-SkÅ‚odowska University), Lublin Poland, pp. 67-76", "authors": ["Anna Wierzbicka"]}, {"title": "New Perspectives on Kinship: Overcoming the Eurocentrism and Scientism of Kinship Studies through Lexical Universals", "year": "2016", "source": "in Nancy Bonvillain (ed.), The Routledge Handbook of Linguistic Anthropology, Routledge Taylor & Francis Group, New York and Abingdon, pp. 62-79", "authors": ["Anna Wierzbicka"]}, {"title": "Two levels of verbal communication, universal and culture-specific", "year": "2016", "source": "in Andrea Rocci and Louis de Saussure (ed.), Verbal Communication, De Gruyter Mouton, Berlin Germany, pp. 447-481", "authors": ["Anna Wierzbicka"]}, {"title": "It", "year": "2016", "source": "s mine!'. Re-thinking the conceptual semantics of \"possession\" through NSM'Language Sciences, vol. 56, pp. 93-104", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Back to", "year": "2016", "source": "Mother' and Father' Overcoming the Eurocentrism of Kinship Studies through Eight Lexical Universals'Current Anthropology, vol. 57, no. 4, pp. 408-429", "authors": ["Anna Wierzbicka"]}, {"title": "Explicating the English lexicon of", "year": "2016", "source": "doing and happening''Functions of Language, vol. 23, no. 2, pp. 214-256", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Pain\" and \"suffering\" in cross-linguistic perspective", "year": "2016", "source": "in Cliff Goddard and Zhengdao Ye (ed.), \"Happiness \"and \"Pain\" across Languages and Cultures, John Benjamins Publishing Company, Amsterdam Holland, pp. 19-43", "authors": ["Anna Wierzbicka"]}, {"title": "Overcoming the Eurocentrism in Psychological Anthropology with Lexical Universals: A Response to Naomi Quinn", "year": "2016", "source": "Ethos: The Journal of the Society for Psychological Anthropology, vol. 44, no. 3, pp. 195-198", "authors": ["Anna Wierzbicka"]}, {"title": "Making sense of terms of address in European languages through the Natural Semantic Metalanguage (NSM)", "year": "2016", "source": "Intercultural Pragmatics, vol. 13, no. 4, pp. 499-527", "authors": ["Anna Wierzbicka"]}, {"title": "Walking\" and \"running\" in English and German The conceptual semantics of verbs of human locomotion", "year": "2016", "source": "Review of Cognitive Linguistics, vol. 14, no. 2, pp. 303-336", "authors": ["Goddard C", "Anna Wierzbicka", "Wong J"]}, {"title": "Terms of Address as Keys to Culture and Society: German Herr vs. Polish Pan", "year": "2016", "source": "Acta Philologica, vol. 49, pp. 29-44", "authors": ["Anna Wierzbicka"]}, {"title": "The idea of a", "year": "2015", "source": "spoon': semanticsprehistory, and cultural logic', Language Sciences, vol. 47, pp. 66-83", "authors": ["Anna Wierzbicka"]}, {"title": "Can there be common knowledge without a common language? German Pflicht versus English Duty", "year": "2015", "source": "Common Knowledge, vol. 21, no. 1, pp. 141-171", "authors": ["Anna Wierzbicka"]}, {"title": "Language and Cultural Scripts", "year": "2015", "source": "in Farzad Sharifian (ed.), The Routledge Handbook of Language and Culture, Routledge Taylor & Francis Group, Abingdon and New York, pp. 339-356", "authors": ["Anna Wierzbicka"]}, {"title": "Innate Conceptual Primitives Manifested in the Languages of the World and in Infant Cognition", "year": "2015", "source": "in Eric Margolis and Stephen Laurence (ed.), The Conceptual Mind: New Directions in the Study of Concepts, MIT Press, United States, pp. 379-412", "authors": ["Anna Wierzbicka"]}, {"title": "whole cloud of culture condensed into a drop of semantics: The meaning of the German word Herr as a term of address", "year": "2015", "source": "International Journal of Language and Culture, vol. 2, no. 1, pp. 1-37", "authors": ["Anna Wierzbicka"]}, {"title": "The meaning of colour words in a cross-linguistic perspective", "year": "2015", "source": "in Andrew J Elliot, Mark D Fairchild and Anna Franklin (ed.), Handbook of Color Psychology, Cambridge University Press, Cambridge, pp. 295-316", "authors": ["Anna Wierzbicka"]}, {"title": "What does Jukurrpa (", "year": "2015", "source": "Dreamtime'the Dreaming') mean? A semantic and conceptual journey of discovery', Australian Aboriginal Studies, vol. 2015/1, no. 1, pp. 43-65", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Words and Meanings: Lexical Semantics across Domains", "year": "2014", "source": "Languages and CulturesOxford University Press, Oxford and New York", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Semantic fieldwork and lexical universals", "year": "2014", "source": "Studies in Language, vol. 38, no. 1, pp. 80-126", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Pain\" and \"suffering\" in cross-linguistic perspective", "year": "2014", "source": "International Journal of Language and Culture, vol. 1, no. 2, pp. 149-173", "authors": ["Anna Wierzbicka"]}, {"title": "Moral absolutes and the multiplicity of languages engaging with Raimond Gaita", "year": "2014", "source": "in Anna Kozlowska and Agnieszka Swiatek (ed.), Znaczenie Tekst Kultura (The Meaning of Cultural Text), Wydawnictwo Uniwersytetu Kardynala Stefana Wyszynskiego, Warsaw Poland, pp. 119-138", "authors": ["Anna Wierzbicka"]}, {"title": "Imprisoned in English: The Hazards of English as a Default Language", "year": "2014", "source": "Oxford University PressUnited States", "authors": ["Anna Wierzbicka"]}, {"title": "Evolutionary semantics: using NSM to model stages in human cognitive evolution", "year": "2014", "source": "Language Sciences, vol. 42, pp. 60-79", "authors": ["Goddard C", "Anna Wierzbicka", "Fabrega Jr H"]}, {"title": "Words and Meanings: Lexical Semantics Across Domains", "year": "2014", "source": "Languagesand Cultures, Oxford University Press, Oxford", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Polish Zwierzeta", "year": "2014", "source": "Animals' and Jablka Apples': an Ethnosemantic Inquiry'in Adam Glaz, David S. Danaher and Przemyslaw Lozowski (ed.), The Linguistic Worldview: Ethnolinguistics, Cognition, and Culture, Versita, London, pp. 137-159", "authors": ["Anna Wierzbicka"]}, {"title": "Kinship and Social Cognition in Australian Languages: Kayardild and Pitjantjatjara", "year": "2013", "source": "Australian Journal of Linguistics, vol. 33, no. 3, pp. 302-321", "authors": ["Anna Wierzbicka"]}, {"title": "Translatability and the scripting of other peoples", "year": "2013", "source": "souls'Australian Journal of Anthropology, The, vol. 24, no. 1, pp. 1-21", "authors": ["Anna Wierzbicka"]}, {"title": "Rejoinder", "year": "2013", "source": "Australian Journal of Anthropology, vol. 24, no. 1, pp. 28-29", "authors": ["Anna Wierzbicka"]}, {"title": "The history of English seen as the history of ideas: Cultural change reflected in different translations of the New Testament", "year": "2012", "source": "in Terttu Nevalainen and Elizabeth Closs Traugott (ed.), The Oxford Handbook of the History of English, Oxford University Press, Oxford United Kingdom, pp. 434-445", "authors": ["Anna Wierzbicka"]}, {"title": "When cultural scripts clash: Miscommunication in \"multicultural Australia\"", "year": "2012", "source": "in Kryk-Kastovsky, Barbara (ed.), Intercultural Miscommunication Past and Present, Peter Lang AG, International Academic Publishers, Frankfurt am Main, Germany, pp. 121-146", "authors": ["Anna Wierzbicka"]}, {"title": "Is", "year": "2012", "source": "Pain' a Human Universal? Conceptualisation of pain' in EnglishFrench and Polish', Colloquia Communia, vol. 1, no. 92, pp. 29-53", "authors": ["Anna Wierzbicka"]}, {"title": "Pain: Universal but culturally shaped", "year": "2012", "source": "Emotion Review, vol. 4, no. 3, pp. 324-325", "authors": ["Anna Wierzbicka"]}, {"title": "Is Pain a Human Universal?: A Cross-Linguistic and Cross-Cultural Perspective on Pain", "year": "2012", "source": "Emotion Review, vol. 4, no. 3, pp. 307-317", "authors": ["Anna Wierzbicka"]}, {"title": "dvice", "year": "2012", "source": "in English and in Russian: A contrastive and cross-cultural perspective'in Holger Limberg and Miriam A. Locher (ed.), Advice in Discourse, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 309-331", "authors": ["Anna Wierzbicka"]}, {"title": "Understanding others requires shared concepts", "year": "2012", "source": "Pragmatics and Cognition, vol. 20, no. 2, pp. 356-379", "authors": ["Anna Wierzbicka"]}, {"title": "The Semantics of \"Sex\" in a cross-linguistic and cross-cultural perspective", "year": "2012", "source": "in Ju. Apresjan, I. Boguslavsky, M.-C. L'Homme, L. Iomdin, J. Milicevic (ed.), Meaning, Texts, and Other Exciting Things: A Festschrift to Commemorate the 80th Anniversary of Professor Igor AlexandroviÄ‰ Mel'Ä‰uk, Languages of Slavic Culture, Moscow, Russia, pp. 641-649", "authors": ["Anna Wierzbicka"]}, {"title": "On emotions and on definitions: A response to Izard", "year": "2010", "source": "Emotion Review, vol. 2, no. 4, pp. 379-380", "authors": ["Anna Wierzbicka"]}, {"title": "Translating Lives: Living with two Languages and Cultures", "year": "2007", "source": "University of Queensland PressSt Lucia Australia", "authors": ["Anna Wierzbicka", "Besemeres M", "eds"]}, {"title": "Semantic Universals and Basic Concepts", "year": "2011", "source": "Jazyki slavjanskoj kulturyMoscow Russia", "authors": ["Anna Wierzbicka"]}, {"title": "Defining", "year": "2011", "source": "the humanities''Culture and Psychology, vol. 17, no. 1, pp. 31-46", "authors": ["Anna Wierzbicka"]}, {"title": "Polish", "year": "2011", "source": "Value Words' in Competitive Perspective'Etnolingwistyka, vol. 23, pp. 45-66", "authors": ["Anna Wierzbicka"]}, {"title": "Bilingualism and cognition: The perspective from semantics", "year": "2011", "source": "in Vivian Cook & Benedetta Bassetti (ed.), Language and Bilingual Cognition: A Different Way of Thinking, Psychology Press, Taylor & Francis, New York, pp. 191-218", "authors": ["Anna Wierzbicka"]}, {"title": "Uniwersalia ugruntowane empirycznie (Empirically grounded universals)", "year": "2011", "source": "Teksty Drugie, vol. 1/2, pp. 13-30", "authors": ["Anna Wierzbicka"]}, {"title": "rguing in Russian: Why Solzhenitsyn", "year": "2011", "source": "s fictional arguments defy translation'Russian Journal of Communication, vol. 4, no. 1/2, pp. 8-37", "authors": ["Anna Wierzbicka"]}, {"title": "Semantics and cognition", "year": "2011", "source": "Wiley Interdisciplinary Reviews: Cognitive Science, vol. 2, no. 2, pp. 125-135", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "What", "year": "2011", "source": "s wrong with \"happiness studies\"? The cultural semantics of happinessbonheur, gluck and scast'e', in  (ed.), Word and Language (Slovo i Jazyk), Jazyki slavjanskoj kultury, Moscow, pp. 155-171", "authors": ["Anna Wierzbicka"]}, {"title": "Common language of all people: The innate language of thought", "year": "2011", "source": "Problems of Information Transmission, vol. 47, no. 4, pp. 378-397", "authors": ["Anna Wierzbicka"]}, {"title": "Story", "year": "2010", "source": "- An English cultural keyword and a key interpretive tool of Anglo culture'Narrative Inquiry, vol. 20, no. 1, pp. 153-181", "authors": ["Anna Wierzbicka"]}, {"title": "Is there thought without language?", "year": "2010", "source": "in Marek Kuczynski (ed.), Language, Thought and Education: Vol. 2, Uniwersytet Zielonogorski, Zielona Gora, Poland, pp. 11-21", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "Emotion terms as a window on culture, social psychology and subjective experience", "year": "2010", "source": "in S V Ionov (ed.), Jazyk i emociia, Volgogradskoe Nauchnoe Izdatel'stvo, Volgograd, pp. 14-32", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "Lexical universals of kinship and social cognition", "year": "2010", "source": "Behavioral and Brain Sciences, vol. 33, no. 5, pp. 403-404", "authors": ["Anna Wierzbicka"]}, {"title": "Semantics and cognition", "year": "2010", "source": "Wires: Cognitive Science, vol. 2, pp. 125-135", "authors": ["Goddard G", "Anna Wierzbicka"]}, {"title": "Eating", "year": "2010", "source": "and drinking' in Kalam'in John Bowden, Nikolaus P Himmelmann & Malcolm Ross (ed.), A journey through Austronesian and Papuan linguistic and cultural space: Papers in honour of Andrew Pawley, Pacific Linguistics, Canberra, ACT, pp. 651-660", "authors": ["Anna Wierzbicka"]}, {"title": "Cultural scripts and international communication", "year": "2010", "source": "in Anna Trosborg (ed.), Pragmatics Across Languages and Cultures, Walter de Gruyter, Berlin/New York, pp. 43-78", "authors": ["Anna Wierzbicka"]}, {"title": "Want", "year": "2010", "source": "is a lexical and conceptual universal: Reply to Khanina'Studies in Language, vol. 34, no. 1, pp. 108-123", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Experience", "year": "2010", "source": "Evidenceand Sense: The Hidden Cultural Legacy of English, Oxford University Press, New York, USA", "authors": ["Anna Wierzbicka"]}, {"title": "Cross-cultural communication and miscommunication: The role of cultural keywords", "year": "2010", "source": "Intercultural Pragmatics, vol. 7, no. 1, pp. 1-23", "authors": ["Anna Wierzbicka"]}, {"title": "The", "year": "2010", "source": "History of Emotions' and the Future of Emotion Research'Emotion Review, vol. 2, no. 3, pp. 269-273", "authors": ["Anna Wierzbicka"]}, {"title": "Cultural Scripts", "year": "2010", "source": "in Louise Cummings (ed.), The Pragmatic's Encyclopedia, Routledge, Taylor & Francis Group, New York, pp. 92-95", "authors": ["Anna Wierzbicka"]}, {"title": "ll people eat and drink: Does this mean that", "year": "2009", "source": "eat' and drink' are universal human concepts?'in John Newman (ed.), The Linguistics of Eating and Drinking, John Benjamins Publishing Company, Amsterdam and Philadelphia, pp. 65-89", "authors": ["Anna Wierzbicka"]}, {"title": "Language and Metalanguage: Key Issues in Emotion Research", "year": "2009", "source": "Emotion Review, vol. 1, no. 1, pp. 3-14", "authors": ["Anna Wierzbicka"]}, {"title": "Reciprocity\": an NSM approach to linguistic typology and social universals", "year": "2009", "source": "Studies in Language, vol. 33, no. 1, pp. 103-175", "authors": ["Anna Wierzbicka"]}, {"title": "Pragmatics and Cultural Values: The Hot Centre of Russian Discourse", "year": "2009", "source": "in Bruce Fraser and Ken Turner (ed.), Language in Life, and a Life in Language: Jacob Mey - a Festschrift, Emerald Group Publishing Ltd, Bingley, UK, pp. 423-434", "authors": ["Anna Wierzbicka"]}, {"title": "Exploring English Phraseology with Two Tools: NSM Semantic Methodology and Google", "year": "2009", "source": "Journal of English Linguistics, vol. 37, no. 2, pp. 101-129", "authors": ["Anna Wierzbicka"]}, {"title": "Contrastive semantics of physical activity verbs:", "year": "2009", "source": "Cutting' and chopping' in EnglishPolish and Japanese', Language Sciences, vol. 31, no. 1, pp. 60-96", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Case in NSM: A reanalysis of the Polish dative", "year": "2009", "source": "in Andrej Malchukov and Andrew Spencer (ed.), The Oxford Handbook of Case, Oxford University Press, New York, USA, pp. 151-169", "authors": ["Anna Wierzbicka"]}, {"title": "Overcoming Anglocentrism in Emotion Research", "year": "2009", "source": "Emotion Review, vol. 1, no. 1, pp. 21-23", "authors": ["Anna Wierzbicka"]}, {"title": "The Concept of Frustration: A Culture-Specific Emotion and a Cultural Key Word", "year": "2009", "source": "in Agata Blachnio and Aneta Przepiorka (ed.), Closer to Emotions III, Wydawnictwo KUL, Lublin, pp. 211-226", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "The Language of \"Bullying\" and \"Harassment\"", "year": "2009", "source": "Quadrant, vol. 53, no. 12, pp. 102-107", "authors": ["Anna Wierzbicka"]}, {"title": "What makes a good life? A cross-linguistic and cross-cultural perspective", "year": "2009", "source": "Journal of Positive Psychology: dedicated to furthering research and promoting good practice, vol. 4, no. 4, pp. 260-272", "authors": ["Anna Wierzbicka"]}, {"title": "The Theory of the Mental Lexicon", "year": "2009", "source": "in S Kempgen, P. Kosta, T. Berger and K Gutschmidt (ed.), Die slavischen Sprachen/The Slavic Languages: An International Handbook of their Structure, their History and their Investigation, Mouton de Gruyter, Berlin, New York, pp. 848-863", "authors": ["Anna Wierzbicka"]}, {"title": "Metatekst w tekÅ?cie (Metatext in the text)", "year": "2008", "source": "in Danuta Ostaszewska and Romuald Cudak (ed.), Polska Genologia Lingwistyczna, Wydawnictwo Naukowe Pwn, Warsaw, Poland, pp. 281-296", "authors": ["Anna Wierzbicka"]}, {"title": "Imeet li smysl govorit", "year": "2008", "source": "o russkoj jazukovoj kartine mira? (Does it make sense to speak of a Russian linguistic picture of the world?)'in Bondarko, A.V., Kustova, G.I., R.I. Rozina (ed.), DinamiÄ?eskie Modeli: Slovo, PredloÅ¾enie, Tekst (Dynamic Models: Word, Sentence, Text), Languages of Slavic Cultures, Moscow, pp. 177-189", "authors": ["Anna Wierzbicka"]}, {"title": "Podmiot rozdwojony w sobie: dwa jÄ™zyki, dwie kultury, jedno(?) ja (The divided self: two languages, two cultures, one(?) self", "year": "2008", "source": "in J. Bartminskiego and A Pajdzinskiej (ed.), Podmiot w jÄ™zyku i kulturze (Subject in language and culture), Wydawnictwo Uniwersytetu, Lublin, pp. 139-159", "authors": ["Anna Wierzbicka"]}, {"title": "New semantic primes and new syntactic frames: \"Specificational BE\" and \"abstract THIS/IT\"", "year": "2008", "source": "in Cliff Goddard (ed.), Cross-Linguistic Semantics, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 35-57", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Kazanie na GÃ³rze (The Sermon on the Mount)", "year": "2008", "source": "Zeszyty Naukowe, vol. 3, pp. 19-57", "authors": ["Anna Wierzbicka"]}, {"title": "Why there are no", "year": "2008", "source": "colour universals' in language and thought'Journal of the Royal Anthropological Institute, vol. 14, no. 2, pp. 407-425", "authors": ["Anna Wierzbicka"]}, {"title": "Rejoinder to Paul Kay and Rolf G. Kuenhi", "year": "2008", "source": "Journal of the Royal Anthropological Institute, vol. 14, no. 4, pp. 887-889", "authors": ["Anna Wierzbicka"]}, {"title": "Modlitwa PaÅ„ska (The Lord", "year": "2008", "source": "s Prayer)'Zeszyty Naukowe, vol. 3, pp. 59-97", "authors": ["Anna Wierzbicka"]}, {"title": "conceptual basis for research into emotions and bilingualism", "year": "2008", "source": "Bilingualism: Language and Cognition, vol. 11, no. 2, pp. 193-195", "authors": ["Anna Wierzbicka"]}, {"title": "Universal human concepts as a basis for contrastive linguistic semantics", "year": "2008", "source": "in M. de los Angeles Gomez Gonzalez, J.L. Mackenzie and E.M. Gonzalez Alvarez (ed.), Current Trends in Contrastive Linguistics: Functional and cognitive perspectives, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 205-226", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "conceptual basis for intercultural pragmatics and world-wide understanding", "year": "2008", "source": "in Martin Putz & JoAnne Neff-van Aertselaer (ed.), Developing Contrastive Pragmatics: Interlanguage and Cross-Cultural Perspectives, Mouton de Gruyter, Berlin, pp. 3-45", "authors": ["Anna Wierzbicka"]}, {"title": "Semantic primes and cultural scripts in language learning and intercultural communication", "year": "2007", "source": "in Farzad Sharifian and Gary B Palmer (ed.), Applied Cultural Linguistics: Implications for second language learning and intercultural communication, John Benjamins Publishing Company, Amsterdam, The Netherlands and Philadelphia, USA, pp. 105-124", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "NSM analyses of the semantics of physical qualities: sweet, hot, hard, heavy, rough, sharp in cross-linguistic perspective", "year": "2007", "source": "Studies in Language, vol. 31, no. 4, pp. 765-800", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Bodies and their parts: An NSM approach to semantic typology", "year": "2007", "source": "Language Sciences, vol. 29, no. 1, pp. 14-65", "authors": ["Anna Wierzbicka"]}, {"title": "Is \"remember\" a universal human concept? \"Memory\" and culture", "year": "2007", "source": "in Mengistu Amberber (ed.), The Language of Memory in a Crosslinguistic Perspective, John Benjamins Publishing Company, Amsterdam, The Netherlands, pp. 13-39", "authors": ["Anna Wierzbicka"]}, {"title": "Introduction:Translating Lives: Living with Two Languages and Cultures", "year": "2007", "source": "in Mary Besemeres & Anna Wierzbicka (ed.), Translating Lives: Living with Two Languages and Cultures, University of Queensland Press, St Lucia Australia, pp. viii-xxiv", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "Reasonably well: Natural Semantic Metalanguage as a tool for the study of phraseology and of its cultural underpinnings", "year": "2007", "source": "in Paul Skandera (ed.), Phraseology and Culture in English, Mouton de Gruyter, Berlin, Germany, pp. 49-78", "authors": ["Anna Wierzbicka"]}, {"title": "Moral sense", "year": "2007", "source": "Journal of Social, Evolutionary and Cultural Psychology, vol. 1, no. 3, pp. 66-85", "authors": ["Anna Wierzbicka"]}, {"title": "Theory and Empirical Findings: A Response to Jackendoff", "year": "2007", "source": "Intercultural Pragmatics, vol. 4, no. 3, pp. 399-409", "authors": ["Anna Wierzbicka"]}, {"title": "Shape and colour in language and thought", "year": "2007", "source": "in Andrea C. Schalley and Drew Khlentzos (ed.), Mental States: Volume 2: Language and cognitive structure, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 37-60", "authors": ["Anna Wierzbicka"]}, {"title": "SÅ?owa klucze: RÃ³Å¼ne jÄ?zyki - rÃ³Å¼ne kultury (Keywords: Foreign languages - foreign cultures)", "year": "2007", "source": "Wydawnictwo UniwersytetuWarsaw, Poland", "authors": ["Anna Wierzbicka"]}, {"title": "Translating Lives: Living with two Languages and Cultures", "year": "2007", "source": "University of Queensland PressSt Lucia Australia", "authors": ["Besemeres M", "Anna Wierzbicka", "eds"]}, {"title": "Two languages, two cultures, one (?) self: Between Polish and English", "year": "2007", "source": "in Mary Besemeres & Anna Wierzbicka (ed.), Translating Lives: Living with Two Languages and Cultures, University of Queensland Press, St Lucia Australia, pp. 96-113", "authors": ["Anna Wierzbicka"]}, {"title": "On folk conceptions of mind, agency and morality. The interface between folk psychology and folk morality", "year": "2006", "source": "Journal of Cognition and Culture, vol. 6.1-2, pp. 165-179", "authors": ["Anna Wierzbicka"]}, {"title": "Shape in grammar revisited", "year": "2006", "source": "Studies in Language, vol. 30, no. 1, pp. 115-177", "authors": ["Anna Wierzbicka"]}, {"title": "nglo scripts against", "year": "2006", "source": "putting pressure' on other people and their linguistic manifestations'in Cliff Goddard (ed.), Ethnopragmatics: Understanding Discourse in Cultural Context, Mouton de Gruyter, Berlin, pp. 31-64", "authors": ["Anna Wierzbicka"]}, {"title": "The concept of", "year": "2006", "source": "dialogue' in cross-linguistic and cross-cultural perspective'Discourse Studies: an interdisciplinary journal for the study of text and talk, vol. 8, no. 5, pp. 675-703", "authors": ["Anna Wierzbicka"]}, {"title": "The semantics of colour: A new paradigm", "year": "2006", "source": "in CP Biggam, CJ Kay (ed.), Progress in Colour Studies, John Benjamins Publishing Company, Amsterdam The Netherlands, pp. 1-24", "authors": ["Anna Wierzbicka"]}, {"title": "Preface - Semantic Primes and Universal Grammar", "year": "2006", "source": "in Bert Peeters (ed.), Semantic Primes and Universal Grammar, John Benjamins Publishing Company, Amsterdam, pp. 1-7", "authors": ["Anna Wierzbicka"]}, {"title": "Experience\" in John Searle", "year": "2006", "source": "s account of the mind: Brainmind, and Anglo culture', Intercultural Pragmatics, vol. 3, no. 3, pp. 241-256", "authors": ["Anna Wierzbicka"]}, {"title": "English: Meaning and Culture", "year": "2006", "source": "Oxford University PressNew York", "authors": ["Anna Wierzbicka"]}, {"title": "There are no \"color universals\" but there are universals of visual semantics", "year": "2005", "source": "Anthropological Linguistics, vol. 47, no. 2, pp. 217-244", "authors": ["Anna Wierzbicka"]}, {"title": "Universal human concepts as a tool for exploring bilingual lives", "year": "2005", "source": "International Journal of Bilingualism, vol. 9, no. 1, pp. 7-26", "authors": ["Anna Wierzbicka"]}, {"title": "W poszukiwaniu lepszego zrozumienia slow eucharystycznych", "year": "2005", "source": "Znak Miesiecaznik, vol. 57/604, no. 9, pp. 33-55", "authors": ["Anna Wierzbicka"]}, {"title": "In Defense of Culture", "year": "2005", "source": "Theory and Psychology, vol. 15, no. 4, pp. 575-597", "authors": ["Anna Wierzbicka"]}, {"title": "Empirical Universals of Language as a Basis for the Study of Other Human Universals and as a Tool for Exploring Cross-Cultural Differences", "year": "2005", "source": "Ethos: The Journal of the Society for Psychological Anthropology, vol. 33, no. 2, pp. 256-291", "authors": ["Anna Wierzbicka"]}, {"title": "Universalnye semanticheskie primitivy kak kljuch k leksicheskoj semantike (sfera emocij)", "year": "2005", "source": "in V.V. Dementiev (ed.), Zhanr i koncept, Kolledzh, Saratov, pp. 156-182", "authors": ["Anna Wierzbicka"]}, {"title": "Conceptual primes in human languages and their analogues in animal communication and cognition", "year": "2004", "source": "Language Sciences, vol. 26, no. 5, pp. 413-441", "authors": ["Anna Wierzbicka"]}, {"title": "Emotion and Culture: Arguing with Martha Nussbaum", "year": "2004", "source": "Ethos: The Journal of the Society for Psychological Anthropology, vol. 31, no. 4, pp. 577-600", "authors": ["Anna Wierzbicka"]}, {"title": "Cultural scripts: What are they and what are they good for?", "year": "2004", "source": "Intercultural Pragmatics, vol. 1, no. 2, pp. 153-166", "authors": ["Anna Wierzbicka", "Goddard C"]}, {"title": "Jak mozna mowic o Trojcy Swietej w stowach prostych i uniwersalnych [How can one talk about the Holy Trinity in simple and universal words?]", "year": "2004", "source": "Wydawnictwo UniwersytetuLublin, Poland", "authors": ["Anna Wierzbicka"]}, {"title": "The English Expressions Good Boy and Good Girl and Cultural Models of Child Rearing", "year": "2004", "source": "Culture and Psychology, vol. 10, no. 3, pp. 251-78", "authors": ["Anna Wierzbicka"]}, {"title": "Jewish cultural scripts and the interpretation of the Bible", "year": "2004", "source": "Journal of Pragmatics, vol. 36, no. 1, pp. 575-599", "authors": ["Anna Wierzbicka"]}, {"title": "Cross-Cultural Pragmatics: The Semantics of Human Interaction", "year": "2003", "source": "Mouton de GruyterBerlin", "authors": ["Anna Wierzbicka"]}, {"title": "The meaning of the particle Iah in Singapore English", "year": "2003", "source": "Pragmatics and Cognition, vol. 11, no. 1, pp. 3-38", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "Semantics and Cognition", "year": "2003", "source": "in Lynn Nadel (ed.), Encyclopedia of Cognitive Science, Nature Publishing Group, Basingstoke, pp. 1096-1102", "authors": ["Anna Wierzbicka", "Goddard C"]}, {"title": "Culture-specific character of the categories directness and indirectness", "year": "2003", "source": "in V.V.Dement?ev (ed.), Prjamaja I neprjamaja Kommunika cija, State Educational and Research Centre College, Saratov, Russia, pp. 136-159", "authors": ["Anna Wierzbicka"]}, {"title": "Introduction to the second edition - Cross Cultural Pragmatics", "year": "2003", "source": "in A Wierzbicka (ed.), Cross-Cultural Pragmatics: The Semantics of Human Interaction, Mouton de Gruyter, Berlin, pp. 5-27", "authors": ["Anna Wierzbicka"]}, {"title": "Singapore English: A semantic and cultural perspective", "year": "2003", "source": "Multilingua - Journal of Cross-Cultural and Interlanguage Communication, vol. 22, no. 2003, pp. 327-366", "authors": ["Anna Wierzbicka"]}, {"title": "Pragmatics and Cognition: The meaning of the particle lah in Singapore English", "year": "2003", "source": "Pragmatics and Cognition, vol. 11, no. 1, pp. 3-38", "authors": ["Besemeres M", "Anna Wierzbicka"]}, {"title": "Reasonable man and Reasonable doubt: The English language, Anglo culture and Anglo-American law", "year": "2003", "source": "Forensic Linguistics: The International Journal of Speech, Language and the Law, vol. 10, no. 1, pp. 1-22", "authors": ["Anna Wierzbicka"]}, {"title": "Semantic Primitives", "year": "2003", "source": "in J Frawley (ed.), International Encyclopedia of Linguistics (2nd ed), Oxford University Press, New York, pp. ?-?", "authors": ["Anna Wierzbicka"]}, {"title": "Semantic Primes and Universal Grammar", "year": "2002", "source": "in Cliff Goddard and Anna Wierzbicka (ed.), Meaning and Universal Grammar: Theory and Empirical Findings Volume I, John Benjamins Publishing Company, Amsterdam, pp. 41-85", "authors": ["Goddard C", "Anna Wierzbicka"]}, {"title": "Meaning and Universal Grammar: Theory and empirical findings", "year": "2002", "source": "in Park Youngsoon (ed.), Current Trends and Prospects for Korean Linguistics in the 21st Century, Hankookmunhwasa Publishing Co., Seoul, p. 343378", "authors": ["Anna Wierzbicka"]}, {"title": "Right and Wrong: from philosophy to everyday discourse", "year": "2002", "source": "Discourse Studies: an interdisciplinary journal for the study of text and talk, vol. 4, no. 2, pp. 225-252", "authors": ["Anna Wierzbicka"]}, {"title": "Zydowskie skrypty kulturowe a interpretacja Ewangelii [Jewish Cultural Scripts and the Interpretation of the Gospels]", "year": "2002", "source": "Teksty Drugie, vol. 76, no. 4, pp. 157-176", "authors": ["Anna Wierzbicka"]}, {"title": "Meaning and Universal Grammar: Theory and empircal findings. Volume I", "year": "2002", "source": "John Benjamins Publishing CompanyAmsterdam", "authors": ["Anna Wierzbicka", "Goddard C", "eds"]}, {"title": "Introduction: The body in description of emotion", "year": "2002", "source": "Pragmatics and Cognition, vol. 10, no. 1/2 (2002), pp. 1-25", "authors": ["Enfield N", "Anna Wierzbicka"]}, {"title": "Semantic Primes and Linguistic Typology", "year": "2002", "source": "in Cliff Goddard and Anna Wierzbicka (ed.), Meaning and Universal Grammar: Theory and Empirical Findings Volume II, John Benjamins Publishing Company, Amsterdam, pp. 257-300", "authors": ["Anna Wierzbicka"]}, {"title": "ustralian Cultural Scripts - bloody revisited", "year": "2002", "source": "Journal of Pragmatics, vol. 34, pp. 1167-1209", "authors": ["Anna Wierzbicka"]}, {"title": "Opening Statement: Meaning and Universal Grammar", "year": "2002", "source": "in Cliff Goddard and Anna Wierzbicka (ed.), Meaning and Universal Grammar: Theory and Empirical Findings Volume I, John Benjamins Publishing Company, Amsterdam, pp. 1-3", "authors": ["Anna Wierzbicka", "Goddard C"]}, {"title": "Meaning and Universal Grammar:Theory and empirical findings Volume II", "year": "2002", "source": "John Benjamins Publishing CompanyAmsterdam", "authors": ["Anna Wierzbicka", "Goddard C", "eds"]}, {"title": "Semantic Primes and Universal Grammar in Polish", "year": "2002", "source": "in Cliff Goddard and Anna Wierzbicka (ed.), Meaning and Universal Grammar: Theory and Empirical Findings Volume II, John Benjamins Publishing Company, Amsterdam, pp. 65-144", "authors": ["Anna Wierzbicka"]}, {"title": "Co mowi Jezus? Objasnianie przypowiesci ewangelicznych w stowach prostych uniwersalnych", "year": "2002", "source": "Wydawnictwo Naukowe PwnWarszawa", "authors": ["Anna Wierzbicka"]}, {"title": "The Theory of Cultural Scripts as a Tool of Cross-Cultural Communication", "year": "2002", "source": "International Conference on Korean Linguistics 2002, ed. Park Youngsoon, Korean Linguistics Society, Seoul, pp. 452-463", "authors": ["Anna Wierzbicka"]}, {"title": "The English Language: A Semantic and Cultural Perspective", "year": "2002", "source": "Linguistics Society of Korea Summer Conference 2002, ed. YunPyo Hong (check?), Thaehaksa, Seoul, pp. 51-89", "authors": ["Anna Wierzbicka"]}, {"title": "Sexism in Grammar: The Semantics of Gender in Australian English", "year": "2003", "source": "Anthropological Linguistics, vol. 44, pp. 143-177", "authors": ["Anna Wierzbicka"]}, {"title": "Russian cultural scripts: The theory of cultural scripts and its applications", "year": "2002", "source": "Ethos: The Journal of the Society for Psychological Anthropology, vol. 30, no. 4, pp. 401-432", "authors": ["Anna Wierzbicka"]}, {"title": "response to Stuart Shanker", "year": "2001", "source": "Current Anthropology, vol. 42, no. 4, pp. 506-507", "authors": ["Anna Wierzbicka"]}, {"title": "Universal semantic primitives and the semantics of the Polish aspect", "year": "2001", "source": "in Chrakovskij, Viktor S., Grochowski, Maciej., Hentschel, Gerd (ed.), Studies on the Syntax and Semantics of Slavonic Language: Paper in honour of Andrzej Boguslawski on the occasion of his 70th Birthday, Bibliotheks-und Informationssystem der Universitat Oldenburg, Oldenburg, Germany, pp. 429-448", "authors": ["Anna Wierzbicka"]}, {"title": "Ponimanie kultr c$erez posredstvo kluc&evyx slov", "year": "2001", "source": "Jazyki slavjanskoj kulturyMoscow", "authors": ["Anna Wierzbicka"]}, {"title": "Leibnizian linguistics", "year": "2001", "source": "in Kenesei, Istvan, Harnish, Robert M. (ed.), Perspectives on Semantics, Pragmatics and Discourse: A Festschrift for Ferenc Kiefer, John Benjamins Publishing Company, Amsterdam, Philadelphia, pp. 229-253", "authors": ["Anna Wierzbicka"]}, {"title": "Emotions in Crosslinguistic Perspective", "year": "2001", "source": "Mouton de GruyterBerlin", "authors": ["Anna Wierzbicka", "Harkins J", "eds"]}, {"title": "ustralian Culture and Australian English: A response to William Ramson", "year": "2001", "source": "Australian Journal of Linguistics, vol. 21, no. 2, pp. 195-214", "authors": ["Anna Wierzbicka"]}, {"title": "Jezus dla kazdego: Rozmowa z profesor Anna Wierzbicka PLEASE add in translation into English", "year": "2001", "source": "Zycie Duchowe, vol. 8, no. 27, pp. 18-25", "authors": ["Anna Wierzbicka"]}, {"title": "Culturally salient Polish Emotion: Przykro (pron. pshickro)", "year": "2001", "source": "in Harkins, Jean and Wierzbicka, Anna (ed.), Emotions in Cross Linguistic Perspective, Mouton de Gruyter, Berlin, pp. 337-357", "authors": ["Anna Wierzbicka", "Harkins J"]}, {"title": "Culturally Salient Polish Emotion: Przykro [Pshickro]", "year": "2001", "source": "International Journal of Group Tensions, vol. 30, no. 1, pp. 3-27", "authors": ["Anna Wierzbicka"]}, {"title": "Introduction [to Emotions in Cross Linguistic Perspective]", "year": "2001", "source": "in Harkins, Jean and Wierzbicka, Anna (ed.), Emotions in Cross Linguistic Perspective, Mouton de Gruyter, Berlin, pp. 1-34", "authors": ["Anna Wierzbicka", "Harkins J"]}, {"title": "The Conceptual system of the human mind: the task of understanding languages in their cultural uniqueness and specificity has a long tradition", "year": "2001", "source": "Humboldt Kosmos, vol. 78, pp. 20-21", "authors": ["Anna Wierzbicka"]}, {"title": "What Did Jesus Mean? Explaining the Sermon on the Mount and the parables in simple and universal human concepts", "year": "2001", "source": "Oxford University PressNew York, USA", "authors": ["Anna Wierzbicka"]}, {"title": "Semantics of Human Facial Expressions", "year": "2000", "source": "Pragmatics and Cognition, vol. 8, no. 1, pp. 147-183", "authors": ["Anna Wierzbicka"]}, {"title": "Semantics, Emotions and the Meaning of the Gospels", "year": "2000", "source": "in Cabre, M. Teresa; Gelphi, Cristina (ed.), Cicle de conferï¿½ncies i seminaris 97-98. Lï¿½xic, corpus i diccionaris, Universitat Pompeu Fabra Institut Universitari de Linguistica Aplicada, Barcelona, pp. 103-121", "authors": ["Anna Wierzbicka"]}, {"title": "The language of Christian belief", "year": "1999", "source": "Quadrant, vol. Jul Aug 99, pp. 62-65", "authors": ["Anna Wierzbicka"]}, {"title": "semantic basis for linguistic typology", "year": "1999", "source": "in Rakhilina, Ekaterina V. and Yakov, G. Testelets (ed.), Typology and Linguistic Theory from Description to Explanation. For the 60th Birthday of Aleksandr E. Kibrik, Languages of Russian Culture, Moscow, pp. 26-35", "authors": ["Anna Wierzbicka"]}, {"title": "Jak interpretowac! Ewangelie4? Semantyka metafory i przypowies:ci. Czï¿½owiekï¿½Nauka ï¿½Wiara PLEASE add in translation into English", "year": "1999", "source": "in Wojtowicza, . Pod redakcja? Jacka J. Jadackiego i  (ed.), Materiaï¿½y sympozjum dla uczczenia jubileuszu 2000-lecia chrzescijan:stwa, Uniwersytet Warszawski, Warszawa, pp. 253-268", "authors": ["Anna Wierzbicka"]}, {"title": "Language, Culture and Meaning: Cross-cultural linguistics", "year": "1999", "source": "in Dirven, Ren?; Verspoor, Marjolin (ed.), Cognitive Exploration of Language and Linguistics, John Benjamins Publishing Company, Amsterdam, pp. 137-159", "authors": ["Anna Wierzbicka"]}, {"title": "What did Jesus mean? The Lords Prayer translated into universal human concepts", "year": "1999", "source": "Neural Computation (online), vol. n/a, pp. 180-216", "authors": ["Anna Wierzbicka"]}, {"title": "Emotions across Languages and Cultures: Diversity and universals", "year": "1999", "source": "Cambridge University PressCambridge, UK", "authors": ["Anna Wierzbicka"]}, {"title": "Lexical prototypes as a universal basis for cross-linguistic identification of parts of speech.", "year": "1999", "source": "in Vogel, Petra M.; Comrie, Bernard (ed.), Approaches to the Typology of Parts of Speech, Mouton de Gruyter, Berlin/New York, pp. 285-317", "authors": ["Anna Wierzbicka"]}]}, "Microsoft-Academic": [{"title": "emotions across languages and cultures diversity and universals", "year": 1999, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "english meaning and culture", "year": 2006, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "semantics primes and universals", "year": 1996, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "words and meanings lexical semantics across domains languages and cultures", "year": 2013, "source": "", "authors": [{"name": "cliff goddard"}, {"name": "anna wierzbicka"}]}, {"title": "imprisoned in english the hazards of english as a default language", "year": 2013, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "semantics culture and cognition universal human concepts in culture specific configurations", "year": 1992, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "cross cultural pragmatics the semantics of human interaction", "year": 1992, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "understanding cultures through their key words english russian polish german and japanese", "year": 1997, "source": "", "authors": [{"name": "anna wierzbicka"}]}, {"title": "light earthworms and soil resources as predictors of diversity of 10 soil invertebrate groups across monocultures of 14 tree species", "year": 2016, "source": "soil biology & biochemistry", "authors": [{"name": "kevin e mueller", "affiliation": "agricultural research service"}, {"name": "nico eisenhauer", "affiliation": "university of minnesota"}, {"name": "nico eisenhauer", "affiliation": "leipzig university"}, {"name": "peter b reich", "affiliation": "university of western sydney"}, {"name": "peter b reich", "affiliation": "university of minnesota"}, {"name": "sarah e hobbie", "affiliation": "university of minnesota"}, {"name": "oliver a chadwick", "affiliation": "university of california santa barbara"}, {"name": "jon chorover", "affiliation": "university of arizona"}, {"name": "tomasz dobies"}, {"name": "cindy m hale", "affiliation": "natural resources research institute"}, {"name": "andrzej m jagodzinski", "affiliation": "polish academy of sciences"}, {"name": "izabela kalucka"}, {"name": "marek kasprowicz", "affiliation": "adam mickiewicz university in poznan"}, {"name": "barbara kieliszewskarokicka", "affiliation": "kazimierz wielki university in bydgoszcz"}, {"name": "jerzy modrzynski"}, {"name": "anna rozen", "affiliation": "jagiellonian university"}, {"name": "maciej skorupski"}, {"name": "łukasz sobczyk", "affiliation": "jagiellonian university"}, {"name": "malgorzata stasinska", "affiliation": "university of szczecin"}, {"name": "lidia k trocha", "affiliation": "polish academy of sciences"}, {"name": "january weiner", "affiliation": "jagiellonian university"}, {"name": "anna wierzbicka"}, {"name": "jacek oleksyn", "affiliation": "polish academy of sciences"}, {"name": "jacek oleksyn", "affiliation": "university of minnesota"}], "id": 62391475}, {"title": "why there are no colour universals in language and thought", "year": 2008, "source": "journal of the royal anthropological institute", "authors": [{"name": "anna wierzbicka", "affiliation": "australian national university"}], "id": 65256140}], "ANDS-Grants": []}