{"ANU": {"name": "Anneka Ferguson", "link": "https://researchers.anu.edu.au/researchers/ferguson-al", "colleges": "ANU College of Law", "email": "anneka.ferguson@anu.edu.au", "phone": "0420 633749", "expertise": [], "interest": ["Regulation of the Legal ProfessionEthics in Legal PracticeLegal Education - how to achieve the best learning outcomes and the creation of professional and well practitionersThe intersections between Psychology and International and Domestic LawBlockchain technology and the legal profession - the impact and the potential of this technology on practice, regulation and international law"], "biography": "", "project": ["Conference Papers", "2018", "National Institute for Teaching Ethics and Professionalism, Melbourne 'Valuing Values' - A teaching and research demonstration", "International Legal Ethics Conference, Melbourne Regulating for Ethical Wellbeing?", "Directions in Legal Education 2018, China University Hong Kong, Valuing Dissonance (Accompanying blog post https://www.learning.law.cuhk.edu.hk/)", "2018 Wellness in Law Forum, Bond University, Deconstructing and reconstructing core motivating beliefs about law without causing detruction", "2017", "Legal Education Sector, Society of Legal Scholars Conference Dublin, Valuing Legal Education", "Visiting Scholar, Staff Seminar, Portsmouth University UK, Valuing Legal Education: Who's values, How and Why?", "2016", "International Legal Ethics Conference, New York, Legal Ethics in Action: Dispatches from the front lines", "National Symposium On Student Mental Health Wellbeing, Melbourne Law School, Determined to be different", "2015", "QUT Capstone Experience Forum, Mind the Gap Please: Integrating sustainable assessment practices to simulate and develop professional identity and behaviour for practice", "2015 Law and Society Conference, Seattle, The value of self determination:How to put the theory into practice for successful well being and professionalism outcomes", "2014", "American Association of Law Schools Annual Meeting, New York, Balance in Law Section (with Stephen Tang and Gary Tamsitt) 'Integration: Essential for improving professionalism and wellbeing outcomes'", "Global Legal Skills Conference, Verona, Italy \"Online learning that is integrated, simulated, professional, personal and well?\" (with Elizabeth Lee)", "Monash University Law Chambers, Melbourne, Developing Capacity to Cope with Ethical Dilemmas in Legal Practice Through Teaching ‘Giving Voice to Values’ Techniques’ (with Vivien Holmes)", "2013", "National Wellness in Law Forum (with Stephen Tang) 'Surprisingly Well?A peek into the wellbeing/distress data from a survey of Australian PLT students'", "National Wellness in Law Forum (with Stephen Tang, Mollie Townes O'Brien and Vivien Holmes), 'Leave Nothing Behind: Bring your Whole Self to Law School!'", "Association of Legal Teachers (ALT) Conference, Notthingham, UK (with Stephen Tang) 'Preparing students for the reality of practice through Practice Management: Empowering values and relishing uncertainty'", "ALT Conference, Nottingham, UK 'Facebook status update: A case study involving social media in the lecture theatre'", "Association of Law Teachers Australia Conference (with Moira Murray) 'Preparing Students for Legal Practice: How Law Teachers can assist students to develop team work and collaboration skills", "2012", "Association of Legal Teachers Conference, Oxford UK (with Elizabeth Lee) 'On which shore does assessment wash up after a perfect storm? - A case study of the potential in using online simulated group based learning to create sustainable assessment practices'", "International Legal Ethics Conference, Banff Canada (with Gary Tamsitt and Vivien Holmes 'Learning Ethics: Achieving Behavioural change through Simulation'", "APLEC conference in Hobart (with Stephen Tang) ' “Servicing our Clients”: A snapshot of our student group at the beginning of their Practical Legal Training'", "2010", "APLEC (with Elizabeth Lee) “Learning the Skills – One Step at a Time: The benefits and challenges of simulated transactional teaching/learning.”", "2008", "APLEC “How Uniform is Uniform? An examination of the implementation of the uniform trust accounting legislation across five Australian jurisdictions.”"], "publication": [{"title": "Enhancing wellbeing and one", "year": "2015", "source": "s capacity to deal effectively with ethical dilemmas in legal practice'National Wellness for Law Forum, Australian National University, Canberra", "authors": ["Holmes V", "Curran L", "Anneka Ferguson"]}, {"title": "Creating practice ready, well and professional law graduates", "year": "2015", "source": "Journal of learning design, vol. 8, no. 2, pp. 22-U83", "authors": ["Anneka Ferguson"]}, {"title": "The Possibility Of Wellbeing: Preliminary Results From Surveys Of Australian Professional Legal Education Students", "year": "2014", "source": "QUT Law Review, vol. 14, no. 1, pp. 27-51", "authors": ["Tang S", "Anneka Ferguson"]}]}, "Microsoft-Academic": [{"title": "creating practice ready well and professional law graduates", "year": 2017, "source": "journal of learning design", "authors": [{"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2764470444}, {"title": "creating practice ready well and professional law graduates", "year": 2015, "source": "social science research network", "authors": [{"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "the possibility of wellbeing preliminary results from surveys of australian professional legal education students", "year": 2014, "source": "qut law review", "authors": [{"name": "stephen tang", "affiliation": "australian national university"}, {"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2737445289}, {"title": "the possibility of wellbeing preliminary results from surveys of australian professional legal education students", "year": 2014, "source": "social science research network", "authors": [{"name": "stephen tang", "affiliation": "australian national university"}, {"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "the development of the virtual educational space how transactional online teaching can prepare today s law graduates for today s virtual age", "year": 2015, "source": "european journal of law and technology", "authors": [{"name": "elizabeth lee", "affiliation": "australian national university"}, {"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2764792111}, {"title": "the development of the virtual educational space how transactional online teaching can prepare today s law graduates for today s virtual age", "year": 2015, "source": "social science research network", "authors": [{"name": "elizabeth lee", "affiliation": "australian national university"}, {"name": "anneka ferguson", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "desperately seeking relevant assessment a case study on the potential for using online simulated group based learning to create sustainable assessment practices", "year": 2014, "source": "social science research network", "authors": [{"name": "anneka ferguson", "affiliation": "australian national university"}, {"name": "elizabeth lee"}], "id": 2751751161}, {"title": "desperately seeking relevant assessment a case study on the potential for using online simulated group based learning to create sustainable assessment practices", "year": 2012, "source": "legal education review", "authors": [{"name": "anneka ferguson"}, {"name": "elizabeth lee"}], "id": 2764675040}, {"title": "determined to be a professional ethical and well", "year": 2019, "source": "", "authors": [{"name": "anneka ferguson"}, {"name": "stephen tang"}]}, {"title": "democracy sausage with mark kenny the kids are all right", "year": 2019, "source": "", "authors": [{"name": "mark kenny"}, {"name": "mark evans"}, {"name": "anneka ferguson"}, {"name": "brendan mccaffrie"}]}], "ANDS-Grants": []}