{"ANU": {"name": "Apostolos (Lee) Alissandratos", "link": "https://researchers.anu.edu.au/researchers/alissandratos-a", "colleges": "College of Science", "email": "apostolos.alissandratos@anu.edu.au", "phone": "+61 2 6125 3490", "expertise": ["Enzymes", "Biocatalysis And Enzyme Technology", "Bioprocessing Bioproduction And Bioproducts", "Medical Biotechnology Diagnostics Incl. Biosensors", "Agricultural Biotechnology Diagnostics Incl. Biosensors", "Environmental Biotechnology Diagnostics Incl. Biosensors", "Bioremediation", "Industrial Chemistry", "Synthetic Biology", "Catalytic Process Engineering"], "interest": ["The use of Biocatalysis and Synthetic Biology to create real-world solutions for some of the most pressing global issues : Global Health, Biosecurity, Energy security, Sustainable chemical processes."], "biography": "", "project": ["Biocatalysis for sustainable chemical processes", "We are employing Synthetic Biology to develop new Biocatalysis platforms that will allow application of multi-enzymatic cascades as replacements for unsustainable fossil-based processes. This includes engineering of new and improved enzyme activities using renewable substrates (e.g. CO2, ammonia), optimisation of cofactor-dependent biotransformations, and development of new tools for control of multi-enzymatic reactions in vitro (cell-free metabolic engineering) and in whole-cell. Bioproducts targeted range from platform chemicals and fuels to green fertilisers to fine chemicals and biologics (therapeutics).", "", "\"Just-add-water\" nucleic acid amplification", "The use of Synthetic Biology to assemble biological components into customised useful devices is now a reality. We are employing these principles for the delivery of bio-devices that carry out pathogen nucleic acid amplification and formulating these into stable \"just-add-water\" formats to produce novel user-friendly, low-cost diagnostic kits that may be applied within primary laboratory settings and at point-of-care. We aim to deliver real-world solutions that may be utilised in low-tech settings in the developing world and remote Australia.", "", "DNA biosensors", "DNA-based biotechnologies are rapidly forming a new landscape in the world of technology and innovation. However accurate identification of a specific DNA-sequence (e.g. as produced through nucleic acid amplification) still requires high-end equipment and complex protocols. Together with colleagues at the CSIRO (Health & Biosecurity) we are harnessing the power of biological recognition for the production of new biosensors that are able to rapidly identify specific ds-DNA sequences. These allow accurate detection/quantitation of a target DNA sequence and are amenable to application with low-cost analytical technologies in primary laboratories and at point-of-care.", ""], "publication": [{"title": "One-Pot Multienzymatic Transformation of NH3 , CO2 , and Ornithine into the Organic Nitrogen Plant Fertilizer Citrulline Using a Single Recombinant Lysate of E. coli", "year": "2019", "source": "ACS Sustainable Chemistry & Engineering, vol. 7, no. 9, pp. 8522-8529", "authors": ["Apostolos (Lee) Alissandratos", "Hartley C", "French N"]}, {"title": "Recombinant cell-lysate-catalysed synthesis of uridine-5", "year": "2019", "source": "-triphosphate from nucleobase and riboseand without addition of ATP', New Biotechnology, vol. 49, pp. 104-111", "authors": ["Loan T", "Easton C", "Apostolos (Lee) Alissandratos"]}, {"title": "Hyperthermophilic Carbamate Kinase Stability and Anabolic In Vitro Activity at Alkaline pH", "year": "2018", "source": "Applied and Environmental Microbiology, vol. 84, no. 3, pp. 1-13", "authors": ["Hennessy J", "Latter M", "Philbrook A", "Apostolos (Lee) Alissandratos"]}, {"title": "TP Recycling with Cell Lysate for Enzyme-Catalyzed Chemical Synthesis, Protein Expression and PCR", "year": "2016", "source": "ACS Chemical Biology, vol. 11, no. 12, pp. 3289-3293", "authors": ["Apostolos (Lee) Alissandratos", "Caron K", "Loan T"]}, {"title": "Biocatalysis for the application of CO2 as a chemical feedstock", "year": "2015", "source": "Beilstein Journal of Organic Chemistry, vol. 11, pp. 2370-2387", "authors": ["Apostolos (Lee) Alissandratos", "Easton C"]}, {"title": "Formate production through carbon dioxide hydrogenation with recombinant whole cell biocatalysts", "year": "2014", "source": "Bioresource Technology, vol. 164, pp. 7-11", "authors": ["Apostolos (Lee) Alissandratos", "Kim H", "Easton C"]}, {"title": "Clostridium carboxidivorans strain P7T recombinant formate dehydrogenase catalyzes reduction of CO2 to formate", "year": "2013", "source": "Applied and Environmental Microbiology, vol. 79, no. 2, pp. 741-744", "authors": ["Apostolos (Lee) Alissandratos", "Kim H", "Matthews H"]}, {"title": "Biochemical processes for generating fuels and commodity chemicals from lignocellulosic biomass", "year": "2013", "source": "in M. Petre (ed.), Environmental Biotechnology - New Approaches and Prospective Applications, InTech Open Access Publisher, Rijeka, Croatia, pp. 39-64", "authors": ["Philbrook A", "Apostolos (Lee) Alissandratos", "Easton C"]}, {"title": "Formate production through biocatalysis", "year": "2013", "source": "Bioengineered, vol. 4, no. 5, pp. 348-350", "authors": ["Apostolos (Lee) Alissandratos", "Kim H", "Easton C"]}, {"title": "Enzymatic acylation of starch", "year": "2012", "source": "Bioresource Technology, vol. 115, pp. 41-47", "authors": ["Apostolos (Lee) Alissandratos", "Halling P"]}, {"title": "Enzymatic synthesis of butyl hydroxycinnamates and their inhibitory effects on LDL-oxidation", "year": "2008", "source": "Journal of Biotechnology, vol. 133, no. 4, pp. 497-504", "authors": ["Vafiadi C", "Topakas E", "Apostolos (Lee) Alissandratos"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}