{"ANU": {"name": "April Biccum", "link": "https://researchers.anu.edu.au/researchers/biccum-ar", "colleges": "College of Arts and Social Sciences", "email": "april.biccum@anu.edu.au", "phone": "", "expertise": ["Communication Studies", "International And Development Communication", "International Relations", "Specialist Studies In Education", "Other Language Communication And Culture", "Citizenship"], "interest": ["April’s research is framed by the Global Politics of Knowledge and Communication with a combined focus on how the categories Empire/Imperialism and Global Citizenship are used, theorised and understood in both the public and scholarly domain. Work on Empire/Imperialism combines a conceptual history in the public domain with a theoretical mapping in the social sciences, with a focus on what changes in our epistemology, methodology, disciplinary framing and understanding of the international system if we take Empire/Imperialism as our category of analysis above state, system or capital. Work on Global Citizenship has a combined theoretical and empirical focus examining both how Global Citizenship has been theorised by scholarship in the Social Sciences and how the concept has been operationalised through Global Education Governance and a variety of elite actors in the international domain. Both projects have wider interdisciplinary implications for International Relations, Political Communication, International Political Sociology, studies of Political Mobilisation through Social Movements and Global Civil Society, and critical perspectives on citizenship, development, global governance and the knowledge economy. April explicitly tries to situate her work in an interdisciplinary frame.Methodologically April is co-convenor of the Interpretation Method Critique Research Cluster at the Australian National University which has the aim of raising the profile of Interpretivist and Critical methodologies in the social sciences with a specific focus on the politics of knowledge production and undergraduate and graduate student capacity building in this area. April is currently accepting supervision of HDR or Honours projects in teh areas of political mobilisation, communication, Global Citizenship, Global Education Governance, any aspect of empire or imperialism."], "biography": "April Biccum, Canadian born, received an MA in Critical theory and Ph.D. in Politics and International Relations from Nottingham University.", "project": ["Global Citizenship Education and the global politics of Truth and Knowledge.  Includes Global Education Governance, the Knowledge Economy, social capital, state society relations, Global Civil Society and the local politics of inclusion and exclusion.", "A conceptual history of the words 'empire' and 'imperialism' and a mapping of approaches to theorising empire in teh social sciences in the context of the American Empire Debate of the early 20th Century."], "publication": [{"title": "What is an Empire? Assessing the postcolonial contribution to the American Empire Debate", "year": "2018", "source": "Interventions, vol. 20, no. 5, pp. 697-716pp", "authors": ["April Biccum"]}, {"title": "What Can Counterterrorism Learn from Cognitive Justice in Global Citizenship Education?", "year": "2018", "source": "International Political Sociology, vol. 12, no. 4, pp. 382-400", "authors": ["April Biccum"]}, {"title": "Global Citizenship and the Politics of Knowledge: What do you need to know to live in the world?", "year": "2018", "source": "in Takahiro Nakajima, Paul Pickering, Xudong Zhang (ed.), Papers from the 2018 PKU-ANU-UTokyo Winter Institute, The University of Tokyo Centre for Philosophy, Tokyo, pp. 51-68", "authors": ["April Biccum"]}, {"title": "What might celebrity humanitarianism have to do with empire?", "year": "2016", "source": "Third World Quarterly, vol. 37, no. 6, pp. 998-1015", "authors": ["April Biccum"]}, {"title": "new development paradigm or business as usual? Exploring the relationship between the political subject and social change", "year": "2016", "source": "in Amy Skinner, Matt Baillie Smith, Eleanor Brown, Tobias Troll (ed.), Education, Learning and the Transformation of Development, Routledge Taylor & Francis Group, Abingdon and New York, pp. 3-18", "authors": ["April Biccum"]}, {"title": "The politics of education for globalisation: managed activism in a time of crisis", "year": "2015", "source": "Australian Journal of International Affairs, vol. 69, no. 3, pp. 321-338", "authors": ["April Biccum"]}, {"title": "Memorializing Empire, Producing Global Citizens The British Bicentenary of the Abolition of the Transatlantic Slave Trade (2007)", "year": "2013", "source": "Interventions, vol. 16, no. 2, pp. 215-232", "authors": ["April Biccum"]}, {"title": "Review,", "year": "2013", "source": "Postcolonial Theory and International Relations: a Critical Introduction'e-International Relations, vol. February 2013", "authors": ["April Biccum"]}, {"title": "Celebrity activists and advocates in development", "year": "2011", "source": "Global Studies Review, vol. 7, no. 3, p. 6", "authors": ["April Biccum"]}, {"title": "Marketing Development: celebrity politics and the", "year": "2011", "source": "new' development advocacy'Third World Quarterly, vol. 32, no. 7, pp. 1331-1346", "authors": ["April Biccum"]}, {"title": "Global Citizenship and the Legacy of Empire: Marketing Development", "year": "2010", "source": "RoutledgeTaylor & Francis Group, New York", "authors": ["April Biccum"]}, {"title": "Theorising Continuities between Empire & Development; toward a new theory of History", "year": "2009", "source": "in Mark Duffield and Vernon Hewitt (ed.), Empire, Development & Colonialism; the Past in the Present, James Currey_Boydell & Brewer, Woodbridge, UK and Rochester, NY, USA, pp. 146-160", "authors": ["April Biccum"]}]}, "Microsoft-Academic": [{"title": "marketing development live 8 and the production of the global citizen", "year": 2007, "source": "development and change", "authors": [{"name": "april biccum", "affiliation": "lancaster university"}], "id": 137192870}, {"title": "global citizenship and neo republicanism", "year": 2020, "source": "", "authors": [{"name": "april biccum"}]}, {"title": "book review postcolonial theory and international relations a critical introduction", "year": 2013, "source": "", "authors": [{"name": "april biccum"}]}, {"title": "authorized versions of otherness creating imperial subjects abroad", "year": 2012, "source": "", "authors": [{"name": "april biccum"}]}, {"title": "third cinema in the first world eve s bayou and daughters of the dust", "year": 1999, "source": "", "authors": [{"name": "april biccum"}]}], "ANDS-Grants": []}