{"ANU": {"name": "Ashley Carruthers", "link": "https://researchers.anu.edu.au/researchers/carruthers-a", "colleges": "College of Arts and Social Sciences", "email": "ashley.carruthers@anu.edu.au", "phone": "", "expertise": ["Consumption And Everyday Life", "Migration", "Asian Cultural Studies", "Social And Cultural Anthropology"], "interest": ["Migration, mobilities, networks and infrastructures, farming, organic agriculture, bicycles, Vietnam"], "biography": "", "project": ["", "", "Organic farming is our political duty!", "The establishment of the organic farming co-operatives of Thanh Dong (Hoi An) and Kim Long (Hue) is a complex and fascinating story involving a whole cast of actors: NGO Action for the City (ACCD), local People's Committees, City level government, foreign experts, student volunteers (including ANU students on the Vietnam Field School) and most importantly, the farmers themselves. While this drama is ongoing, to date it has been a hopeful one in which people living in precarity in periurban areas threatened by the expropriation of farming land, loss of rural livelihoods and the destruction of environments have, in an apparently impossible situation, succeeded in building new collectives that have enabled them to reconfigure a set of entrenched problems around the survival of smallholder farming in Vietnam.  These assemblages involve reconfigured relationships with their immediate neighbours to create a renewed sense of local community, but also with the previously disconnected middle class urbanites and urban institutions (such as schools and universities) who are now their customers and collaborators. These new social ties do not stand alone, but rather are nodes in a complex new network involving an equally rich cast of non-human actors: land, organic produce, animals, waste, new infrastructures and technologies such as greenhouses, composting structures and misting irrigation systems, networks of communications, marketing, distribution, certification, and on and on. These new farming assemblages in turn act upon a rich series of ongoing \"controversies\": over food safety, chemical agriculture, land tenure, urbanisation and the status of rural people in a rapidly modernising society.", "", "", "", "Taking the Road for Play: Cyclist Appropriations of Automobile Infrastructures in Vietnam", "After declining in status and mode share sharply with the popularization of the motorcycle, cycling in Vietnam is on the rise. Urban elites who pursue sport and leisure cycling are the most visible of Vietnam’s new cyclists, and they bring their sense of social mastery out onto the road with them by appropriating the nation’s new, automobile-focused infrastructures as places for play and display. While motivated by self-interest, their informal activism around securing bicycle access to new bridges and highways potentially benefits all and contributes to making livable cities. These socially elite cyclists transcend the status associated with their means of mobility as they enact their mastery overautomobile infrastructures meant to usher in a new Vietnamese automobility.", "Check out the article here: https://www.berghahnjournals.com/view/journals/transfers/8/3/trans080302.xml"], "publication": [{"title": "On the Myth of", "year": "2018", "source": "Uncivilised' Rural People in the City'in Catherine Earl (ed.), Mythbusting Vietnam, NIAS Press, 2018, pp. 163-182", "authors": ["Ashley Carruthers"]}, {"title": "Taking the Road for Play: Cyclist Appropriations of Automobile Infrastructures in Vietnam", "year": "2018", "source": "Transfers: interdisciplinary journal of mobility studies, vol. 8, no. 3, pp. 1-27pp", "authors": ["Ashley Carruthers"]}, {"title": "Cars", "year": "2017", "source": "bicycles and the fatal myth of equal reciprocitypp. 1-4pp", "authors": ["Ashley Carruthers"]}, {"title": "Book review: Vietnam", "year": "2017", "source": "s Socialist Servants: DomesticityClass, Gender and Identity', The Asia Pacific Journal of Anthropology, vol. 18, no. 3, pp. 268 - 270pp.", "authors": ["Ashley Carruthers"]}, {"title": "Vietnam", "year": "2016", "source": "s New Cyclists'in P Q Minh, N V Suu, I Ang & G Hawkins (ed.), Globalization, Modernity and Urban Change in Asian Cities, Knowledge Publishing House, Hanoi, Vietnam, pp. 213-232", "authors": ["Ashley Carruthers"]}, {"title": "National Multiculturalism, Transnational Identities", "year": "2013", "source": "Journal of Intercultural Studies, vol. 34, no. 2, pp. 214-228", "authors": ["Ashley Carruthers"]}, {"title": "Introduction: Risk, Opportunity and Resilience: Contemporary Vietnamese Mobilities", "year": "2012", "source": "Journal of Vietnamese Studies, vol. 7, no. 4, pp. 1-9", "authors": ["Ashley Carruthers"]}, {"title": "The Socio-Spatial Constellation of a Central Vietnamese Village and its Emigrants", "year": "2012", "source": "Journal of Vietnamese Studies, vol. 7, no. 4, pp. 122-153", "authors": ["Ashley Carruthers", "Dang T"]}, {"title": "Indochine chic: Why is Vietnamese food so classy in Singapore?", "year": "2012", "source": "Anthropology Today, vol. 28, no. 2, pp. 17-20", "authors": ["Ashley Carruthers"]}, {"title": "lternative multicultural subjectivities? Indochinese cosmopolitanisms in Western Sydney", "year": "2011", "source": "in Keith Jacobs and Jeff Malpas (ed.), Ocean to Outback: Cosmopolitanism in Contemporary Australia, University of Western Australia Press, Crawley Australia, pp. 176-205", "authors": ["Ashley Carruthers"]}, {"title": "Dark Tourism, Diasporic Memory and Disappeared History: The contested meaning of the former Indochinese Refugee Camp at Pulau Galang", "year": "2011", "source": "in Yuk Wah Chan (ed.), The Chinese/Vietnamese Diaspora: Revisiting the Boat People, Routledge, Taylor & Francis Group, Oxon, UK, pp. 147-160", "authors": ["Ashley Carruthers", "Huynh-Beattie B"]}, {"title": "The Lao in Sydney", "year": "2010", "source": "Sydney Journal, vol. 2, no. 2, p. 6", "authors": ["Ashley Carruthers", "Meuansanith P"]}, {"title": "Lao Australians on Sydney", "year": "2010", "source": "s Urban Fringe: A Non-Cosmopolitan Transnationalism?'Amerasia Journal, vol. 36, no. 2, pp. 1-16", "authors": ["Ashley Carruthers"]}, {"title": "The Cambodians in Sydney", "year": "2009", "source": "Sydney Journal, vol. 2, no. 1, pp. 62-67", "authors": ["Ashley Carruthers", "Tuy S"]}, {"title": "The Trauma of Synchronisation: The Temporal Location of the Homeland in the Vietnamese Diaspora", "year": "2008", "source": "Crossroads: An Interdisciplinary Journal of Southeast Asian Studies, vol. 19, no. 2, pp. 63-92", "authors": ["Ashley Carruthers"]}, {"title": "The Vietnamese in Sydney", "year": "2008", "source": "Sydney Journal, vol. 1, no. 3, pp. 102-109", "authors": ["Ashley Carruthers"]}, {"title": "Cambodians", "year": "2008", "source": "in   (ed.), The Dictionary of Sydney, Dictionary of Sydney, Sydney, pp. 4pp", "authors": ["Ashley Carruthers", "Tuy S"]}, {"title": "Saigon from the diaspora", "year": "2008", "source": "Singapore Journal of Tropical Geography, vol. 29, pp. 68-86", "authors": ["Ashley Carruthers"]}, {"title": "Vietnamese Language and Media Policy in the Service of Deterritorialized Nation-Building", "year": "2007", "source": "in Lee Hock Guan and Leo Suryadinata (ed.), Language, Nation and Development in Southeast Asia, Institute of Southeast Asian Studies (ISEAS), Singapore, pp. 195-216", "authors": ["Ashley Carruthers"]}, {"title": "National Identity, Diasporic Anxiety, and Music Video Culture in Vietnam", "year": "2007", "source": "Journal BOL Vietnam and US, vol. winter, pp. 86-114", "authors": ["Ashley Carruthers"]}, {"title": "Book review: The Hmong of Australia: Culture and Diaspora", "year": "2006", "source": "The Asia Pacific Journal of Anthropology, vol. 7, no. 1, pp. 110-112", "authors": ["Ashley Carruthers"]}, {"title": "John Clammer (2002) Diaspora and Identity: The Sociology of Culture in Southeast Asia, Selangor Darul Ehsan: Pelanduk Publications", "year": "2004", "source": "Singapore Journal of Tropical Geography, vol. 25, no. 2, pp. 241-243", "authors": ["Ashley Carruthers"]}, {"title": "Cute Logics of the Multicultural and the Consumption of the Vietnamese Exotic in Japan", "year": "2004", "source": "Positions: East Asia Cultures Critique, vol. 12, no. 2, pp. 401-429", "authors": ["Ashley Carruthers"]}, {"title": "The Accumulation of National Belonging in Transnational Fields: Ways of Being at Home in Vietnam", "year": "2002", "source": "Identities: Global Studies in Culture and Power, vol. 9, no. 4, pp. 423-444", "authors": ["Ashley Carruthers"]}, {"title": "National Identity, Diasporic Anxiety and Music Video Culture in Vietnam", "year": "2001", "source": "in Yao Souchou (ed.), House of glass: culture, modernity, and the state in Southeast Asia, White Lotus Press, Thailand, pp. 119-149", "authors": ["Ashley Carruthers"]}]}, "Microsoft-Academic": [{"title": "the accumulation of national belonging in transnational fields ways of being at home in vietnam", "year": 2002, "source": "identities global studies in culture and power", "authors": [{"name": "ashley carruthers", "affiliation": "national university of singapore"}], "id": 128487343}, {"title": "saigon from the diaspora", "year": 2008, "source": "singapore journal of tropical geography", "authors": [{"name": "ashley carruthers", "affiliation": "australian national university"}], "id": 72893657}, {"title": "national multiculturalism transnational identities", "year": 2013, "source": "journal of intercultural studies", "authors": [{"name": "ashley carruthers"}], "id": 161901644}, {"title": "cute logics of the multicultural and the consumption of the vietnamese exotic in japan", "year": 2004, "source": "positions east asia cultures critique", "authors": [{"name": "ashley carruthers"}], "id": 183866676}, {"title": "mekong dreaming life and death along a changing river andrew alan johnson durham duke university press 2020", "year": 2021, "source": "asia pacific journal of anthropology", "authors": [{"name": "ashley carruthers", "affiliation": "australian national university"}], "id": 191816521}, {"title": "dark tourism diasporic memory and disappeared history the contested meaning of the former indochinese refugee camp at pulau galang", "year": 2011, "source": "", "authors": [{"name": "ashley carruthers", "affiliation": "city university of hong kong"}, {"name": "boitran huynhbeattie"}]}, {"title": "taking the road for play cyclist appropriations of automobile infrastructures in vietnam", "year": 2018, "source": "", "authors": [{"name": "ashley carruthers", "affiliation": "australian national university"}]}, {"title": "suburbanasia ways of reading cultural difference in the mainstream australian media", "year": 1995, "source": "media international australia", "authors": [{"name": "ashley carruthers"}], "id": 7997079}, {"title": "vietnam s socialist servants domesticity class gender and identity", "year": 2017, "source": "asia pacific journal of anthropology", "authors": [{"name": "ashley carruthers", "affiliation": "australian national university"}], "id": 191816521}, {"title": "kung fu fighting the cultural pedagogy of the body in the vovinam overseas vietnamese martial arts school", "year": 1998, "source": "the australian journal of anthropology", "authors": [{"name": "ashley carruthers"}], "id": 202606351}], "ANDS-Grants": []}