{"ANU": {"name": "Ashley Jameson Eriksmoen", "link": "https://researchers.anu.edu.au/researchers/eriksmoen-aj", "colleges": "College of Arts and Social Sciences", "email": "ashley.eriksmoen@anu.edu.au", "phone": "", "expertise": ["Visual Arts And Crafts", "Other Built Environment And Design"], "interest": ["Critical design; environmental ethics; consumerism/waste/environment/natural resources, and sustainability addressed through the practice of craft; furniture design and construction; applications and appropriations of woodworking technologies (hand, conventional, digital);  gesture and sentient connection conveyed by inanimate objects.For two decades, my practice has been centred on the gaps, tensions, and overlaps between manmade and natural environments, the domains of that which was built versus that which has grown. My conceptual concerns arise from existential questions regarding humans’ capacity and need to feel connected to their environments, be it their living room or their planet. American novelist Toni Morrison once posed the question, \"How do we meet the world and connect to our personal spaces?\" And I would add, “How do we take care of each other and the world if we don’t first feel connected?”My work looks at the connection between people and the world mediated through relationships to objects, and how objects can bridge the divide; I combine and re-present familiar objects and creatures to make those links. Many of my works utilize devices such as slight asymmetry and visual tension to imply animate posture and gesture in furniture forms. My work also addresses issues of sustainability, natural resources, consumerism, and waste, and most recently the inherent violence that arises from delineation and desensitization regarding the world and others. Of late, my material and process choices have further referenced the embedded life-cycles of objects, appropriating found shapes of salvaged furniture to return discarded artefacts of consumerism to a neo-natural state. I am interested in re-wilding the modernist interior, challenging Cartesian notions of order, utility, and the planned universe. My current individual projects and collaborations address issues of maintaining forests, reclaimed and salvaged timber, utilising urban timber, and habitat reduction and loss from both conceptual and practical points of view."], "biography": "Ashley Jameson Eriksmoen was born and raised in Southern California. Her undergraduate studies cumulated in a Bachelors of Science degree in Geology, and several years as a practising engineering geologist followed. Moving from rocks to timber, she studied fine woodworking at the College of the Redwoods before earning her M.F.A. in Furniture Design at Rhode Island School of Design. In 2006, she received the Norwegian Marshall Fund Grant to research traditional woodworking methods in Norway. Eriksmoen has taught design/woodworking at California College of the Arts, College of the Redwoods, Oregon College of Art & Craft, Anderson Ranch Arts Center, and Penland School of Craft. From 2002 until 2011, she designed and built sculptural furniture in her studio in Oakland, California. In 2012, Eriksmoen moved to Canberra, Australia to be Head of Furniture at the Australian National University School of Art & Design, where she continues her teaching, Practice-led Research, and exhibiting internationally.", "project": ["Urban Timber Rescue Project", "Together with Fenner Assoc Prof Cris Brack, Eriksmoen co-hosted a two-day synthesis workshop, \"Life and Death in a City of Trees\" in September 2019. The workshop brought together over 50 participants from North America, Asia, and Australia to engage in collaborative discussion aimed at developing innovative approaches to better utilisation of the timber from street tree removals, particularly in the ACT.", "The workshop brought together a wide range of stakeholders, including ACT Ministers, ACT local government treescapes and resource managers, foresters, sawyers, woodworkers, school teachers, researchers in forestry, habitat, art, and architecture, activists and conservationists, and cultural prescinct managers. The robust discussion across the two day event revealed many perspecitves to be considered in approaching this complex, multi-layered concern that crosses many sectors and disciplines.", "Eriksmoen and Brack are currently developing industry, government, and cross-institutional partnerships to develop the project further with external funding.", "Nature><Culture Research Group", "In early 2017, ANU School of Art & Design researchers Eriksmoen and Dr Raquel Ormella co-founded the Nature><Culture Research Group.", "The Nature><Culture Research Group of the School of Art & Design is a forum for researchers whose creative practices address the interactions, relationships, and shared or contested territories between humans and other animals, life and non-life. The Nature><Culture Research Group aims to expand and promote our research capacity in this interdisciplinary area by encouraging the exchange of ideas, fostering collaborations, pursuing opportunities for research funding and publishing. We enrich teaching and learning by sharing these activities and outcomes with the student cohort. The group seeks engagement and impact beyond the university by fostering interdisciplinary research partnerships across ANU and with government, industry and community groups.", "The research group fosters an interdisciplinary discourse addressing themes including: habitat architecture; animal-human relationships; shared and contested spaces; urban treescapes and birdscapes; the emergent field of Animal Studies; and the myriad ecological impacts of the Anthropocene.", "The cluster has hosted a number of international and Australian visiting artists, architects, writers, and curators to contribute to events and explore collaborations with ANU researchers. In 2017, Eriksmoen and Ormella co-organised and curated the exhibition Animistructions at the Tuggeranong Art Centre, bringing together works of staff, current undergraduate and research students, and alumni to demonstrate the broad range of materials and approaches in art, craft, and design underpinned by the relationship between humans and non-human animals. https://www.tuggeranongarts.com/events/animastructions-story-behind-exhibition/", "In 2019, Eriksmoen and Ormella co-organised a 2-day symposium, To see ourselves as part of something larger. https://soad.cass.anu.edu.au/events/symposium-see-ourselves-part-something-larger-0 The symposium brought together local, Australian, and international scientists, architects, historians and artists to consider how we might understand our place within complex ecosystems, be these nature reserves or the streets where we live. The symposium centred on the ways that visual arts and design can build meaningful recognition of Aboriginal sovereignty; compassion for the more-than-human world; and strengthen our connections to country. The symposium was in conjunction with the exhibition opening of I thought I heard a bird at Craft ACT. The show was co-organised by Eriksmoen and Ormella, and curated by Ormella.", "The works in I thought I heard a bird consider what it is to represent without picturing landscape where birds are present or absent. both to focus on the histories birds signify, and what it is to consider the bird as a marker for a landscape and environment. The included works address the theme both conceptually and practically, ranging from paintings to models of realised public works of habitat architecture. I thought I heard a bird continues to evolve, with additional artists and architects and new works being added for a second iteration of the exhibit scheduled for October 2020 in Hobart, Tasmania."], "publication": [{"title": "", "year": "2019", "source": "Edge Conditions 1", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "Interpretations Pending Center for Art in Wood (2017)", "year": "2017", "source": "", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "Hold Everything: central theme of the", "year": "2017", "source": "vessel' provides a trans-disciplinary conceptual context and an interdisciplinary approach across contemporary craft studios'ACUADS 2017, Australian Council of University Art & Design Schools, Online, p. 18", "authors": ["Ashley Jameson Eriksmoen", "Rubenis N"]}, {"title": "Center for Art in Wood 2016", "year": "2016", "source": "", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2016", "source": "For Whom the Bell Tolls", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2016", "source": "Saudade", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2016", "source": "Bang! Bang!", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2016", "source": "Ikebana Tansu", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2016", "source": "Ripple", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2015", "source": "Feral: Rewilding Furniture", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2015", "source": "Theory of Everything", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "Your Personal Hang-ups", "year": "2015", "source": "in   (ed.), Your Personal Hang-ups, Schiffer, United States, pp. 34-35", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2013", "source": "So Goes A Whittle", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2013", "source": "Reforestation: How to Make a Tree from a Chair CMAG (2013)", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2013", "source": "Circuit", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2012", "source": "Little Bugs", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2009", "source": "Sway", "authors": ["Ashley Jameson Eriksmoen"]}, {"title": "", "year": "2008", "source": "Lift", "authors": ["Ashley Jameson Eriksmoen"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}