{"ANU": {"name": "Avery Andrews", "link": "https://researchers.anu.edu.au/researchers/andrews-ad", "colleges": "College of Arts and Social Sciences", "email": "Avery.Andrews@anu.edu.au", "phone": "", "expertise": ["Linguistic Structures Incl. Grammar Phonology Lexicon Semantics"], "interest": ["Syntactic Theory, including descriptive and typological aspects.  Mostly in the framework of Lexical-Functional Grammar, but with an eye to making this more compatable with Chomsky's 'Minimalist Program'.Syntax-Semantics Interface (Glue semantics).Natural Semantic Metalanguage, from the standpoint of connecting it better to formal syntax and semantics."], "biography": "Dr Avery Andrews was a Senior Lecturer in the Linguistics Program, School of Language Studies, Faculty of Arts, now retired but still doing research He is well known for his work on syntactic and morphological theory.", "project": [], "publication": [{"title": "On Defining Parts of Speech with Generative Grammar and NSM", "year": "2020", "source": "in Helen  Bromhead, Zhengdao Ye (ed.), Meaning, Life and Culture, ANU Press, Canberra, Australia, pp. 333-354", "authors": ["Avery Andrews"]}, {"title": "One-level Analysis of Icelandic Quirky Case", "year": "2019", "source": "24th International LFG Conference, LFG2019, ed. M Butt, T H King & I Toivonen, CSLI Publications, Stanford, CA, pp. 27-47", "authors": ["Avery Andrews"]}, {"title": "Sets, heads, and spreading in LFG", "year": "2018", "source": "Journal of Language Modelling, vol. 6, no. 1, pp. 131-174", "authors": ["Avery Andrews"]}, {"title": "Case: Oblique, Inherent, Semantic, Quirky", "year": "2017", "source": "in Martin Everaert and Henk C. van Riemsdijk (ed.), The Wiley Blackwell Companion to Syntax, Wiley Blackwell, United States, pp. 552-587", "authors": ["Avery Andrews"]}, {"title": "Reconciling NSM and Formal Semantics", "year": "2016", "source": "Australian Journal of Linguistics, vol. 36, no. 1, pp. 79-111", "authors": ["Avery Andrews"]}, {"title": "UG and variation in expression", "year": "2012", "source": "in Cathryn Donohue, Shunichi Ishihara and William Steed (ed.), Quantitative approaches to problems in linguistics: Studies in honour of Phil Rose, Lincom Europa, Munich, Germany, pp. 223-240", "authors": ["Avery Andrews"]}, {"title": "Propositional glue and the projection architecture of LFG", "year": "2010", "source": "Linguistics and Philosophy: a journal of natural language syntax, semantics, logic, pragmatics, and processing, vol. 33, no. 3, pp. 141-170", "authors": ["Avery Andrews"]}, {"title": "Grammatical", "year": "2010", "source": "vs. Lexical' Meaning Constructors for Glue Semantics'Conference of the Australian Linguistic Society 2009, ed. Yvonne Treis and Rik De Busser, Australian Linguistics Society, Melbourne Australia, p. 34", "authors": ["Avery Andrews"]}, {"title": "linguistic and computational morphosyntactic analysis for the applicative -I in Indonesian", "year": "2009", "source": "International Lexical Functional Grammar Conference (LFG 2009), ed. Miriam Butt, Tracy Holloway King, CSLI Publications, United States, pp. 85-105", "authors": ["Arka I Wayan Dalrymple M", "Mistica M", "Avery Andrews"]}, {"title": "Double Double, Morphology and Trouble: Looking into Reduplication in Indonesian", "year": "2009", "source": "Australasian Language Technology Association Workshop (ALTA 2009), ed. Luiz Pizzato and Rolf Schwitter, Australasian Language Technology Association, Sydney, pp. 44-52", "authors": ["Mistica M", "Avery Andrews", "Arka I W"]}, {"title": "Splitting vs. lumping in morphological analysis: evidence from Greek", "year": "2008", "source": "in Claire Bowern, Bethwyn Evans & Luisa Miceli (ed.), Morphology and Language History: In honour of Harold Koch, John Benjamins Publishing Company, Amsterdam, The Netherlands, pp. 91-97", "authors": ["Avery Andrews"]}, {"title": "The Role of PRED in LFG+Glue", "year": "2008", "source": "International Lexical-Functional Grammar Annual Conference (LFG 2008), ed. Kirsti Borjars and Martin Forst, CSLI Publications, Stanford, USA, pp. 46-67", "authors": ["Avery Andrews"]}, {"title": "Input and Glue in OT-LFG", "year": "2007", "source": "in Annie Zaenen, Jane Simpson, Tracy Holloway King, Jane Grimshaw, Joan Maling (ed.), Architectures, Rules, and Preferences; variations on themes by Joan W. Bresnan, CSLI Publications, USA, pp. 319-340", "authors": ["Avery Andrews"]}, {"title": "The major functions of the noun phrase", "year": "2007", "source": "in Timothy Shopen (ed.), Language Typology and Syntactic Description: Clause Structure (2nd ed), Cambridge University Press, Cambridge, United Kingdom, pp. 132-223", "authors": ["Avery Andrews"]}, {"title": "Relative Clauses", "year": "2007", "source": "in Timothy Shopen (ed.), Language Typology and Syntactic Description - Complex Constructions (2nd ed), Cambridge University Press, New York, USA, pp. 206-236", "authors": ["Avery Andrews"]}, {"title": "Semantic Composition for NSM, Using LFG+Glue", "year": "2006", "source": "Conference of the Australian Linguistic Society 2005, ed. Keith Allan, Australian Linguistics Society, online, pp. 1-22", "authors": ["Avery Andrews"]}, {"title": "Homeric Recitation, with Input from Phonology and Philology", "year": "2005", "source": "Antichthon, vol. 39, pp. 1-28", "authors": ["Avery Andrews"]}, {"title": "Glue logic vs. Spreading Architecture in LFG", "year": "2004", "source": "Conference of the Australian Linguistics Society 2003, ed. Christo Moskovsky, Australian Linguistics Society, University of Newcastle, p. 16", "authors": ["Avery Andrews"]}, {"title": "Non-canonical A/S Marking in icelandic", "year": "2001", "source": "in Noonan, Michael (ed.), Non-Canonical Marking of Subjects and Objects, John Benjamins Publishing Company, Amsterdam, pp. 85-111", "authors": ["Avery Andrews"]}, {"title": "Relative Clauses", "year": "2001", "source": "in Neil J Smelser, Paul B Baltes (ed.), International Encyclopedia of the Social and Behavioral Sciences (2001), Elsevier, Oxford, UK, pp. 10pp", "authors": ["Avery Andrews"]}, {"title": "Complex Predicates and Information Spreading in LFG", "year": "1999", "source": "CSLI PublicationsStanford USA", "authors": ["Avery Andrews", "Manning C"]}]}, "Microsoft-Academic": [{"title": "authority and the commune parma 833 1133", "year": 1975, "source": "the american historical review", "authors": [{"name": "avery andrews"}, {"name": "reinhold schumann"}], "id": 197437610}, {"title": "charles trinkaus in our image and likeness humanity and divinity in italian humanist thought in two volumes chicago university of chicago press 1970 pp xxvii 457 viii 461 985 22 50 the set", "year": 1971, "source": "the american historical review", "authors": [{"name": "avery andrews", "affiliation": "george washington university"}], "id": 197437610}, {"title": "notariato medievale bolognese volume 2 atti di un convegno febbraio 1976", "year": 1979, "source": "the american historical review", "authors": [{"name": "avery andrews"}], "id": 197437610}, {"title": "les ecrivains et le pouvoir en italie a l epoque de la renaissance l arioste bernardo dovizi da bibbiena machiavel l academie florentine giambattista giraldi cinthio", "year": 1976, "source": "the american historical review", "authors": [{"name": "avery andrews"}, {"name": "andre rochon"}], "id": 197437610}, {"title": "the lost fifth book of the life of pope paul ii by gaspar of verona", "year": 1970, "source": "studies in the renaissance", "authors": [{"name": "avery andrews"}], "id": 2764811799}], "ANDS-Grants": []}