{"ANU": {"name": "Bert Fraussen", "link": "https://researchers.anu.edu.au/researchers/fraussen-b", "colleges": "College of Arts and Social Sciences", "email": "", "phone": "+61 2 6125 5492", "expertise": ["Public Policy", "Public Administration", "Organisation And Management Theory"], "interest": ["Interest Group Politics; Policy Advisory Systems; Organization Design and Development; European Union Politics"], "biography": "I am a Visiting Research Fellow at the Antwerp Centre for Institutions and Multilevel Politics (https://www.uantwerpen.be/en/rg/acim/) and a member of the ECPR Standing Group on Interest Groups (http://www.ecpr-sgig.eu/), the Comparative Interest Group Populations Network (http://www.interest-groups.org/) and the Belgian Political Science Association. Furthermore, I hold degrees in Global Management (Antwerp Management School), Public Administration (KU Leuven) and Political Science (University of Antwerp). From 2006 until 2008, I also worked part-time as an assistant to a Member of the European Parliament, as well as at Europe Direct.", "project": ["“Public Policy and the Transformation of Political Advocacy” (in collaboration with Professor Darren R. Halpin). For more information, visit our project website: http://interestgroupsaustralia.com/.", "“A Revolving Door? Examining the Professional Background of Political Elites in Australia\"", "PUBLICATIONS", "Articles in Peer-Reviewed Journals", "Halpin, D., Fraussen, B. and Nownes, A.J. 2017. The balancing act of establishing a policy agenda: Conceptualizing and measuring drivers of issue prioritization within interest groups. Governance.doi: 10.1111/gove.12284. http://onlinelibrary.wiley.com/doi/10.1111/gove.12284/full", "Halpin, D. and Fraussen, B. 2017. Conceptualising the Policy Engagement of Interest Groups: Involvement, Access and Prominence European Journal of Political Research. doi: 10.1111/1475-6765.12194. http://onlinelibrary.wiley.com/doi/10.1111/1475-6765.12194/abstract", "Fraussen, B. and Halpin, D. 2016. \"Political Parties and Interest Organizations at the Crossroads: Perspectives on the Transformation of Political Organizations.\" Political Studies Review. doi: 10.1177/1478929916644868. http://psw.sagepub.com/content/early/2016/06/10/1478929916644868.abstract", "Fraussen, B. and Halpin, D. 2016. \"Think Tanks and Strategic  Policymaking: The Contribution of Think Tanks to Policy Advisory  Systems.\" Policy Sciences. doi: 10.1007/s11077-016-9246-0. http://link.springer.com/article/10.1007%2Fs11077-016-9246-0", "Fraussen, B. and Halpin, D. 2016. \"Assessing the Composition and Diversity of the Australian Interest Group System.\" Australian Journal of Public Administration. doi: 10.1111/1467-8500.12188. http://onlinelibrary.wiley.com/doi/10.1111/1467-8500.12188/abstract", "Fraussen, B. and Wouters, R. 2015. \"Aandacht trekken of advies verstrekken? De aanwezigheid van middenveldorganisaties in adviesraad- en beeldbuispolitiek.\" Res Publica 57(2):159-183.", "Fraussen, B., and Beyers, J. 2015. \"Who's in and who's out? Explaining access to policy-makers in Belgium\". Acta Politica, doi: 10.1057/ap.2015.9. http://www.palgrave-journals.com/ap/journal/vaop/ncurrent/abs/ap20159a.html", "Beyers, J., T. Donas, and B. Fraussen. 2015. \"No Place Like Home?  Explaining Venue Selection of Regional Offices in Brussels\". Journal of European Public Policy 22(5): 589-608. http://www.tandfonline.com/doi/full/10.1080/13501763.2014.977335", "Fraussen, B. 2014. \"The Visible Hand of the State: On the Organizational Development of Interest Groups.\" Public Administration 92(2):406-21. http://onlinelibrary.wiley.com/doi/10.1111/padm.12056/abstract", "Fraussen, B., J. Beyers, and T. Donas. 2014. \"The Expanding Core and  Varying Degrees of Insiderness: Institutionalized Interest Group  Involvement Through Advisory Councils.\" Political Studies. doi: 10.1111/1467-9248.12112. http://onlinelibrary.wiley.com/doi/10.1111/1467-9248.12112/abstract", "Donas, T., B. Fraussen, and J. Beyers 2014. \"It's not all about the  money: Explaining varying policy portfolios of regional representations  in Brussels. \" Interest Groups and Advocacy, 3(1): 79-98. http://www.palgrave-journals.com/iga/journal/v3/n1/abs/iga201315a.html", "Fraussen, B. 2012. \"Interest Group Politics: Continuity and Change.\" Journal of European Integration 34(5):523-29. http://www.tandfonline.com/doi/abs/10.108 /07036337.2012.690236?journalCode=geui20#.VESmnck4Jq5", "", "Chapters in Edited Books", "Daugbjerg, K, Fraussen, B., and Halpin, D. (forthcoming). Interest Groups and Policy Capacity: Resources, Networks and Time. In Xun, W., Howlett, M. and Ramesh, M. (Eds.), Policy Capacity: State and Societal Perspectives. Palgrave Macmillan.", "Fraussen; B., Bossens N., Keating M. and Wilson, A. 2017. Interest  Groups and Policy Analysis in Belgium. In M. Brans and D. Aubin (Eds.), Policy Analysis in Belgium. Bristol: Policy Press.", "Fraussen, B., Lawarée, J., Pattyn, V. 2017. Policy Analysis by Think Tanks. In M. Brans and D. Aubin (Eds.), Policy Analysis in Belgium. Bristol: Policy Press.", "Fraussen, B. and Donas, T. 2015. Regions lobbying the European Union: Organizational Forms, Policy Portfolios and Venue Selection. In P. Shotton and P. Nixon (Eds.), Interest Groups in the European Union: Changing Times, Changing Minds. Routledge. https://www.routledge.com/products/9781472452139", "Fraussen, B., & Dejaeghere, Y. 2011. Belgian Parties,  Interest Groups, Media and Public Opinion and the Presidency: A  Non-Issue for Non-State Actors? In S. Van Hecke & P. Bursens (Eds.),  Readjusting the Council Presidency. Belgian Leadership in the EU (pp.  79-100). Brussel: ASP. http://www.aspeditions.be/article.aspx?article_id=READJU436I"], "publication": [{"title": "Think tanks and strategic policy-making: the contribution of think tanks to policy advisory systems", "year": "2017", "source": "Policy Sciences, vol. 50, no. 1, pp. 105-124pp", "authors": ["Bert Fraussen", "Halpin D"]}, {"title": "Conceptualising the policy engagement of interest groups: Involvement, access and prominence", "year": "2017", "source": "European Journal of Political Research, vol. Online, pp. 5pp", "authors": ["Halpin D", "Bert Fraussen"]}, {"title": "The balancing act of establishing a policy agenda: Conceptualizing and measuring drivers of issue prioritization within interest groups", "year": "2017", "source": "Governance: an International journal of Policy, Administration and Institutions, vol. online, pp. 1-23pp", "authors": ["Halpin D", "Bert Fraussen", "Nownes A"]}, {"title": "Who", "year": "2016", "source": "s in and who's out?: Explaining access to policymakers in Belgium'Acta Politica, vol. 51, no. 2, pp. 214-236", "authors": ["Bert Fraussen", "Beyers J"]}, {"title": "ssessing the Composition and Diversity of the Australian Interest Group System", "year": "2016", "source": "Australian Journal of Public Administration, vol. 75, no. 4, pp. 476-491pp", "authors": ["Bert Fraussen", "Halpin D"]}, {"title": "Political Parties and Interest Organizations at the Crossroads: Perspectives on the Transformation of Political Organizations", "year": "2016", "source": "Political Studies Review", "authors": ["Bert Fraussen", "Halpin D"]}, {"title": "No Place Like Home? Explaining Venue Selection of Regional Offices in Brussels", "year": "2015", "source": "Journal of European Public Policy, vol. 22, no. 5, pp. 589-608", "authors": ["Beyers J", "Donas T", "Bert Fraussen"]}, {"title": "The Expanding Core and Varying Degrees of Insiderness: Institutionalised Interest Group Access to Advisory Councils", "year": "2015", "source": "Political Studies, vol. 63, no. 3, pp. 569-588", "authors": ["Bert Fraussen", "Beyers J", "Donas T"]}, {"title": "andacht trekken of advies verstrekken? De aanwezigheid van middenveldorganisaties in adviesraad- en beeldbuispolitiek (Gaining Attention or Giving Advice? The Presence of Advocacy Groups in Advisory Councils and Television News)", "year": "2015", "source": "Res Publica: a journal of legal and social philosophy, vol. 57, no. 2, pp. 159-183", "authors": ["Bert Fraussen", "Wouters R"]}, {"title": "It", "year": "2014", "source": "s not all about the money: Explaining varying policy portfolios of regional representations in Brussels'Interest Groups and Advocacy, vol. 3, no. 1, pp. 79-98", "authors": ["Donas T", "Bert Fraussen", "Beyers J"]}, {"title": "The Visible Hand of the State: On the Organizational Development of Interest Groups", "year": "2014", "source": "Public Administration, vol. 92, no. 2, pp. 406-421", "authors": ["Bert Fraussen"]}, {"title": "Interest Group Politics: Change and Continuity", "year": "2012", "source": "Revue d'Integration Europeenne (Journal of European Integration), vol. 34, no. 5, pp. 523-529", "authors": ["Bert Fraussen"]}, {"title": "Belgian Parties, Interest Groups, Media and Public Opinion and the Presidency: A Non-Issue for Non-State Actors?", "year": "2011", "source": "in Steven Van Hecke and Peter Bursens (ed.), Readjusting the Council Presidency. Belgian Leadership in the EU, Academic and Scientific Publishers, Brussel, Belgium, pp. 79-100", "authors": ["Bert Fraussen", "Dejaeghere Y"]}]}, "Microsoft-Academic": [{"title": "political parties and interest organizations at the crossroads perspectives on the transformation of political organizations", "year": 2018, "source": "political studies review", "authors": [{"name": "bert fraussen", "affiliation": "australian national university"}, {"name": "darren halpin", "affiliation": "australian national university"}], "id": 1390998}, {"title": "the expanding core and varying degrees of insiderness institutionalised interest group access to advisory councils", "year": 2015, "source": "political studies", "authors": [{"name": "bert fraussen", "affiliation": "university of antwerp"}, {"name": "jan beyers", "affiliation": "university of antwerp"}, {"name": "tom donas", "affiliation": "university of antwerp"}], "id": 90283396}, {"title": "think tanks and strategic policy making the contribution of think tanks to policy advisory systems", "year": 2017, "source": "policy sciences", "authors": [{"name": "bert fraussen", "affiliation": "australian national university"}, {"name": "darren halpin", "affiliation": "australian national university"}], "id": 197895017}, {"title": "conceptualising the policy engagement of interest groups involvement access and prominence", "year": 2017, "source": "european journal of political research", "authors": [{"name": "darren halpin", "affiliation": "australian national university"}, {"name": "bert fraussen", "affiliation": "leiden university"}], "id": 135158421}, {"title": "assessing the composition and diversity of the australian interest group system", "year": 2016, "source": "australian journal of public administration", "authors": [{"name": "bert fraussen", "affiliation": "australian national university"}, {"name": "darren halpin", "affiliation": "australian national university"}], "id": 128357121}, {"title": "who s in and who s out explaining access to policymakers in belgium", "year": 2016, "source": "acta politica", "authors": [{"name": "bert fraussen", "affiliation": "australian national university"}, {"name": "jan beyers", "affiliation": "university of antwerp"}], "id": 71218591}, {"title": "the visible hand of the state on the organizational development of interest groups", "year": 2014, "source": "public administration", "authors": [{"name": "bert fraussen"}], "id": 201221823}, {"title": "interest groups and policy capacity modes of engagement policy goods and networks", "year": 2018, "source": "", "authors": [{"name": "carsten daugbjerg", "affiliation": "australian national university"}, {"name": "carsten daugbjerg", "affiliation": "university of copenhagen"}, {"name": "bert fraussen", "affiliation": "leiden university"}, {"name": "darren halpin", "affiliation": "australian national university"}]}, {"title": "the balancing act of establishing a policy agenda conceptualizing and measuring drivers of issue prioritization within interest groups", "year": 2018, "source": "governance", "authors": [{"name": "darren halpin", "affiliation": "australian national university"}, {"name": "bert fraussen", "affiliation": "leiden university"}, {"name": "anthony j nownes", "affiliation": "university of tennessee"}], "id": 62375027}, {"title": "laying the groundwork linking internal agenda setting processes of interest groups to their role in policy making", "year": 2019, "source": "administration & society", "authors": [{"name": "darren halpin", "affiliation": "australian national university"}, {"name": "bert fraussen", "affiliation": "leiden university"}], "id": 5465880}], "ANDS-Grants": []}