{"ANU": {"name": "Bonnie B. McConnell", "link": "https://researchers.anu.edu.au/researchers/mcconnell-b", "colleges": "College of Arts and Social Sciences", "email": "Bree.McConnell@anu.edu.au", "phone": "(02) 61257015", "expertise": [], "interest": ["Bonnie's primary research interests center on intersections between musical performance practice, gender, health and wellbeing. Additional areas of research include: Music of Africa and the African diasporaMusic and climate changePolitical economy of performancePerformance-based approaches to ethnographic research Music and IslamMusic and emotionIndigenous Australian music"], "biography": "", "project": ["Music, Health, and Power: Singing the Unsayable in The Gambia", "My current book project is an investigation of music, health, and power in the Gambia through the lens of Muslim women's performances. It examines the way women have adapted indigenous musical healing practices in order to address contemporary public health challenges. In the face of political repression and economic austerity, women use music to address sensitive health topics, challenge gender inequality, and promote collective action. Focusing on the music of kanyeleng fertility societies as well as popular dance music, the book demonstrates that female performers navigate complex gendered expectations and religious restrictions to access new forms of power and influence in contemporary Gambia. (Funded by the Fulbright-Hays Program and the American Association of University Women)", "Developing a Community Singing-Based Intervention for Perinatal Mental Health in The Gambia", "This is an international partnership building project exploring how music can be used to support maternal mental health in The Gambia. I am a co-Investigator on the project which is led by Lauren Stewart, Goldsmiths, University of London (Funded by UK Global Public Health Partnership Award, AHRC/MRC)", ""], "publication": [{"title": "Music", "year": "2020", "source": "Healthand Power: Singing the Unsayable in The Gambia, Routledge, New York", "authors": ["Bonnie B. McConnell"]}, {"title": "Gambia: Modern and Contemporary Performance Practice", "year": "2019", "source": "in Janet Sturman (ed.), SAGE International Encyclopedia of Music and Culture, SAGE Publications, London, pp. 976-977", "authors": ["Bonnie B. McConnell"]}, {"title": "Gambia: History, Culture, and Geography of Music", "year": "2019", "source": "in Janet Sturman (ed.), SAGE International Encyclopedia of Music and Culture, SAGE Publications, London, pp. 974-975", "authors": ["Bonnie B. McConnell"]}, {"title": "study protocol for testing the feasibility of a randomised stepped wedge cluster design to investigate a Community Health Intervention through Musical Engagement (CHIME) for perinatal mental health in The Gambia", "year": "2019", "source": "Pilot and Feasibility Studies, vol. 5, no. 124, pp. 1-8", "authors": ["Sanfilippo K", "Bonnie B. McConnell", "Cornelius V"]}, {"title": "fropolitan Projects: Music, Representation, and the Politics of Belonging in Australia", "year": "2019", "source": "Popular Music and Society, vol. 42 no. 2, pp. 131-149", "authors": ["Bonnie B. McConnell"]}, {"title": "To Bring Peace that Stays: Music, Conflict, and Conciliation in the Gambia", "year": "2019", "source": "International Journal of Community Music, vol. 12, no. 3, pp. 349-366", "authors": ["Bonnie B. McConnell"]}, {"title": "Performing \"participation\": Kanyeleng musicians and global health in the Gambia", "year": "2017", "source": "Ethnomusicology, vol. 61, no. 2, pp. 312-332", "authors": ["Bonnie B. McConnell"]}, {"title": "Music and the ecology of fear: Kanyeleng women performers and Ebola prevention in the Gambia.", "year": "2017", "source": "Africa Today, vol. 63, no. 3, pp. 28-42", "authors": ["Bonnie B. McConnell", "and B Darboe"]}, {"title": "Book Review - Abidjan USA: Music, Dance, and Mobility in the Lives of Four Ivorian Immigrants", "year": "2017", "source": "Journal of Folklore Research, vol. Online, pp. 2pp.", "authors": ["Bonnie B. McConnell"]}, {"title": "Music and health communication in The Gambia: A social capital approach", "year": "2016", "source": "Social Science and Medicine, vol. 169, no. Sep 2016, pp. 132-140", "authors": ["Bonnie B. McConnell"]}, {"title": "", "year": "2015", "source": "Singing the Unsayable: Female Performers and Global Health in The Gambia", "authors": ["Bonnie B. McConnell"]}, {"title": "Performing Baadinyaa: Music, Emotion, and Health in The Gambia", "year": "2015", "source": "Voices: A World Forum for Music Therapy, vol. 15, no. 3, pp. 1-22", "authors": ["Bonnie B. McConnell"]}, {"title": "Reflections on Love and Malaria: Agency and Control in the Wagogo Music Festival of Chamwino, Tanzania", "year": "2012", "source": "Ethnomusicology Symposium 2012, University of Dar es Salaam, Tanzania", "authors": ["Bonnie B. McConnell"]}, {"title": "HIV/AIDS Communication through the Performing Arts in Senegal", "year": "2011", "source": "Ethnomusicology Symposium 2011, ed. Mitchel Strumpf, University of Dar es Salaam, Tanzania, pp. 92-98", "authors": ["Bonnie B. McConnell"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}