{"ANU": {"name": "Brandon Yoder", "link": "https://researchers.anu.edu.au/researchers/yoder-b", "colleges": "College of Arts and Social Sciences", "email": "Brandon.Yoder@anu.edu.au", "phone": "", "expertise": ["Political Science", "International Relations", "Comparative Government And Politics", "Government And Politics Of Asia And The Pacific", "Experimental Economics"], "interest": ["International Security, US-China Relations, Chinese Politics, Politics of East Asia, Power Transitions, Signaling and Credibility, Formal Models, Lab Experiments, Foreign Policy, Comparative Democratization"], "biography": "", "project": ["UNDER REVIEW", "Signaling Under the Security Dilemma: An Experimental Analysis (with Kyle Haynes). Forthcoming at Journal of Conflict Resolution", "Costly Talk: Covert Action, Transparency, and Credible Reassurance. Revise and resubmit at International Organization", "How Informative are China’s Foreign Policy Signals? IR Theory and the Debate about China’s Intentions. Accepted at Chinese Journal of International Politics", "Reciprocation or Resolve? The Tradeoffs of Conditional Foreign Policy Strategies (with Kyle Haynes). Under review at Journal of Conflict Resolution", "Edited Volume: International Relations Theory and China-Russia Relations after the Cold War (Under contract with Palgrave-Macmillan)", "It has been widely noted that China and Russia have grown  progressively closer over the last two decades, yet the bilateral  relationship has been the subject of very little scrutiny using rigorous  theory. This volume addresses the theoretical lacuna in the literature  on China-Russia relations by bringing together leading scholars of  international relations from various theoretical perspectives, as well  as theoretically-informed experts in Chinese and/or Russian foreign  policy. The chapters work in combination to both improve our  understanding of a crucially important contemporary case, while also  advancing IR theory in substantial ways.", "Special Issue: International Relations Theory and China-India Relations (Under Review at Journal of Contemporary China)", "", "WORKING PAPERS", "Mixed Signals: The Limits of Reassurance in International Relations", "China’s Rise and the ‘Engagement-Containment’ Debate", "Signaling and Socialization: Reassurance with Endogenous Preferences (with Kyle Haynes)", "The Policy Relevance of Formal Models", "How Third-Party Threats Facilitate Credible Reassurance", "Power Shifts, Multiple Audiences and Credible Cheap-Talk Signals", "Realism’s Goldilocks Problem: Explaining Balancing Patterns in China-Russia Relations (with Alexander Korolev)", "Provocation versus Resolve in Coercive Bargaining (with Kyle Haynes)", "", "Book Manuscript: Uncertainty and Decline: Power Shifts, Credible Signaling, and US-China Relations", "How can the US and other states form accurate beliefs about the intentions of a rising China? Signaling during power shifts has also been dramatically undertheorized, and the literature on China’s rise lack systematic criteria for inferring China’s intentions. This project presents a novel theoretical framework that identifies conditions under which a rising state’s behavioral signals are more or less credible, and criteria that scholars and policymakers can use to infer a state’s foreign policy goals from its past actions. The findings al two chapters applied to contemporary US-China relations, to assess the credibility of China’s recent foreign policy signals and derive implications for US foreign policy.", ""], "publication": [{"title": "Offsetting Uncertainty: Reassurance with Two-Sided Incomplete Information", "year": "2020", "source": "American Journal of Political Science, vol. 64, no. 1, pp. 38-51", "authors": ["Haynes K", "Brandon Yoder"]}, {"title": "Mutual Uncertainty and Credible Communication: Experimental Evidence", "year": "2020", "source": "International Interactions, vol. 46, no. 4, pp. 1-18", "authors": ["Brandon Yoder", "Haynes K"]}, {"title": "Theoretical Rigor and the Study of Contemporary Cases: Explaining Post-Cold War China-Russia Relations", "year": "2020", "source": "International Politics 57 (5), pp. 741-759.", "authors": ["Brandon Yoder"]}, {"title": "Political Groups, Coordination Costs and Credible Communication in the Shadow of Power", "year": "2019", "source": "Political Science Quarterly, vol. 134, no. 3, pp. 507-536", "authors": ["Brandon Yoder", "Gaubatz K", "Schutte R"]}]}, "Microsoft-Academic": [{"title": "the uncertainty of decline signaling future intentions during power transitions", "year": 2011, "source": "social science research network", "authors": [{"name": "brandon yoder", "affiliation": "university of virginia"}], "id": 2751751161}, {"title": "using the next generation science standards equip rubric evaluating a course in biomedical science", "year": 2017, "source": "", "authors": [{"name": "brandon yoder"}]}, {"title": "after insolvency the causes and consequences of military retrenchment book project offsetting uncertainty how ignorance begets confidence capable and committed crisis bargaining under multidimensional uncertainty decline and detente how power shifts produce peace", "year": 2016, "source": "", "authors": [{"name": "william thompson"}, {"name": "brandon yoder"}]}, {"title": "the uncertainty of decline power shifts interstatesignaling and international conflict", "year": 2013, "source": "", "authors": [{"name": "brandon yoder"}]}], "ANDS-Grants": []}