{"ANU": {"name": "Bree Blakeman", "link": "https://researchers.anu.edu.au/researchers/blakeman-bm", "colleges": "College of Arts and Social Sciences", "email": "bree.blakeman@anu.edu.au", "phone": "02 6125 5764", "expertise": ["Social And Cultural Anthropology"], "interest": ["Yolngu culture and languagesAnthropology of Aboriginal AustraliaAnthropology of EmotionCognitive AnthropologyExchange theory Value theory Theories of autonomyStateless societies"], "biography": "Bree has worked with Yolngu people in northeast Arnhem Land since 2007. Her previous research focused on emotion concepts in Yolngu languages and how this body of concepts forms part of the local theory of value and exchange. From 2013-2015 Bree worked as an applied anthropologist in the Northern Territory. She has contributed to teaching a number of undergraduate courses focused Aboriginal Australia at The Australian National University over the years including working as course coordinator for ANTH2005/ANTH6005: Traditional Australian Indigenous Cultures, Societies and Environment in 2018. She was previously sole author of the popular blog, Footnotes and Fieldnotes (http://fieldnotesandfootnotes.wordpress.com/). Her other interests include property relations and land tenure, poetry and anarchist political philosophy. She is also the Mother of one very cute little boy.", "project": ["Placenames and Personal Names in Yolngu society and country through time – an ARC Project with Howard and Frances Morphy:", "The Yolngu peoples’ land and sea Country in north-east Arnhem Land is densely named, as a consequence of the actions of ancestral beings who gave shape to Country and to Yolngu society in place. Placenames are sung in ceremony, and passed down through the generations as personal names. This project aims to document the placenames of two Yolngu regions and explore what they tell us about Yolngu society as a system that has been in place for thousands of years. In consultation with Yolngu, it aims to create an interactive map and database archive to which Yolngu historians can add in the future, providing significant benefits for a community for who consider these names to be central to their identity and wellbeing – past, present and future."], "publication": [{"title": "Special Issue: Language, Morality and the Emotions Introduction", "year": "2015", "source": "Australian Journal of Anthropology, The, vol. 26, no. 3, pp. 319-331", "authors": ["Bree Blakeman", "Keen I"]}, {"title": "Exploring the role of affect in Yolngu exchange", "year": "2015", "source": "Australian Journal of Anthropology, The, vol. 26, no. 3, pp. 398-413", "authors": ["Bree Blakeman"]}, {"title": "Yolngu kinship and the case for extensionism: a reply to Warren Shapiro", "year": "2012", "source": "Journal of the Royal Anthropological Institute, vol. 18, no. 3, pp. 681-683", "authors": ["Bree Blakeman"]}]}, "Microsoft-Academic": [{"title": "exploring the role of affect in yolŋu exchange", "year": 2015, "source": "the australian journal of anthropology", "authors": [{"name": "bree blakeman", "affiliation": "australian national university"}], "id": 202606351}, {"title": "yolŋu kinship and the case for extensionism a reply to warren shapiro", "year": 2012, "source": "journal of the royal anthropological institute", "authors": [{"name": "bree blakeman", "affiliation": "australian national university"}], "id": 65256140}, {"title": "book review moving anthropology critical indigenous studies", "year": 2009, "source": "asia pacific journal of anthropology", "authors": [{"name": "bree blakeman"}], "id": 191816521}], "ANDS-Grants": []}