{"ANU": {"name": "Brendan McMorran", "link": "https://researchers.anu.edu.au/researchers/mcmorran-b", "colleges": "College of Health & Medicine", "email": "brendan.mcmorran@anu.edu.au", "phone": "", "expertise": ["Biochemistry And Cell Biology", "Genomics", "Innate Immunity", "Medical Parasitology", "Microbiology Not Elsewhere Classified", "Haematology", "Medical Biochemistry Proteins And Peptides Incl. Medical Proteomics"], "interest": ["Malaria is caused by the Plasmodium parasite, which is transmitted between people by mosquitoes, and infects the liver and red blood cells; clinical symptoms arise during the erythrocytic stage. Infections can result in flu-like symptoms and periodic fevers, which if unchecked, increase in severity and can further develop into serious life-threatening conditions, including severe anaemia, respiratory distress and coma. Millions of people living in the tropics are at risk of infection and young children, particularly those living in Africa, are most susceptible; the disease kills at least 1 million people each year. The widespread development of drug-resistant parasites is hampering ongoing control and elimination programs, motivating urgency for new ways to combat the disease. The main focus of my research is to understand the host response to malarial infection. Malaria survival has been a major driver in the evolutionary history of humans and many protective mechanisms have arisen that determine an individuals’ susceptibility to infection. One such mechanism involves platelets, which are able to bind parasite-infected cells and kill the parasite within. Understanding the molecular basis and clinical importance of these observations are major focuses in my group. I am also interested in discovering novel genes and pathways that protect the host during an infection, and using this knowledge to develop so-called host-directed therapies for malaria."], "biography": "I am a graduate of The University of Otago, Dunedin, New Zealand and hold BSc (Hons) and PhD degrees in biochemistry. I conducted postdoctoral studies at the Institute for Molecular Bioscience, University of Queensland (1997-2006) on cystic fibrosis and host response to lung disease. Since 2006 I have lead research on the protective role of platelets in malarial infection, whilst working at the Menzies Research Institute, University of Tasmania (Senior Research Fellow; 2006-2012) and at the Australian School of Advanced Medicine, Macquarie University (Associate Professor; 2012-2014). I was appointed as an Associate Professor at the John Curtin School of Medicine (JCSMR), Australian National University (ANU) in 2014.", "project": ["A hosted-directed approach to malarial treatment.", "Critical to an individual’s ability to survive an infection are the genetic makeup and ability to mount an appropriate protective response. Several genetic polymorphisms are associated with increased resistance to malarial infection, and these polymorphisms are common in populations living in malaria endemic regions. Compared to the short effective half-lives of modern antimalarial drugs, genetic-based protection, which has arisen through natural selection, has provided protection for millennia. This is because the anti-malarial effects are outside the genetic control of the parasite, whereas all current drugs target parasite molecules; variant parasite strains that modify the drug or mutate its target protein can (and have) rapidly arisen through their own selective bottlenecks. We propose that drugs that mimic host genetic-based protection will be highly effective and resistance-proof antimalarial agents. We call this approach host-directed therapy.", "", "Host red enzymes as targets for host-directed antimalarial therapy.", "During its residence in the red blood cell, the Plasmodium parasite scavenges and co-opts many host cell molecules to sustain its own growth requirements. The aim of this project is to develop drugs that ‘starve’ parasite of these molecules, and thereby act as host-directed antimalarial therapies. Amongst these molecules are enzymes used by progenitor red cells to synthesise haem. We have discovered, using a combination of genetics, bioinformatics and molecular biology that these host enzymes are essential for the parasite. Inhibiting their functions by genetic targeting or small molecule inhibitors produces a potent anti-malarial effect. Our current work aims to evaluate which enzymes are most suited as targets for host-directed therapy, and to develop novel inhibitors as lead antimalarial compounds.", "Relevant papers:", "Smith CM, Jerkovic A, Puy H, Winship I, Deybach JC, Gouya L, van Dooren G, Goodman CD, Sturm A, Manceau H, McFadden GI, David P, Mercereau-Puijalon O, Burgio G, McMorran BJ, Foote SJ. Red cells from ferrochelatase-deficient erythropoietic protoporphyria patients are resistant to growth of malarial parasites. Blood. 2015;125:534-541.", "Project funding:", "Foote and McMorran. Griseofulvin, a novel host-directed drug. NHMRC Project Grant APP104090", "Foote, McMorran and Burgio. ENU Mutagenesis and malaria chemotherapy. NHMRC Project Grant APP1047082.", "", "The role of platelets in the protection against malarial infection", "We have discovered that platelets in the circulation directly target and kill the malarial parasite as it grows inside red blood cells. This was a completely novel finding at the time as platelets are traditionally thought of as merely mediators of haemostasis and clot formation. However a large body of evidence now indicates their importance in many immunological and host defence functions, including malaria protection.  Platelets preferentially bind to Plasmodium-infected cells, become activated and release a molecule called Platelet factor 4 (PF4), which is cytotoxic to the parasite. The PF4 molecule enters the cell and parasite via red cell molecule called Duffy.  Parasites growing in red cells that lack Duffy are killed by the platelet. These discoveries implicate a relationship between the Duffy-negative allele and rates of P. falciparum infection; both are highly prevalent in African populations. Our current work aims to address a number of important questions relating to these findings, including the molecular mechanisms involved in the platelet killing function, the reasons for platelet loss early in malarial infection, and the occurrence of platelet-mediated parasite killing amongst different human populations.", "Relevant papers:", "McMorran BJ, Marshall VM, de Graaf C, et al. Platelets kill intraerythrocytic malarial parasites and mediate survival to infection. Science. 2009; 323:797-800.", "McMorran BJ, Wieczorski L, Drysdale KE, et al. Platelet factor 4 and Duffy antigen required for platelet killing of Plasmodium falciparum. Science. 2012; 338:1348-1351.", "McMorran BJ, Burgio G, Foote SJ. New Insights Into The Protective Power Of Platelets In Malaria Infection. Communicative & Integrative Biology 2013; 1;6(3):e23653.", "Project funding:", "McMorran, Foote and Burgio. The role of Duffy and PF4 in platelet killing of malaria parasites. NHMRC Project Grant APP1066502"], "publication": [{"title": "nalysis of the F2LR3 (PAR4) Single Nucleotide Polymorphism (rs773902) in an Indigenous Australian Population", "year": "2020", "source": "Frontiers in Genetics, vol. 11, no. 432, pp. 1-5", "authors": ["Ningtyas D", "Thomson R", "Tarlac V", "Brendan McMorran"]}, {"title": "Polymorphism in the serotonin transporter gene polymorphisms ( 5-HTTLPR) modifies the association between significant life events and depression in people with multiple sclerosis", "year": "2019", "source": "Multiple Sclerosis, vol. 25, no. 6, pp. 848-855pp", "authors": ["Saul A", "Taylor B", "Simpson Jr S", "Brendan McMorran"]}, {"title": "Defense Peptides Engineered from Human Platelet Factor 4 Kill Plasmodium by Selective Membrane Disruption", "year": "2018", "source": "Cell Chemical Biology, vol. 25, pp. 1140-1150pp", "authors": ["Lawrence N", "Dennis A", "Lehane A", "Brendan McMorran"]}, {"title": "Platelets kill circulating parasites of all major Plasmodium species in human malaria", "year": "2018", "source": "Blood, vol. 132, no. 12, pp. 1332-1334pp", "authors": ["Kho S", "Barber B", "Johar E", "Brendan McMorran"]}, {"title": "Immune role of platelets in malaria", "year": "2018", "source": "ISBT Science Series, vol. 14, no. 1, pp. 67-76", "authors": ["Brendan McMorran"]}, {"title": "Host genetics in malaria: lessons from mouse studies", "year": "2018", "source": "https://www.ncbi.nlm.nih.gov/pubmed/29594458", "authors": ["Huang H", "Brendan McMorran", "Foote S"]}, {"title": "Erythrocyte Î² spectrin can be genetically targeted to protect mice from malaria", "year": "2018", "source": "https://www.ncbi.nlm.nih.gov/pubmed/29296915", "authors": ["Lelliott P", "Huang H", "Dixon M", "Brendan McMorran"]}, {"title": "Griseofulvin impairs intraerythrocytic growth of Plasmodium falciparum through ferrochelatase inhibition but lacks activity in an experimental human infection study.", "year": "2017", "source": "Scientific Reports, vol. 7, pp. 41975-41975", "authors": ["Smith C", "Jerkovic A", "Truong T", "Brendan McMorran"]}, {"title": "Platelets in Malarial Infection: Protective or Pathological?", "year": "2017", "source": "in P. Gresele, Neal S. Kleiman, Jose A Lopez, Clive P Page (ed.), Platelets in Thrombotic and Non-Thrombotic Disorders, Springer International Publishing AG, Switzerland, pp. 1103-1109pp", "authors": ["Foote S", "Burgio G", "Brendan McMorran"]}, {"title": "nkyrin-1 gene exhibits allelic heterogeneity in conferring protection against Malaria", "year": "2017", "source": "https://www.ncbi.nlm.nih.gov/pubmed/28751503", "authors": ["Huang H", "Bauer D", "Lelliott P", "Brendan McMorran"]}, {"title": "denosine monophosphate deaminase 3 activation shortens erythrocyte half-life and provides malaria resistance in mice", "year": "2016", "source": "https://www.ncbi.nlm.nih.gov/pubmed/27465915", "authors": ["Hortle E", "Nijagal B", "Bauer D", "Brendan McMorran"]}, {"title": "novel ENU-induced ankyrin-1 mutation impairs parasite invasion and increases erythrocyte clearance during malaria infection in mice", "year": "2016", "source": "https://www.ncbi.nlm.nih.gov/pubmed/27848995", "authors": ["Huang H", "Bauer D", "Lelliott P", "Brendan McMorran"]}, {"title": "Genome-wide analysis of chemically induced mutations in mouse in phenotype-driven screens", "year": "2015", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2650323", "authors": ["Bauer D", "Brendan McMorran", "Foote S"]}, {"title": "Erythrocytic iron deficiency enhances susceptibility to Plasmodium chabaudi infection in mice carrying a missense mutation in transferrin receptor 1", "year": "2015", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2630339", "authors": ["Lelliott P", "Brendan McMorran", "Foote S"]}, {"title": "In vivo assessment of rodent Plasmodium parasitemia and merozoite invasion by flow cytometry", "year": "2015", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2586720", "authors": ["Lelliott P", "Brendan McMorran", "Foote S"]}, {"title": "The influence of host genetics on erythrocytes and malaria infection: Is there therapeutic potential?", "year": "2015", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2621518", "authors": ["Lelliott P", "Brendan McMorran", "Foote S"]}, {"title": "Treatment of erythrocytes with the 2-Cys peroxiredoxin inhibitor, conoidin A, prevents the growth of Plasmodium falciparum and enhances parasite sensitivity to chloroquine", "year": "2014", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2469913", "authors": ["Brizuela M", "Huang H", "Smith C", "Brendan McMorran"]}, {"title": "flow cytometric assay to quantify invasion of red blood cells by rodent Plasmodium parasites in vivo", "year": "2014", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2462898", "authors": ["Lelliott P", "Lampkin S", "Brendan McMorran"]}, {"title": "New insights into the protective power of platelets in malaria infection", "year": "2013", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2371027", "authors": ["Brendan McMorran", "Burgio G", "Foote S"]}, {"title": "novel ENU-mutation in ankyrin-1 disrupts malaria parasite maturation in red blood cells and mice", "year": "2012", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2272391", "authors": ["Greth A", "Lampkin S", "Mayura-Guru P", "Brendan McMorran"]}, {"title": "Platelet factor 4 and duffy antigen required for platelet killing of Plasmodium falciparum", "year": "2012", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2322455", "authors": ["Brendan McMorran", "Wieczorski L", "Drysdale K"]}, {"title": "Comparing genotyping algorithms for Illumina", "year": "2011", "source": "s Infinium whole-genome SNP BeadChips'BMC Bioinformatics, vol. 12, no. 68, pp. (12 pp)", "authors": ["Ritchie M", "Liu R", "Carvalho B", "Brendan McMorran"]}, {"title": "Host resistance to malaria: Using mouse models to explore the host response", "year": "2010", "source": "http://www.ncbi.nlm.nih.gov/pubmed/2111663", "authors": ["Longley R", "Smith C", "Fortin A", "Brendan McMorran"]}, {"title": "The role of TNF in parasitic diseases: Still more questions than answers", "year": "2010", "source": "International Journal for Parasitology, vol. 40, no. 8, pp. 879-888", "authors": ["Korner H", "Brendan McMorran", "Schluter D"]}, {"title": "Platelets kill intraerythrocytic malarial parasites and mediate survival to infection", "year": "2009", "source": "Science, vol. 323, no. 5915, pp. 797-800", "authors": ["Brendan McMorran", "Marshall V", "de Graaf C"]}, {"title": "Genome-wide association study identifies new multiple sclerosis susceptibility loci on chromosomes 12 and 20", "year": "2009", "source": "Nature Genetics, vol. 41, no. 7, pp. 824-828", "authors": ["Bahlo M", "Booth D", "Broadley S", "Brendan McMorran"]}]}, "Microsoft-Academic": [{"title": "gene complementation of airway epithelium in the cystic fibrosis mouse is necessary and sufficient to correct the pathogen clearance and inflammatory abnormalities", "year": 2002, "source": "human molecular genetics", "authors": [{"name": "delvac oceandy"}, {"name": "brendan mcmorran"}, {"name": "stephen n smith", "affiliation": "national institutes of health"}, {"name": "rainer schreiber", "affiliation": "university of queensland"}, {"name": "karl kunzelmann", "affiliation": "university of queensland"}, {"name": "eric w f w alton", "affiliation": "national institutes of health"}, {"name": "david a hume"}, {"name": "brandon j wainwright"}], "id": 166515463}, {"title": "g551d cystic fibrosis mice exhibit abnormal regulation of inflammation in lungs and macrophages", "year": 2000, "source": "journal of immunology", "authors": [{"name": "gordon thomas"}, {"name": "elaine a costelloe", "affiliation": "university of queensland"}, {"name": "dominic p lunn"}, {"name": "katryn j stacey", "affiliation": "university of queensland"}, {"name": "s j delaney"}, {"name": "robert passey", "affiliation": "university of queensland"}, {"name": "edwina mcglinn"}, {"name": "brendan mcmorran"}, {"name": "azita ahadizadeh"}, {"name": "carolyn l geczy", "affiliation": "university of new south wales"}, {"name": "brandon j wainwright"}, {"name": "david a hume", "affiliation": "university of queensland"}], "id": 38008053}, {"title": "effector exou from the type iii secretion system is an important modulator of gene expression in lung epithelial cells in response to pseudomonas aeruginosa infection", "year": 2003, "source": "infection and immunity", "authors": [{"name": "brendan mcmorran", "affiliation": "university of california san francisco"}, {"name": "liam town", "affiliation": "university of california san francisco"}, {"name": "elaine o costelloe", "affiliation": "university of california san francisco"}, {"name": "james s palmer", "affiliation": "university of california san francisco"}, {"name": "joanne n engel", "affiliation": "university of california san francisco"}, {"name": "david a hume", "affiliation": "university of california san francisco"}, {"name": "brandon j wainwright", "affiliation": "university of california san francisco"}], "id": 128227336}, {"title": "g551d cf mice display an abnormal host response and have impaired clearance of pseudomonas lung disease", "year": 2001, "source": "american journal of physiology lung cellular and molecular physiology", "authors": [{"name": "brendan mcmorran", "affiliation": "university of queensland"}, {"name": "james s palmer", "affiliation": "university of queensland"}, {"name": "dominic p lunn", "affiliation": "university of queensland"}, {"name": "delvac oceandy", "affiliation": "university of queensland"}, {"name": "elaine o costelloe", "affiliation": "university of queensland"}, {"name": "gordon thomas", "affiliation": "university of queensland"}, {"name": "david a hume", "affiliation": "university of queensland"}, {"name": "brandon j wainwright", "affiliation": "university of queensland"}], "id": 47245711}, {"title": "flagellin of pseudomonas aeruginosa inhibits na transport in airway epithelia", "year": 2006, "source": "the faseb journal", "authors": [{"name": "karl kunzelmann", "affiliation": "university of regensburg"}, {"name": "kerstin scheidt", "affiliation": "university of regensburg"}, {"name": "birgit e scharf", "affiliation": "university of regensburg"}, {"name": "jiraporn ousingsawat", "affiliation": "university of regensburg"}, {"name": "rainer schreiber", "affiliation": "university of regensburg"}, {"name": "brandon j wainwright", "affiliation": "university of queensland"}, {"name": "brendan mcmorran", "affiliation": "university of queensland"}], "id": 25293849}, {"title": "first encounter how pathogens compromise epithelial transport", "year": 2004, "source": "physiology", "authors": [{"name": "karl kunzelmann", "affiliation": "university of regensburg"}, {"name": "brendan mcmorran", "affiliation": "university of queensland"}], "id": 88977973}, {"title": "gfp tagged cftr transgene is functional in the g551d cystic fibrosis mouse colon", "year": 2003, "source": "the journal of membrane biology", "authors": [{"name": "delvac oceandy", "affiliation": "university of queensland"}, {"name": "brendan mcmorran", "affiliation": "university of queensland"}, {"name": "rainer schreiber", "affiliation": "university of regensburg"}, {"name": "brandon j wainwright", "affiliation": "university of queensland"}, {"name": "karl kunzelmann", "affiliation": "university of regensburg"}], "id": 967762373}, {"title": "the cystic fibrosis transmembrane conductance regulator cftr regulates the sensitivity of macrophages to bacterial lipopolysaccharide", "year": 1999, "source": "journal of endotoxin research", "authors": [{"name": "david a hume", "affiliation": "university of queensland"}, {"name": "gordon thomas", "affiliation": "university of queensland"}, {"name": "brendan mcmorran", "affiliation": "university of queensland"}, {"name": "azita ahadizadeh", "affiliation": "university of queensland"}, {"name": "edwina mcglinn", "affiliation": "university of queensland"}, {"name": "dominic p lunn", "affiliation": "university of queensland"}, {"name": "paul k lovelock", "affiliation": "university of queensland"}, {"name": "stephen j delaney", "affiliation": "university of queensland"}, {"name": "elaine o costelloe", "affiliation": "university of queensland"}, {"name": "katryn j stacey", "affiliation": "university of queensland"}, {"name": "robert passey", "affiliation": "university of new south wales"}, {"name": "carolyn l geczy", "affiliation": "university of new south wales"}, {"name": "brandon j wainwright", "affiliation": "university of queensland"}], "id": 14555865}, {"title": "iron metabolism in g551d cystic fibrosis mouse incisor ameloblasts", "year": 2006, "source": "", "authors": [{"name": "j r smid"}, {"name": "w g young"}, {"name": "brendan mcmorran"}, {"name": "brandon j wainwright"}]}, {"title": "first encounter how pathogens", "year": 2004, "source": "", "authors": [{"name": "karl kunzelmann"}, {"name": "brendan mcmorran"}]}], "ANDS-Grants": [{"description": "Platelets in the blood can kill the Plasmodium parasite, which lives inside red blood cells and causes malaria. Platelets bind parasite-infected red cells and release a molecule that is toxic to the parasite. This project will study why a red cell molecule called Duffy is also needed for this function of platelets. Most Africans carry a gene for Duffy that stops its expression in red cells, and may therefore be more susceptible to malaria because their platelets cannot kill the malaria parasite.", "title": "How platelets kill malaria parasites", "id": "1344912", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/GNT1066502", "researchers": ["Prof Simon Foote", "A/Pr Brendan McMorran", "Dr Gaetan Burgio"], "status": "closed", "fundingAmount": 338447, "fundingScheme": "Project Grants", "startDate": 2014, "endDate": 2017, "dateTimeModified": "2018-10-03T01:49:29Z", "dateTimeCreated": "2018-10-03T01:49:29Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["A/Pr Brendan McMorran"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1066502", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1066502", "GNT1066502"], "subjects": ["Medical Parasitology", "MEDICAL AND HEALTH SCIENCES", "MEDICAL MICROBIOLOGY", "malaria", "platelet function", "innate immunity", "genetic susceptibility"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1344912"}]}]}