{"ANU": {"name": "Brenda L  Croft", "link": "https://researchers.anu.edu.au/researchers/croft-b", "colleges": "College of Arts and Social Sciences", "email": "Brenda.Croft@anu.edu.au", "phone": "", "expertise": ["Visual Arts And Crafts", "Lens Based Practice", "Performance And Installation Art", "Performing Arts And Creative Writing", "Other Studies In Creative Arts And Writing"], "interest": ["Australian First Nations' contemporary visual arts and culture; international First Nations' contemporary visual arts and culture; critical Indigenous performative auto-ethnography, Indigenous Storying and Indigenous Knowledges; creative-led research; cultural representation and identity; re/memorying, memorialisation; personal and public archives and access"], "biography": "Brenda is also affiliated with the following organisations and projects:", "project": ["Artistic/curatorial practice-led research, selected", "Artistic practice, selected", "Curatorial practice, selected"], "publication": [{"title": "Blackwoman", "year": "2019", "source": "in Cordite, 89: Domestic, (ed. Dr Natalie Harkin), 1 February, 2019, http://cordite.org.au/poetry/domestic/blackwoman/, accessed 3 December, 2020", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "‘Missing’", "year": "2018", "source": "in Absolute Humidity (Ed. Tess Maunder)Hardbound, First Edition. (A Hardworking Goodlooking Book. Printer: Tito Acquino Noscal, Manila City, Philippines). Attribution: Non-Commercial-NoDeriv (CC BY-NC-ND), pp 34 – 45. (Essay originally published in Shards: Nici Cumpston, Yhonnie Scarce and Judy Watson, exh. Cat. SASA Gallery, UniSA, 30 September – 24 October, 2008, curated by Mary Knights", "authors": ["Brenda L  Croft"]}, {"title": "home/lands", "year": "2018", "source": "in  Visualising Human Rights, Jane Lydon (ed.), UWA Publishing, Crawley, Perth, Western Australia, pp. 101-112pp", "authors": ["Brenda L  Croft"]}, {"title": "Grounded (red, black, white)", "year": "2018", "source": "triptych, exhibited in Genius loci, Canberra Glassworks, 5 April - 3 June; selected for Hindmarsh Prize, Fitters Workshop, Canberra Glassworks, 21 - 30 September; Toyama Glass Museum, Toyama, Japan, 26 October - 11 Novembe", "authors": ["Brenda L  Croft"]}, {"title": "Still in my mind: Gurindji location, experience and visuality", "year": "2018", "source": "in Jacqueline Millner, Catriona Moore (eds.), Feminist Perspectives on Art : Contemporary Outtakes, Routledge Taylor & Francis Group, UK, pp. 69-78. Best Indigenous Writing Award, AAANZ Annual Conference, 2018", "authors": ["Brenda L  Croft"]}, {"title": "The Instability of Truth: Aspects of Developing a Specific Indigenous Methodology on Experimental Practice-led Research", "year": "2018", "source": "Visual Anthropology Review, vol. 34, no. 1, pp. 15-26", "authors": ["Brenda L  Croft"]}, {"title": "home/lands", "year": "2017", "source": "essay in Still in my mind: Gurindji location, experience and visuality, (exh. cat.) UQ Art Museum, Brisbane, Qld, pp 19 - 31", "authors": ["Brenda L  Croft"]}, {"title": "Still in my mind: Gurindji location, experience and visuality", "year": "2017", "source": "practice-led doctoral research exhibition, UNSW Galleries, UNSW, 5 May - 29 July. Curator, participating artist.", "authors": ["Brenda L  Croft"]}, {"title": "shut/mouth/scream", "year": "2017", "source": "(2016) (diptych)from the blood/type' series, exhibited in Defying Empire: 3rd National Indigenous Art Triennial, National Gallery of Australia, 26 May - 10 September, 2017", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "shut/mouth/scream", "year": "2016", "source": "(diptych) from the blood/type' series. Pigment print on archival paper. Exhibited in solo exhibition subalter/N/ative dreams', Stills Gallery, Sydney, 27 July - 27 August, 2016; Defying Empire: 3rd National Indigenous Art Triennial', National Gallery of Australia, 26 May - 10 September, 2017, then national tour", "authors": ["Brenda L  Croft"]}, {"title": "Wave Hill/Victoria River Country", "year": "2016", "source": "(2016)21 pigment prints on archival paper. Exhibited in ‘subalter/N/ative dreams’, Stills Gallery, Sydney, 27 July – 27 August, 2016; ‘Defying Empire: 3rd National Indigenous Art Triennial', National Gallery of Australia, 26 May - 10 September, 201", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "Self-portraits on country, 2014", "year": "2016", "source": "(printed 2016)13 pigment prints on archival paper. Exhibited in solo exhibition subalter/N/ative dreams', Stills Gallery, Sydney, 27 July - 27 August, 2016; ‘tell: Ballarat International Foto Biennial’, 19 August - 17 September, 201", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "subalter/N/ative dreams - solo exhibition", "year": "2016", "source": "Stills GallerySydney, 27 July - 27 August", "authors": ["Brenda L  Croft"]}, {"title": "Retrac(k)ing country and (s)kin: walking the Wave Hill Walk Off Track (and other sites of cultural contestation)", "year": "2016", "source": "WesterlyVol. 61, No. 1, pp. 76 - 82", "authors": ["Brenda L  Croft"]}, {"title": "Signs of the Times", "year": "2015", "source": "in Rosie Scott, Anita Heiss (ed.), The Intervention: An anthology, Concerned Australians, Salisbury, South Australia, pp. 162 - 178", "authors": ["Brenda L  Croft"]}, {"title": "Say my name", "year": "2015", "source": "in Celina Jeffery (ed.), The Artist as Curator, Intellect, Bristol, UK; University of Chicago Press, Chicago, USA, pp. 115 - 130. https://issuu.com/tina9214/docs/celina_jeffery-the_artist_as_curat", "authors": ["Brenda L  Croft"]}, {"title": "Still in My Mind: An Exploration of Practice-led Experimental Research in Progress", "year": "2015", "source": "Cultural Studies Review, vol. 21, no. 1, pp. pp. 230-248", "authors": ["Brenda L  Croft"]}, {"title": "Revolutionize me (and you, and you, and you)", "year": "2012", "source": "in Decolonize Me/Décolonisez Moi(exh. cat.), Ottawa Art Gallery, Canada, pp 46 - 73", "authors": ["Brenda L  Croft"]}, {"title": "Sell-abrasion of our nations", "year": "2011", "source": "lead essay, exhibition catalogue, Stop(the)gap: international Indigenous art in motion', Samstag Art Museum and Port Adelaide Mill, Adelaide International Art Festival, guest curator (with curatorial advisors Kathleen Ash-Milby (USA), David Garneau (Canada) and Megan Tamati-Quennell (Aotearoa/New Zealand), Feb - March, 201", "authors": ["Brenda L  Croft"]}, {"title": "To be young (at heart), gifted and blak: the cultural and political renaissance of Indigenous art in Australia", "year": "2007", "source": "in H. Perkins and M. West (ed.), One Sun, One Moon: Aboriginal Art in Australia, Art Gallery of New South Wales, Sydney, pp. pp285 - pp292", "authors": ["Brenda L  Croft"]}, {"title": "Cannot buy my soul", "year": "2007", "source": "in   (ed.), Culture Warriors: National Indigenous Art Triennial, National Gallery of Australia, Canberra, Australia, pp. x - xxvii", "authors": ["Brenda L  Croft"]}, {"title": "Culture Warriors: National Indigenous Art Triennial", "year": "2007", "source": "National Gallery of AustraliaCanberra, Australia. Inaugural curator. Established the National Indigenous Art Triennial during tenure as Senior Curator, Aboriginal and Torres Strait Islander Art, NGA, (2002 - 09)", "authors": ["Brenda L  Croft"]}, {"title": "Up in the sky, behind the clouds", "year": "2006", "source": "in   (ed.), Michael Riley: Sights Unseen, National Gallery of Australia, Canberra, Australia, pp. 17 - 43", "authors": ["Brenda L  Croft"]}, {"title": "Michael Riley: Sights Unseen", "year": "2006", "source": "National Gallery of AustraliaCanberra, Australia. Curator", "authors": ["Brenda L  Croft"]}, {"title": "Meeting, Not Colliding", "year": "2006", "source": "Vision, Space, Desire:\r\nGlobal Perspectives and\r\nCultural Hybridity, ed. Elizabeth Kennedy Gische, National Museum of the American Indian: Smithsonian Institute, USA, pp. 68-75", "authors": ["Brenda L  Croft"]}, {"title": "What about the dots and circles?! The children need them!", "year": "2004", "source": "Banff Centre for Continuing Education Conference, ed. Lee-Ann Martin, The Banff International Curatorial Institute, in association with Walter Phillips Gallery, The Banff Centre, Canada, pp. 108 - 127", "authors": ["Brenda L  Croft"]}, {"title": "Textiles and tactility; object list", "year": "2003", "source": "in   (ed.), Tactility: two centuries of objects, textiles and fibre, National Gallery of Australia, Canberra", "authors": ["Brenda L  Croft"]}, {"title": "Cultural life-force: ceremonial and traditional practices", "year": "2003", "source": "in   (ed.), Tactility: two centuries of objects, textiles and fibre, National Gallery of Australia, Canberra, pp. pp9-pp11", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "Representing the figurative", "year": "2003", "source": "in   (ed.), Tactility: two centuries of objects, textiles and fibre, National Gallery of Australia, Canberra, pp. pp12-pp17", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "Tactility: two centuries of objects, textiles and fibre", "year": "2003", "source": "in   (ed.), Tactility: two centuries of objects, textiles and fibre, National Gallery of Australia, Canberra, pp. pp3-pp6", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "Ink to Inkjet", "year": "2003", "source": "in   (ed.), South West Central: Indigenous Art from south Western Australia 1833 - 2002, Art Gallery of Western Australia, Perth, WA, pp. 21 - 35", "authors": ["Brenda L  Croft"]}, {"title": "South West Central: Indigenous Art from south Western Australia 1833 - 2002", "year": "2003", "source": "Art Gallery of Western AustraliaPerth, WA. Curator", "authors": ["Brenda L  Croft"]}, {"title": "Laying ghosts to rest", "year": "2002", "source": "in   (ed.), Colonialist Photography: Imag(in)ing Race and Place., Routledge, London UK; New York, USA, pp. 20 - 29. Previously published in Portraits of Oceania, Art Gallery of New South Wales, 1997", "authors": ["Brenda L  Croft"]}, {"title": "Indigenous art in the State Art Collection", "year": "2001", "source": ",\r\n in Indigenous Art: Art Gallery of Western AustraliaArt Gallery of Western Australia, Perth, Western Australia, pp. 7 - 13", "authors": ["Brenda L  Croft", "Brenda L  Croft"]}, {"title": "lbert", "year": "2001", "source": "s Gift'in   (ed.), Indigenous Art: Art Gallery of Western Australia, Art Gallery of Western Australia, Perth, Western Australia, pp. 76 - 93pp", "authors": ["Brenda L  Croft"]}, {"title": "beyond the pale: empires built on the bones of the dispossessed", "year": "2000", "source": "in   (ed.), beyond the pale: empires built on the bones of the dispossessed, Art Gallery of South Australia, Adelaide, Australia, pp. 8 - 14", "authors": ["Brenda L  Croft"]}, {"title": "Beyond the pale: contemporary Indigenous art", "year": "2000", "source": "Adelaide Biennial of Australian ArtArt Gallery of South Australia, Adelaide, for the Adelaide International Arts Festival, Australia. Curator", "authors": ["Brenda L  Croft"]}, {"title": "Boomalli: from little things big things grow", "year": "1999", "source": "in Taylor, L. (ed.), Painting the Land Story, National Museum of Australia Press, Canberra, pp. 95-118", "authors": ["Brenda L  Croft"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}