{"ANU": {"name": "Brett Lidbury", "link": "https://researchers.anu.edu.au/researchers/lidbury-ba", "colleges": "College of Health & Medicine", "email": "brett.lidbury@anu.edu.au", "phone": "+61 (0)2 6125 7875", "expertise": ["Medical Virology", "Biostatistics", "Infectious Diseases", "Pathology Excl. Oral Pathology"], "interest": ["Previous laboratory-based interests in virology and pathogenesis have moved in silico, with the application of machine-learning/pattern-recognition techniques to support the study of human susceptibility or resistance to disease post viral infection (e.g. HBV). Techniques include recursive partitioning (trees) and support vector machines (SVMs), as both classification and regression applications to biomedical data. This research theme has diversified into other aspects of quality in diagnostic pathology, supported by the Quality Use of Pathology Programme (QUPP - Commonwealth Department of Health), and in collaboration with the Royal College of Pathologists (QAP) and NSW Health Pathology.Chronic Fatigue Syndrome/Myalgic Encephalomyelitis (CFS/ME) studies are ongoing with research participants recruited and assessed by CFS Discovery in Melbourne, and in collaboration with the Hudson Research Institute, Paranta Biosciences, Bio21 Institute (Melbourne) and JCSMR. The CFS/ME projects are funded by the Mason Foundation and ME Research UK."], "biography": "In addition to the above, I have experience in diagnostic pathology and a period as a pre-clinical evaluator (toxicology) with the Therapeutic Goods Administration.", "project": ["Current and ongoing projects are associated with the development of alternatives to animals in fundamental biomedical research. Through this approach there are two disease foci being explored via non-animal strategies utilising bioinformatics, genetic data and biological validation through human pathology testing. These projects are:"], "publication": [{"title": "Biomedical Insights That Inform the Diagnosis of ME/CFS", "year": "2020", "source": "Diagnostics, vol. 10, no. 2", "authors": ["Brett Lidbury"]}, {"title": "Rethinking ME/CFS Diagnostic Reference Intervals via Machine Learning, and the Utility of Activin B for Defining Symptom Severity", "year": "2019", "source": "Diagnostics, vol. 9, no. 79, pp. 1-21", "authors": ["Brett Lidbury", "Richardson A"]}, {"title": "Large expert-curated database for benchmarking document similarity detection in biomedical literature search [IN PRESS]", "year": "2019", "source": "Database : the journal of biological databases and curation, vol. online", "authors": ["Brown P", "Tan A", "El-Esawi M", "Brett Lidbury"]}, {"title": "ustralia and New Zealand", "year": "2018", "source": "in Michael Balls, Robert Combes, Andrew Worth (ed.), The History of Alternative Test Methods in Toxicology, Academic Press, United Kingdom, pp. 71-76", "authors": ["France M", "Brett Lidbury"]}, {"title": "Predicting liver disease post hepatitis virus infection: In silico pathology and pattern recognition", "year": "2018", "source": "E-Bio Medicine, vol. 35, pp. 10-11pp", "authors": ["Brett Lidbury"]}, {"title": "Weighting of Orthostatic Intolerance Time Measurements with Standing Difficulty Score Stratifies ME/CFS Symptom Severity and Analyte Detection", "year": "2018", "source": "Journal of Translational Medicine. 16:97\r\nhttps://doi.org/10.1186/s12967-018-1473-", "authors": ["Richardson A", "Lewis D", "Kita B", "Brett Lidbury"]}, {"title": "Integration of ISO15189 and external quality assurance data to assist the detection of poor laboratory performance in New South Wales", "year": "2018", "source": "Pathology, vol. 50, no. 1, pp. D92", "authors": ["Brett Lidbury", "Richardson AM"]}, {"title": "ctivin B is a novel biomarker for chronic fatigue syndrome/myalgic encephalomyelitis (CFS/ME) diagnosis: a cross sectional study", "year": "2017", "source": "Journal of Translational Medicine, vol. 15, no. 1", "authors": ["Brett Lidbury", "Lewis D"]}, {"title": "Integration of ISO 15189 and external quality assurance data to assist the detection of poor laboratory performance in NSW, Australia", "year": "2017", "source": "Journal of Laboratory and Precision Medicine, vol. 2, no. 97, pp. 1-15", "authors": ["Brett Lidbury", "Richardson A"]}, {"title": "Enhancement of hepatitis virus immunoassay outcome predictions in imbalanced routine pathology data by data balancing and feature selection before the application of support vector machines", "year": "2017", "source": "BMC Medical Informatics and Decision Making, vol. 17, p. 121", "authors": ["Richardson A", "Brett Lidbury"]}, {"title": "nimal Models of Alphavirus-induced Inflammatory Disease", "year": "2016", "source": "in Suresh Mahalingam, Lara Herrero and Belinda Herring (ed.), Alphaviruses: Current Biology, Caister Academic Press, United Kingdom, pp. 89-124", "authors": ["Herrero L", "Taylor A", "Roques P", "Brett Lidbury"]}, {"title": "New In Vitro Toxicology: Shifting from Cells to Serum by Exploiting Pathology Data and Machine Learning to Investigate Liver Toxicity", "year": "2016", "source": "Applied In Vitro Toxicology, vol. 2, no. 4, pp. 217/222", "authors": ["Brett Lidbury"]}, {"title": "Response to article: serum total bilirubin concentrations are inversely associated with total white blood cell counts in an adult population", "year": "2016", "source": "Annals Of Clinical Biochemistry, vol. 53, no. 3, pp. 412-414", "authors": ["Badrick T", "Richardson A", "Brett Lidbury"]}, {"title": "ustralian Regulation of Animal Use in Science and Education: A Critical Appraisal", "year": "2016", "source": "ILAR Journal, vol. 57, no. 3, pp. 324-332", "authors": ["Timoshanko A", "Marston H", "Brett Lidbury"]}, {"title": "Novel quantitative methods that enhance clinical decision support based on routine pathology testing. Report for The Quality Use of Pathology Programme", "year": "2015", "source": "The Commonwealth Department of HealthCanberra Australia", "authors": ["Badrick T", "Brett Lidbury"]}, {"title": "Lessons from toxicology: Developing a 21st-century paradigm for medical research", "year": "2015", "source": "Environmental Health Perspectives, vol. 123, no. 11, pp. A268-A272", "authors": ["Langley G", "Austin C", "Balapure A", "Brett Lidbury"]}, {"title": "ssessment of machine-learning techniques on large pathology data sets to address assay redundancy in routine liver function test profiles", "year": "2015", "source": "Diagnosis, vol. 2, no. 1, pp. 41-51", "authors": ["Brett Lidbury", "Richardson A", "Badrick T"]}, {"title": "Effects of an in-frame deletion of the 6k gene locus from the genome of Ross River virus", "year": "2016", "source": "Journal of Virology, vol. 90, no. 8, pp. 4150-4159", "authors": ["Taylor A", "Melton J", "Herrero L", "Brett Lidbury"]}, {"title": "Dengue virus and host antibody: A dangerous balancing act", "year": "2014", "source": "The Lancet Infectious Diseases, vol. 14, no. 9, pp. 783-784", "authors": ["Brett Lidbury"]}, {"title": "rthritogenic alphaviral infection perturbs osteoblast function and triggers pathologic bone loss", "year": "2014", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 111, no. 16, pp. 6040-6045", "authors": ["Chen W", "Foo S", "Rulli N", "Brett Lidbury"]}, {"title": "Characterization of Barmah Forest virus pathogenesis in a mouse model", "year": "2014", "source": "Journal of General Virology, vol. 95, pp. 2146-2154", "authors": ["Herrero L", "Brett Lidbury"]}, {"title": "n 1H-MRS framework predicts the onset of Alzheimer", "year": "2013", "source": "s disease symptoms in PSEN1 mutation carriers'Alzheimer's & Dementia, vol. 2013, pp. 1-10", "authors": ["Londono A", "Castellanos F", "Andres A", "Brett Lidbury"]}, {"title": "Infection status outcome, machine learning method and virus type interact to affect the optimised prediction of hepatitis virus immunoassay results from routine pathology laboratory assays in unbalanced data", "year": "2013", "source": "BMC Bioinformatics, vol. 14, no. 1, pp. -", "authors": ["Brett Lidbury"]}, {"title": "Predicting the presence of hepatitis B virus surface antigen in Chinese patients by pathology data mining", "year": "2013", "source": "Journal of Medical Virology, vol. 85, no. 8, pp. 1334-1339", "authors": ["Shang G", "Easteal S", "Ohms S", "Brett Lidbury"]}, {"title": "Novel technologies and an overall strategy to allow hazard assessment and risk prediction of chemicals, cosmetics, and drugs with animal-free methods", "year": "2012", "source": "Altex Alternativen zu Tierexperimenten, vol. 29, no. 4, pp. 373-388", "authors": ["Leist M", "Brett Lidbury", "Yang C"]}, {"title": "Mousetraps and how to avoid them: the convergence of utilitarian and scientific cases for limiting the mouse model in biomedical research", "year": "2012", "source": "Between the Species: an online journal for the study of philosophy and animals, vol. 15, no. 1, pp. 59-74", "authors": ["Brett Lidbury", "Townley C"]}, {"title": "pattern recognition bioinformatics alternative system to rodent models in fundamental research", "year": "2012", "source": "World Congress on Alternatives and Animal Use in the Life Sciences 2011, ed. Society ALTEX Edition, Kuesnacht, Switzerland, Spektrum Akademischer Verlag Springer-Verlag GmbH, Germany, pp. 515-520pp", "authors": ["Brett Lidbury", "Richardson A"]}, {"title": "Testing times: A symposium on the ethics and epistemology of animal experimentation Sydney, Australia, September 20-21, 2011", "year": "2012", "source": "Altex Alternativen zu Tierexperimenten, vol. 29, no. 1, pp. 96-97", "authors": ["Johnston J", "Brett Lidbury"]}, {"title": "Identification and characterization of a Ross River virus variant that grows persistently in macrophages, shows altered disease kinetics in a mouse model, and exhibits resistance to type I interferon", "year": "2011", "source": "Journal of Virology, vol. 85, no. 11, pp. 5651-5663", "authors": ["Brett Lidbury", "Musso C"]}, {"title": "The viral manipulation of the host cellular and immune environments to enhance propagation and survival: A focus on RNA viruses", "year": "2002", "source": "Journal of Leukocyte Biology, vol. 72, no. 3, pp. 429-439", "authors": ["Mahalingam S", "Meanger J", "Foster P", "Brett Lidbury"]}, {"title": "Identification and characterization of a Ross River virus variant that grows persistently in macrophages, shows altered disease kinetics in a mouse model, and exhibits resistance to type I interferon", "year": "2011", "source": "Journal of Virology, vol. 85, no. 11, pp. 5651-5663", "authors": ["Brett Lidbury", "Musso C"]}, {"title": "Respiratory syncytial virus--the unrecognised cause of health and economic burden among young children in Australia.", "year": "2011", "source": "Communicable Diseases Intelligence, vol. 35, no. 2, pp. 177-184", "authors": ["Ranmuthugala G", "Brown L", "Brett Lidbury"]}, {"title": "Learning from pathology databases to improve the laboratory diagnosis of infectious diseases.", "year": "2010", "source": "First IMIA/IFIP Joint Symposium, E-Health 2010, Held as Part of WCC 2010,  Proceedings, ed. Hiroshi Takeda, Springer, on line, pp. 226-227", "authors": ["Richardson A", "Shadabi F", "Brett Lidbury"]}, {"title": "Macrophage-derived proinflammatory factors contribute to the development of arthritis and myositis after infection with an arthrogenic alphavirus", "year": "2008", "source": "Journal of Infectious Diseases, vol. 197, pp. 1585-1593", "authors": ["Brett Lidbury", "Suhrbier A"]}, {"title": "Enhanced laboratory diagnosis of human Chlamydia pneumoniae through pattern recognition derived from pathology database analysis", "year": "2008", "source": "International Conference on Pattern Recognition (ICPR 2008), ed. Conference Program Committee, IEEE Computer Society, Melbourne, Australia, pp. 227-232", "authors": ["Richardson A", "Hawkins S", "Shadabi F", "Brett Lidbury"]}, {"title": "Gene Profiles in Drug Design", "year": "2008", "source": "CRC Press LLCUSA", "authors": ["Brett Lidbury"]}, {"title": "RNA Viruses and RNA-Based Drugs: A Perfect Match for RNA Delivery and the Identification of Candidate Therapeutic Target Inflammatory Molecules", "year": "2007", "source": "in Brett. A Lidbury and Suresh Mahalingam (ed.), Gene Profiles in Drug Design, CRC Press LLC, USA, pp. 115-130", "authors": ["Brett Lidbury", "Johal J"]}, {"title": "Ethical Considerations for a Genetic Future in Diagnosis and Drug Development", "year": "2008", "source": "in Brett. A Lidbury and Suresh Mahalingam (ed.), Gene Profiles in Drug Design, CRC Press LLC, USA, pp. 131-141", "authors": ["Brans L", "Brett Lidbury"]}, {"title": "Differential Induction of Type I Interferon Responses in Myeloid Dendritic Cells by Mosquito and Mammalian-Cell-Derived Alphaviruses", "year": "2007", "source": "Journal of Virology, vol. 81, no. 1, pp. 237-247", "authors": ["Shabman R", "Morrison T", "Moore C", "Brett Lidbury"]}, {"title": "Characterization of Ross River virus tropism and virus-induced inflammation in a mouse model of viral arthritis and myositis", "year": "2006", "source": "Journal of Virology, vol. 80, no. 2, pp. 737-749", "authors": ["Morrison T", "Whitmore A", "Shabman R", "Brett Lidbury"]}, {"title": "ntibody-dependent enhancement and vaccine development", "year": "2006", "source": "Expert Review of Vaccines, vol. 5, no. 4, pp. 409-412", "authors": ["Thomas S", "Redfern J", "Brett Lidbury"]}, {"title": "Ross River virus: molecular and cellular aspects of disease pathogenesis", "year": "2005", "source": "Pharmacology and Therapeutics, vol. 107, pp. 329-342", "authors": ["Rulli N", "Suhrbier A", "Hueston L", "Brett Lidbury"]}, {"title": "ntibody-dependent enhancement of infection: Bacteria do it too. Trends in Immunology", "year": "2003", "source": "24: 465-467", "authors": ["Brett Lidbury"]}, {"title": "Suppression of lipopolysaccharide-induced antiviral transcription factor (STAT1 and NF-ÎºB) complexes by antibody-dependent enhancement of macrophage infection by Ross River virus. Proceedings of the National Academy of Science", "year": "2002", "source": "USA99:13819-13824", "authors": ["Brett Lidbury"]}, {"title": "The specific ablation of antiviral gene expression in macrophages by antibody-dependent enhancement of Ross River virus infection. Journal of Virology", "year": "2000", "source": "74: 8376-8381", "authors": ["Brett Lidbury"]}, {"title": "Persistent Ross River virus infection of murine macrophages: An in vitro model for the study of viral relapse and immune modulation during long-term infection. Virology", "year": "2002", "source": "301: 281-292", "authors": ["Brett Lidbury"]}, {"title": "Genetic", "year": "2001", "source": "budget' of viruses and the cost to the infected host: A theory on the relationship between the genetic capacity of virusesimmune evasion, persistence and disease. Immunology and Cell Biology, 79: 62-66", "authors": ["Brett Lidbury"]}, {"title": "Sustainable Language Support Practices in Science Education: Technologies and Solutions. IGI Global", "year": "2012", "source": "HersheyPennsylvania, The United States", "authors": ["Brett Lidbury"]}, {"title": "Language Focus for Genetics and Molecular Biology Students", "year": "2012", "source": "in Felicia Zhang, Brett A. Lidbury (et al.), Sustainable language support practices in science education: Technologies and solutions, Information Science Reference, Hershey, Pennsylvania, USA", "authors": ["Brett Lidbury"]}, {"title": "Evaluating a Genetics Concept Inventory", "year": "2012", "source": "in Felicia Zhang (ed.), Sustainable language support practices in science education: Technologies and solutions, Information Science Reference, Hershey, Pennsylvania, USA, pp. 116-128", "authors": ["Zhang F", "Brett Lidbury"]}, {"title": "Language Support for First Year Human Physiology and Biology", "year": "2012", "source": "in Felicia Zhang (ed.), Sustainable language support practices in science education: Technologies and solutions, Information Science Reference, Hershey, Pennsylvania, USA, pp. 129-159", "authors": ["Mate K", "Rodger J", "Brett Lidbury"]}, {"title": "Integrating Language Learning Practices in First Year Science Disciplines", "year": "2010", "source": "The International Journal of Learning, vol. 17, pp. 481-502", "authors": ["Zhang F", "Brett Lidbury"]}, {"title": "Embedding in-discipline language support for first year students in the sciences: outcomes and future directions", "year": "2009", "source": "National UniServe Science Conference 2009, ed. Conference Program Committee, UniServe Science, Sydney Australia, pp. 139-145", "authors": ["Zhang F", "Brett Lidbury"]}, {"title": "Language difficulties in first year Science - an interim report", "year": "2008", "source": "UniServe Science Teaching and Learning Research Conference 2008, ed. Conference Program Committee, UniServe Science, Sydney Australia, pp. 159-164", "authors": ["Zhang F", "Brett Lidbury"]}, {"title": "ctivating multiple senses in learning statistics", "year": "2008", "source": "UniServe Science Teaching and Learning Research Conference 2008, ed. Conference Program Committee, UniServe Science, Sydney Australia, pp. 98-103", "authors": ["Richardson A", "Zhang F", "Brett Lidbury"]}, {"title": "It", "year": "2006", "source": "s all foreign to me: learning through the language of genetics and molecular biology'National UniServe Science Conference 2006, ed. Ian Johnston and Mary Peat, UniServe Science, Sydney Australia, pp. 153-159", "authors": ["Zhang F", "Brett Lidbury"]}]}, "Microsoft-Academic": [{"title": "the antiviral role of cytokines", "year": 1993, "source": "", "authors": [{"name": "brett lidbury"}]}], "ANDS-Grants": [{"description": "We have developed a novel animal model by which to study arthritic disease caused by insect-transmitted viruses known as arboviruses. The existence of this model and novel reagents provides an excellent opportunity to further explore the basic mechanisms of infectious disease in a complete functioning animal, rather than specific cultured cells. The study will use modern approaches in molecular and cellular biology to achieve this goal. The production by our immune systems of soluble mediators (cytokines-chemokines) and antibodies is an overwhelming positive aspect of our physiological response to infection by microbes. Protection from disease by these immune compounds can happen naturally, or the body's ability to produce these factors can be exploited to our benefit via the administration of vaccines. However, these factors can also be detrimental to the host contributing to severe disease. For instance, work performed almost 40 years ago showed for the first time that under particular conditions, antibodies against viruses can enhance infection, instead of inhibiting infection as normally seen. In the intervening years work by scientists all over the world has associated antibody-dependent enhancement (ADE) of infection to many types of viruses; ADE is even thought to be a risk factor to serious disease with dengue virus, and has been shown in vitro for the AIDS virus and Ebola virus. We have recently discovered a molecular mechanism which explains how antibody enhances viral infection in vitro. In studies on immune cells infected with Ross River Virus (RRV) we found that infection helped by antibody resulted in the specific disruption to the production of cellular chemicals which are toxic to viruses. Are these mechanisms of antibody-enhanced infection also found in animals? Will such mode of infection cause enhanced disease and tissue pathology (arthritis) in animals?", "title": "A NOVEL MOUSE MODEL TO INVESTIGATE THE MECHANISMS OF VIRUS-INDUCED ARTHRITIS", "id": "96333", "institutions": ["University of Canberra"], "key": "http://purl.org/au-research/grants/nhmrc/303404", "researchers": ["Prof Suresh Mahalingam", "A/Pr Brett Lidbury"], "status": "closed", "fundingAmount": 336000, "fundingScheme": "NHMRC Project Grants", "startDate": 2004, "endDate": 2006, "dateTimeModified": "2015-04-12T07:49:46Z", "dateTimeCreated": "2013-05-15T05:57:26Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["University of Canberra"], "principalInvestigator": ["Prof Suresh Mahalingam"], "purl": "http://purl.org/au-research/grants/nhmrc/303404", "identifiers": ["http://purl.org/au-research/grants/nhmrc/303404", "303404"], "subjects": ["Infectious Diseases", "MEDICAL AND HEALTH SCIENCES", "CLINICAL SCIENCES", "Ross River virus", "antibody-dependent enhancement", "antiviral activity", "immunopathology", "infection", "arthritis", "immune enhancement of viral disease", "viral disease", "viral tissue tropism and replication"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/96333"}]}, {"description": "Many viruses are known to cause arthritis (e.g. HIV, hepatitis viruses, mosquito borne viruses). Symptoms of viral arthritis include joint pain, stiffness, and swelling. The mechanism of disease is poorly understood. We have developed a novel animal model of disease by which to study arthritic disease caused by viral infections. This model provides an excellent opportunity to explore the mechanisms of rheumatic disease in a complete functioning animal and to explore new treatment regimes.", "title": "Novel insights into the mechanisms of how viruses cause arthritis-arthralgia", "id": "81871", "institutions": ["Griffith University"], "key": "http://purl.org/au-research/grants/nhmrc/508600", "researchers": ["Prof Andreas Suhrbier", "Prof Andrzej Tarkowski", "Prof Suresh Mahalingam", "A/Pr Mark Heise", "A/Pr Brett Lidbury"], "status": "closed", "fundingAmount": 626459.6, "fundingScheme": "NHMRC Project Grants", "startDate": 2008, "endDate": 2012, "dateTimeModified": "2017-07-17T04:48:53Z", "dateTimeCreated": "2013-05-15T04:47:17Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Griffith University"], "principalInvestigator": ["Prof Suresh Mahalingam"], "purl": "http://purl.org/au-research/grants/nhmrc/508600", "identifiers": ["http://purl.org/au-research/grants/nhmrc/508600", "508600"], "subjects": ["320402", "Alphaviruses (Ross River virus)", "Complement proteins", "Cytokines and chemokines", "Myositis (muscle inflammation)", "Viral arthritis", "Arthralgia", "Epidemic polyarthritis", "Inflammation", "Ross River virus disease"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/81871"}]}]}