{"ANU": {"name": "Brett Howland", "link": "https://researchers.anu.edu.au/researchers/howland-b", "colleges": "College of Science", "email": "Brett.Howland@anu.edu.au", "phone": "", "expertise": ["Ecology"], "interest": ["Using ecological knowledge to inform on ground management actions - weed control- grazing management- fire"], "biography": "", "project": ["ACT Government -  Grassland Restoration Project", "In 2015, ACT PCS embarked on a three year restoration project to improve the adaptive management of grassland ecosystems within Canberra Nature Park with an emphasis on improving and expanding habitat for threatened species.", "Working with ACT NRM and with funding from the Australian Government National Landcare Program, ACT PCS is working to deliver key actions for the conservation and protection of species and ecosystems of national environmental significance, such as the native grasslands.", "Bush Heritage Australia - Grass production", "Working to turn a 5 hectare African Love Grass paddock to a native grass seed produciotn site. Early stages have been coamplted in terms of seed collection, and the first year of grass sowing.", "Bush Heritage Australia - Restoration wheel", "Applying the national standards for the practise of ecological restoration to restoration activities at the Scottsdale property. The project is about quantifying the different indicators within the restoration wheel with on-ground data and then using that to inform restoration planning.", ""], "publication": [{"title": "Birds of a feather flock together: Using trait-groups to understand the effect of macropod grazing on birds in grassy habitats", "year": "2016", "source": "Biological Conservation, 194, 89-99", "authors": ["Brett Howland", "Stojanovic D", "Gordon I"]}, {"title": "Habitat preference of the striped legless lizard: Implications of grazing by native herbivores and livestock for conservation of grassland biota", "year": "2016", "source": "Austral Ecology, 41(4), 455-464", "authors": ["Brett Howland", "Stojanovic D", "Gordon I"]}, {"title": "Eaten out of house and home: Impacts of grazing on ground-dwelling reptiles in Australian grasslands and grassy woodlands", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 12, pp. 1-25", "authors": ["Brett Howland", "Stojanovic D", "Gordon I"]}, {"title": "ccounting for animal density gradients using independent information in distance sampling surveys", "year": "2013", "source": "Statistical Methods and Applications, vol. 22, no. 1, pp. 67-80", "authors": ["Marques T", "Buckland S", "Bispo R", "Brett Howland"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}