{"ANU": {"name": "Britta Foerster", "link": "https://researchers.anu.edu.au/researchers/forster-b", "colleges": "College of Science", "email": "britta.forster@anu.edu.au", "phone": "", "expertise": ["Plant Physiology", "Crop And Pasture Biochemistry And Physiology", "Cell Metabolism", "Plant Cell And Molecular Biology"], "interest": ["CO2 concentrating mechanisms in cyanobacteria and aquatic algaeMolecular physiology approaches to increasing photosynthetic efficiency and chloroplast function for yield improvement of C3 cropsMolecular mechanisms of photosynthesis and photoprotection using the unicellular alga Chlamydomonas reinhardtii as model systemPhotoacclimation to light and shade environments in relation to roles of the xanthophyll cycles in avocado trees"], "biography": "", "project": [], "publication": [{"title": "Progress and challenges of engineering a biophysical carbon dioxide-concentrating mechanism into higher plants", "year": "2017", "source": "Journal of Experimental Botany, vol. 68, no. 14, pp. 3717-3737", "authors": ["Rae B", "Long B", "Britta Foerster"]}, {"title": "Cyanobacterial CO2-concentrating mechanism components: function and prospects for plant metabolic engineering", "year": "2016", "source": "Current Opinion in Plant Biology, vol. 31, pp. 1-8", "authors": ["Long B", "Rae B", "Rolland V", "Britta Foerster"]}, {"title": "Characterisation of cyanobacterial bicarbonate transporters in E. Coli shows that SBTA homologs are functional in this heterologous expression system", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 12, pp. e115905-e115905", "authors": ["Du J", "Britta Foerster", "Rourke L"]}, {"title": "Gymnosperms have increased capacity for electron leakage to oxygen (Mehler and PTOX reactions) in photosynthesis compared with angiosperms", "year": "2013", "source": "Plant and Cell Physiology, vol. 54, no. 7, pp. 1152-1163", "authors": ["Shirao M", "Kuroki S", "Kaneko K", "Britta Foerster"]}, {"title": "Cyanobacterial Carboxysomes: Microcompartments that Facilitate CO2 Fixation", "year": "2013", "source": "Journal of Molecular Microbiology and Biotechnology, vol. 23, no. 4-5, pp. 300-307", "authors": ["Rae B", "Long B", "Whitehead L", "Britta Foerster"]}, {"title": "Decreased Photochemical Efficiency of Photosystem II following Sunlight Exposure of Shade-Grown Leaves of Avocado: Because of, or in Spite of, Two Kinetically Distinct Xanthophyll Cycles?", "year": "2013", "source": "Plant Physiology, vol. 161, no. 2, pp. 836-852", "authors": ["Jia H", "Forster B", "Chow W", "Britta Foerster"]}, {"title": "From ecophysiology to phenomics: some implications of photoprotection and shade-sun acclimation in situ for dynamics of thylakoids in vitro", "year": "2012", "source": "Philosophical Transactions of the Royal Society of London Series B, vol. 367, no. 1608, pp. 3503-3514", "authors": ["Matsubara S", "Britta Foerster", "Waterman M"]}, {"title": "Canopy conundrums: building on the Biosphere 2\r\nexperience to scale measurements of inner and outer\r\ncanopy photoprotection from the leaf to the landscape", "year": "2012", "source": "Functional Plant Biology 39, 1-24", "authors": ["Nichol CJ Pieruschka R", "Takayama K", "Britta Foerster"]}, {"title": "The CO2-concentrating mechanism of Synechococcus WH5701 is composed of native and horizontally-acquired components", "year": "2011", "source": "Photosynthesis Research, vol. 109, no. 1-3, pp. 59-72", "authors": ["Rae B", "Britta Foerster", "Badger M"]}, {"title": "Lutein from deepoxidation of lutein epoxide replaces zeaxanthin to sustain an enhanced capacity for nonphotochemical chlorophyll fluorescence quenching in avocado shade leaves in the dark", "year": "2011", "source": "Plant Physiology, 156, no. 1, pp. 393-403", "authors": ["Forster B", "Osmond CB Pogson BJ", "Britta Foerster"]}, {"title": "De Novo Synthesis and Degradation of Lx and V Cycle Pigments during Shade and Sun Acclimation in Avocado Leaves", "year": "2009", "source": "Plant Physiology, vol. 149, pp. 1179-1195", "authors": ["Forster B", "Pogson BJ Osmond CB", "Britta Foerster"]}, {"title": "Plastid signalling to the nucleus and beyond", "year": "2008", "source": "Trends in Plant Science, vol. 13, no. 11, pp. 602-609", "authors": ["Pogson B", "Woo N", "Britta Foerster"]}, {"title": "Dynamics of the truncated lutein epoxide cycle in avocado (Persea Americana L.): implications for efficiency of light harvesting", "year": "2008", "source": "in Allen, J. F., Gantt, E., Golbeck, J. H., Osmond, B. (ed.), Photosynthesis. Energy from the Sun: 14th International Congress on Photosynthesis 2007, Springer, Dordrecht, pp. 1031-1034", "authors": ["Pogson B", "Forster B", "Osmond CB", "Britta Foerster"]}, {"title": "Comparative proteomics of high light stress in the model alga Chlamydomonas reinhardtii", "year": "2006", "source": "Proteomics, vol. 6, no. 15, pp. 4309-4320", "authors": ["Britta Foerster", "Mathesius U", "Pogson B"]}, {"title": "Photoinhibition: Then and Now", "year": "2006", "source": "in Barbara Demmig-Adams, William Adams & Autar Mattoo (ed.), Photoprotection, Photoinhibition, Gene Regulation, and Environment, Springer, Netherlands, pp. 11-22", "authors": ["Osmond CB Forster B", "Britta Foerster"]}, {"title": "simple chlorophyll fluorescence parameter the correlates with the rate coefficient of photoinactivation of Photosystem II", "year": "2005", "source": "Photosynthesis Research, vol. 84, pp. 43-49", "authors": ["Hendrickson L", "Britta Foerster", "Pogson B"]}, {"title": "Improved survival of very high light and oxidative stress is conferred by spontaneous gain-of-function mutations in Chlamydomonas", "year": "2005", "source": "Biochimica et Biophysica Acta: Bioenergetics, vol. 1709, pp. 45-57", "authors": ["Forster B", "Osmond CB Pogson BJ", "Britta Foerster"]}, {"title": "Carotenoids in Photosynthesis", "year": "2004", "source": "in RM Goodman (ed.), Encyclopedia of Plant and Crop Science, Marcel Dekker Inc., New York, pp. 245-249pp", "authors": ["Britta Foerster", "Pogson B"]}, {"title": "Processes contributing to photoprotection of grapevine leaves illuminated at low temperature", "year": "2004", "source": "Physiologia Plantarum, vol. 121, no. 2, pp. 272-281", "authors": ["Hendrickson L", "Britta Foerster", "Furbank R"]}, {"title": "Occurrence of the lutein-epoxide cycle in mistletoes of the Loranthaceae and Viscaceae", "year": "2003", "source": "Planta, vol. 217, pp. 868-879", "authors": ["Matsubara S", "Morosinotto T", "Bassi R", "Britta Foerster"]}, {"title": "Very high light resistant mutants of Chlamydomonas reinhardtii: Responses of Photosystem II, nonphotochemical quenching and xanthophyll pigments to light and CO2", "year": "2001", "source": "Photosynthesis Research, vol. 67, pp. 5-15", "authors": ["Britta Foerster", "Osmond C", "Boynton J"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}