{"ANU": {"name": "Bruce Christensen PhD", "link": "https://researchers.anu.edu.au/researchers/christensen-phd-bk", "colleges": "College of Health & Medicine", "email": "Bruce.Christensen@anu.edu.au", "phone": "6125 2814", "expertise": ["Biological Psychology Neuropsychology Psychopharmacology Physiological Psychology", "Health Clinical And Counselling Psychology", "Cognitive Sciences"], "interest": ["My research can be described as \"cognitive psychopathology”. In broad terms, I am interested in the cognitive and neurobiological mechanisms of mental illness, with an emphasis on psychotic and affective disorders. However, my lab has also studied participants with anxiety disorders, traumatic brain injuries, eating disorders and forensic histories. Several of our studies rely on evolutionary models of functional brain organization to generate neurocognitive hypotheses, which we then test using both cognitive science and psychophysical methods. In addition, when possible, we include neuroimaging techniques (including MRI, PET, EEG/ERP, TMS) to investigate hypothesized neural correlates. In this context, we have studied the impact of mental illness on visual-perception, attention, memory/meta -memory, face processing, judgment/decision making, and cognition-emotion interactions and whether these abnormalities underwrite the clinical symptoms or functional disability associated with mental illness. I am also an active clinician (clinical psychology and neuropsychology) and devote some of my time to studying psychometric and pragmatic issues relating to clinical assessment. More recently, I have used a set of multivariate statistical tools borrowed from market research (Discrete Conjoint Analysis) to better understand the needs and preferences of mental health clients in relation to service delivery. We have also used these same techniques to study the characteristics that students prefer in academic supervisors and which aspects of mental illness most influence prejudice from others."], "biography": "I am trained as a clinical psychologist and clinical neuropsychologist. I received my PhD in clinical psychology and neuroscience from Vanderbilt Universtiy before completing an APA-approved internship in clinical psychology and cliincal neuropsychology at the Long Island Jewish Medical Centre, Albert Einstien College of Medicine in New York. I then spent two years as a postdoctoral fellow at the Rotman Research Institute, University of Toronto, studying neuropsychology, cognitive neuroscience and experimental psychopathology. I spent the first nine years of my academic career as a clinician-scientist at the Centre for Addiction and Mental Health, Univeristy of Toronto, with adjunct appointments to the Program in Neuroscience (University of Toronto), Institute of Medical Sciences (University of Toronto) and the Department of Psychology at the University of Waterloo. In 2007 I moved to the Departments of Psychiatry and Psychology at McMaster University before accepting a faculty position in the Research School of Psychology at the ANU in 2014. I also was a Visiting Scholar at the Clare Hall Centre for Advanced Study, Cambridge University, in 2010-11. Across these settings I have directed research laboratories primarily aimed at investigating the cognitive and neurobiological mechanisms of mental illness. In addition, I have established and directed two separate university-hospital-based psychological assessment clincs and served in senior university administrative positions (e.g., Associate Chair for Resarch, Associate Director-Clinical). I have also been an Associate Editor for the journal Assessment and a reviewer for the Canadian Institutes of Health Research. I also spent several years ast the Co-chair of the Professional Advisory Committee and a Board Member at Healthy Minds Canada. In my spare time I enjoy cooking, reading, jazz and downhill skiing.", "project": [], "publication": [{"title": "Traditional test administration and proactive interference undermine visual-spatial working memory performance in schizophrenia-spectrum disorders", "year": "2018", "source": "Cognitive Neuropsychiatry, vol. 23, no. 4, pp. 242-253", "authors": ["Girard T", "Wilkins L", "Kathleen M", "Bruce Christensen PhD"]}, {"title": "Temporal dynamics of anxiety-related attentional bias: is affective context a missing piece of the puzzle?", "year": "2018", "source": "Cognition and Emotion, vol. 32, no. 6, pp. 1329-1338pp", "authors": ["Cox J", "Bruce Christensen PhD", "Goodhew S"]}, {"title": "Measuring cognitive assessment and intervention burden in patients with acquired brain injured: Development of the \"How Much is Too Much\" questionnaire", "year": "2018", "source": "Journal of Rehabilitation Medicine, vol. 50, no. 6, pp. 519-526pp", "authors": ["Tomaszczyk J", "Sharma B", "Chan A", "Bruce Christensen PhD"]}, {"title": "Hippocampal activation and memory performance in schizophrenia depend on strategy use in a virtual maze", "year": "2017", "source": "Psychiatry Research: Neuroimaging, vol. 268, pp. 1-8", "authors": ["Wilkins L", "Girard T", "Herdman K", "Bruce Christensen PhD"]}, {"title": "Social anxiety and attentional biases: A top-down contribution?", "year": "2017", "source": "Attention, Perception & Psychophysics, pp. 1-12pp", "authors": ["Delchau H", "Bruce Christensen PhD", "Goodhew S"]}, {"title": "The unexpected killer: effects of stimulus threat and negative affectivity on inattentional blindness", "year": "2017", "source": "Cognition and Emotion, vol. 32, no. 6, pp. 1374-1381", "authors": ["Beanland V", "Bruce Christensen PhD", "Beanland V"]}, {"title": "Inhibiting reactions to emotional versus non-emotional response cues in schizophrenia: Insights from a motor-process paradigm", "year": "2016", "source": "Journal of Neuropsychology, vol. 10, no. 1, pp. 59-76", "authors": ["Patrick R", "Bruce Christensen PhD", "Smolewska K"]}, {"title": "Effortful versus automatic emotional processing in schizophrenia: Insights from a face-vignette task", "year": "2015", "source": "Cognition and Emotion, vol. 29, no. 5, pp. 767-783", "authors": ["Patrick R", "Rastogi A", "Bruce Christensen PhD"]}, {"title": "Neurophysiological correlates of emotional directed-forgetting in persons with Schizophrenia: An event-related brain potential study", "year": "2015", "source": "International Journal of Psychophysiology, vol. 98, no. 3, pp. 612-623", "authors": ["Patrick R", "Kiang M", "Bruce Christensen PhD"]}, {"title": "Event-related brain potential study of semantic priming in unaffected first-degree relatives of schizophrenia patients", "year": "2014", "source": "Schizophrenia Research, vol. 153, no. 1-3, pp. 78-86", "authors": ["Kiang M", "Bruce Christensen PhD", "Zipursky R"]}, {"title": "Negative neuroplasticity in Chronic Traumatic Brain Injury and Implications for Neurorehabilitation", "year": "2014", "source": "Neuropsychology Review, vol. 24, no. 4, pp. 409-427", "authors": ["Tomaszczyk J", "Green N", "Frasca D", "Bruce Christensen PhD"]}, {"title": "Two distinct neural networks functionally connected to the human hippocampus during pattern separation tasks", "year": "2014", "source": "Brain and Cognition, vol. 92, no. 2014, pp. 101-111", "authors": ["Paleja M", "Girard T", "Herdman K", "Bruce Christensen PhD"]}, {"title": "ssociation of abnormal semantic processing with delusion-like ideation in frequent cannabis users: An electrophysiological study", "year": "2013", "source": "Psychopharmacology, vol. 225, no. 1, pp. 95-104", "authors": ["Kiang M", "Bruce Christensen PhD", "Streiner D"]}, {"title": "Reduced directed forgetting for negative words suggests schizophrenia-related disinhibition of emotional cues", "year": "2013", "source": "Psychological Medicine, vol. 43, no. 11, pp. 2289-2299", "authors": ["Patrick R", "Bruce Christensen PhD"]}, {"title": "The course of cognitive functioning over six months in individuals at clinical high risk for psychosis", "year": "2013", "source": "Psychiatry Research, vol. 206, no. 2-3, pp. 195-199", "authors": ["Barbato M", "Colijn M", "Keefe R", "Bruce Christensen PhD"]}, {"title": "CE verbal episodic memory impairment in schizophrenia: A comparison with frontal lobe lesion patients", "year": "2013", "source": "Clinical Neuropsychologist, vol. 27, no. 4, pp. 647-666", "authors": ["Bruce Christensen PhD", "Patrick R", "Stuss D"]}, {"title": "Contribution of coherent motion to the perception of biological motion among persons with schizophrenia", "year": "2013", "source": "Frontiers in Psychology, vol. 4, no. August, pp. 1-10", "authors": ["Spencer J", "Sekuler A", "Bennett P", "Bruce Christensen PhD"]}, {"title": "Noise as a mechanism of anomalous face processing among persons with Schizophrenia", "year": "2013", "source": "Frontiers in Psychology, vol. 4, no. JUL, pp. 401-401", "authors": ["Bruce Christensen PhD", "Spencer J", "King J"]}, {"title": "Test-retest reliability and stability of N400 effects in a word-pair semantic priming paradigm", "year": "2013", "source": "Clinical Neurophysiology, vol. 124, no. 4, pp. 667-674", "authors": ["Kiang M", "Patriciu I", "Roy C", "Bruce Christensen PhD"]}, {"title": "Spatial-memory deficit in schizophrenia spectrum disorders under viewpoint-independent demands in the virtual courtyard task", "year": "2013", "source": "Journal of Clinical and Experimental Neuropsychology, vol. 35, no. 10, pp. 1082-1093", "authors": ["Wilkins L", "Girard T", "King J", "Bruce Christensen PhD"]}, {"title": "Selective deficit in spatial memory strategies contrast to intact response strategies in patients with schizophrenia spectrum disorders tested in a virtual navigation task", "year": "2013", "source": "Hippocampus, vol. 23, no. 11, pp. 1015-1024", "authors": ["Wilkins L", "Girard T", "Konishi K", "Bruce Christensen PhD"]}, {"title": "Electrophysiological evidence for primary semantic memory functional organization deficits in schizophrenia", "year": "2012", "source": "Psychiatry Research, vol. 196, no. 2-3, pp. 171-180", "authors": ["Kiang M", "Bruce Christensen PhD", "Kutas M"]}, {"title": "Evaluating the mood state dependence of automatic thoughts and dysfunctional attitudes in remitted versus never-depressed individuals", "year": "2012", "source": "Journal of Cognitive Psychotherapy: An International Quarterly, vol. 26, no. 4, pp. 381-389", "authors": ["Lau M", "Haigh E", "Bruce Christensen PhD"]}, {"title": "Ethical issues relevant to the assessment of suicide risk in nonclinical research settings", "year": "2012", "source": "Crisis: The Journal of Crisis Intervention and Suicide Prevention\r\n, vol. 33, no. 1, pp. 54-59", "authors": ["Wilson C", "Bruce Christensen PhD"]}, {"title": "Depth-of-processing effects on semantic activation deficits in schizophrenia: An electrophysiological investigation", "year": "2011", "source": "Schizophrenia Research, vol. 133, no. 1-3, pp. 91-98", "authors": ["Kiang M", "Bruce Christensen PhD", "Zipursky R"]}, {"title": "ttentional guidance during visual search among patients with schizophrenia", "year": "2011", "source": "Schizophrenia Research, vol. 131, no. 1-3, pp. 224-230", "authors": ["Elahipanah A", "Bruce Christensen PhD", "Reingold E"]}, {"title": "Controlling the spotlight of attention: Visual span size and flexibility in schizophrenia", "year": "2011", "source": "Neuropsychologia, vol. 49, no. 12, pp. 3370-3376", "authors": ["Elahipanah A", "Bruce Christensen PhD", "Reingold E"]}, {"title": "Virtual human analogs to rodent spatial pattern separation and completion memory tasks", "year": "2011", "source": "Learning and Motivation, vol. 42, no. 3, pp. 237-244", "authors": ["Paleja M", "Girard T", "Bruce Christensen PhD"]}, {"title": "What can eye movements tell us about Symbol Digit substitution by patients with schizophrenia?", "year": "2011", "source": "Schizophrenia Research, vol. 127, no. 1-3, pp. 137-143", "authors": ["Elahipanah A", "Bruce Christensen PhD", "Reingold E"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}