{"ANU": {"name": "Bryan Rodgers", "link": "https://researchers.anu.edu.au/researchers/rodgers-b", "colleges": "College of Arts and Social Sciences", "email": "Bryan.Rodgers@anu.edu.au", "phone": "", "expertise": ["Mental Health", "Epidemiology", "Family And Household Studies", "Health Promotion", "Developmental Psychology And Ageing", "Social Policy", "Environmental And Occupational Health And Safety", "Health And Community Services", "Public Health And Health Services"], "interest": ["childhood adversity and adult mental healthlong-term sequelae of parental divorce family relationships and mental healthrelationships of alcohol consumption with anxiety, depression and cognitive functionmodels of vulnerability and resilienceepidemiology of mental disorders over the life coursemental health literacyjobs and mental healtheating disorder behavioursgambling and problem gambling"], "biography": "", "project": [], "publication": [{"title": "The relationship of experiencing workplace bullying with mental health, affective commitment and job satisfaction: Application of the job demands control model", "year": "2020", "source": "International Journal of Environmental Research and Public Health, vol. 17, no. 2151, p. 14", "authors": ["Steele N", "Bryan Rodgers", "Fogarty G"]}, {"title": "Gambling Behaviour, Problem Gambling and Reasons for Gambling among International Students in Tasmania, Australia", "year": "2019", "source": "Journal of Gambling Studies, vol. 35, no. 1, pp. 155-170pp", "authors": ["Mond J", "Skromanis S", "Purton T", "Bryan Rodgers"]}, {"title": "Couple and family therapies for post-traumatic stress disorder (PTSD)", "year": "2019", "source": "Cochrane Database of Systematic Reviews (CDSR), no. 12, pp. 1-55", "authors": ["Suomi A", "Evans L", "Bryan Rodgers"]}, {"title": "Elucidating knowledge and beliefs about obesity and eating disorders among key stakeholders: paving the way for an integrated approach to health promotion", "year": "2019", "source": "BMC Public Health, vol. 19, no. 1681, pp. 1-10", "authors": ["Bullivant B", "Denham A", "Stephens C", "Bryan Rodgers"]}, {"title": "Couple and family therapies for post-traumatic stress disorder (PTSD)", "year": "2019", "source": "Cochrane Database of Systematic Reviews (CDSR), no. 12, pp. 1-55", "authors": ["Suomi A", "Evans L", "Bryan Rodgers"]}, {"title": "Health and Well-being of International University Students, and Comparison with Domestic Students in Tasmania Australia", "year": "2018", "source": "International Journal of Environmental Research and Public Health, vol. 15, no. 6, pp. 1-13", "authors": ["Skromanis S", "Cooling N", "Bryan Rodgers"]}, {"title": "prospective study of the substance use and mental health outcomes of young adult former and current cannabis users", "year": "2017", "source": "Drug and Alcohol Review, vol. 36, no. 5, pp. 618-625", "authors": ["Silins E", "Swift W", "Slade T", "Bryan Rodgers"]}, {"title": "", "year": "2017", "source": "Certifying mediation: A study of section 60I certificates. ANU Centre for Social Research Working Paper No. 2. ANU CSRM: Canberr", "authors": ["Smyth B", "Bonython W", "Bryan Rodgers"]}, {"title": "Emotion regulation difficulties in binge eating disorder with and without the overvaluation of weight and shape", "year": "2016", "source": "Psychiatry Research, vol. 245, pp. 436-442", "authors": ["Harrison C", "Mitchison D", "Rieger E", "Bryan Rodgers"]}, {"title": "Sex differences in the relationships between body dissatisfaction, quality of life and psychological distress", "year": "2016", "source": "Australian and New Zealand Journal of Public Health, vol. 40, no. 6, pp. 518-522", "authors": ["Griffiths S", "Hay P", "Mitchison D", "Bryan Rodgers"]}, {"title": "Consistency and continuity in material and psychosocial adversity among Australian families with young children", "year": "2016", "source": "Social Indicators Research, vol. 128, no. 1, pp. 35-57", "authors": ["Gubhaju B", "Bryan Rodgers", "Butterworth P"]}, {"title": "Identifying Persuasive Public Health Messages to Change Community Knowledge and Attitudes About Bulimia Nervosa", "year": "2016", "source": "Journal of Health Communication, vol. 21, no. 2, pp. 178-187", "authors": ["McLean S", "Paxton S", "Massey R", "Bryan Rodgers"]}, {"title": "Gender, mental health, physical health and retirement: A prospective study of 21,608 Australians aged 55-69 years", "year": "2016", "source": "Maturitas, vol. 87, pp. 40-48", "authors": ["Byles J", "Vo K", "Forder P", "Bryan Rodgers"]}, {"title": "The 2014 Study on Gambling expenditure by level of problem gambling", "year": "2016", "source": "type of activityand demographic and socioeconomic characteristics.", "authors": ["Davidson T", "Bryan Rodgers", "Markham F"]}, {"title": "Implications of gambling problems for family and interpersonal adjustment: Results from the Quinte Longitudinal Study", "year": "2016", "source": "Addiction, vol. 11, pp. 1628-1636", "authors": ["Cowlishaw S", "Suomi A", "Bryan Rodgers"]}, {"title": "", "year": "2015", "source": "Preventive interventions for problem gambling: A public health perspective.", "authors": ["Bryan Rodgers", "Suomi A", "Davidson T"]}, {"title": "record linkage study of antidepressant medication use and weight change in Australian adults", "year": "2015", "source": "Australian and New Zealand Journal of Psychiatry, vol. 49, no. 11, pp. 1029-1039", "authors": ["Paige E", "Korda R", "Kemp-Casey A", "Bryan Rodgers"]}, {"title": "Correlates of binge eating with and without overvaluation of weight or shape: Further evidence from a general population sample of women", "year": "2015", "source": "Advances in Eating Disorders (Abingdon): Theory, Research and Practice, vol. 3, no. 1, pp. 20-33", "authors": ["Harrison C", "Mond J", "Rieger E", "Bryan Rodgers"]}, {"title": "Generic and eating disorder-specific impairment in binge eating disorder with and without overvaluation of weight or shape", "year": "2015", "source": "Behaviour Research and Therapy, vol. 72, pp. 93-99", "authors": ["Harrison C", "Mond J", "Rieger E", "Bryan Rodgers"]}, {"title": "Gambling Expenditure in the ACT (2009): By level of problem gambling", "year": "2015", "source": "type of activityand socioeconomic and demographic characteristics", "authors": ["Bryan Rodgers", "Davidson T", "Markham F"]}, {"title": "Characteristics of antidepressant medication users in a cohort of mid-age and older Australians", "year": "2015", "source": "Australian and New Zealand Journal of Psychiatry, vol. 49, no. 3, pp. 275-290", "authors": ["Paige E", "Korda R", "Kemp A", "Bryan Rodgers"]}, {"title": "Retirement, age, gender and mental health: Findings from the 45 and Up Study", "year": "2015", "source": "Aging and Mental Health, vol. 19, no. 7, pp. 647-657", "authors": ["Vo K", "Forder P", "Tavener M", "Bryan Rodgers"]}, {"title": "Stigmatizing Attitudes and Beliefs Toward Bulimia Nervosa The Importance of Knowledge and Eating Disorder Symptoms", "year": "2015", "source": "Journal of Nervous and Mental Disease, vol. 203, no. 4, pp. 259-263", "authors": ["Bryan Rodgers", "Paxton S", "McLean S"]}, {"title": "The Australian child support reforms: A critical evaluation", "year": "2015", "source": "Australian Journal of Social Issues, vol. 50, no. 3, pp. 217-341", "authors": ["Smyth B", "Bryan Rodgers", "Son V"]}, {"title": "Obesity and psychosocial impairment: Mediating roles of health status, weight/shape concerns and binge eating in a community sample of women and men", "year": "2015", "source": "International Journal of Obesity, vol. 39, no. 2, pp. 346-352", "authors": ["van Zutven K", "Mond J", "Latner J", "Bryan Rodgers"]}, {"title": "Couple and family therapies for post-traumatic stress disorder (PTSD)", "year": "2014", "source": "Cochrane Database of Systematic Reviews (CDSR), vol. 9, no. 2014, pp. 1-14", "authors": ["Cowlishaw S", "Evans L", "Suomi A", "Bryan Rodgers"]}, {"title": "Can child support compliance be improved by the introduction of a", "year": "2014", "source": "fairer' child support formula and more rigorous enforcement? The recent Australian experience'Journal of Family Studies, vol. 20, no. 3, pp. 204-220", "authors": ["Smyth B", "Vnuk M", "Bryan Rodgers"]}, {"title": "Loss of control eating with and without the undue influence of weight or shape on self-evaluation: evidence from an adolescent population", "year": "2014", "source": "Journal of Eating Disorders, vol. 2, no. 1, pp. 31-31", "authors": ["Harrison C", "Mond J", "Bentley C", "Bryan Rodgers"]}, {"title": "Sex differences in psychosocial impairment associated with eating-disordered behavior: What if there aren", "year": "2014", "source": "t any?'Eating Behaviors, vol. 15, no. 4, pp. 609-614", "authors": ["Bentley C", "Mond J", "Bryan Rodgers"]}, {"title": "Psychological distress and comorbid physical conditions: Disease or disability?", "year": "2014", "source": "Depression and Anxiety (Hoboken), vol. 31, no. 6, pp. 524-532", "authors": ["Byles J", "Robinson I", "Banks E", "Bryan Rodgers"]}, {"title": "Stigmatizing attitudes and beliefs about bulimia nervosa: Gender, age, education and income variability in a community sample", "year": "2014", "source": "International Journal of Eating Disorders, vol. 47, no. 4, pp. 353-361", "authors": ["McLean S", "Paxton S", "Massey R", "Bryan Rodgers"]}, {"title": "How weight change is modelled in population studies can affect research findings: empirical results from a large-scale cohort study", "year": "2014", "source": "BMJ Open, vol. 4, no. 6, pp. e004860-e004860", "authors": ["Paige E", "Korda R", "Banks E", "Bryan Rodgers"]}, {"title": "The impact of child support changes on the financial living standards of separated families in Australia", "year": "2014", "source": "Australian Journal of Family Law, vol. 28, no. 2, pp. 193-232", "authors": ["Vu B", "Bryan Rodgers", "Smyth B"]}, {"title": "Prenotification but not envelope teaser increased response rates in a bulimia nervosa mental health literacy survey: A randomized controlled trial", "year": "2014", "source": "Journal of Clinical Epidemiology, vol. 67, no. 8, pp. 870-876", "authors": ["McLean S", "Paxton S", "Massey R", "Bryan Rodgers"]}, {"title": "Legislating for shared-time parenting after parental separation: Insights from Australia?", "year": "2014", "source": "Law and Contemporary Problems, vol. 77, no. 1, pp. 109-149", "authors": ["Smyth B", "Chisholm R", "Bryan Rodgers"]}, {"title": "", "year": "2013", "source": "Stigma and help-seeking for gambling problems", "authors": ["Carroll A", "Bryan Rodgers", "Davidson T"]}, {"title": "Combining work and family: rewards or risks for children", "year": "2013", "source": "s mental health?'Social Science and Medicine, vol. 87, pp. 99-107", "authors": ["Strazdins L", "O'Brien L", "Lucas N", "Bryan Rodgers"]}, {"title": "Quality of life impairment associated with body dissatisfaction in a general population sample of women", "year": "2013", "source": "BMC Public Health, vol. 13, pp. 920-920", "authors": ["Mond J", "Mitchison D", "Latner J", "Bryan Rodgers"]}, {"title": "Factors associated with variability and stability of cannabis use in young adulthood", "year": "2013", "source": "Drug and Alcohol Dependence, vol. 133, no. 2, pp. 452-458", "authors": ["Silins E", "Hutchinson D", "Swift W", "Bryan Rodgers"]}, {"title": "Quality of life impairment in a community sample of women with eating disorders", "year": "2012", "source": "Australian and New Zealand Journal of Psychiatry, vol. 46, no. 6, pp. 561-568", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "community-based study of enduring eating features in young women", "year": "2012", "source": "Nutrients, vol. 4, no. 5, pp. 413-424", "authors": ["Hay P", "Buettner P", "Mond J", "Bryan Rodgers"]}, {"title": "Is poor mental health a risk factor for retirement? Findings from a longitudinal population survey", "year": "2012", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 47, no. 5, pp. 735-744", "authors": ["Olesen S", "Butterworth P", "Bryan Rodgers"]}, {"title": "Post-separation patterns of children", "year": "2012", "source": "s overnight stays with each parent: A detailed snapshot'Journal of Family Studies, vol. 18, no. 2-3, 202-221", "authors": ["Smyth B", "Bryan Rodgers", "Allen L"]}, {"title": "Psychosocial job adversity and health in Australia: analysis of data from the HILDA Survey", "year": "2011", "source": "Australian and New Zealand Journal of Public Health, vol. 35, no. 6, pp. 564-571", "authors": ["Butterworth P", "Leach L", "Bryan Rodgers"]}, {"title": "Strategic bargaining over child support and parenting time: A critical review of the literature", "year": "2011", "source": "Australian Journal of Family Law, vol. 25, pp. 210-235", "authors": ["Smyth B", "Bryan Rodgers"]}, {"title": "The psychosocial quality of work determines whether employment has benefits for mental health: Results from a longitudinal national household panel survey", "year": "2011", "source": "Occupational and Environmental Medicine, vol. 68, no. 11, pp. 806-812", "authors": ["Butterworth P", "Leach L", "Strazdins L", "Bryan Rodgers"]}, {"title": "BARRIERS TO HELP SEEKING IN YOUNG WOMEN WITH EATING DISORDERS A QUALITATIVE EXPLORATION IN A LONGITUDINAL COMMUNITY SURVEY", "year": "2011", "source": "Eating Disorders, vol. 19, no. 3, pp. 270-285", "authors": ["Evans E", "Hay P", "Mond J", "Bryan Rodgers"]}, {"title": "Mental health impairment associated with eating-disorder features in a community sample of women", "year": "2011", "source": "Journal of Mental Health, vol. 20, no. 5, pp. 445-455", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Parental divorce and adult family, social and psychological outcomes: the contribution of childhood family adversity", "year": "2011", "source": "Social Policy Research Papers, vol. 42, p. 47", "authors": ["Bryan Rodgers", "Gray P", "Davidson T"]}, {"title": "Could better jobs improve mental health? A prospective study of change in work conditions and mental health in mid-aged adults", "year": "2011", "source": "Journal of Epidemiology and Community Health, vol. 65, no. 6, pp. 529-534", "authors": ["Strazdins L", "D'Souza R", "Clements M", "Bryan Rodgers"]}, {"title": "re ecstasy users biased toward endorsing somatic mental health symptoms? Results from a general community sample", "year": "2011", "source": "Psychopharmacology, vol. 214, no. 4, pp. 901-909", "authors": ["George A", "Windsor T", "Bryan Rodgers"]}, {"title": "", "year": "2011", "source": "Profiling Problem Gambling Symptoms in the Australian Capital Territory: Socioeconomic and Demographic Characteristics and Gambling Participation", "authors": ["Davidson T", "Bryan Rodgers"]}, {"title": "", "year": "2011", "source": "Help-seeking and Uptake of Services Amongst People with Gambling Problems in the ACT", "authors": ["Carroll A", "Davidson T", "Marsh D", "Bryan Rodgers"]}, {"title": "Mental health impairment in underweight women: do body dissatisfaction and eating-disordered behavior play a role?", "year": "2011", "source": "BMC Public Health, vol. 11;547, doi:10.1186/1471-2458-11-547", "authors": ["Mond J", "Bryan Rodgers", "Owen C"]}, {"title": "Pathways to social inclusion: considering the relationship between unemployment", "year": "2010", "source": "job quality and personal disadvantage", "authors": ["Leach L", "Butterworth P", "Bryan Rodgers"]}, {"title": "Survey of the Nature and Extent of Gambling", "year": "2010", "source": "and Problem Gamblingin the Australian Capital Territory", "authors": ["Davidson T", "Bryan Rodgers"]}, {"title": "Deriving an evidence-based measure of job quality from the HILDA survey", "year": "2010", "source": "Australian Social Policy, vol. 9, pp. 67-86", "authors": ["Leach L", "Butterworth P", "Bryan Rodgers"]}, {"title": "Objective and subjective bulimic episodes in the classification of bulimic-type eating disorders: Another nail in the coffin of a problematic distinction", "year": "2010", "source": "Behaviour Research and Therapy, vol. 48, no. 7, pp. 661-669", "authors": ["Mond J", "Latner J", "Hay P", "Bryan Rodgers"]}, {"title": "Factors that explain the poorer mental health of caregivers: Results from a community survey of older Australians", "year": "2010", "source": "Australian and New Zealand Journal of Psychiatry, vol. 44, no. 7, pp. 616-624", "authors": ["Butterworth P", "Pymont C", "Bryan Rodgers"]}, {"title": "Quality of life, course and predictors of outcomes in community women with EDNOS and common eating disorders", "year": "2010", "source": "European Eating Disorders Review, vol. 18, no. 4, pp. 281-295", "authors": ["Hay P", "Buttner P", "Mond J", "Bryan Rodgers"]}, {"title": "The limitations of employment as a tool for social inclusion", "year": "2010", "source": "BMC Public Health, vol. 10, no. 621, pp. 1-13", "authors": ["Leach L", "Butterworth P", "Strazdins L", "Bryan Rodgers"]}, {"title": "Eating disorders", "year": "2010", "source": "mental health literacy' in low riskhigh risk and symptomatic women: Implications for health promotion programs', Eating Disorders, vol. 18, no. 4, pp. 267-285", "authors": ["Mond J", "Hay P", "Paxton S", "Bryan Rodgers"]}, {"title": "Psychological distress in non-drinkers: Associations with previous heavy drinking and curent social relationships", "year": "2010", "source": ". Alcohol and Alcoholism. 4595-102", "authors": ["Bryan Rodgers"]}, {"title": "", "year": "2009", "source": "Social participation as a strategy to improve mental health: A systematic review of peer-reviewed controlled trials and discussion of key issues for future research and interventions", "authors": ["Olesen S", "Butterworth P", "Bryan Rodgers"]}, {"title": "", "year": "2008", "source": "The stress and burden of caregiving: Improving our understanding of how to promote better mental health and wellbeing", "authors": ["Pymont C", "Butterworth P", "Windsor T", "Bryan Rodgers"]}, {"title": "", "year": "2008", "source": "Family relationships and Mental Illness: Impacts and service responses - Resource Sheet", "authors": ["Robinson E", "Bryan Rodgers", "Butterworth P"]}, {"title": "Contemporary Australian archetypes: different people", "year": "2008", "source": "different needs", "authors": ["Berry H", "Butterworth P", "Davidson T", "Bryan Rodgers"]}, {"title": "Is psychological distress in people living with cancer related to the fact of diagnosis, current treatment or level of disability? Findings from a larger Australian study", "year": "2010", "source": "Medical Journal of Australia, vol. 193, no. 5, pp. S62-S67", "authors": ["Banks E", "Byles J", "Gibson R", "Bryan Rodgers"]}, {"title": "Financial hardship, socio-economic position and depression: results from the PATH Through Life Survey", "year": "2009", "source": "Social Science and Medicine, vol. 69, pp. 229-237", "authors": ["Butterworth P", "Bryan Rodgers", "Windsor T"]}, {"title": "Women with bulimic eating disorders: When do they receive treatment for an eating problem?", "year": "2009", "source": "Journal of Consulting and Clinical Psychology, vol. 77, no. 5, pp. 835-844", "authors": ["Mond J", "Hay P", "Darby A", "Bryan Rodgers"]}, {"title": "Comparing the Health Burden of Eating-Disordered Behavior and Overweight in Women", "year": "2009", "source": "Journal of Women's Health, vol. 18, no. 7, pp. 1-9", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Measuring gambling participation", "year": "2009", "source": ". Addiction. 1041065-1069.", "authors": ["Bryan Rodgers"]}, {"title": "Mental health problems and marital disruption: Is it the combination of husbands and wives", "year": "2008", "source": "mental health problems that predicts later divorce?'Social Psychiatry and Psychiatric Epidemiology, vol. 43, pp. 758-763", "authors": ["Butterworth P", "Bryan Rodgers"]}, {"title": "Screening for eating disorders in primary care: EDE-Q versus SCOFF", "year": "2008", "source": "Behaviour Research and Therapy, vol. 46, pp. 612-622", "authors": ["Mond J", "Myers T", "Crosby R", "Bryan Rodgers"]}, {"title": "Behavioral approach and behavioral inhibition as moderators of the association between negative life events and perceived control in midlife", "year": "2008", "source": "Personality and Individual Differences, vol. 44, pp. 1080-1092", "authors": ["Windsor T", "Anstey K", "Butterworth P", "Bryan Rodgers"]}, {"title": "Mental Health Literacy and eating disorders: What do women with bulimic eating disorders think and know about bulimia nervosa and its treatment?", "year": "2008", "source": "Journal of Mental Health, vol. 17, no. 6, pp. 565-575", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Family relationships and Mental Illness: Impacts and service responses", "year": "2008", "source": "AFRC Briefing, vol. 4, p. 19", "authors": ["Robinson E", "Bryan Rodgers", "Butterworth P"]}, {"title": "Factors associated with relationship dissolution of Australian families with children", "year": "2008", "source": "Commonwealth Department of FamiliesCommunity Services and Indigenous Affairs, Australia", "authors": ["Butterworth P", "Oz T", "Bryan Rodgers"]}, {"title": "Volunteering and psychological Wellbeing among young-old adults: How much is too much?", "year": "2008", "source": "Gerontologist, The, vol. 48, no. 1, pp. 59-70", "authors": ["Windsor T", "Anstey K", "Bryan Rodgers"]}, {"title": "Mental health literacy and eating-disordered behavior: Beliefs of adolescent girls concerning the treatment of and treatment-seeking for bulimia nervosa", "year": "2007", "source": "Journal of Youth and Adolescence, vol. 36, no. 6, pp. 753-762", "authors": ["Mond J", "Marks P", "Hay P", "Bryan Rodgers"]}, {"title": "Disordered eating behaviours and cognitions in young women with obesity: relationship with psychological status", "year": "2007", "source": "International Journal of Obesity, vol. 31, no. 5, pp. 876-882", "authors": ["Darby A", "Hay P", "Mond J", "Bryan Rodgers"]}, {"title": "Retirement and the sense of control in young-old adults: the mediating role of engagement in goal-directed activities", "year": "2007", "source": "Hallym International Journal Of Aging, vol. 9, no. 1, pp. 17-29", "authors": ["Windsor T", "Bryan Rodgers", "Butterworth P"]}, {"title": "Life-course influences on health in British adults: effects of socio-economic position in childhood and adulthood.", "year": "2007", "source": "International Journal of Epidemiology, vol. 36, no. 3, pp. 532-539", "authors": ["Power C", "Atherton K", "Strachan D", "Bryan Rodgers"]}, {"title": "Lifecourse influences on health among British adults: Effects of region of residence in childhood and adulthood.", "year": "2007", "source": "International Journal of Epidemiology, vol. 36, no. 3, pp. 522-531", "authors": ["Strachan D", "Rudnicka A", "Power C", "Bryan Rodgers"]}, {"title": "Obesity and Impairment in Psychosocial Functioning in Women: The Mediating Role of Eating Disorder Features", "year": "2007", "source": "Obesity, vol. 15, no. 11, pp. 2769-2779", "authors": ["Mond J", "Bryan Rodgers", "Hay P"]}, {"title": "Self-Report Versus Interview Assessment of Purging in a Community Sample of Women.", "year": "2007", "source": "European Eating Disorders Review, vol. 15, pp. 403-409", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "What are the effects of providing evidence-based information on eating disorders and their treatments? A randomized controlled trial in a symptomatic community sample", "year": "2007", "source": "Early Intervention in Psychiatry, vol. 1, no. 4, pp. 316-324", "authors": ["Hay P", "Mond J", "Paxton S", "Bryan Rodgers"]}, {"title": "ffective disorders, anxiety disorders and psychological distress in non-drinkers", "year": "2007", "source": "Journal of Affective Disorders, vol. 99, no. 1-3, pp. 165-72", "authors": ["Bryan Rodgers", "Parslow R", "Degenhardt L"]}, {"title": "Mental health problems among single and partnered mothers: The role of financial hardship and social support", "year": "2007", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 42, no. 1, pp. 6-13", "authors": ["Crosier T", "Butterworth P", "Bryan Rodgers"]}, {"title": "Validity of the mental health component scale of the 12-item Short-Form Health Survey (MCS-12) as measure of common mental disorders in the general population", "year": "2007", "source": "Psychiatry Research, vol. 152, no. 1, pp. 63-71", "authors": ["Olesen S", "Butterworth P", "Bryan Rodgers"]}, {"title": "Health Service Utilization for Eating Disorders: Findings From a Community-Based Study", "year": "2007", "source": "International Journal of Eating Disorders, vol. 40, no. 5, pp. 399-408", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Preliminary development and validation of an Australian community participation questionnaire: Types of participation and associations with distress in a coastal community", "year": "2007", "source": "Social Science and Medicine, vol. 64, no. 8, pp. 1719-1737", "authors": ["Berry H", "Bryan Rodgers", "Dear K"]}, {"title": "His retirement or Hers? Retirement and wellbeing within families", "year": "2007", "source": "Department  Family &Community Services", "authors": ["Butterworth P", "Bryan Rodgers"]}, {"title": "Concordance in the mental health of spouses: analysis of a large national household panel survey", "year": "2006", "source": "Psychological Medicine, vol. 36, pp. 685-697", "authors": ["Butterworth P", "Bryan Rodgers"]}, {"title": "Mental Health and the timing of men", "year": "2006", "source": "s retirement'Social Psychiatry and Psychiatric Epidemiology, vol. 41, no. 7, pp. 515-522", "authors": ["Olesen S", "Butterworth P", "Bryan Rodgers"]}, {"title": "Eating Disorder Examination Questionnaire (EDE-Q):Norms for young adult women", "year": "2006", "source": "Behaviour Research and Therapy, vol. 44, no. 1, pp. 53-62", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Childhood adversity and adult personality", "year": "2006", "source": "Australian and New Zealand Journal of Psychiatry, vol. 40, no. 5, pp. 482-490", "authors": ["Rosenman S", "Bryan Rodgers"]}, {"title": "The Lesser Evil: Bad jobs or unemployment? A survey of Mid-aged Australians", "year": "2006", "source": "Social Science and Medicine, vol. 63, no. 3, pp. 575-586", "authors": ["Broom D", "D'Souza R", "Strazdins L", "Bryan Rodgers"]}, {"title": "Examining geographic and household variation in mental Health in Australia", "year": "2006", "source": "Australian and New Zealand Journal of Psychiatry, vol. 40, no. 5, pp. 491-497", "authors": ["Butterworth P", "Bryan Rodgers", "Jorm A"]}, {"title": "Measuring Physical and Mental Health using the SF-12 : Implications for community surveys of mental health", "year": "2006", "source": "Australian and New Zealand Journal of Public Health, vol. 40, pp. 797-803", "authors": ["Windsor T", "Bryan Rodgers", "Butterworth P"]}, {"title": "Retirement and mental health: Analysis of the Australiannational survey of mental health and well-being", "year": "2006", "source": "Social Science and Medicine, vol. 62, pp. 1179-1191", "authors": ["Butterworth P", "Olesen S", "Bryan Rodgers"]}, {"title": "dolescents", "year": "2006", "source": "responses to peers with depression or conduct disorder'Australian and New Zealand Journal of Psychiatry, vol. 40, no. 1, pp. 63-66", "authors": ["Kelly C", "Bryan Rodgers", "Jorm A"]}, {"title": "Weekly alcohol consumption, brain atrophy, and white matter hyperintensities in a community-based sample aged 60 to 64 years", "year": "2006", "source": "Psychosomatic Medicine, vol. 68, no. 05, pp. 778-785", "authors": ["Anstey K", "Jorm A", "Meslin C", "Bryan Rodgers"]}, {"title": "Work demands, job insecurity and sickness absence from work: How productive is the new, flexible labour force?", "year": "2006", "source": "Australian and New Zealand Journal of Public Health, vol. 30, no. 3, pp. 205-212", "authors": ["D'Souza R", "Strazdins L", "Broom D", "Bryan Rodgers"]}, {"title": "Hormone replacement therapy and cognition in an Australian representative sample aged 60-64", "year": "2006", "source": "Maturitas, vol. 54, pp. 86-94", "authors": ["Low L", "Anstey K", "Jorm A", "Bryan Rodgers"]}, {"title": "Self-recognition of disordered eating among women with buimic-type eating disorders: a commmunity-based study", "year": "2006", "source": "International Journal of Eating Disorders, vol. 39, no. 8, pp. 747-753", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Correlates of the use of purging and non-purgingmethods of weight control in a community sampleof women", "year": "2006", "source": "Australian and New Zealand Journal of Psychiatry, vol. 40, no. 2, pp. 136-142", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "n Update on the Definition of \"Excessive Exercise\"in Eating Disorders Research", "year": "2006", "source": "International Journal of Eating Disorders, vol. 39, no. 2, pp. 147-153", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Use of Extreme Weight Control Behaviors with andwithout Binge Eating in a Community Sample:Implications for the Classification of Bulimic-TypeEating Disorders", "year": "2006", "source": "International Journal of Eating Disorders, vol. 39, no. 4, pp. 294-302", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Correlates of Self-Induced Vomiting and Laxative Misuse in a Community Sample of Women", "year": "2006", "source": "Journal of Nervous and Mental Disease, vol. 194, no. 1, pp. 40-46", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Recurrent binge eating with and without the \"undue influence of weight or shape on self-evaluation\": Implications for the diagnosis of binge eating disorder", "year": "2006", "source": "Behaviour Research and Therapy, vol. 45, no. 5, pp. 929-38", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Lower cognitive test scores observed in alcohol abstainers are associated with demographic, personality, and biological factors: PATH Through Life Project", "year": "2005", "source": "Addiction, vol. 100, no. 9, pp. 1291-1301", "authors": ["Anstey K", "Windsor T", "Bryan Rodgers"]}, {"title": "Non-linear relationships between cognitive function and alcohol consumption in young, middle-aged and older adults: PATH Through Life Project", "year": "2005", "source": "Addiction, vol. 100, no. 9, pp. 1203-1388", "authors": ["Bryan Rodgers", "Windsor T", "Anstey K"]}, {"title": "ge group differences in psychological distress: the role of psychosocial risk factors that vary with age.", "year": "2005", "source": "Psychological Medicine, vol. 35, pp. 1253-1263", "authors": ["Jorm A", "Windsor T", "Dear K", "Bryan Rodgers"]}, {"title": "Reproductive period and cognitive function in a representative sample of naturally postmenapausal women aged 60- 64 years", "year": "2005", "source": "Climacteric, vol. 8, pp. 380-389", "authors": ["Low L", "Anstey K", "Jorm A", "Bryan Rodgers"]}, {"title": "Pet Ownership and Health in Older Adults: Findings from a Survey of 2551 Community Based Australians Aged 60- 64", "year": "2005", "source": "Gerontology, vol. 51, pp. 40-47", "authors": ["Parslow R", "Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "ssessing quality of life in eating disorder patients", "year": "2005", "source": "Quality of Life Research, vol. 14, pp. 171-178", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "The Health Effects of jobs: Status, working conditions, or both?", "year": "2005", "source": "Australian and New Zealand Journal of Public Health, vol. 29, no. 3, pp. 222-228", "authors": ["D'Souza R", "Strazdins L", "Clements M", "Bryan Rodgers"]}, {"title": "The associations between work stress and mental health: A comparison of organizationally employed and self- employed workers", "year": "2004", "source": "Work and Stress, vol. 18, no. 3, pp. 231-244", "authors": ["Parslow R", "Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "Mental health and the family law system", "year": "2004", "source": "Journal of Family Studies, vol. 10, no. 1, pp. 50-70", "authors": ["Bryan Rodgers", "Smyth B", "Robinson E"]}, {"title": "Mode of Delivery, but not questionnaire length, affected response in an epidemiological study of eating-disordered behavior", "year": "2004", "source": "Journal of Clinical Epidemiology, vol. 57, no. 11, pp. 1167-1171", "authors": ["Mond J", "Bryan Rodgers", "Hay P"]}, {"title": "Population survey found an association between self-reports of traumatic brain injury and increased psychiatric symptoms", "year": "2004", "source": "Journal of Clinical Epidemiology, vol. 57, no. 11, pp. 1202-1209", "authors": ["Anstey K", "Butterworth P", "Jorm A", "Bryan Rodgers"]}, {"title": "Temporal Stability of the Eating Disorder Examination Questionnaire", "year": "2004", "source": "International Journal of Eating Disorders, vol. 36, no. 2, pp. 195-203", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "ssociation of Adverse Childhood Experiences, Age of Menarche, and Adult Reproductive Behavior: Does the Androgen Receptor Gene Play a Role?", "year": "2004", "source": "American Journal of Medical Genetics, Part A, vol. 125B, pp. 105-111", "authors": ["Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "Use of medical services after participation in a community-based epidemiological health survey", "year": "2004", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 39, pp. 311-317", "authors": ["Parslow R", "Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "ctions taken to cope with depression at different levels of severity: a community survey", "year": "2004", "source": "Psychological Medicine, vol. 34, pp. 293-299", "authors": ["Jorm A", "Griffiths K", "Christensen H", "Bryan Rodgers"]}, {"title": "n examination of seasonality experienced by Australians living in a continental temperate climate zone", "year": "2004", "source": "Journal of Affective Disorders, vol. 80, pp. 181-190", "authors": ["Parslow R", "Jorm A", "Butterworth P", "Bryan Rodgers"]}, {"title": "Use of medications to enhance memory in a large community sample of 60-64 year olds", "year": "2004", "source": "International Psychogeriatrics, vol. 16, no. 2, pp. 209-217", "authors": ["Jorm A", "Bryan Rodgers", "Christensen H"]}, {"title": "Gender differences in cognitive abilities: The mediating role of health state and health habits", "year": "2004", "source": "Intelligence, vol. 32, pp. 7-23", "authors": ["Jorm A", "Anstey K", "Christensen H", "Bryan Rodgers"]}, {"title": "community survey demonstrated cohort differences in the lifetime prevalance of self- reportrd head injury", "year": "2004", "source": "Journal of Clinical Epidemiology, vol. 57, pp. 742-748", "authors": ["Butterworth P", "Anstey K", "Jorm A", "Bryan Rodgers"]}, {"title": "ssociation of Pulmonary Function with Cognitive Performance in Early, Middle and Late Adulthood", "year": "2004", "source": "Gerontology, vol. 50, pp. 230-234", "authors": ["Anstey K", "Windsor T", "Jorm A", "Bryan Rodgers"]}, {"title": "Beliefs of Women concerning the severity and prevalance of bulimia nervosa", "year": "2004", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 39, pp. 299-304", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Beliefs of women concerning causes and risk factors for bulimia nervosa", "year": "2004", "source": "Australian and New Zealand Journal of Psychiatry, vol. 38, pp. 463-469", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Mental Health Problems, Disability and Income Support Receipt: A Replication and Extension Using the HILDA Survey", "year": "2004", "source": "Australian Journal of Labour Economics, vol. 7, no. 2, pp. 151-174", "authors": ["Butterworth P", "Crosier T", "Bryan Rodgers"]}, {"title": "Nonresponse Bias in a General Population Survey of Eating-Disordered Behaviour", "year": "2004", "source": "International Journal of Eating Disorders, vol. 36, pp. 89-98", "authors": ["Mond J", "Bryan Rodgers", "Hay P"]}, {"title": "Effectiveness of complementary and self-help treatments for anxiety disorders", "year": "2004", "source": "Medical Journal of Australia, vol. 181, no. 7, pp. S29-S46", "authors": ["Jorm A", "Christensen H", "Griffiths K", "Bryan Rodgers"]}, {"title": "Gender differences in factors affecting use of health services: an analysis of a community study of middle-aged and older Australians", "year": "2004", "source": "Social Science and Medicine, vol. 59, pp. 2121-2129", "authors": ["Parslow R", "Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "Disability associated with community cases of commonly occurring eating disorders", "year": "2004", "source": "Australian and New Zealand Journal of Public Health, vol. 28, no. 3, pp. 246-251", "authors": ["Mond J", "Bryan Rodgers", "Hay P"]}, {"title": "Beliefs of the Public Concerning the Helpfulness of Interventions for Bulimia Nervosa", "year": "2004", "source": "International Journal of Eating Disorders, vol. 36, pp. 62-68", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Mental Health and the Family Law System", "year": "2004", "source": "Journal of Family Studies, vol. 10, no. 1, pp. 50-70", "authors": ["Bryan Rodgers", "Smyth B", "Robinson E"]}, {"title": "Relationships Between Exercise Behaviour, Eating-Disordered Behaviour and Quality of Life in a Community Sample of Women: When is excercise Excessive", "year": "2004", "source": "European Eating Disorders Review, vol. 12, pp. 265-272", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Childhood adversity in an Australian population", "year": "2004", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 39, no. 9, pp. 695-702", "authors": ["Rosenman S", "Bryan Rodgers"]}, {"title": "Validity of the Eating Disorder Examination Questionnaire (EDE-Q) in screening for eating disorders in community samples", "year": "2004", "source": "Behaviour Research and Therapy, vol. 42, no. 5, pp. 551-567", "authors": ["Mond J", "Hay P", "Bryan Rodgers"]}, {"title": "Job Strain, Job Insecurity, and Health: Rethinking the Relationship", "year": "2004", "source": "Journal of Occupational health Psychology, vol. 9, no. 4, pp. 296-305", "authors": ["Strazdins L", "D'Souza R", "Lim L", "Bryan Rodgers"]}, {"title": "Interaction between mothers and fathers affection as a risk factor for anxiety and depression symptoms. Evidence for increased risk in adults who rate their father as having been more affectionate than their mother", "year": "2003", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 38, pp. 173-179", "authors": ["Jorm A", "Dear K", "Bryan Rodgers"]}, {"title": "Cohort Differences in Sexual Orientation: Results from a Large Age-Statified Population Sample", "year": "2003", "source": "Gerontology, vol. 49, pp. 392-395", "authors": ["Jorm A", "Dear K", "Bryan Rodgers"]}, {"title": "Providing information about the effectiveness of treatment options to depressed people in the community: a randomized controlled trial of effects on mental health literacy, help-seeking and symptoms.", "year": "2003", "source": "Psychological Medicine, vol. 33, pp. 1071-1079", "authors": ["Jorm A", "Griffiths K", "Christensen H", "Bryan Rodgers"]}, {"title": "Trust and distress in three generations of rural Australians", "year": "2003", "source": "Australasian Psychiatry, vol. 11, no. S, pp. 131-137", "authors": ["Berry H", "Bryan Rodgers"]}, {"title": "ssociation of obesity with anxiety, depression and emotional well being:a community survey", "year": "2003", "source": "Australian and New Zealand Journal of Public Health, vol. 27, no. 4, pp. 434-440", "authors": ["Jorm A", "Korten A", "Christensen H", "Bryan Rodgers"]}, {"title": "Work and health in a contemporary society: demands, control, and insecurity", "year": "2003", "source": "Journal of Epidemiology and Community Health, vol. 57, pp. 849-854", "authors": ["D'Souza R", "Strazdins L", "Lim L", "Bryan Rodgers"]}, {"title": "ccuracy of retrospective reports of infections during pregnancy", "year": "2002", "source": "International Journal of Methods in Psychiatric Research, vol. 11, no. 4, pp. 184-186", "authors": ["Voldsgaard P", "Schiffman J", "Mednick S", "Bryan Rodgers"]}, {"title": "Commentary on", "year": "2002", "source": "Depression and psychological distress: a life course perspective''in Diana Kuh and Rebecca Hardy (ed.), A life course approach to women's health, Oxford University Press, New York, pp. 171-172", "authors": ["Bryan Rodgers"]}, {"title": "Lifetime risk factors for women", "year": "2002", "source": "s psychological distress in midlife'Social Science and Medicine, vol. 55, pp. 1957-1973", "authors": ["Kuh D", "Hardy R", "Bryan Rodgers"]}, {"title": "Effectiveness of complementary and self-help treatments for depression", "year": "2002", "source": "Medical Journal of Australia, vol. 176, pp. S84-S96", "authors": ["Jorm A", "Christensen H", "Griffiths K", "Bryan Rodgers"]}, {"title": "Sexual orientation and mental health: results from a community survey of young and middle-aged adults", "year": "2002", "source": "British Journal of Psychiatry, vol. 180, pp. 423-427", "authors": ["Jorm A", "Korten A", "Bryan Rodgers"]}, {"title": "Introducing the Longitudinal Study of Australian Children: LSAC DISCUSSION PAPER N0.1", "year": "2002", "source": "Australian Institute of Family StudiesMelbourne Australia", "authors": ["Sanson A", "Nicholson J", "Ungerer J", "Bryan Rodgers"]}, {"title": "Help for depression: What works (and what doesn", "year": "2001", "source": "t)Australian National University, Canberra", "authors": ["Jorm A", "Christensen H", "Griffiths K", "Bryan Rodgers"]}, {"title": "Children and Changing Families: Life After Parental Separation", "year": "2001", "source": "Blackwell Publishing LtdOxford", "authors": ["Pryor J", "Bryan Rodgers"]}, {"title": "Non-linear relationships in associations of depression and anxiety with alcohol use", "year": "2000", "source": "Psychological Medicine, vol. 30, pp. 421-432", "authors": ["Bryan Rodgers", "Korten A", "Jorm A"]}, {"title": "COMT and DRD3 polymorphisms, environmental exposures, and personality traits related to common mental disorders", "year": "2000", "source": "American Journal of Medical Genetics, Part A, vol. 96, pp. 102-107", "authors": ["Henderson A", "Jorm A", "Christensen H", "Bryan Rodgers"]}, {"title": "Risk factors for depression and anxiety in abstainers, moderate drinkers and heavy drinkers", "year": "2000", "source": "Addiction, vol. 95, pp. 1833-1845", "authors": ["Bryan Rodgers", "Korten A", "Jorm A"]}, {"title": "Factors associated with informant-rated personality problems in an elderly population", "year": "2000", "source": "Aging and Mental Health, vol. 4, pp. 36-42", "authors": ["Jacomb P", "Jorm A", "Korten A", "Bryan Rodgers"]}, {"title": "Predicting anxiety and depression from personality: is there a synergistic effect of neuroticism and extraverson?", "year": "2000", "source": "Journal of Abnormal Psychology, vol. 109, pp. 145-149", "authors": ["Jorm A", "Christensen H", "Henderson A", "Bryan Rodgers"]}, {"title": "Public belief systems about the helpfulness of interventions for depression: associations with history of depression and professional help-seeking", "year": "2000", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 35, pp. 211-219", "authors": ["Jorm A", "Christensen H", "Medway J", "Bryan Rodgers"]}, {"title": "ssociation of smoking and personality with a polymorphism of the dopamine transporter gene: results from a community survey", "year": "2000", "source": "American Journal of Medical Genetics, Part A, vol. 96, pp. 331-334", "authors": ["Jorm A", "Henderson A", "Jacomb P", "Bryan Rodgers"]}, {"title": "ssociation of a functional polymorphism of the monoamine oxdiase A gene promoter with personality and psychiatric symptoms", "year": "2000", "source": "Psychiatric Genetics, vol. 10, pp. 87-90", "authors": ["Jorm A", "Henderson A", "Jacomb P", "Bryan Rodgers"]}, {"title": "ttitudes towards people with depression: effects on the publics help-seeking and outcome when experiencing common psychiatric symptoms", "year": "2000", "source": "Australian and New Zealand Journal of Psychiatry, vol. 34, pp. 612-618", "authors": ["Jorm A", "Medway J", "Christensen H", "Bryan Rodgers"]}, {"title": "Public beliefs about the helpfulness of interventions for depression: effects on actions taken when experiencing anxiety and depression symptoms", "year": "2000", "source": "Australian and New Zealand Journal of Psychiatry, vol. 34, pp. 619-626", "authors": ["Jorm A", "Medway J", "Christensen H", "Bryan Rodgers"]}, {"title": "re changes in sensory disability, reaction time and grip strength associated with changes in memory and crystallized intelligence? A longitudinal analysis in an elderly community sample", "year": "2000", "source": "Gerontology, vol. 46, pp. 276-292", "authors": ["Christensen H", "Korten A", "MacKinnon A", "Bryan Rodgers"]}]}, "Microsoft-Academic": [{"title": "mental health literacy a survey of the public s ability to recognise mental disorders and their beliefs about the effectiveness of treatment", "year": 1997, "source": "the medical journal of australia", "authors": [{"name": "anthony f jorm", "affiliation": "australian national university"}, {"name": "a e korten", "affiliation": "australian national university"}, {"name": "p a jacomb", "affiliation": "australian national university"}, {"name": "helen christensen", "affiliation": "australian national university"}, {"name": "bryan rodgers", "affiliation": "australian national university"}, {"name": "penelope pollitt", "affiliation": "australian national university"}], "id": 13978405}, {"title": "validity of the eating disorder examination questionnaire ede q in screening for eating disorders in community samples", "year": 2004, "source": "behaviour research and therapy", "authors": [{"name": "jonathan mond", "affiliation": "canberra hospital"}, {"name": "phillipa hay", "affiliation": "university of adelaide"}, {"name": "bryan rodgers", "affiliation": "australian national university"}, {"name": "cathy owen", "affiliation": "canberra hospital"}, {"name": "pierre j v beumont", "affiliation": "university of sydney"}], "id": 186589312}, {"title": "eating disorder examination questionnaire ede q norms for young adult women", "year": 2006, "source": "behaviour research and therapy", "authors": [{"name": "jonathan mond"}, {"name": "phillipa hay", "affiliation": "james cook university"}, {"name": "bryan rodgers", "affiliation": "australian national university"}, {"name": "cathy owen", "affiliation": "australian national university"}], "id": 186589312}, {"title": "child developmental risk factors for adult schizophrenia in the british 1946 birth cohort", "year": 1994, "source": "the lancet", "authors": [{"name": "peter jones"}, {"name": "bryan rodgers", "affiliation": "university college london"}, {"name": "robin m murray"}, {"name": "michael marmot", "affiliation": "university college london"}], "id": 49861241}, {"title": "cohort profile the path through life project", "year": 2012, "source": "international journal of epidemiology", "authors": [{"name": "kaarin j anstey", "affiliation": "australian national university"}, {"name": "helen christensen", "affiliation": "australian national university"}, {"name": "peter butterworth", "affiliation": "australian national university"}, {"name": "simon easteal", "affiliation": "australian national university"}, {"name": "andrew mackinnon", "affiliation": "australian national university"}, {"name": "trish jacomb", "affiliation": "australian national university"}, {"name": "karen maxwell", "affiliation": "australian national university"}, {"name": "bryan rodgers", "affiliation": "australian national university"}, {"name": "tim d windsor", "affiliation": "australian national university"}, {"name": "nicolas cherbuin", "affiliation": "australian national university"}, {"name": "anthony f jorm", "affiliation": "australian national university"}], "id": 13389975}, {"title": "the psychosocial quality of work determines whether employment has benefits for mental health results from a longitudinal national household panel survey", "year": 2011, "source": "occupational and environmental medicine", "authors": [{"name": "peter butterworth", "affiliation": "australian national university"}, {"name": "liana s leach"}, {"name": "lyndall strazdins"}, {"name": "sarah c olesen"}, {"name": "bryan rodgers"}, {"name": "dorothy broom"}], "id": 159252376}, {"title": "sexual orientation and mental health results from a community survey of young and middle aged adults", "year": 2002, "source": "british journal of psychiatry", "authors": [{"name": "anthony f jorm", "affiliation": "australian national university"}, {"name": "a e korten"}, {"name": "bryan rodgers"}, {"name": "p a jacomb"}, {"name": "helen christensen"}], "id": 127936299}, {"title": "helpfulness of interventions for mental disorders beliefs of health professionals compared with the general public", "year": 1997, "source": "british journal of psychiatry", "authors": [{"name": "anthony f jorm", "affiliation": "australian national university"}, {"name": "a e korten"}, {"name": "p a jacomb"}, {"name": "bryan rodgers"}, {"name": "penelope pollitt"}, {"name": "helen christensen"}, {"name": "scott henderson"}], "id": 127936299}, {"title": "financial hardship socio economic position and depression results from the path through life survey", "year": 2009, "source": "social science & medicine", "authors": [{"name": "peter butterworth", "affiliation": "australian national university"}, {"name": "bryan rodgers", "affiliation": "australian national university"}, {"name": "tim d windsor", "affiliation": "australian national university"}], "id": 106822843}, {"title": "a short form of the positive and negative affect schedule evaluation of factorial validity and invariance across demographic variables in a community sample", "year": 1999, "source": "personality and individual differences", "authors": [{"name": "andrew mackinnon", "affiliation": "monash university"}, {"name": "anthony f jorm", "affiliation": "australian national university"}, {"name": "helen christensen", "affiliation": "australian national university"}, {"name": "a e korten", "affiliation": "australian national university"}, {"name": "p a jacomb", "affiliation": "australian national university"}, {"name": "bryan rodgers", "affiliation": "australian national university"}], "id": 151331055}], "ANDS-Grants": [{"title": "Research Fellowship - Grant ID:366758", "id": "114451", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/366758", "researchers": ["Prof Bryan Rodgers"], "description": null, "status": "closed", "fundingAmount": 357250, "fundingScheme": "NHMRC Research Fellowships", "startDate": 2006, "endDate": 2008, "dateTimeModified": "2015-04-12T07:51:52Z", "dateTimeCreated": "2013-05-15T07:27:41Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Bryan Rodgers"], "purl": "http://purl.org/au-research/grants/nhmrc/366758", "identifiers": ["http://purl.org/au-research/grants/nhmrc/366758", "366758"], "subjects": ["PUBLIC HEALTH AND HEALTH SERVICES", "MEDICAL AND HEALTH SCIENCES", "Women's health"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/114451"}]}, {"title": "Centre for mental health research - Unit Grant", "id": "112720", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/148948", "researchers": ["Prof Bryan Rodgers"], "description": null, "status": "closed", "fundingAmount": 524511.5, "fundingScheme": "NHMRC Research Fellowships", "startDate": 2001, "endDate": 2005, "dateTimeModified": "2017-07-10T03:55:16Z", "dateTimeCreated": "2013-05-15T07:23:59Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Bryan Rodgers"], "purl": "http://purl.org/au-research/grants/nhmrc/148948", "identifiers": ["http://purl.org/au-research/grants/nhmrc/148948", "148948"], "subjects": ["MEDICAL AND HEALTH SCIENCES", "N/A"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/112720"}]}, {"description": "My background is in psychology and epidemiology and I study lifecourse factors related to common mental health problems, including: depression, anxiety, substance use, eating-disordered behaviour, and gambling. My aims are to use research findings to (1)", "title": "Uncoupled Research Fellowship", "id": "115345", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/471429", "researchers": ["Prof Bryan Rodgers"], "status": "closed", "fundingAmount": 842443.25, "fundingScheme": "NHMRC Research Fellowships", "startDate": 2008, "endDate": 2014, "dateTimeModified": "2017-07-17T04:48:38Z", "dateTimeCreated": "2013-05-15T07:29:31Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Bryan Rodgers"], "purl": "http://purl.org/au-research/grants/nhmrc/471429", "identifiers": ["http://purl.org/au-research/grants/nhmrc/471429", "471429"], "subjects": ["321204", "Family needs and support", "Mental health", "Prevention", "Risk factors", "Substance abuse"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/115345"}]}, {"title": "Epidemiology of high prevalence mental disorders: Aetiology, course & public health intervention", "id": "99553", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/179805", "researchers": ["Prof Anthony Jorm", "Prof Kaarin Anstey", "Prof Bryan Rodgers", "Prof Keith Dear", "Prof Simon Easteal", "Prof Helen Christensen"], "description": null, "status": "closed", "fundingAmount": 8008989, "fundingScheme": "Programs", "startDate": 2002, "endDate": 2006, "dateTimeModified": "2017-07-10T03:55:27Z", "dateTimeCreated": "2013-05-15T06:56:20Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Anthony Jorm"], "purl": "http://purl.org/au-research/grants/nhmrc/179805", "identifiers": ["http://purl.org/au-research/grants/nhmrc/179805", "179805"], "subjects": ["321204", "anxiety", "cognitive impairment", "depression", "longitudinal study", "subtance abuse"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/99553"}]}]}