{"ANU": {"name": "Camille Goodman", "link": "https://researchers.anu.edu.au/researchers/goodman-c", "colleges": "ANU College of Law", "email": "camille.goodman@anu.edu.au", "phone": "0411 771 620", "expertise": [], "interest": ["Public international law, law of the sea, international fisheries law, public policy"], "biography": "In 2020, Camille has been appointed as a Visiting Fellow at the ANU Centre for International and Public Law, where she will pursue her research interests in the international law of the sea. Camille is an active member of the Australian and New Zealand Society of International Law (ANZSIL) (https://www.anzsil.org.au/). She serves as a member of the ANZSIL Council, and is Co-Chair of the Oceans and International Environmental Law Interest Group.", "project": [], "publication": [{"title": "Rights, Obligations, Prohibitions: A Practical Guide to Understanding Judicial Decisions on Coastal State Jurisdiction over Living Resources in the Exclusive Economic Zone", "year": "2018", "source": "The International Journal of Marine and Coastal Law, vol. 33, no. 3, pp. 558-584", "authors": ["Camille Goodman"]}, {"title": "Law Beyond Boundaries: innovative mechanisms for the integrated management of biodiversity beyond national jurisdiction Introduction", "year": "2018", "source": "ICES Journal of Marine Science, vol. 75, no. 1, pp. 402-404pp", "authors": ["Camille Goodman", "Matley H"]}, {"title": "ustralian Jurisdiction and International Law", "year": "2017", "source": "in Donald R Rothwell & Emily Crawford (ed.), International Law in Australia, Thomson Reuters (Professional) Australia Limited, Sydney: Pyrmont, N.S.W., pp. 71-94pp", "authors": ["Camille Goodman", "Rothwell D"]}, {"title": "Striking the right balance? Applying the jurisprudence of international tribunals to coastal state innovations in international fisheries governance", "year": "2017", "source": "Marine Policy, vol. 84, pp. 293-299pp", "authors": ["Camille Goodman"]}]}, "Microsoft-Academic": [{"title": "rights obligations prohibitions a practical guide to understanding judicial decisions on coastal state jurisdiction over living resources in the exclusive economic zone", "year": 2017, "source": "the international journal of marine and coastal law", "authors": [{"name": "camille goodman", "affiliation": "australian national university"}], "id": 20683218}, {"title": "striking the right balance applying the jurisprudence of international tribunals to coastal state innovations in international fisheries governance", "year": 2017, "source": "marine policy", "authors": [{"name": "camille goodman", "affiliation": "australian national university"}], "id": 56205983}, {"title": "law beyond boundaries innovative mechanisms for the integrated management of biodiversity beyond national jurisdiction", "year": 2018, "source": "ices journal of marine science", "authors": [{"name": "camille goodman", "affiliation": "australian national university"}, {"name": "holly matley", "affiliation": "attorney general s department"}], "id": 200038611}, {"title": "acta sunt servanda a regime for regulating the unilateral acts of states at international law", "year": 2006, "source": "", "authors": [{"name": "camille goodman"}]}, {"title": "acta sunt servanda a regime for the unilateral acts of states at international law", "year": 2006, "source": "", "authors": [{"name": "camille goodman"}]}, {"title": "the nature and extent of coastal state jurisdiction over living resources in the exclusive economic zone", "year": 2019, "source": "", "authors": [{"name": "camille goodman"}]}, {"title": "international law issues in the south pacific edited by geoff leane and barbara von tigerstrom ashgate publishing 2005 xi 284 pp", "year": 2007, "source": "", "authors": [{"name": "camille goodman"}]}], "ANDS-Grants": []}