{"ANU": {"name": "Carolyn Strange", "link": "https://researchers.anu.edu.au/researchers/strange-c", "colleges": "College of Arts and Social Sciences", "email": "carolyn.strange@anu.edu.au", "phone": "0011 2 6125-2613", "expertise": ["History And Philosophy Of Law And Justice", "North American History", "Culture Gender Sexuality", "Law And Society", "Courts And Sentencing", "Criminology", "Australian History Excl. Aboriginal And Torres Strait Islander History", "History And Philosophy Of Medicine"], "interest": ["My educational training in history has been enhanced over my career through teaching appointments in the U.S., Canada and Australia in women's studies, law and criminology in addition to history.The range of my research is expansive, and I have published on Australian, Canadian, U.S., and British modern history in the following areas: the history of crime and justice; the history of gender, sexuality and medicine; the history of geography; and the concepts of place, memory and identity in modernity. My research has been supported by major grants from the Social Sciences and Humanities Research Council (Canada) and the Australian Research Council. In addition to institutionally-awarded funding I have received grants from the Hannah Institute for the History of Medicine, the Canadian High Commission, the National Institute for Social Sciences and Law, the National Library of Australia, and the Huntington Library. In 2013 the New York State Archives named me 'researcher of the year' in recognition of my publications based on its collections. In 2014 I was awarded a fellowship at the Huntington Library, which further supported the research for my most recent book, published by New York University Press in 2016. I have extended my expertise in crime, justice and gender through my research on the history of sex murder and capital punishment in post-Confederation Canadian history. This research has led to the production of a monograph and several articles.I am currently returning to the field of twentieth-century Australian history through the analysis of inter-gender homicide. Initial funding for this project was awarded through a collaborative inter-School research grant from the Research School of Social Sciences.In 2019, I was awarded a five-year strategic initiative grant from the Research School of Social Sciences to co-ordinate a cross-campus network on the History and Legacies of Violence. Affiliates and updates are listed on the dedicated website: https://www.thehistoryandlegaciesofviolence.com/"], "biography": "", "project": ["My latest book 'The Death Penalty and Sex Murder in Canadian History' covers the period from Confederation (1867) to the abolition of the death penalty (1976). It is supported by a joint ARC Discovery Grant. I completed the manuscript as a visiting professor in the Faculty of Law, University of Toronto, in 2018. It was published by the University of Toronto Press in 2020. https://utorontopress.com/us/the-death-penalty-and-sex-murder-in-canadian-history-2", "The project I have just completed, also supported by an ARC Discovery grant, examines the history of discretionary justice in New York State. Discretionary Justice: Pardon and Parole in New York, from the Revolution to the Depression (New York University Press, 2016) extends the insights I developed in my 1996 edited collection, Qualities of Mercy: Justice, Punishment and Discretion (UBC Press, 1996). It also builds on my publication, “The Unwritten Law of Executive Justice: Pardoning Patricide in Reconstruction-era New York,” Law and History Review, 28 4(November 2010): 891-30. I challenge Foucauldian scholarship's fixation on sovereign power as the capacity to inflict violence by focusing on the gubernatorial prerogative of mercy, and I track its bureaucratisation over the late-19th and early-twentieth centuries through the emergence of a disciplinary apparatus, marked by indeterminate sentencing, parole and the rise of the 'psi' complex.", "Two further projects flowed from this grant. The first was a feature radio documentary, produced for ABC's Hindsight: 'Patricide! A Murder Close to Home'. This production draws on interviews with historians Natalie Zemon Davis, Charles Rosenberg, and Timothy Gilfoyle, and includes dramatisations of an 1873 murder trial in New York City, which brought the relationship between family, violence and honour to the fore. Using this high-profile case, I interrogate contemporary concerns over the legal and cultural erosion of masculine familial prerogatives; the medicalisation of criminal responsibility; women's growing use of law to advance individual and collective ambitions and citizenship aspirations; and rising suspicion over the place of sentiment in legal dispositions.", "The second project was a major international conference on 'Honour Killing across Culture and Time',  8-9 December 2011. Inspired by contributions to this conference I co-edited two books: Honour, Violence and Emotions in History (London: Bloomsbury, 2014) (with Robert Cribb and Christopher Forth); and Honour Killing and Violence: Theory, Policy and Practice (London: Palgrave, 2014) (with Aisha Gill and Karl Roberts)."], "publication": [{"title": "Where", "year": "2020", "source": "s the government on domestic violence?", "authors": ["Carolyn Strange", "Mortensen J"]}, {"title": "Murderess or Miscarriage of Justice? A Case of Husband Poisoning in Early Federation New South Wales", "year": "2020", "source": "Australian Historical Studies, vol. 51, no. 3, pp. 299-323", "authors": ["Carolyn Strange", "Hetherington L"]}, {"title": "[BOOK REVIEW]", "year": "2020", "source": "Civilizing Torture: An American Tradition'Journal of American History, vol. 106, no. 4, pp. 1025-1026", "authors": ["Carolyn Strange"]}, {"title": "The Passions of the Broken-Hearted: Patrick White and Spousal Homicide", "year": "2020", "source": "Meanjin, vol. 79, no. 3, pp. 151-155", "authors": ["Carolyn Strange"]}, {"title": "Femininities and Masculinities\r\nLooking backward and moving forward in Criminal Legal Historical Gender Research", "year": "2018", "source": "in Markus D Dubber and Christopher Tomlins (ed.), The Oxford Handbook of Legal History, Oxford University Press, United Kingdom, pp. 221pp-243pp", "authors": ["Carolyn Strange"]}, {"title": "Determining the Punishment of Sex Criminals in Confederation Era Canada: A Matter of National Policy", "year": "2018", "source": "Canadian Historical Review, vol. 99, no. 4, pp. 541pp-562pp", "authors": ["Carolyn Strange"]}, {"title": "[BOOK REVIEW] Escape to prison: Penal tourism and the pull of punishment", "year": "2017", "source": "International Criminal Justice Review, vol. 27, no. 1, pp. 73-75", "authors": ["Carolyn Strange"]}, {"title": "Mercy", "year": "2017", "source": "in Jo Turner, Paul Taylor, Sharon Morley, Karen Corteen (ed.), A Companion to the History of Crime & Criminal Justice, The Policy Press, bristol, uk, pp. 145-147pp", "authors": ["Carolyn Strange"]}, {"title": "Pardon and Parole in Prohibition-Era New York: Discretionary Justice in the Administrative State", "year": "2017", "source": "Osgoode Hall Law Journal, vol. 54, no. 3, pp. 909-932pp.", "authors": ["Carolyn Strange"]}, {"title": "Presidential Mercy:Obama", "year": "2017", "source": "s Trickle of PardonsSydney Morning Herald", "authors": ["Carolyn Strange"]}, {"title": "Beyond brutal passions: prostitution in early nineteenth-century Montreal - Book Review", "year": "2016", "source": "Feminist Review, vol. 113, no. 1, pp. e8-e9", "authors": ["Carolyn Strange"]}, {"title": "Mercy and Parole in Anglo-American Criminal Justice Systems from the Eighteenth Century to the Twenty-First Century", "year": "2016", "source": "in Paul Knepper and Anja Johansen (ed.), The Oxford Handbook of the History of Crime and Criminal Justice, Oxford University Press, New York, pp. 573-596pp.", "authors": ["Carolyn Strange"]}, {"title": "Book Review: Women, Infanticide and the Press", "year": "2016", "source": "Victorian Studies: a journal of the humanities, arts and sciences, vol. 58, no. 2, pp. 394-395", "authors": ["Carolyn Strange"]}, {"title": "Honor Killing", "year": "2016", "source": "in Nancy A. Naples (ed.), The Wiley Blackwell Encyclopedia of Gender and Sexuality Studies, John Wiley & Sons Ltd., Chicester, United Kingdom, pp. 5 pages", "authors": ["Carolyn Strange"]}, {"title": "Discretionary Justice - Pardon and Parole in New York from the Revolution to the Depression", "year": "2016", "source": "New York University PressNew York", "authors": ["Carolyn Strange"]}, {"title": "Port Arthur Massacre: commemoration will balance the fascination with a kille", "year": "2015", "source": "pp. online", "authors": ["Carolyn Strange"]}, {"title": "The battlefields of personal and public memory: Commemorating the Battle of Saratoga (1777) in the late nineteenth century", "year": "2015", "source": "The Journal of the Gilded Age and Progressive Era, vol. 14, no. 2, pp. 194-221", "authors": ["Carolyn Strange"]}, {"title": "SISTERHOOD OF BLOOD The Will to Descend and the Formation of the Daughters of the American Revolution", "year": "2014", "source": "Journal of Women's History, vol. 26, no. 3, pp. 105-128", "authors": ["Carolyn Strange"]}, {"title": "Book Review - Transcribing Class and Gender: Masculinity and Femininity in Nineteenth-Century Courts and Offices (review)", "year": "2014", "source": "Journal of Social History, vol. 45, no. 4, pp. 1141-1142", "authors": ["Carolyn Strange"]}, {"title": "Mining for the Meanings of a Murder: The Impact of OCR Quality on the Use of Digitized Historical Newspapers", "year": "2014", "source": "Digital Humanities Quarterly, vol. 8, no. 1, pp. 1-17", "authors": ["Carolyn Strange", "McNamara D", "Wodak J"]}, {"title": "djusting the Lens of Honour-Based Violence: Perspectives from Euro-American History", "year": "2014", "source": "in Aisha K. Gill, Carolyn Strange and Karl Roberts (ed.), Honour' Killing & Violence: Theory, Policy and Practice, Palgrave Macmillan Ltd, Basingstoke and New York, pp. 46-69", "authors": ["Carolyn Strange"]}, {"title": "Honour", "year": "2014", "source": "Killing & Violence: TheoryPolicy and Practice, Palgrave Macmillan Ltd, Basingstoke and New York", "authors": ["Carolyn Strange", "Gill A", "Roberts K", "eds"]}, {"title": "Honour, Violence and Emotion: An afterword", "year": "2014", "source": "in Carolyn Strange, Robert Cribb, Christopher E. Forth (ed.), Honour, Violence and Emotions in History, Bloomsbury, London and New York, pp. 203-206", "authors": ["Carolyn Strange"]}, {"title": "The Ambivalent Embrace of Kingly Power: Executive Clemency in Mid-Century Politics and Constitutional Thought", "year": "2014", "source": "American Political Thought, vol. 3, no. 1, pp. 64-95", "authors": ["Carolyn Strange"]}, {"title": "re", "year": "2014", "source": "honour' killings really too dangerous to be discussed in public?Guardian, Australia, pp. 3pp", "authors": ["Carolyn Strange"]}, {"title": "Historical perspectives on honour, violence and emotion", "year": "2014", "source": "in   (ed.), Honour, Violence and Emotions in History, Bloomsbury, London, pp. 1-22", "authors": ["Carolyn Strange"]}, {"title": "History off the books at the Australian National University", "year": "2013", "source": "History Australia, vol. 10, no. 3, pp. 264-269", "authors": ["Carolyn Strange"]}, {"title": "Commentary", "year": "2013", "source": "Nature Versus The Australian' Griffith Taylor'in L. Robin, S. Sorlin, P. Warde (ed.), The Future of Nature, Yale University Press, Yale, USA, pp. 142-144pp", "authors": ["Carolyn Strange"]}, {"title": "Commentary", "year": "2013", "source": "in L. Robin, S. Sorlin, P. Warde (ed.), The Future of Nature, Yale University Press, Yale, USA, pp. 142-144", "authors": ["Carolyn Strange"]}, {"title": "Stanley Kubrick", "year": "2012", "source": "s A Clockwork Orange as Art Against Torture'in Michael Flynn and Fabiola Fernandez Salek (ed.), Screening Torture: Media Representatives of State Terror and Political Domination, Columbia University Press, New York, pp. 143-164pp.", "authors": ["Carolyn Strange"]}, {"title": "How did women", "year": "2012", "source": "s war relief in the Spanish-American War alter traditions of female benevolence and pave the way for women's formal military service?'Women and Social Movements in the United States, 1600-2000, vol. 16, no. 1", "authors": ["Carolyn Strange"]}, {"title": "", "year": "2012", "source": "Parricide! A Murder Close to Home - Radio National", "authors": ["Carolyn Strange"]}, {"title": "Reconsidering the \"Tragic\" scott expedition: Cheerful masculine home-making in Antarctica, 1910-1913", "year": "2012", "source": "Journal of Social History, vol. 46, no. 1, pp. 66-88", "authors": ["Carolyn Strange"]}, {"title": "Phillips", "year": "2012", "source": "brief NEVER TO BE RELEASED?'Criminal Law Journal, vol. 36, no. 6, pp. 395-396", "authors": ["Carolyn Strange"]}, {"title": "Transcribing Class and Gender: Masculinity and Femininity in Nineteenth-Century Courts and Offices.", "year": "2012", "source": "Journal of Social History, vol. 45, no. 4, pp. 1141-1142", "authors": ["Carolyn Strange"]}, {"title": "From Modern Babylon to a City upon a Hill: Toronto", "year": "2012", "source": "s Social Survey Commission of 1915 and the Search for Sexual Order in the City'in Maureen Fitzgerald and Scott Rayter (ed.), Queerly Canadian: An Introductory Reader in Sexuality Studies, Canadian Scholars Press, Toronto, pp. 213-228", "authors": ["Carolyn Strange"]}, {"title": "Talking Turkey: President Obama", "year": "2012", "source": "s Paltry Pardons on The Conversation websitepp. 1-3pp", "authors": ["Carolyn Strange"]}, {"title": "Book review - The Practice of Execution in Canada by Ken Leyton-Brown", "year": "2011", "source": "Canadian Historical Review, vol. 92, no. 3, pp. 561-563", "authors": ["Carolyn Strange"]}, {"title": "Book review - Selling Sex: A Hidden History of Prostitution by Raelene Frances", "year": "2008", "source": "Australian Historical Studies, vol. 39, no. 3, pp. 389-90", "authors": ["Carolyn Strange"]}, {"title": "Book review: Crimes against Children: Sexual Violence and Legal Culture in New York City, 1880-1960", "year": "2008", "source": "Journal of the History of Sexuality, vol. 17, no. 1, pp. 163-166", "authors": ["Carolyn Strange"]}, {"title": "Book review: Madness in Australia: Histories, Heritage and the Asylum", "year": "2008", "source": "Australian Historical Studies, vol. 36, no. 124, pp. 397-399", "authors": ["Carolyn Strange"]}, {"title": "Book review: Beyond Papillon: The French Overseas Penal Colonies, 1854-1952", "year": "2008", "source": "Nineteenth Century French Studies, vol. 36, no. 3&4, pp. 331-333", "authors": ["Carolyn Strange"]}, {"title": "Book review: Arresting Images: Crime and Policing in front of the Television Camera", "year": "2005", "source": "University of Toronto Quarterly, vol. 74, no. 1, pp. 376-378", "authors": ["Carolyn Strange"]}, {"title": "Stanley Kubrick", "year": "2010", "source": "s A Clockwork Orange as art against torture'Crime, Media, Culture, vol. 6, no. 3, pp. 267-284", "authors": ["Carolyn Strange"]}, {"title": "Griffith Taylor", "year": "2010", "source": "s Antarctica: ScienceSentiment, and Politics', Polar Record, vol. 46, no. 1, pp. 65-74", "authors": ["Carolyn Strange"]}, {"title": "The Personality of Environmental Prediction: Griffith Taylor as", "year": "2010", "source": "Latter-day Prophet''Historical Records of Australian Science, vol. 21, no. 2, pp. 133-148", "authors": ["Carolyn Strange"]}, {"title": "Transgressive Transnationalism: Griffith Taylor and Global Thinking", "year": "2010", "source": "Australian Historical Studies, vol. 41, no. 1, pp. 25-40", "authors": ["Carolyn Strange"]}, {"title": "Case for Legal Records in Women", "year": "2010", "source": "s and Gender History'Journal of Women's History, vol. 22, no. 2, pp. 144-148", "authors": ["Carolyn Strange"]}, {"title": "Eugenics in Canada: A Checkered History, 1850s-1990s", "year": "2010", "source": "in Alison Bashford and Philippa Levine (ed.), The Oxford Handbook of The History of Eugenics, Oxford University Press, Oxford, pp. 523-538", "authors": ["Carolyn Strange", "Stephen J"]}, {"title": "The Unwritten Law of Executive Justice:  Pardoning Patricide in Reconstruction-era New York", "year": "2010", "source": "Law and History Review, vol. 28, no. 4, pp. 891-3", "authors": ["Carolyn Strange"]}, {"title": "", "year": "2010", "source": "Humanities Research", "authors": ["Rooney M", "Carolyn Strange", "eds"]}, {"title": "Book Review: Review of Jacqueline Z. Wilson", "year": "2009", "source": "s Prison: Cultural Memory and Dark Tourism'History Australia, vol. 6, no. 2, p. 5", "authors": ["Carolyn Strange"]}, {"title": "", "year": "2009", "source": "Violent Ends: The Arts of Environmental Anxiety", "authors": ["Carolyn Strange"]}, {"title": "Griffith Taylor: Global Geographer", "year": "2009", "source": "", "authors": ["Carolyn Strange"]}, {"title": "Book Review: Carnal Crimes: Sexual Assault Law in Canada, 1900-1975", "year": "2009", "source": "Canadian Historical Review, vol. 90, no. 4, pp. 753-755", "authors": ["Carolyn Strange"]}, {"title": "Griffith Taylor: Visionary", "year": "2008", "source": "EnvironmentalistExplorer, National Library of Australia, Canberra, Australia", "authors": ["Carolyn Strange", "Bashford A"]}, {"title": "Griffith Taylor: Prophet and Pariah", "year": "2008", "source": "", "authors": ["Carolyn Strange"]}, {"title": "Thinking Historically about Public Health", "year": "2007", "source": "Medical Humanities, vol. 33, no. December, pp. 87-92", "authors": ["Carolyn Strange", "Bashford A"]}, {"title": "Pain and Death: Politics, Aesthetics, Legalities", "year": "2007", "source": "Humanities Research, vol. XIV, no. 2, pp. 1-3", "authors": ["Carolyn Strange"]}, {"title": "Humanities Research vol XIV (2)", "year": "2007", "source": "Vol XIV. No. 2", "authors": ["Carolyn Strange", "ed"]}, {"title": "The", "year": "2006", "source": "Shock' of Torture: a Historiographical Challenge'History Workshop Journal, vol. 61, no. 1, pp. 135-152", "authors": ["Carolyn Strange"]}, {"title": "Postcard from Plaguetown: SARS and the Exoticization of Toronto", "year": "2006", "source": "in Alison Bashford (ed.), Medicine at the Border. Disease, Globalization and Security, 1850 to the Present, Palgrave Macmillan Ltd, United Kingdom & USA, pp. 219-239", "authors": ["Carolyn Strange"]}, {"title": "Pain and Death-Transnational Perspectives", "year": "2006", "source": "Radical History Review, vol. Fall 2006, no. 96, pp. 137-150", "authors": ["Carolyn Strange"]}, {"title": "Hybrid History and the retrial of the painful past", "year": "2006", "source": "Crime, Media, Culture: An International Journal, vol. August 2006, Vol 2, no. No. 2, pp. 197-215", "authors": ["Carolyn Strange"]}, {"title": "Capital Punishment, Crime and Punishment, Moral and Social Reform, Prostitution", "year": "2004", "source": "in Gerald Hallowell (ed.), The Oxford Companion to Canadian History, Oxford University Press, UK, pp. 114-115, 163-164, 413-414, 510", "authors": ["Carolyn Strange"]}, {"title": "True Crime True North: the golden Age of Canadian Pulp Magazines", "year": "2004", "source": "Raincoast BooksVancouver", "authors": ["Carolyn Strange", "Loo T"]}, {"title": "Public Pedagogy: Sex Education and Mass Communication in the Mid-Twentieth Century", "year": "2004", "source": "Journal of the History of Sexuality, vol. 13, no. 1, pp. 71-99", "authors": ["Bashford A", "Carolyn Strange"]}, {"title": "Symbiotic Commemoration", "year": "2004", "source": "History and Memory, vol. 16, no. 1, pp. 86-117", "authors": ["Carolyn Strange"]}]}, "Microsoft-Academic": [{"title": "shades of dark tourism alcatraz and robben island", "year": 2003, "source": "annals of tourism research", "authors": [{"name": "carolyn strange", "affiliation": "university of toronto"}, {"name": "michael kempa", "affiliation": "australian national university"}], "id": 51885707}, {"title": "mining for the meanings of a murder the impact of ocr quality on the use of digitized historical newspapers", "year": 2014, "source": "digital humanities quarterly", "authors": [{"name": "carolyn strange"}, {"name": "daniel mcnamara"}, {"name": "joshua wodak"}, {"name": "ian wood"}], "id": 166472302}, {"title": "use of pooled dna samples to detect linkage disequilibrium of polymorphic restriction fragments and human disease studies of the hla class ii loci", "year": 1985, "source": "proceedings of the national academy of sciences of the united states of america", "authors": [{"name": "norman arnheim"}, {"name": "carolyn strange"}, {"name": "henry a erlich"}], "id": 125754415}, {"title": "asylum seekers and national histories of detention", "year": 2002, "source": "australian journal of politics and history", "authors": [{"name": "alison bashford", "affiliation": "university of sydney"}, {"name": "carolyn strange", "affiliation": "university of toronto"}], "id": 68037046}, {"title": "masculinities intimate femicide and the death penalty in australia 1890 1920", "year": 2003, "source": "british journal of criminology", "authors": [{"name": "carolyn strange", "affiliation": "university of toronto"}], "id": 27273401}, {"title": "masculinities intimate femicide and the death penalty in australia 1890 1920", "year": 2003, "source": "social science research network", "authors": [{"name": "carolyn strange", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "isolation places and practices of exclusion", "year": 2003, "source": "", "authors": [{"name": "carolyn strange"}, {"name": "alison bashford"}]}, {"title": "reconsidering the tragic scott expedition cheerful masculine home making in antarctica 1910 1913", "year": 2012, "source": "journal of social history", "authors": [{"name": "carolyn strange", "affiliation": "australian national university"}], "id": 74845278}, {"title": "griffith taylor visionary environmentalist explorer", "year": 2008, "source": "", "authors": [{"name": "carolyn strange"}, {"name": "alison bashford"}]}, {"title": "honour violence and emotions in history", "year": 2014, "source": "", "authors": [{"name": "carolyn strange"}, {"name": "robert cribb"}, {"name": "christopher e forth", "affiliation": "university of kansas"}]}], "ANDS-Grants": [{"description": "Testimony of sexual abuse before the current Royal Commission has exposed the historic neglect and cover-up of institutional offences. Yet, to unearth the deeper and wider dimensions of sexual offending requires scholarly historical analysis. This project uses qualitative and quantitative analysis to track how and why certain forms of sexual behaviour sparked public concern and provoked legal responses and public inquiries from the 1880s to the 1980s. Our systematic examination of these patterns through archival and published documents will test the relation between shifting community and political concerns and the conduct of criminal trials. Thus, it will make a significant contribution to the promotion of health and wellbeing.", "title": "Discovery Projects - Grant ID: DP150101798", "id": "617879", "institutions": ["University of Newcastle"], "key": "http://purl.org/au-research/grants/arc/DP150101798", "researchers": ["Dr Lisa Featherstone", "Dr Amanda Kaladelfos", "Dr Carolyn Strange", "Dr Nina Westera"], "status": "closed", "fundingAmount": 237326, "fundingScheme": "Discovery Projects", "startDate": 2015, "endDate": 2017, "dateTimeModified": "2017-07-05T03:02:01Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Newcastle"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP150101798", "identifiers": ["http://purl.org/au-research/grants/arc/DP150101798", "DP150101798"], "subjects": ["HISTORICAL STUDIES", "HISTORY AND ARCHAEOLOGY", "CRIME AND JUSTICE; GENDER AND SEXUALITY ; HISTORY"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/617879"}]}]}