{"ANU": {"name": "Catherine Bowan", "link": "https://researchers.anu.edu.au/researchers/bowan-cj", "colleges": "College of Arts and Social Sciences", "email": "kate.bowan@anu.edu.au", "phone": "61254251", "expertise": [], "interest": ["Kate is a cultural musicologist whose work explores the intersections between musicology and social and political history with a particular focus on transnational history. Her recent work has drawn upon music's potential to be used as a heuristic device in the telling of transnational histories, while exploring uses of music in the nineteenth and early twentieth century radical political sphere across the Anglophone world. This extends in important ways previous research on early twentieth-century Australian music which was recontextualised within the broader framework of the British World. Formal and informal networks and personal connections inform her current research interests which focus on questions of internationalism, cosmopolitanism and transnational history with reference to early twentieth-century musical modernisms and more particularly the interwar history of the International  Society for Contemporary Music. Journals published in include the Journal of the Royal Music Association, Musicology Australia and Labour History Review (UK). Her article 'Between Worlds Ancient and Modern: The Musical Collaboration of Kathleen Schlesinger and Elsie Hamilton' won the International Association of Women in Music's Pauline Alderman Award for Best Article of 2013."], "biography": "Kate Bowan is a Lecturer at the Centre for Heritage and Museum Studies  in the Research School of Humanities and the Arts at the Australian National University. She took up this position in 2013 after completing an ARC-funded Australian Postdoctoral Fellowship. Her research has examined aspects of early twentieth-century Australian musical modernism, drawing upon conceptual frameworks such as transnationalism and the British world. More recently, she has been working on music and radical political and reform culture in the nineteenth-century Anglophone world. She currently has a forthcoming co-authored book, Sounds of Liberty: Music, Radicalism and Reform in the Anglophone World, 1790-1914 and a forthcoming book chapter with Cambridge University Press, ‘Friendship, cosmopolitan connections and late Victorian socialist songbook culture’ in Cheap Print and Popular Song in the Nineteenth Century: A Cultural History of the Songster  edited by Derek B. Scott, Patrick Spedding and Paul Watt.", "project": ["Internationalism, transnationalism, cosmopolitanism and the International Society for Contemporary Music (1922-1952)", "Commemoration and heritage in the 1939 London Festival of Music for the People and the musical pageants by the communist composer, Alan Bush", "The Anthology of Australian Music on Disc and the Bicentennial: Art Music, Musical Monuments and Nation-Buillding", "", "", ""], "publication": [{"title": "Music and Victorian Liberalism Composing the Liberal Subject", "year": "2019", "source": "in Sarah Collins (ed.), Music and Victorian Liberalism\r\nComposing the Liberal Subject, Cambridge University Press, Cambridge, pp. 83-107", "authors": ["Catherine Bowan"]}, {"title": "Historically informed performance", "year": "2019", "source": "in Vanessa Agnew, Jonathan Lamb & Juliane Tomann (ed.), The Routledge Handbook of Reenactment Studies: Key Terms in the Field, Routledge, Abingdon, pp. 106-110", "authors": ["Catherine Bowan"]}, {"title": "Friendship, Cosmopolitan Connections and Late Victorian Socialist Songbook Culture", "year": "2017", "source": "in Paul Watt, Derek B. Scott, and Patrick Spedding (ed.), Cheap Print and Popular Song in the Nineteenth Century, Cambridge University Press, UK, pp. 91 - 111", "authors": ["Catherine Bowan"]}, {"title": "Sounds of Liberty Music", "year": "2017", "source": "radicalism and reform in the Anglophone world1790-1914, Manchester University Press, Manchester, United Kingdom", "authors": ["Catherine Bowan", "Pickering P"]}, {"title": "performance of magic lantern slides with song and piano", "year": "2014", "source": "", "authors": ["Jolly M", "Catherine Bowan", "Tregear P"]}, {"title": "The Travels of ‘John Anderson", "year": "2013", "source": "my jo’Humanities Research 19 no. 2, pp. 57-70", "authors": ["Catherine Bowan"]}, {"title": "Living between Worlds Ancient and Modern: The Musical Collaboration of Kathleen Schlesinger and Elsie Hamilton", "year": "2012", "source": "Journal of the Royal Musical Association, vol. 137, no. 2, pp. 197-242", "authors": ["Catherine Bowan"]}, {"title": "Singing for Socialism", "year": "2011", "source": "in Laurajane Smith, Paul A. Shackel and Gary Campbell (ed.), Heritage, Labour and the Working Classes, Routledge, Taylor & Francis Group, Abingdon UK, pp. 192-215", "authors": ["Catherine Bowan", ""]}, {"title": "That keen interest we have for the strange and the rare....", "year": "2010", "source": "'Music Forum, vol. 16, no. 4, pp. 46-49", "authors": ["Catherine Bowan"]}, {"title": "R.G. Collingwood, Historical Reenactment and the Early Music Revival", "year": "2010", "source": "in Paul A Pickering & Iain MaCalman (ed.), Historical Reenactment: From Realism to the Affective Turn, Palgrave Macmillan Ltd, UK, pp. 134 - 158", "authors": ["Catherine Bowan"]}, {"title": "that keen interest we have for the strange and the rare ...", "year": "2009", "source": ": The Radio Broadcasts of Adelaide composer Hooper Brewster-Jones (1930-1933)'Journal of Music Research Online, vol. 1, no. Online, p. 13", "authors": ["Catherine Bowan"]}, {"title": "Songs for the Millions", "year": "2009", "source": ": Chartist Music and Popular Aural Tradition'Labour History Review, vol. 74, no. 1, pp. 44-63", "authors": ["Catherine Bowan", "Pickering P"]}, {"title": "The Very Song of Life", "year": "2008", "source": ": A musical Context for the 1919 Colour in Art Exhibition'in Nick Waterlow and Annable Pegus (ed.), Colour in Art - Revisiting 1919, Ivan Dougherty Gallery, Sydney, Australia, pp. 19-21", "authors": ["Catherine Bowan"]}, {"title": "On a New Formula: Reassessing Hooper Brewster Jones", "year": "2008", "source": "Context: Journal of Music Research, vol. 33, pp. 25-43", "authors": ["Catherine Bowan"]}, {"title": "Wild Men and Mystics: Rethinking Roy Agnew", "year": "2008", "source": "s Early Sydney Works'Musicology Australia, vol. 30, no. 2008, pp. 1-28", "authors": ["Catherine Bowan"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}