{"ANU": {"name": "Catherine J. Frieman", "link": "https://researchers.anu.edu.au/researchers/frieman-cj", "colleges": "College of Arts and Social Sciences", "email": "catherine.frieman@anu.edu.au", "phone": "02 619 70054", "expertise": ["Archaeology", "Archaeology Of Europe The Mediterranean And The Levant", "Social Theory", "Sociology And Social Studies Of Science And Technology"], "interest": ["Innovation in prehistoric societies; Flint, ground-stone and other lithic technologies; Trade and communication in 4th-2nd millennia BC Europe; European Neolithic and Bronze Age society; Adoption of metal; Prehistoric metallurgy; Flint daggers; Ornaments and identity;Material culture studies; Archaeological theory"], "biography": "", "project": ["Southeast Kernow Archaeological Survey", "Despite many generations of archaeological fieldwork in Britain’s southwestern peninsula and Cornwall’s central role in later prehistoric exchange networks, the prehistory of the southeastern part of the county has not been exposed to the same amount of modern archaeological investigation. The Southeast Kernow Archaeological Survey (SEKAS) project aims to develop a better understanding of the prehistoric landscape of this region which links the metal-rich uplands to the English Channel. The study region for the SEKAS project comprises of the area between the Tamar and the Fowey rivers and south of the A38, and the period from the Neolithic through to the later Iron Age.", "The project was launched in 2012 as a collaboration between Dr Catherine Frieman (ANU) and James Lewis, a professional archaeologist currently based in Scotland. Since then, geophysical and topographic surveys have been conducted at a number of later prehistoric sites in the study area. The results of several of these surveys were incorporated into Mr. Lewis’ 2016 MA thesis Iron Age and Romano-British Enclosures of southeast Cornwall (Dept of Archaeology, University of Glasgow). Commencing in 2017, this ongoing fieldwork will provide the case study for Dr. Frieman’s ARC DECRA project Conservatism as a dynamic response to the diffusion of innovations (DE170100464).", "The project homepage can be found: http://archanth.anu.edu.au/research/kernow-survey", ""], "publication": [{"title": "Telling stories about the past - theory and method in Australian Archaeology [IN PRESS]", "year": "2020", "source": "Australian Archaeology, vol. online", "authors": ["Matthews J", "Catherine J. Frieman"]}, {"title": "Survival, Social Cohesion and Rock Art: The Painted Hands of Western Arnhem Land, Australia [IN PRESS]", "year": "2020", "source": "Cambridge Archaeological Journal, vol. online", "authors": ["May S", "Taylor L", "Catherine J. Frieman"]}, {"title": "Present pasts in the archaeology of genetics, identity, and migration in Europe: a critical essay", "year": "2019", "source": "World Archaeology, vol. 51, no. 4, pp. 528-545", "authors": ["Catherine J. Frieman", "Hofmann D"]}, {"title": "Who", "year": "2019", "source": "s been using my burial mound? Radiocarbon dating and isotopic tracing of human diet and mobility at the collective burial siteLe Tumulus des Sables, southwest France', Journal of Archaeological Science: Reports, vol. 24, pp. 955-966", "authors": ["James H", "Willmes M", "Courtaud P", "Catherine J. Frieman"]}, {"title": "Navigating Contact: tradition and innovation in Australian contact rock art [IN PRESS]", "year": "2019", "source": "International Journal of Historical Archaeology", "authors": ["Catherine J. Frieman", "May S"]}, {"title": "Very Remote Storage Box Indeed: The Importance of Doing Archaeology with Old Museum Collections", "year": "2018", "source": "Journal of Field Archaeology, vol. 43, no. 4, pp. 257-268pp", "authors": ["Catherine J. Frieman", "Janz L"]}, {"title": "ging Well: Treherne", "year": "2017", "source": "s Warrior's Beauty' Two Decades Later'European Journal of Archaeology, vol. 20, no. 1, pp. 36 - 73", "authors": ["Catherine J. Frieman", "Bruck J", "Rebay-Salisbury K"]}, {"title": "Rach Nui: Ground stone technology in coastal Neolithic settlements of southern Vietnam", "year": "2017", "source": "Antiquity, vol. 91, no. 358, pp. 933-946", "authors": ["Catherine J. Frieman", "Piper P", "Nguyen K"]}, {"title": "The Changing of the Guards\"?: British Prehistoric Collections and Archaeology in the Museums of the Future", "year": "2016", "source": "Museum Worlds: Advances in Research, vol. 4, pp. 33-50pp", "authors": ["Catherine J. Frieman", "Wilkin N"]}, {"title": "Early metallurgy in western and northern Europe", "year": "2015", "source": "in C Fowler, J Harding & D Hofmann (ed.), The Oxford handbook of Neolithic Europe, Oxford University Press, London, pp. 711-727pp", "authors": ["Roberts B", "Catherine J. Frieman"]}, {"title": "Flint Daggers in prehistoric Europe", "year": "2015", "source": "Oxbow BooksOxford, UK and Havertown, USA", "authors": ["Catherine J. Frieman", "Eriksen B", "eds"]}, {"title": "Introduction. Flint daggers: A historical, typological and methodological primer", "year": "2015", "source": "in Catherine J. Frieman and Berit Valentin Eriksen (ed.), Flint Daggers in Prehistoric Europe, Oxbow Books, Oxford, UK and Havertown, USA, pp. 1-9", "authors": ["Catherine J. Frieman", "Eriksen B"]}, {"title": "rt thou but a dagger of the mind? Understanding lithic daggers in Europe and beyond", "year": "2015", "source": "in Catherine J. Frieman and Berit Valentin Eriksen (ed.), Flint Daggers in Prehistoric Europe, Oxbow Books, Oxford, UK and Havertown, USA, pp. 161-165", "authors": ["Catherine J. Frieman"]}, {"title": "Making a point: Re-evaluating British flint daggers in their cultural and technological contexts", "year": "2015", "source": "in Catherine J. Frieman and Berit Valentin Eriksen (ed.), Flint Daggers in Prehistoric Europe, Oxbow Books, Oxford, UK and Havertown, USA, pp. 103-115", "authors": ["Catherine J. Frieman"]}, {"title": "Double Edged blades : re-visiting the british (and Irish) flint daggers", "year": "2014", "source": "Proceedings of the Prehistoric Society, vol. 80, pp. 33-65", "authors": ["Catherine J. Frieman"]}, {"title": "ed.)", "year": "2013", "source": "Claimed by the sea: SalcombeLangdon Bay, and other marine finds of the Bronze Age, Council for British Archaeology, York", "authors": ["Needham S", "Parham D", "Catherine J. Frieman"]}, {"title": "Innovation and Identity: The Language and Reality of Prehistoric Imitation and Technological Change", "year": "2013", "source": "in Jeb J. Card (ed.), The Archaeology of Hybrid Material Culture, Southern Illinois University Press, Illinois, pp. 318-341", "authors": ["Catherine J. Frieman"]}, {"title": "Flint daggers, copper daggers, and technological innovation in late neolithic Scandinavia", "year": "2012", "source": "European Journal of Archaeology, vol. 15, no. 3, pp. 440-464", "authors": ["Catherine J. Frieman"]}, {"title": "Going to pieces at the funeral: Completeness and complexity in early Bronze Age jet", "year": "2012", "source": "necklace' assemblages'Journal of Social Archaelology, vol. 12, no. 3, pp. 334-355", "authors": ["Catherine J. Frieman"]}, {"title": "Drawing Boundaries and Drawing Models: investigating the concept of the", "year": "2012", "source": "Chalcolithic frontier' in north-west Europe'in Michael J. Allen, Julie Gardiner, Alison Sheridan (ed.), Is there a British Chalcolithic? People, place and polity in the late 3rd millennium, The Prehistoric Society, London. 27-39", "authors": ["Roberts B", "Catherine J. Frieman"]}, {"title": "Innovation and Imitation: Stone Skeuomorphs of Metal from 4th-2nd Millennia BC Northwest Europe", "year": "2012", "source": "ArchaeopressOxford", "authors": ["Catherine J. Frieman"]}, {"title": "Imitation, identity and communication: The presence and problems of skeuomorphs in the Metal Ages", "year": "2010", "source": "in Berit Valentin Eriksen (ed.), Lithic technology in metal using societies, Jutland Archaeological Society, Hojbjerg, Denmark, pp. 33-44", "authors": ["Catherine J. Frieman"]}, {"title": "Islandscapes and", "year": "2008", "source": "islandness': The prehistoric Isle of Man in the Irish seascape'Oxford Journal of Archaeology, vol. 27, no. 2, pp. 135-151", "authors": ["Catherine J. Frieman"]}, {"title": "Seeing is perceiving?", "year": "2007", "source": "World Archaeology, vol. 39, no. 1, pp. 4-16", "authors": ["Catherine J. Frieman", "Gillings M"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}