{"ANU": {"name": "Chandani Lokuge", "link": "https://researchers.anu.edu.au/researchers/lokuge-c", "colleges": "College of Arts and Social Sciences", "email": "Chandani.Lokuge@anu.edu.au", "phone": "+61 411 952 055", "expertise": ["Literary Studies", "Performing Arts And Creative Writing"], "interest": ["Chandani’s research specializations include creative and critical approaches to the postcolonial, particularly representations of transculturality in travel and tourism, migration and diaspora. Her 16 book publications include 4 literary novels and a book of short stories. Her latest novel, My Van Gogh was published in 2019. Previous novels, Softly as I leave you was awarded Sri Lanka's Godage National Literary Award 2013, and If the moon smiled was shortlisted for New South Wales Premier’s Award 2001. Her creative work has been translated into Greek, French and Hindi. Her short fiction and academic essays are widely anthologized. Her edited academic books include Creative Lives: interviews with South Asian diaspora writers (Ibidem, Columbia University Press, forthcoming 2021) and Mediating Literary Borders: Asian Australian Writing (Routledge, 2018). As Editor of the Oxford Classics Reissues series, she has published 7 critical editions of pioneering Indian women’s writing in English. Among her co--edited special issues of journals are Journal of Postcolonial Writing, Moving Worlds, New Literatures Review and Meanjin."], "biography": "A former Commonwealth Scholar from Sri Lanka, Chandani Lokuge is affiliated to Australian National University as Associate Professor in Literary Studies and Creative Writing. Previously, from 2001-2020 (incl), she was Associate Professor in Literary Studies and Creative Writing at Monash University. During her tenure at Monash, she was  Deputy Associate Dean International in the Faculty of Arts from 2014-2015 incl (Deputizing for the Dean who helds the position of Associate Dean International) The Monash Higher Degree Research (Creative Writing) programme was set up under her directorship. She was the founding director of the Centre for Postcolonial Writing from 2002-2012, and South Asian International Research Network from 2015-2020. For her various research activities, she has secured funding from Literature Board of the Australia Council, Myer and Ian Potter Foundations, Australia-India Council and Arts Victoria. Her international research appointments include the Ludwig Hirschfeld-Mack Visiting Chair in Australian Studies, Freie University, Berlin; Le Studium International Research Chair in Creative Writing, Advanced Studies Institute, France; and Guest Professorships at Goethe University, Frankfurt am Main and Harvard University’s Humanities Centre. Chandani has published 16 books. Her next book, Creative Lives: Interviews with South Asian Diaspora Writers, edited with Christopher Ringrose is forthcoming in 2021. An award winning novelist, Chandani is the recipient of a Writer's grant from the Literature Board of the Australia Council and has undertaken international residencies including at the Chateau de Lavigny, Foundation Ledig-Rowalt, Switzerland. Chandani's interactions with the wider literary community and media include her (invited) participation at Australian and international Writers' Festivals. She was an invited panelist for ABC Radio's Books and Arts Programme: Subcontinental Book Club; her reviews and articles are published in numerous journals and newspapers.", "project": ["Current research projects:", "Creative Lives: interviews with South Asian diaspora writers co-edited with Christopher Rignrose (Ibidem World Literature Series, Columbia University Press, forthcoming 2021)", "Consultant Editor, Empire on Line (Postcolonial), Adam Matthews.", "Previous research projects:", "Editor for Oxford University Press of the Classics Reissues series of Pioneering Indian Women's Writing in English. The 7 critical editions of this series include:India Calling: The memories of Cornelia Sorabji, India's First Woman Barrister; and Toru Dutt: Selected Prose and Poetry.", "Editor, Annnotaed Bibliography of Englsh Studies - ABES (Postcolonial), Routledge.", "Current creative project:", "Literary novel in progress.", "Previous creative publications:", "My Van Gogh (Ausralian Scholarly Publishing, Melbourne, 2019)", "Softly, as I leave you (Australian Scholarly Publishing, Melbourne, 2012)", "Turtle Nest (Penguin Australia, 2003)", "If the moon smiled (Penguin Australia, 2000)", "Moth and Other Stories (Denmark: Aarhus University Press, 1996)", "External funding:", "Writer's grant from the Australia Council; Myer and Ian Potter Foundations; Arts Victoria; Australia-India Council.", ""], "publication": []}, "Microsoft-Academic": [{"title": "mediating literary borders sri lankan writing in australia", "year": 2016, "source": "journal of postcolonial writing", "authors": [{"name": "chandani lokuge", "affiliation": "monash university"}], "id": 26362423}, {"title": "mediating literary borders asian australian writing", "year": 2018, "source": "", "authors": [{"name": "janet m wilson"}, {"name": "chandani lokuge"}]}, {"title": "softly as i leave you", "year": 2011, "source": "", "authors": [{"name": "chandani lokuge"}]}, {"title": "the lives of ancestors sri lankan first arrivals in australia", "year": 2020, "source": "interventions international journal of postcolonial studies", "authors": [{"name": "chandani lokuge", "affiliation": "monash university"}], "id": 17227813}, {"title": "introduction realigning the margins asian australian writing", "year": 2016, "source": "journal of postcolonial writing", "authors": [{"name": "janet m wilson", "affiliation": "university of northampton"}, {"name": "chandani lokuge", "affiliation": "monash university"}], "id": 26362423}, {"title": "journey into vishranti a critico autobiographical reflection on diasporic dis belonging", "year": 2011, "source": "interventions international journal of postcolonial studies", "authors": [{"name": "chandani lokuge", "affiliation": "monash university"}], "id": 17227813}, {"title": "the novelist and censorship a sri lankan australian perspective", "year": 2012, "source": "", "authors": [{"name": "chandani lokuge", "affiliation": "monash university"}]}, {"title": "toru dutt collected prose and poetry", "year": 2006, "source": "", "authors": [{"name": "toru dutt"}, {"name": "chandani lokuge"}]}, {"title": "the return journey and the aesthetic of rasa in michael ondaatje s poetry", "year": 2010, "source": "", "authors": [{"name": "chandani lokuge"}]}, {"title": "india calling the memories of cornelia sorabji india s first woman barrister", "year": 2001, "source": "", "authors": [{"name": "cornelia sorabji"}, {"name": "chandani lokuge"}]}], "ANDS-Grants": []}