{"ANU": {"name": "Charles Barry  Osmond", "link": "https://researchers.anu.edu.au/researchers/osmond-cb", "colleges": "College of Science", "email": "barry.osmond@anu.edu.au", "phone": "+61 2 6287 1487", "expertise": ["Plant Physiology", "Plant Biology", "Biochemistry And Cell Biology", "Ecology"], "interest": ["Research InterestsPhotosynthesis, the miracle in which plants turn sunlight, air and water into bread and wine, fuel and fibre, is the most energetic of all biological processes. It is susceptible to stress in strong light and my research deals with relationships between the two reversible processes of photoprotection and photoinactivation. Photoprotection involves pigment-protein transformations in the light harvesting antennae of chloroplasts that lead to the dumping of excess light as heat. Shade leaves of tropical plants, such as avocado, have two carotenoid based pigment cycles that have established a particular photoprotective function for the xanthophyll pigment lutein. Photoinactivation involves events in the water splitting reaction centre in chloroplasts that lead to the destruction of core proteins, loss of function and a cycle of repair. Studies of these events in-vivo depend heavily on non-intrusive methods using chlorophyll fluorescence. These techniques are also applied in environmental plant physiology and ecology to determine the interaction of strong light with high temperature, water and nutritional stresses, and some can be scaled up for remote sensing in canopies"], "biography": "Member, Integrated Biological Systems Steering Committee, DIISR (2009-11)", "project": ["Photoprotective functions of xanthophyll pigments in avocado", "Studies of shade leaves in some tropical plants (including avocado) that have two carotenoid based pigment cycles have established a particular photoprotective function for the xanthophyll pigment lutein.", "Papers from this project:", "Jia HS, Forster B, Chow WS, Pogson BJ, Osmond CB (2013) Deacreased photochemical efficiency of Photosystem II following sunlight exposure of shade-grown leaves of avocado (Persea americana Mill.): because of, or in spite of, two kinetically distinct xanthophyll cycles. Plant Physiology 161,863-852", "Matsubara S, Forster B, Waterman M, Robinson SA, Pogson BJ, Gunning B, Osmond B (2012). From ecophysiology to phenomics: some implications of photoprotection and shade-sun acclimation in-situ for dynamics of thylakoids in-vitro. Philosophical Transactions of the Royal Society of London, B. 367, 3503-3514", "Forster B, Osmond CB, Pogson BJ (2011) Lutein from deepoxidation of lutein epoxide replaces zeaxanhin to sustain an enhanced capacity for nonphotochemical chlorophyll fluorescence quenching in avocado shade leaves in the dark, Plant Physiology 156, 393-403", "Förster B, Pogson BJ, Osmond CB (2009) De-novo synthesis and degradation of Lx- and V-cycle pigments during shade and sun acclimation in avocado leaves (P. americana). Plant Physiology 149, 1179-1195", "Esteban R, Jiménez MS, Morales D, Jiménez ET, Hormaetxe K, Becerril JM, Osmond B, García-Plazaola J-I (2008) Short and long-term modulation of the lutein-epoxide and violaxanthin cycles in two species of the Lauraceae: sweet bay laurel (Laurus nobilis L.) and avocado (Persea americana Mill). Plant Biology 10, 288-297."], "publication": [{"title": "From ecophysiology to phenomics: some implications of photoprotection and shade-sun acclimation in situ for dynamics of thylakoids in vitro", "year": "2012", "source": "Philosophical Transactions of the Royal Society of London Series B, vol. 367, no. 1608, pp. 3503-3514", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Canopy conundrums: building on the Biosphere 2\r\nexperience to scale measurements of inner and outer\r\ncanopy photoprotection from the leaf to the landscape", "year": "2012", "source": "Functional Plant Biology 39, 1-24", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Lutein from deepoxidation of lutein epoxide replaces zeaxanthin to sustain an enhanced capacity for nonphotochemical chlorophyll fluorescence quenching in avocado shade leaves in the dark", "year": "2011", "source": "Plant Physiology, 156, no. 1, pp. 393-403", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "De Novo Synthesis and Degradation of Lx and V Cycle Pigments during Shade and Sun Acclimation in Avocado Leaves", "year": "2009", "source": "Plant Physiology, vol. 149, pp. 1179-1195", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Testing the functional implications of photosynthetic heterogeneity in leaves of C4 plants: Reductionism during scale expansion", "year": "2009", "source": "in Ulrich Schurr, Barry Osmond (ed.), Imaging and integrating heterogeneity of plant functions: Functional biodiversity from cells to the biosphere, Deutsche Akademie der Naturforscher Leopoldina, Germany, p. 192", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Diel leaf growth cycles in Clusia spp. are related tochanges between C3 photosynthesis and crassulacean acid metabolism during development and during water stress", "year": "2008", "source": "Plant Cell and Environment, vol. 31, no. 4, pp. 484-491", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Short- and long-term modulation of the lutein epoxide and violaxanthin cycles in two species of the Lauraceae: sweet bay laurel (Laurus nobilis L.) and avocado (Persea americana Mill)", "year": "2008", "source": "Plant Biology, vol. 10, no. 3, pp. 288-297", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Photosynthesis: Energy from the Sun. 14th International Congress on Photosynthesis", "year": "2008", "source": "SpringerThe Netherlands", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "The rise and fall of the prickly pear", "year": "2008", "source": "Australian Heritage, vol. 12, pp. 47-52", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Curiosity and context revisited: crassulacean acid metabolism in the Anthropocene", "year": "2008", "source": "Journal of Experimental Botany, vol. 59, no. 7, pp. 1489-1502", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Dynamics of the truncated lutein epoxide cycle in avocado (Persea Americana L.): implications for efficiency of light harvesting", "year": "2008", "source": "in Allen, J. F., Gantt, E., Golbeck, J. H., Osmond, B. (ed.), Photosynthesis. Energy from the Sun: 14th International Congress on Photosynthesis 2007, Springer, Dordrecht, pp. 1031-1034", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Imaging heterogeneity of xanthophyll independent non-photochemical quenching during photosynthetic induction in shade-grown leaves of avocado (Persea americana L.)", "year": "2008", "source": "International Congress on Photosynthesis (PS 2008), ed. J Allen, E Gantt, J Golbeck, B Osmond, Springer, The Netherlands, pp. 681-685", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "The effect of elevated CO2, soil and atmospheric water deficit and seasonal phenology on leaf and ecosystem isoprene emission", "year": "2007", "source": "Functional Plant Biology, vol. 34, pp. 774-784", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "The lutein epoxide cycle in higher plants; its relationship to other xanthophyll cycles and possible functions", "year": "2007", "source": "Functional Plant Biology, vol. 34, no. 9, pp. 759-773", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Short- and Long-Term Operation of the Lutein-Epoxide Cycle in Light-Harvesting Antenna Complexes", "year": "2007", "source": "Plant Physiology, vol. 144, no. 2, pp. 926-941", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Photoinhibition: Then and Now", "year": "2006", "source": "in Barbara Demmig-Adams, William Adams & Autar Mattoo (ed.), Photoprotection, Photoinhibition, Gene Regulation, and Environment, Springer, Netherlands, pp. 11-22", "authors": ["Charles Barry  Osmond"]}, {"title": "Improved survival of very high light and oxidative stress is conferred by spontaneous gain-of-function mutations in Chlamydomonas", "year": "2005", "source": "Biochimica et Biophysica Acta: Bioenergetics, vol. 1709, pp. 45-57", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Distinctive diel growth cycles in leaves and cladodes of CAM plants: differences from C3 plants and putative interations with substrate availability, turgor and cytoplasmic pH", "year": "2005", "source": "Functional Plant Biology, vol. 32, no. 5, pp. 421-428", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Measuring photosynthetic parameters at a distance: laser induced fluorescence transient (LIFT) method for remote measurements of photosynthesis in terrestrial vegetation", "year": "2005", "source": "Photosynthesis Research, vol. 84, pp. 121-129", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Remote sensing of hetergeneity in photosynthetic efficiency, electron transport and dissipation of excess light in Populus deltoides stands under ambient and elevated CO2 concentrations,and in a tropical forest canopy, using a new laser-induced fluorescenc", "year": "2005", "source": "Global Change Biology, vol. 11, pp. 1195-1206", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Steady-state chlorophyll fluorescece (Fs) as an indicator of leaf photosynthesis and stomatal conductance under drought conditions", "year": "2002", "source": "International Congress on Photosynthesis (PS 2001), CSLI Publications, Melbourne, pp. s28-005", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Low morning temperature limits photosynthesis and growth in cool climate grapevines", "year": "2002", "source": "International Congress on Photosynthesis (PS 2001), CSLI Publications, Melbourne, pp. s34-008", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Field portable imaging system for measurement of chlorophyll fluorescence quenching", "year": "2002", "source": "in K Omasa, H Saji, S Youseffian and N Kondo (ed.), Air Pollution and Plant Biotechnology, Springer, Tokyo, pp. 309-319", "authors": ["Charles Barry  Osmond"]}, {"title": "Steady-state chlorophyll fluorescence (Fs) measurements as a tool to follow variations of net CO2 assimilation and stomatal conductance during water stress in C3 plants", "year": "2002", "source": "Physiologia Plantarum, vol. 114, pp. 231-240", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "What does it take to be C4? Lessons from the evolution of C4 photosynthesis", "year": "2001", "source": "Plant Physiology, vol. 125, pp. 46-49", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Diurnal and acclimatory responses of violaxanthin and lutein epoxide in the Australian mistletoe Amyema miquelii", "year": "2001", "source": "Australian Journal of Plant Physiology, vol. 28, pp. 793-800", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Infection with phloem limited Abutilon virus causes localised carbohydrate accumulation in leaves of Abutilon striatum: relationships to symptom development and effects on chlorophyll fluorescence quenching during photosynthetic induction", "year": "2000", "source": "Plant Biology, vol. 2, pp. 161-167", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Effects of acetate on facultative autotrophy in Chlamydomonas reinhardtti assessed by photosynthetic measurements and stable isotope analysis", "year": "2000", "source": "Plant Physiology, vol. 122, pp. 1439-1445", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Evaluation of photoinhibitory printing on leaves by chlorophyll autofluorescence: confocal microscopy confirms diminished fluorescence from grana", "year": "1999", "source": "Australian Journal of Plant Physiology, vol. 26, pp. 717-724", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Rapid changes in xanthophyll cycle-dependent energy dissipation and photosystem II efficiency intwo vines, Sephania japonica and Smilax australis, growing in the under-storey of an open eucalyptus forest", "year": "1999", "source": "Plant Cell and Environment, vol. 22, pp. 125-136", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "nalysis of the relative increase in photosynthetic O2 uptake when photosynthesis in grapevine leaves is inhibited following low night temperatures and/or water stress", "year": "1999", "source": "Plant Physiology, vol. 121, pp. 675-684", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Mutants of Chlamydomonas reinhardtii resistent to very high light", "year": "1999", "source": "Journal of Photochemistry and Photobiology B: Biology, vol. 48, pp. 127-135", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Photoinhibitory printing on leaves, visualized by chlorophyll fluorescence imaging and confocal microscopy, is due to diminished fluorescence from grana", "year": "1999", "source": "Australian Journal of Plant Physiology, vol. 26, pp. 717-724", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}, {"title": "Reversible, water stress-induced non-uniform chlorophyll fluorescence quenchinginwilting leaves of Potentilla reptans may not be due topatchy stomatal closure", "year": "1999", "source": "Plant Biology, vol. 1, pp. 618-624", "authors": ["Charles Barry  Osmond", "Charles Barry  Osmond"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}