{"ANU": {"name": "Christopher James Nolan PhD", "link": "https://researchers.anu.edu.au/researchers/nolan-cx", "colleges": "College of Health & Medicine", "email": "christopher.nolan@anu.edu.au", "phone": "+61251245311", "expertise": ["Endocrinology", "Metabolic Medicine", "Cell Physiology", "Systems Physiology", "Foetal Development And Medicine"], "interest": ["Type 1 diabetes, type 2 diabetes, diabetes in pregnancy, pancreatic islet biology, metabolic diseases, diabetes complications"], "biography": "Prof Christopher (Chris) Nolan is a clinician/scientist/teacher/policy advisor in diabetes. He completed his training in Medicine at the University of Melbourne (BMedSc and MBBS-1983) and Endocrinology at The Royal Melbourne Hospital (FRACP-1991). He received his doctoral degree from the University of Melbourne on glucose metabolism and insulin action in pregnancy under the supervision of Prof Joe Proietto (1998). He received further training in islet beta-cell research at the University of Montreal under supervision of Prof Marc Prentki (2002-4). He moved to Canberra to join the Endocrinology Department at The Canberra Hospital and the ANU Medical School in 2005. He is currently Associate Dean of Research and Professor of Endocrinology for the ANU Medical School, Chair of the ANU College of Health and Medicine Research Committee, and a Senior Staff Specialist in Endocrinology at Canberra Health Services. In 2018 he stepped down as Director of Diabetes Services (2011-2018) and Director of Endocrinology (2016-2018) at the Canberra Hospital. Under his leadership, the ACT Health Diabetes Service was recognised as a National Centre of Excellence by the National Association of Diabetes Centres. Prof Nolan is currently a Board Member of the Australian Diabetes Society and Co-Chair of the Advisory Committee of the Diabetes Australia Research Program. He has previously been President of the Australasian Diabetes in Pregnancy Society and Council Member of the International Association of Diabetes in Pregnancy Study Groups. He is an Advisory Board Member for Diabetologia (2020-) and an International Review Panel Member for the Danish Diabetes Academy Committee for Talent Development (2018-). He directs an active diabetes research laboratory at the John Curtin School of Medical Research focusing on islet beta-cell failure in type 1 and 2 diabetes and the role of insulin hypersecretion in metabolic syndrome and related conditions. He is involved in multicentre diabetes clinical studies including the NHMRC funded Treatment of Booking Gestational Diabetes (TOBOGM) study. He is a lead investigator for the ANU Grand Challenge project, Our Health in Our Hands, which includes research into improving the care of people with type 1 diabetes using a personalised medicine approach.", "project": [], "publication": [{"title": "Turning the tide", "year": "2020", "source": "on hyperglycemia in pregnancy: insights from multiscale dynamic simulation modeling'BMJ Open Diabetes Research & Care, vol. 8, no. 1, pp. 1-12", "authors": ["Freebairn L", "Atkinson J", "Qin Y", "Christopher James Nolan PhD"]}, {"title": "Strict Preanalytical Oral Glucose Tolerance Test Blood Sample Handling Is Essential for Diagnosing Gestational Diabetes Mellitus", "year": "2020", "source": "Diabetes Care, vol. 43, no. 7, pp. 1438-1441", "authors": ["Potter J", "Hickman P", "Oakman C", "Christopher James Nolan PhD"]}, {"title": "Exploring Therapeutic Targets to Reverse or Prevent the Transition from Metabolically Healthy to Unhealthy Obesity", "year": "2020", "source": "Cells, vol. 9, no. 7, pp. 1-23", "authors": ["Christopher James Nolan PhD"]}, {"title": "Insulin resistance and insulin hypersecretion in the metabolic syndrome and type 2 diabetes: Time for a conceptual framework shift", "year": "2019", "source": "Diabetes and Vascular Disease Research, vol. 16, no. 2, pp. 118-127", "authors": ["Christopher James Nolan PhD", "Prentki M"]}, {"title": "Diabetes in pregnancy: a new decade of challenges ahead", "year": "2018", "source": "Diabetologia, vol. 61, no. 5, pp. 1012-1021pp", "authors": ["Schaefer-Graf U", "Napoli A", "Christopher James Nolan PhD"]}, {"title": "Hyperglycaemia in early pregnancy: the Treatment of Booking Gestational diabetes Mellitus (TOBOGM) study. A randomised controlled trial", "year": "2018", "source": "Medical Journal of Australia, vol. 209, no. 9, pp. 405-406pp", "authors": ["Simmons D", "Hague W", "Teede H", "Christopher James Nolan PhD"]}, {"title": "Barriers to a healthy lifestyle for three- to four-year-old children of Australian-born and overseas-born mothers with post-gestational diabetes: An Australian qualitative study", "year": "2018", "source": "Journal of Child Health Care, vol. 22, no. 3, pp. 447-459", "authors": ["Zulfiqar T", "Christopher James Nolan PhD", "Banwell C"]}, {"title": "Changes in Macular function with Multifocal Pupillography and its spatial correlation with severity of Diabetic Retinopathy", "year": "2018", "source": "Annual Meeting of the Association for Research in Vision and Ophthalmology (ARVO), ed. Donald C. Hood, ARVO, USA, pp. Meeting Abstract: 1893", "authors": ["Sabeti F", "Sabeti F", "Carle C", "Christopher James Nolan PhD"]}, {"title": "Identification of the signals for glucose-induced insulin secretion in INS1 (832/13) -cells using metformin-induced metabolic deceleration as a model", "year": "2017", "source": "Journal of Biological Chemistry, vol. 292, no. 47, pp. 19458-19468", "authors": ["Lamontagne J", "Al-Mass A", "Christopher James Nolan PhD"]}, {"title": "case of Klinefelter syndrome with hypersexual desire", "year": "2017", "source": "Endocrinology, Diabetes & Metabolism Case Reports, vol. 2017, no. 1, pp. 1-5", "authors": ["Okolie K", "Perampalam S", "Barker A", "Christopher James Nolan PhD"]}, {"title": "Can body temperature dysregulation explain the co-occurrence between overweight/obesity, sleep impairment, late-night eating, and a sedentary lifestyle?", "year": "2017", "source": "Eating and Weight Disorders, vol. 22, no. 4, pp. 599-608pp", "authors": ["Brown R", "Thorsteinsson E", "Smithson M", "Christopher James Nolan PhD"]}, {"title": "Barriers to a healthy lifestyle post gestational-diabetes: An Australian qualitative study", "year": "2017", "source": "Women and Birth, vol. 30, no. 4, pp. 319-324", "authors": ["Zulfiqar T", "Lithander F", "Banwell C", "Christopher James Nolan PhD"]}, {"title": "Genetic predisposition for beta cell fragility underlies type 1 and type 2 diabetes", "year": "2016", "source": "Nature Genetics, vol. 48, no. 5, pp. 519-527", "authors": ["Dooley J", "Tian L", "Schonefeldt S", "Christopher James Nolan PhD"]}, {"title": "The fetal glucose steal: an underappreciated phenomenon in diabetic pregnancy", "year": "2016", "source": "Diabetologia, vol. 59, no. 6, pp. 1089-1094", "authors": ["Desoye G", "Christopher James Nolan PhD"]}, {"title": "The Role of Digital Engagement in the Self-Management of Type 2 Diabetes", "year": "2016", "source": "Health Communication, vol. 31, no. 12, pp. 1557-1565", "authors": ["Hanlen L", "Christopher James Nolan PhD", "Park S"]}, {"title": "The gestational diabetes tsunami: can we survive it?", "year": "2016", "source": "Australian and New Zealand Journal of Obstetrics and Gynaecology, vol. 56, no. 4, pp. 333-335pp", "authors": ["Scott P", "Zhang Y", "Christopher James Nolan PhD"]}, {"title": "n Integrated MHealth Model for Type 2 Diabetes Patients Using Mobile Tablet Devices", "year": "2016", "source": "Journal of mobile technology in medicine, vol. 5, no. 2, pp. 24-32pp", "authors": ["Park S", "Burford S", "Hanlen L", "Christopher James Nolan PhD"]}, {"title": "Reversibility of Defects in Proinsulin Processing and Islet beta-Cell Failure in Obesity-Related Type 2 Diabetes", "year": "2016", "source": "Diabetes, vol. 65, no. 2, pp. 352-354", "authors": ["Christopher James Nolan PhD", "Delghingaro-Augusto V"]}, {"title": "The Pathobiology of Diabetes", "year": "2016", "source": "in Anandwardhan A. Hardikar (ed.), Pancreatic Islet Biology, Springer, Australia, pp. 1-48", "authors": ["Jenkins A", "O'Neal D", "Christopher James Nolan PhD"]}, {"title": "Insulin Resistance as a Physiological Defense Against Metabolic Stress: Implications for the Management of Subsets of Type 2 Diabetes", "year": "2015", "source": "Diabetes, vol. 64, no. 3, pp. 673-686", "authors": ["Christopher James Nolan PhD", "Ruderman N", "Kahn S"]}, {"title": "Diabetes in pregnancy outcomes: A systematic review and proposed codification of definitions", "year": "2015", "source": "Diabetes-Metabolism research and reviews, vol. 31, no. 7, pp. 680-690", "authors": ["Feig D", "Corcoy R", "Jensen D", "Christopher James Nolan PhD"]}, {"title": "Multifocal pupillography identifies changes in visual sensitivity according to severity of diabetic retinopathy in type 2 diabetes", "year": "2015", "source": "Investigative Ophthalmology and Visual Science, vol. 56, no. 8, pp. 4504-4513", "authors": ["Sabeti F", "Christopher James Nolan PhD", "Christopher James Nolan PhD"]}, {"title": "Strain dependence of diet-induced NASH and liver fibrosis in obese mice is linked to diabetes and inflammatory phenotype", "year": "2014", "source": "Liver International, vol. 34, no. 7, pp. 1084-1093", "authors": ["Farrell G", "Mridha A", "Yeh M", "Christopher James Nolan PhD"]}, {"title": "Lipotoxicity, beta Cell Dysfunction, and Gestational Diabetes", "year": "2014", "source": "Cell Metabolism, vol. 19, no. 4, pp. 553-554", "authors": ["Christopher James Nolan PhD"]}, {"title": "Follow-up of blood-pressure lowering and glucose control in type 2 diabetes", "year": "2014", "source": "New England Journal of Medicine, vol. 371, no. 15, pp. 1392-1406", "authors": ["Zoungas S", "Chalmers J", "Neal B", "Christopher James Nolan PhD"]}, {"title": "Chronic Intervillositis: Value of ALKP Monitoring", "year": "2014", "source": "Pathology, vol. 46, no. S2, pp. S32", "authors": ["Dahlstrom J", "Christopher James Nolan PhD", "McCormack R"]}, {"title": "Once-weekly albiglutide versus once-daily liraglutide in patients with type 2 diabetes inadequately controlled on oral drugs (HARMONY 7): a randomised, open-label, multicentre, non-inferiority phase 3 study", "year": "2014", "source": "The Lancet Diabetes & Endocrinology, vol. 2, no. 4, pp. 289-297", "authors": ["Pratley R", "Nauck M", "Barnett A", "Christopher James Nolan PhD"]}, {"title": "RNA sequencing of all transcripts and how islet beta-cells fail", "year": "2014", "source": "Diabetes, vol. 63, no. 6, pp. 1823-1825", "authors": ["Christopher James Nolan PhD", "Delghingaro-Augusto V"]}, {"title": "Opportunistic pathology-based screening for Diabetes", "year": "2013", "source": "BMJ Open, vol. 3, no. 9, pp. e003411-e003411", "authors": ["Simpson A", "Krowka R", "Kerrigan J", "Christopher James Nolan PhD"]}, {"title": "Dietary modification dampens liver inflammation and fibrosis in obesity-related fatty liver disease", "year": "2013", "source": "Obesity, vol. 21, no. 6, pp. 1189-1199", "authors": ["Larter C", "Yeh M", "Haigh W", "Christopher James Nolan PhD"]}, {"title": "Selective modulation through the glucocorticoid receptor ameliorates muscle pathology in mdx mice", "year": "2013", "source": "Journal of Pathology, vol. 231, no. 2, pp. 223-235", "authors": ["Huynh T", "Uaesoontrachoon K", "Quinn J", "Christopher James Nolan PhD"]}, {"title": "Normal long-term health for infants of diabetic mothers: can we achieve it?", "year": "2013", "source": "Journal of Clinical Endocrinology and Metabolism, vol. 98, no. 9, pp. 3592-3594", "authors": ["Christopher James Nolan PhD"]}, {"title": "Intensive insulin for type 2 diabetes: the risk of causing harm", "year": "2013", "source": "The Lancet Diabetes & Endocrinology, vol. 1, no. 1, pp. 9-10", "authors": ["Christopher James Nolan PhD", "Ruderman N", "Prentki M"]}, {"title": "Type 2 diabetes across generations: from pathophysiology to prevention and management", "year": "2011", "source": "Lancet, The (UK edition), vol. 378, no. 9786, pp. 169-181", "authors": ["Christopher James Nolan PhD", "Damm P", "Prentki M"]}, {"title": "Vitamin D status and its predictive factors in pregnancy in 2 Australian populations", "year": "2011", "source": "Australian and New Zealand Journal of Obstetrics and Gynecology, vol. 51, no. 4, pp. 353-359", "authors": ["Perampalam S", "Ganda K", "Chow K", "Christopher James Nolan PhD"]}, {"title": "Controversies in gestational diabetes", "year": "2011", "source": "Best Practice & Research: Clinical Obstetrics & Gynaecology, vol. 25, no. 1, pp. 37-49", "authors": ["Christopher James Nolan PhD"]}, {"title": "Effects of perindopril-indapamide on left ventricular diastolic function and mass in patients with type 2 diabetes: The ADVANCE Echocardiography Substudy", "year": "2011", "source": "Journal of Hypertension, vol. 29, no. 7, pp. 1439-1447", "authors": ["Doughty R", "Whalley G", "Gamble G", "Christopher James Nolan PhD"]}, {"title": "Failure of islet beta-cell compensation for insulin resistance causes type 2 diabetes: What causes non-alcoholic fatty liver disease and non-alcoholic steatohepatitis?", "year": "2010", "source": "Journal of Gastroenterology and Hepatology, vol. 25, no. 10, pp. 1594-1597", "authors": ["Christopher James Nolan PhD"]}, {"title": "Pioglitazone Acutely Reduces Insulin Secretion and Causes Metabolic Deceleration of the Pancreatic beta-Cell at Submaximal Glucose Concentrations", "year": "2009", "source": "Endocrinology, vol. 150, no. 8, pp. 3465-3474", "authors": ["Lamontagne J", "Pepin E", "Peyot M", "Christopher James Nolan PhD"]}, {"title": "The islet beta-cell: fuel responsive and vulnerable", "year": "2008", "source": "Trends in Endocrinology and Metabolism, vol. 19, no. 8, pp. 285-291", "authors": ["Christopher James Nolan PhD", "Prentki M"]}, {"title": "Circulating lipids are lowered but pancreatic islet lipid metabolism and insulin secretion are unaltered in exercise-trained female rats", "year": "2007", "source": "Applied Physiology, Nutrition and Metabolism, vol. 32, pp. 241-248", "authors": ["Lamontagne J", "Masiello P", "Marcil M", "Christopher James Nolan PhD"]}, {"title": "Upregulation of cellular triacylglycerol - free fatty acid cycling by oleate is associated with long-term serum-free survival of human breast cancer cells", "year": "2007", "source": "Biochemistry and Cell Biology, vol. 85, pp. 301-310", "authors": ["Przybytkowski E", "Joly E", "Christopher James Nolan PhD"]}, {"title": "Islet beta cell failure in type 2 diabetes", "year": "2006", "source": "Journal of Clinical Investigation, vol. 116, no. 7, pp. 1802-1812", "authors": ["Prentki M", "Christopher James Nolan PhD"]}, {"title": "daptive failure to high-fat diet characterizes steatohepatitis in Alms1 mutant mice", "year": "2006", "source": "Biochemical and Biophysical Research Communications, vol. 342, pp. 1152-1159", "authors": ["Arsov T", "Larter C", "Christopher James Nolan PhD"]}, {"title": "daptive failure to high-fat diet characterizes steatohepatitis in Alms1 mutant mice", "year": "2006", "source": "Biochemical and Biophysical Research Communications, vol. 342, no. 4, pp. 1152-59", "authors": ["Arsov T", "Larter C", "Christopher James Nolan PhD"]}, {"title": "Regulation of lipolytic activity by long-chain acyl-coenzyme A in islets and adipocytes", "year": "2005", "source": "American Journal of Physiology - Endocrinology and Metabolism, vol. 289, no. 6, pp. E1085-E1092", "authors": ["Hu L", "Deeney J", "Christopher James Nolan PhD"]}, {"title": "role for the malonyl-CoA/long-chain acyl-CoA pathway of lipid signaling in the regulation of insulin secretion in response to both fuel and nonfuel stimuli", "year": "2004", "source": "Diabetes, vol. 53, no. 2004, pp. 1007-1019", "authors": ["Christopher James Nolan PhD", "Roduit R", "Alarcon C"]}, {"title": "Saturated fatty acids synergize with elevated glucose to cause pancreatic beta-cell death", "year": "2003", "source": "Endocrinology, vol. 144, no. 9, pp. 4154-4163", "authors": ["El-Assaad W", "Buteau J", "Peyot M", "Christopher James Nolan PhD"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}