{"ANU": {"name": "Christopher Cvitanovic", "link": "https://researchers.anu.edu.au/researchers/cvitanovic-c", "colleges": "College of Science", "email": "Christopher.Cvitanovic@anu.edu.au", "phone": "", "expertise": [], "interest": ["OverviewIn its broadest sense, Chris' research is focused on improving the uptake and impact of scientific research among different end-users to facilitate evidence-informed decision-making for sustainable ocean futures.  He does so by collaborating closely with researchers from other disciplines (e.g. economists, psychologists and ecologists), and actors from other sectors (e.g. policy-makers, industry leaders and non-governmental organisations) to ensure a transdisciplinary approach to his work.  Chris is currently leading (or has led) research projects throughout Australia, in the EU, the US and the South Pacific. Specific Research ThemesTheme 1: Generating the knowledge needed to support the sustainable management of marine socio-ecological systemsThe first of Chris’ research themes is focused on generating the knowledge that is needed to support the sustainable management of marine socio-ecological systems.  This research recognises that understanding, and developing solutions to, contemporary social-ecological challenges necessitates integrative forms of knowledge production, such as those associated with inter- and trans-disciplinary research approaches.  Despite the promise of integrative research approaches, however, persistent and systematic barriers to the implementation remain – and thus Chris’ research in this space aims to identify strategies to improve their implementation.  For example, through the evaluation of existing interdisciplinary research efforts to identify the critical factors underpinning success (e.g. Blythe and Cvitanovic, under review); or by drawing on organizational psychology theory to identify improved mechanisms for developing shared goals within interdisciplinary research teams that reflect the values, worldviews and knowledge bases of all team members (Cvitanovic et al. 2020).  Theme 2: Connecting marine science to policy and practiceChris’ second theme of research is focused on improving knowledge exchange among marine scientists and decision-makers to enable evidence-informed decision-making processes.  He approaches this topic in a number of ways.  First, by seeking to identify and better understand the strategies that can facilitate improved knowledge exchange, to optimise their implementation and match specific strategies to contexts.  This work has included a focus on knowledge brokers (Cvitanovic et al. 2017), boundary organisations (Cvitanovic et al. 2018a) and processes of knowledge co-production (Norström, Cvitanovic et al. 2020). Second, this research seeks to improve the ways in which knowledge exchange processes are evaluated (Posner and Cvitanovic, 2019) so as to improve our capacity to learn from existing efforts, and provide guiding principles for future initiatives aimed at linking marine science to policy and practice (e.g. Fig 1 in Cvitanovic and Hobday 2018). A key focus throughout all of this research has been identifying the institutional changes that are needed (by research organisations, government agencies and research funders) to better support a more dynamic relationship between marine science, policy and practice.  Theme 3: Public engagement for ocean literacyThe third theme of Chris’ research is focused on improving ocean literary among the public (e.g. community groups, tourists, etc.) for better environmental outcomes.  This research stream developed following several years of collaborating with marine park managers in Australia across Commonwealth and State levels, and learning about their need for engagement strategies that can reach all segments of diverse communities and user groups.  Thus, to ensure the practical utility of this research it is co-developed with different marine park managers.  Recent examples include a study from the Ningaloo Coast in Australia that sought to understand community perceptions about the management of the Ningaloo Marine Park, so as to develop a typology of ‘community members’, and identify specific engagement strategies to engage with each ‘type’ of community member (Cvitanovic et al. 2018b).     Building the capacity of early career marine scientistsIn addition to his research, Chris’ work also focuses on helping to build the capacity of early career marine scientists in relation to the themes outlined above.  For example, Chris has co-authored several articles focused on helping early career researchers understand how to achieve impacts on policy and practice (e.g. Evans and Cvitanovic, 2018), and how to engage more effectively as part of interdisciplinary research teams and processes (e.g. Kelly et al. 2019; Moon et al. under review).  He is also a regular lecturer for the IMBeR ClimEco International Summer School series, and has convened practical workshops in Australia and overseas for early career scientists focused on building capacity for policy engagement."], "biography": "Chris was the founding chair of The Interdisciplinary Marine Early Career Network where he continues to serve as a member of the Organising Committee.  He is also on the Editorial Boards for the Springer-Nature journals Reviews in Fish Biology and Fisheries and Socio-Ecological Practice Research.  Previously Chris has also served as a member of the Integrated Marine Biosphere Research (IMBeR) project Scientific Steering Committee and the MarXiv Advisory Board.", "project": [], "publication": [{"title": "pplying an Organizational Psychology Model for Developing Shared Goals in Interdisciplinary Research Teams", "year": "2020", "source": "One Earth, vol. 2, no. 1, pp. 75-83", "authors": ["Christopher Cvitanovic", "Colvin R", "Reynolds K"]}, {"title": "To Achieve a Sustainable Blue Future, Progress Assessments Must Include Interdependencies between the Sustainable Development Goals", "year": "2020", "source": "One Earth, vol. 2, no. 2, pp. 161-173", "authors": ["Nash K", "Blythe J", "Christopher Cvitanovic"]}, {"title": "Principles for knowledge co-production in sustainability research", "year": "2020", "source": "Nature Sustainability, vol. 3, pp. 182-190", "authors": ["Norstrom A", "Christopher Cvitanovic", "Lof M"]}, {"title": "Engaging More Effectively With Visitors to Coastal Regions for Improved Management Outcomes: Insights From the Ningaloo Coast, Australia", "year": "2020", "source": "Frontiers in Marine Science, vol. 7, no. 583, pp. 1-14", "authors": ["Christopher Cvitanovic", "van Putten I", "Kelly R"]}, {"title": "Coupling property rights with responsibilities to improve conservation outcomes across land and seascapes [IN PRESS]", "year": "2020", "source": "Conservation Letters, vol. Online", "authors": ["Moon K", "Marsh D", "Christopher Cvitanovic"]}, {"title": "Five Organizational Features That Enable Successful Interdisciplinary Marine Research", "year": "2020", "source": "Frontiers in Marine Science, vol. 7, pp. 1-14", "authors": ["Blythe J", "Christopher Cvitanovic"]}, {"title": "Quantitative Foresighting as a Means of Improving Anticipatory Scientific Capacity and Strategic Planning", "year": "2020", "source": "One Earth, vol. 3, no. 5, pp. 631-644", "authors": ["Hobday A", "Boschetti F", "Moeseneder C", "Christopher Cvitanovic"]}, {"title": "n Assessment of How Australian Fisheries Management Plans Account for Climate Change Impacts", "year": "2020", "source": "Frontiers in Marine Science, vol. 7, pp. 1-19", "authors": ["Fogarty H", "Christopher Cvitanovic", "Hobday A"]}, {"title": "Prepared for change? An assessment of the current state of knowledge to support climate adaptation for Australian fisheries", "year": "2019", "source": "Reviews in Fish Biology and Fisheries, vol. 29, no. 4, pp. 877-894", "authors": ["Fogarty H", "Christopher Cvitanovic", "Hobday A"]}, {"title": "Ten tips for developing interdisciplinary socio-ecological researchers", "year": "2019", "source": "Socio-Ecological Practice Research, vol. 1, no. 2, pp. 149-161", "authors": ["Kelly R", "Mackay M", "Nash K", "Christopher Cvitanovic"]}, {"title": "practical framework for implementing and evaluating integrated management of marine activities", "year": "2019", "source": "Ocean and Coastal Management, vol. 177, pp. 127-138", "authors": ["Stephenson R", "Hobday A", "Christopher Cvitanovic"]}, {"title": "Maximising the benefits of participatory climate adaptation research by understanding and managing the associated challenges and risks", "year": "2019", "source": "Environmental Science and Policy, vol. 94, pp. 20-31", "authors": ["Christopher Cvitanovic", "Howden M", "Colvin R"]}, {"title": "Evaluating the impacts of boundary-spanning activities at the interface of environmental science and policy: A review of progress and future research needs", "year": "2019", "source": "Environmental Science and Policy, vol. 92, pp. 141-151", "authors": ["Posner S", "Christopher Cvitanovic"]}, {"title": "Proactive, Reactive, and Inactive Pathways for Scientists in a Changing World", "year": "2019", "source": "Earth's Future, vol. 7, pp. 60-73", "authors": ["McDonald K", "Hobday A", "Thompson P", "Christopher Cvitanovic"]}, {"title": "Progress in integrating natural and social science in marine\r\necosystem-based management research", "year": "2019", "source": "Marine and Freshwater Research, vol. 70, no. 1, pp. 71-83", "authors": ["Alexander K", "Hobday A", "Christopher Cvitanovic"]}, {"title": "Building optimism at the environmental science-policy-practice interface through the study of bright spots", "year": "2018", "source": "Nature Communications, vol. 9, no. 3466, pp. 1-5", "authors": ["Christopher Cvitanovic", "Hobday A"]}, {"title": "Understanding and managing trust at the climate science-policy interface", "year": "2018", "source": "Nature Climate Change, vol. 8, no. 1, pp. 22-28", "authors": ["Lacey J", "Howden M", "Christopher Cvitanovic"]}, {"title": "Building university-based boundary organisations that facilitate impacts on environmental policy and practice", "year": "2018", "source": "PLOS ONE (Public Library of Science), vol. 13, no. 9, pp. 1-19", "authors": ["Christopher Cvitanovic", "Lof M", "Norstrom A"]}, {"title": "n introduction to achieving policy impact for early career researchers", "year": "2018", "source": "palgrave communications, vol. 4, no. 88, pp. 1-12", "authors": ["Evans M", "Christopher Cvitanovic"]}, {"title": "Boundary spanning at the science-policy interface: the practitioners", "year": "2018", "source": "perspectives'Sustainability Science, vol. 13, no. 4, pp. 1175-1183", "authors": ["Bednarek A", "Wyborn C", "Christopher Cvitanovic"]}, {"title": "Building trust among marine protected area managers and community members through scientific research: Insights from the Ningaloo Marine Park, Australia", "year": "2018", "source": "Marine Policy, vol. 93, pp. 195-206", "authors": ["Christopher Cvitanovic", "van Putten I", "Hobday A"]}, {"title": "Ten essentials for action-oriented and second order energy transitions, transformations and climate change research", "year": "2018", "source": "Energy Research & Social Science, vol. 40, pp. 54-70pp", "authors": ["Fazey I", "Schapke N", "Caniglia G", "Christopher Cvitanovic"]}, {"title": "The emergence of social licence necessitates reforms in environmental regulation", "year": "2018", "source": "Ecology and Society, vol. 23, no. 3, pp. 1-11", "authors": ["van Putten I", "Christopher Cvitanovic", "Fulton E"]}, {"title": "Governing fisheries through the critical decade: the role and utility of polycentric systems", "year": "2018", "source": "Reviews in Fish Biology and Fisheries, vol. 28, no. 1, pp. 1-18", "authors": ["Christopher Cvitanovic", "Hobday A", "McDonald J"]}, {"title": "dapting to climate change: the role of organisational personalities in natural resource management", "year": "2018", "source": "Regional Environmental Change, vol. 18, no. 2, pp. 561-571", "authors": ["Hobday A", "Doerr V", "Marshall N", "Christopher Cvitanovic"]}, {"title": "framework for incorporating sense of place into the management of marine systems", "year": "2018", "source": "Ecology and Society, vol. 23, no. 4, pp. 1-24", "authors": ["van Putten I", "Plaganyi E", "Booth K", "Christopher Cvitanovic"]}, {"title": "Using Social Network Analysis to Monitor and Assess the Effectiveness of Knowledge Brokers at Connecting Scientists and Decision-Makers: An Australian case study", "year": "2017", "source": "Environmental Policy and Governance, vol. 27, no. 3, pp. 256-269pp", "authors": ["Christopher Cvitanovic", "Cunningham R", "Dowd A"]}, {"title": "Empirically derived guidance for social scientists to influence environmental policy", "year": "2017", "source": "PLOS ONE (Public Library of Science), vol. 12, no. 3, pp. 1-9", "authors": ["Marshall N", "Adger N", "Attwood S", "Christopher Cvitanovic"]}, {"title": "Planetary boundaries for a blue planet", "year": "2017", "source": "Nature Ecology & Evolution, vol. 1, no. 11, pp. 1625-1634", "authors": ["Nash K", "Christopher Cvitanovic", "Fulton E"]}, {"title": "Preparing Australian fisheries for the critical decade: insights from the past 25 years", "year": "2017", "source": "Marine and Freshwater Research, vol. 68, no. 10, pp. 1779-1787", "authors": ["Hobday A", "Christopher Cvitanovic"]}, {"title": "The Influence of Community Size and Location on Different Dimensions of Vulnerability: a case study of Australian coastal communities", "year": "2017", "source": "Australian Geographer, vol. 48, no. 1, pp. 121-142", "authors": ["van Putten I", "Villanueva C", "Christopher Cvitanovic"]}, {"title": "From science to action: Principles for undertaking environmental research that enables knowledge exchange and evidence-based decision-making", "year": "2016", "source": "Journal of Environmental Management, vol. 183, no. 3, pp. 864-874", "authors": ["Christopher Cvitanovic", "McDonald J", "Hobday A"]}, {"title": "Engaging communities in climate adaptation: the potential of social networks", "year": "2016", "source": "Climate Policy, vol. 16, no. 7, pp. 894-908pp", "authors": ["Cunningham R", "Christopher Cvitanovic", "Measham T"]}, {"title": "changing marine sector in Australian coastal communities: An analysis of inter and intra sectoral industry connections and employment", "year": "2016", "source": "Ocean and Coastal Management, vol. 131, pp. 1-12", "authors": ["van Putten I", "Christopher Cvitanovic", "Fulton E"]}, {"title": "call for empirically based guidelines for building trust among stakeholders in environmental sustainability projects", "year": "2016", "source": "Sustainability Science, vol. 11, no. 5, pp. 855-859", "authors": ["Boschetti F", "Christopher Cvitanovic", "Fleming A"]}, {"title": "Linking adaptation science to action to build food secure Pacific Island communities", "year": "2016", "source": "Climate Risk Management, vol. 11, pp. 53-62", "authors": ["Christopher Cvitanovic", "Crimp S", "Fleming A"]}, {"title": "Informed adaptation: Ethical considerations for adaptation researchers and decision-makers", "year": "2015", "source": "Global Environmental Change - Human and Policy Dimensions, vol. 32, pp. 200-210", "authors": ["Lacey J", "Howden M", "Christopher Cvitanovic"]}, {"title": "Overcoming barriers to knowledge exchange for adaptive resource management; the perspectives of Australian marine scientists", "year": "2015", "source": "Marine Policy, vol. 52, pp. 38-44", "authors": ["Christopher Cvitanovic", "Hobday A", "Van Kerkhoff L"]}, {"title": "Informed adaptation: Ethical considerations for adaptation researchers and decision-makers", "year": "2015", "source": "Global Environmental Change - Human and Policy Dimensions, vol. 32, pp. 200-210", "authors": ["Lacey J", "Howden M", "Christopher Cvitanovic"]}, {"title": "Perceptions of Australian marine protected area managers regarding the role, importance, and achievability of adaptation for managing the risks of climate change", "year": "2014", "source": "Ecology and Society, vol. 19, no. 4, p. 33", "authors": ["Christopher Cvitanovic", "Marshall N", "Wilson S"]}, {"title": "Foraging in corallivorous butterflyfish varies with wave exposure", "year": "2014", "source": "Coral Reefs, vol. 33, no. 2, pp. 351-361", "authors": ["Noble M", "Pratchett M", "Coker D", "Christopher Cvitanovic"]}, {"title": "Utility of primary scientific literature to environmental managers: An international case study on coral-dominated marine protected areas", "year": "2014", "source": "Ocean and Coastal Management, vol. 102, pp. 72-78", "authors": ["Christopher Cvitanovic", "Fulton C", "Wilson S"]}, {"title": "bundance, diversity, and feeding behavior of coral reef butterflyfishes at Lord Howe Island", "year": "2014", "source": "Ecology and Evolution, vol. 4, no. 18, pp. 3612-3625", "authors": ["Pratchett M", "Hoey A", "Christopher Cvitanovic"]}, {"title": "Supporting Regional Natural Resource management (NRM) organisations to update their NRM plans for adaptation to climate change", "year": "2013", "source": "International Congress on Modelling and Simulation MODSIM 2013, ed. Piantadosi, J., Anderssen, R.S. and Boland J., Modelling and Simulation Society of Australia and New Zealand Inc., Australia, pp. 2214-2220", "authors": ["Bohnet I", "Hill R", "Turton S", "Christopher Cvitanovic"]}, {"title": "Critical research needs for managing coral reef marine protected areas: Perspectives of academics and managers", "year": "2013", "source": "Journal of Environmental Management, vol. 114, pp. 84-91", "authors": ["Christopher Cvitanovic", "Wilson S", "Fulton C"]}, {"title": "High Macroalgal Cover and Low Coral Recruitment Undermines the Potential Resilience of the World", "year": "2011", "source": "s Southernmost Coral Reef Assemblages'PLOS ONE (Public Library of Science), vol. 6, no. 10, pp. 1-9", "authors": ["Hoey A", "Pratchett M", "Christopher Cvitanovic"]}, {"title": "Rapid increase in coral cover on an isolated coral reef, the Ashmore Reef National Nature Reserve, north-western Australia", "year": "2011", "source": "Marine and Freshwater Research, vol. 62, no. 10, pp. 1214-1220", "authors": ["Ceccarelli D", "Richards Z", "Pratchett M", "Christopher Cvitanovic"]}, {"title": "RESEARCH CHALLENGES TO IMPROVE THE MANAGEMENT AND CONSERVATION OF SUBTROPICAL REEFS TO TACKLE CLIMATE CHANGE THREATS FINDINGS OF A WORKSHOP CONDUCTED IN COFFS HARBOUR AUSTRALIA ON 13 SEPTEMBER 2010", "year": "2011", "source": "Ecological Management and Restoration, vol. 12, no. 1, pp. e7-e10", "authors": ["Beger M", "Babcock R", "Booth D", "Christopher Cvitanovic"]}, {"title": "Benthic community composition influences within-habitat variation in macroalgal browsing on the Great Barrier Reef", "year": "2010", "source": "Marine and Freshwater Research, vol. 61, no. 9, pp. 999-105", "authors": ["Christopher Cvitanovic", "Hoey A"]}, {"title": "Local variation in herbivore feeding activity on an inshore reef of the Great Barrier Reef", "year": "2009", "source": "Coral Reefs, vol. 28, no. 1, pp. 127-133", "authors": ["Christopher Cvitanovic", "Bellwood D"]}]}, "Microsoft-Academic": [{"title": "principles for knowledge co production in sustainability research", "year": 2020, "source": "", "authors": [{"name": "albert v norstrom", "affiliation": "stockholm resilience centre"}, {"name": "christopher cvitanovic", "affiliation": "australian national university"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "marie lof", "affiliation": "stockholm university"}, {"name": "simon west", "affiliation": "charles darwin university"}, {"name": "simon west", "affiliation": "australian national university"}, {"name": "simon west", "affiliation": "stockholm resilience centre"}, {"name": "carina wyborn", "affiliation": "university of montana"}, {"name": "carina wyborn", "affiliation": "international union for conservation of nature and natural resources"}, {"name": "patricia balvanera", "affiliation": "national autonomous university of mexico"}, {"name": "angela t bednarek", "affiliation": "the pew charitable trusts"}, {"name": "elena m bennett", "affiliation": "mcgill university"}, {"name": "reinette biggs", "affiliation": "stellenbosch university"}, {"name": "reinette biggs", "affiliation": "stockholm resilience centre"}, {"name": "ariane de bremond", "affiliation": "university of maryland college park"}, {"name": "ariane de bremond", "affiliation": "university of bern"}, {"name": "bruce m campbell", "affiliation": "international center for tropical agriculture"}, {"name": "josep g canadell", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "stephen r carpenter", "affiliation": "university of wisconsin madison"}, {"name": "carl folke", "affiliation": "stockholm resilience centre"}, {"name": "carl folke", "affiliation": "royal swedish academy of sciences"}, {"name": "elizabeth a fulton", "affiliation": "university of tasmania"}, {"name": "elizabeth a fulton", "affiliation": "hobart corporation"}, {"name": "owen gaffney", "affiliation": "potsdam institute for climate impact research"}, {"name": "owen gaffney", "affiliation": "stockholm resilience centre"}, {"name": "stefan gelcich", "affiliation": "pontifical catholic university of chile"}, {"name": "jeanbaptiste jouffray", "affiliation": "stockholm resilience centre"}, {"name": "jeanbaptiste jouffray", "affiliation": "royal swedish academy of sciences"}, {"name": "melissa leach", "affiliation": "university of sussex"}, {"name": "martin le tissier", "affiliation": "university college cork"}, {"name": "berta martinlopez", "affiliation": "luneburg university"}, {"name": "elena louder", "affiliation": "university of arizona"}, {"name": "mariefrance loutre"}, {"name": "alison m meadow", "affiliation": "university of arizona"}, {"name": "harini nagendra", "affiliation": "azim premji university"}, {"name": "davnah payne", "affiliation": "university of bern"}, {"name": "garry d peterson", "affiliation": "stockholm resilience centre"}, {"name": "belinda reyers", "affiliation": "stellenbosch university"}, {"name": "belinda reyers", "affiliation": "stockholm resilience centre"}, {"name": "r j scholes", "affiliation": "university of the witwatersrand"}, {"name": "chinwe ifejika speranza", "affiliation": "university of bern"}, {"name": "marja spierenburg", "affiliation": "stellenbosch university"}, {"name": "marja spierenburg", "affiliation": "radboud university nijmegen"}, {"name": "mark staffordsmith", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "maria tengo", "affiliation": "stockholm resilience centre"}, {"name": "sandra van der hel", "affiliation": "utrecht university"}, {"name": "ingrid van putten", "affiliation": "university of tasmania"}, {"name": "ingrid van putten", "affiliation": "hobart corporation"}, {"name": "henrik osterblom", "affiliation": "stockholm resilience centre"}]}, {"title": "improving knowledge exchange among scientists and decision makers to facilitate the adaptive governance of marine resources a review of knowledge and research needs", "year": 2015, "source": "ocean & coastal management", "authors": [{"name": "christopher cvitanovic", "affiliation": "australian national university"}, {"name": "christopher cvitanovic", "affiliation": "hobart corporation"}, {"name": "alistair j hobday", "affiliation": "university of tasmania"}, {"name": "alistair j hobday", "affiliation": "hobart corporation"}, {"name": "l van kerkhoff", "affiliation": "australian national university"}, {"name": "shaun k wilson", "affiliation": "university of western australia"}, {"name": "kirstin dobbs", "affiliation": "great barrier reef marine park authority"}, {"name": "nadine marshall", "affiliation": "james cook university"}], "id": 8178725}, {"title": "ten essentials for action oriented and second order energy transitions transformations and climate change research", "year": 2018, "source": "energy research and social science", "authors": [{"name": "ioan fazey", "affiliation": "university of dundee"}, {"name": "niko schapke", "affiliation": "luneburg university"}, {"name": "guido caniglia", "affiliation": "luneburg university"}, {"name": "james patterson", "affiliation": "vu university amsterdam"}, {"name": "johan hultman", "affiliation": "lund university"}, {"name": "barbara van mierlo", "affiliation": "wageningen university and research centre"}, {"name": "filippa sawe", "affiliation": "lund university"}, {"name": "arnim wiek", "affiliation": "arizona state university"}, {"name": "julia wittmayer", "affiliation": "erasmus university rotterdam"}, {"name": "paulina aldunce", "affiliation": "university of chile"}, {"name": "husam al waer", "affiliation": "university of dundee"}, {"name": "nandini battacharya", "affiliation": "university of dundee"}, {"name": "hilary bradbury", "affiliation": "chalmers university of technology"}, {"name": "esther carmen", "affiliation": "university of dundee"}, {"name": "john colvin", "affiliation": "emerald group publishing"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "marcella dsouza"}, {"name": "maja gopel"}, {"name": "bruce evan goldstein", "affiliation": "university of colorado boulder"}, {"name": "timo hamalainen"}, {"name": "gavin harper", "affiliation": "university of birmingham"}, {"name": "tom henfry", "affiliation": "university of lisbon"}, {"name": "anthony hodgson", "affiliation": "university of dundee"}, {"name": "mark howden", "affiliation": "australian national university"}, {"name": "andrew kerr", "affiliation": "university of edinburgh"}, {"name": "matthias klaes", "affiliation": "university of buckingham"}, {"name": "christopher lyon", "affiliation": "university of dundee"}, {"name": "gerald midgley", "affiliation": "university of hull"}, {"name": "susanne c moser", "affiliation": "stanford university"}, {"name": "nandan mukherjee", "affiliation": "university of dundee"}, {"name": "karl muller"}, {"name": "karen obrien", "affiliation": "university of oslo"}, {"name": "deborah oconnell", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "per olsson", "affiliation": "stockholm university"}, {"name": "glenn page"}, {"name": "mark reed", "affiliation": "newcastle university"}, {"name": "beverley a searle", "affiliation": "university of dundee"}, {"name": "giorgia silvestri", "affiliation": "erasmus university rotterdam"}, {"name": "viktoria spaiser", "affiliation": "university of leeds"}, {"name": "tim strasser", "affiliation": "maastricht university"}, {"name": "petra tschakert", "affiliation": "university of western australia"}, {"name": "natalia uribecalvo"}, {"name": "steve waddell"}, {"name": "jennifer raowilliams", "affiliation": "university of dundee"}, {"name": "russell m wise", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "ruth wolstenholme"}, {"name": "mel woods", "affiliation": "university of dundee"}, {"name": "carina wyborn"}], "id": 2764593084}, {"title": "boundary spanning at the science policy interface the practitioners perspectives", "year": 2018, "source": "sustainability science", "authors": [{"name": "angela t bednarek", "affiliation": "the pew charitable trusts"}, {"name": "carina wyborn", "affiliation": "university of montana"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "ryan meyer", "affiliation": "university of california davis"}, {"name": "rebecca colvin", "affiliation": "australian national university"}, {"name": "prue f e addison", "affiliation": "university of oxford"}, {"name": "s l close", "affiliation": "the pew charitable trusts"}, {"name": "k curran", "affiliation": "the pew charitable trusts"}, {"name": "mahmud farooque", "affiliation": "arizona state university"}, {"name": "erica goldman"}, {"name": "david hart", "affiliation": "university of maine"}, {"name": "h mannix"}, {"name": "bridie mcgreavy", "affiliation": "university of maine"}, {"name": "adam parris", "affiliation": "city university of new york"}, {"name": "stephen posner", "affiliation": "university of vermont"}, {"name": "c robinson"}, {"name": "melanie ryan", "affiliation": "university of cambridge"}, {"name": "p b leith", "affiliation": "university of tasmania"}], "id": 135086837}, {"title": "from science to action principles for undertaking environmental research that enables knowledge exchange and evidence based decision making", "year": 2016, "source": "journal of environmental management", "authors": [{"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "jan mcdonald", "affiliation": "university of tasmania"}, {"name": "alistair j hobday", "affiliation": "university of tasmania"}, {"name": "alistair j hobday", "affiliation": "hobart corporation"}], "id": 44455300}, {"title": "planetary boundaries for a blue planet", "year": 2017, "source": "nature ecology and evolution", "authors": [{"name": "kirsty l nash", "affiliation": "university of tasmania"}, {"name": "kirsty l nash", "affiliation": "hobart corporation"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "christopher cvitanovic", "affiliation": "hobart corporation"}, {"name": "elizabeth a fulton", "affiliation": "hobart corporation"}, {"name": "elizabeth a fulton", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "benjamin s halpern", "affiliation": "imperial college london"}, {"name": "benjamin s halpern", "affiliation": "university of california santa barbara"}, {"name": "e j milnergulland", "affiliation": "university of oxford"}, {"name": "reg watson", "affiliation": "university of tasmania"}, {"name": "reg watson", "affiliation": "hobart corporation"}, {"name": "julia l blanchard", "affiliation": "university of tasmania"}, {"name": "julia l blanchard", "affiliation": "hobart corporation"}], "id": 2764884935}, {"title": "an introduction to achieving policy impact for early career researchers", "year": 2018, "source": "palgrave communications", "authors": [{"name": "megan c evans", "affiliation": "university of queensland"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}], "id": 2737936280}, {"title": "empirically derived guidance for social scientists to influence environmental policy", "year": 2017, "source": "plos one", "authors": [{"name": "nadine marshall", "affiliation": "james cook university"}, {"name": "neil adger", "affiliation": "university of exeter"}, {"name": "simon attwood", "affiliation": "university of east anglia"}, {"name": "katrina brown", "affiliation": "university of exeter"}, {"name": "charles c crissman", "affiliation": "worldfish"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "cassandra de young"}, {"name": "margaret gooch", "affiliation": "great barrier reef marine park authority"}, {"name": "craig james", "affiliation": "commonwealth scientific and industrial research organisation"}, {"name": "sabine jessen", "affiliation": "canadian parks and wilderness society"}, {"name": "dave johnson"}, {"name": "paul marshall", "affiliation": "university of queensland"}, {"name": "sarah park", "affiliation": "university of east anglia"}, {"name": "dave wachenfeld", "affiliation": "great barrier reef marine park authority"}, {"name": "damian wrigley"}], "id": 202381698}, {"title": "ten tips for developing interdisciplinary socio ecological researchers", "year": 2019, "source": "", "authors": [{"name": "rachel kelly", "affiliation": "university of tasmania"}, {"name": "mary mackay", "affiliation": "university of tasmania"}, {"name": "kirsty l nash", "affiliation": "university of tasmania"}, {"name": "christopher cvitanovic", "affiliation": "australian national university"}, {"name": "christopher cvitanovic", "affiliation": "university of tasmania"}, {"name": "edward h allison", "affiliation": "university of washington"}, {"name": "derek armitage", "affiliation": "university of waterloo"}, {"name": "aletta bonn", "affiliation": "university of jena"}, {"name": "aletta bonn", "affiliation": "leipzig university"}, {"name": "steven j cooke", "affiliation": "carleton university"}, {"name": "s d frusher", "affiliation": "university of tasmania"}, {"name": "elizabeth a fulton", "affiliation": "university of tasmania"}, {"name": "elizabeth a fulton", "affiliation": "hobart corporation"}, {"name": "benjamin s halpern", "affiliation": "university of california santa barbara"}, {"name": "priscila f m lopes", "affiliation": "federal university of rio grande do norte"}, {"name": "e j milnergulland", "affiliation": "university of oxford"}, {"name": "myron a peck", "affiliation": "university of hamburg"}, {"name": "g t pecl", "affiliation": "university of tasmania"}, {"name": "robert l stephenson", "affiliation": "university of st andrews"}, {"name": "robert l stephenson", "affiliation": "university of new brunswick"}, {"name": "francisco e werner", "affiliation": "national marine fisheries service"}]}, {"title": "overcoming barriers to knowledge exchange for adaptive resource management the perspectives of australian marine scientists", "year": 2015, "source": "marine policy", "authors": [{"name": "christopher cvitanovic", "affiliation": "australian national university"}, {"name": "christopher cvitanovic", "affiliation": "hobart corporation"}, {"name": "alistair j hobday", "affiliation": "hobart corporation"}, {"name": "l van kerkhoff", "affiliation": "australian national university"}, {"name": "nadine marshall", "affiliation": "james cook university"}], "id": 56205983}], "ANDS-Grants": []}