{"ANU": {"name": "Christina Petterson", "link": "https://researchers.anu.edu.au/researchers/petterson-c", "colleges": "College of Arts and Social Sciences", "email": "Christina.Petterson@anu.edu.au", "phone": "", "expertise": ["Christian Studies Incl. Biblical Studies And Church History", "European History Excl. British Classical Greek And Roman", "Culture Gender Sexuality", "Postcolonial Studies"], "interest": ["My main research interest is looking at Christianity through the  lenses of theology, history and cultural theory. Over the years this has  taken place through analyses of eighteenth century Germany, Danish colonialism in  Greenland, and New Testament studies.  My interests in European history in the 15th to 18th centuries are  focussed on social change, the role of Christianity and the emergence  and consolidation of capitalism, including colonialism and missions. My  PhD thesis was on the relationship between Protestant ideology and  colonialism in the Danish mission to Greenland and how Protestantism  helped implement racial hierarchies, gender roles and abstract social  relations in Greenlandic society.      My interest in New Testament relate to questions of method, language,  economics and interpretation. My latest book deals with the relationship between  text and the body of Jesus in John's  gospel. Rather than a religious  study, I would regard this as a  philosophical exploration of the  relationship between text and reality,  and the ideology of writing in  our understandings of body and death. I have also done work in Hebrews, Ephesians, and the Acts of the  Apostles. At the moment I am completing a bookmanuscript based on archival studies of 400 speeches given by the  founder of the Moravian Brethren (Herrnhuter Brüdergemeinde), Count  Zinzendorf to the congregation in Herrnhut (eastern Germany) in the  mid-eighteenth century. The speeches are in handwritten German, and are  fabulous sources to the changes in social relations, the establishment  of gender roles, and  individualisation. The project I will be working on here at the ANU is called Balancing Economy and Christ: The Brüdergemeinde in Greenland and Australia and is a two year research project funded by the Gerda Henkel Stiftung. It is a comparative project which analyses the change in social relations with the advent of capitalism in the missionary practice of the global Protestant missions  of the Herrnhuter Brüdergemeinde to Greenland (1733-1901)  and the Australian colonies (1848-1919). Drawing on unpublished  archival material (church records, correspondence, journals, and  ledgers), the project aims to show how the missionary practice of the  Brüdergemeinde changed from an earlier approach, practiced  in Greenland, and embedded in a local subsistence economy to a more  dis-embedded economic approach, practiced in Australia; and analyse how  this affected the missionaries’ attitude to and engagements with the  Indigenous populations.In 2018 I will be part of a network on the Danish Moravian settlement of Christiansfeld, a UNESCO cultural heritage site. This 3 year network, whose core-members are 5 colleagues from Denmark and myself  is funded by The Independent Research Fund Denmark (FFR)."], "biography": "", "project": [], "publication": [{"title": "Colonial Subjectification Foucault, Christianity and Governmentality", "year": "2012", "source": "Cultural Studies Review, vol. 18, no. 2, pp. 89-108", "authors": ["Christina Petterson"]}]}, "Microsoft-Academic": [{"title": "speaking about marriage notes from the 1744 married choir conferences", "year": 2017, "source": "", "authors": [{"name": "christina petterson"}, {"name": "katherine faull"}]}, {"title": "apostles of revolution marxism and biblical studies", "year": 2020, "source": "", "authors": [{"name": "christina petterson", "affiliation": "university of copenhagen"}]}, {"title": "colonialism racism and exceptionalism", "year": 2016, "source": "", "authors": [{"name": "christina petterson"}]}, {"title": "can you ever really leave foucault", "year": 2021, "source": "political theology", "authors": [{"name": "christina petterson", "affiliation": "australian national university"}], "id": 181266130}, {"title": "white women aboriginal missions and australian settler governments maternal contradictions", "year": 2020, "source": "australian historical studies", "authors": [{"name": "christina petterson", "affiliation": "australian national university"}], "id": 199561357}, {"title": "idols of nations biblical myth at the origins of capitalism", "year": 2014, "source": "", "authors": [{"name": "roladn boer"}, {"name": "christina petterson"}]}, {"title": "the missionary the catechist and the hunter foucault protestantism and colonialism", "year": 2014, "source": "", "authors": [{"name": "christina petterson"}]}, {"title": "time of troubles a new economic framework for early christianity", "year": 2017, "source": "", "authors": [{"name": "roland boer"}, {"name": "christina petterson"}]}, {"title": "review of fernando f segovia and r s sugirtharajah eds a postcolonial commentary on the new testament writings the bible and postcolonialism 13 new york london t t clark 2007", "year": 2011, "source": "the bible and critical theory", "authors": [{"name": "christina petterson", "affiliation": "macquarie university"}], "id": 194316711}, {"title": "colonial subjectification foucault christianity and governmentality", "year": 2012, "source": "cultural studies review", "authors": [{"name": "christina petterson", "affiliation": "humboldt university of berlin"}], "id": 2764866180}], "ANDS-Grants": []}