{"ANU": {"name": "Christian Lueck", "link": "https://researchers.anu.edu.au/researchers/lueck-cj", "colleges": "College of Health & Medicine", "email": "christian.lueck@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "neuralgic amyotrophy following infection with sars cov 2", "year": 2020, "source": "muscle & nerve", "authors": [{"name": "timo siepmann", "affiliation": "dresden university of technology"}, {"name": "hagen h kitzler", "affiliation": "dresden university of technology"}, {"name": "christian lueck", "affiliation": "dresden university of technology"}, {"name": "ivan platzek", "affiliation": "dresden university of technology"}, {"name": "heinz reichmann", "affiliation": "dresden university of technology"}, {"name": "kristian barlinn", "affiliation": "dresden university of technology"}], "id": 173274907}], "ANDS-Grants": [{"description": "A new technology for concurrently stimulating both eyes, and recording thousands of responses from the brain, will be tested for its effectiveness in diagnosing and tracking progression in Multiple Sclerosis (MS), and the degree to which it complements Magnetic Resonance Imaging (MRI). Our understanding of MS has changed in recent years. It is now recognised to have two phases: an initial inflammatory phase, and a secondary progressive phase. The progressive phase produces the inexorable increasing disability of MS. MS only affects about 0.04% of Australians but the early onset of MS, the high cost of medication, and the prolonged period of disability, mean that the cost to Australia is about $2 billion pa. MRI quantifies the inflammatory phase well but is poorly correlated with the debilitating secondary progression. The common treatments for MS target the inflammatory phase but not the causes of secondary progression, which are unknown. Current diagnostic methods mean diagnosis can take years, meaning that patients can be denied treatment for some time. The applicants have published experiments on 50 MS patients and 27 normal subjects using a variant of the new method. Not only has it shown high diagnostic accuracy, but the new method seems to provide data on the progressive phase, suggesting strongly that it is complementary to MRI. The new method is also much cheaper to set up and run than MRI and so could provide cost-effective means for monitoring patient condition and testing new drugs that are effective against the progressive phase. The applicants have considerable experience commercialising diagnostic technologies, and are currently working with an Australian company developing new diagnostic hardware. That hardware has been adapted to perform the presently proposed experiments. Overall it is reasonable to assume that positive outcomes will be translated into economic and health benefits for Australians.", "title": "Rapid, cost-effective, diagnosis and monitoring of multiple sclerosis by novel multifocal evoked potential methods", "id": "97894", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/418029", "researchers": ["A/Pr Andrew James", "Prof Ted Maddess", "Prof Christian Lueck"], "status": "closed", "fundingAmount": 152463.89, "fundingScheme": "NHMRC Development Grants", "startDate": 2008, "endDate": 2008, "dateTimeModified": "2015-04-12T07:53:36Z", "dateTimeCreated": "2013-05-15T06:45:35Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Ted Maddess"], "purl": "http://purl.org/au-research/grants/nhmrc/418029", "identifiers": ["http://purl.org/au-research/grants/nhmrc/418029", "418029"], "subjects": ["Neurology and Neuromuscular Diseases", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "cortical evoked potentials", "electrophysiological measures", "evoked response potentials", "magnetic resonance imaging", "multiple sclerosis", "brain function", "diagnostic methods", "vision screening"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/97894"}]}, {"description": "Thrombolysis is a method of dissolving the blood clot that is the cause of the majority of strokes in Australia. The first major trial to demonstrate benefit for this treatment was published some 11 years ago but treatment has not been widely implemented across Australia because of the difficulties in giving treatment within the very tight time window for which treatment is currently approved (patients must get to hospital, be scanned and start treatment within 3 hours of the onset of the stroke). Other factors which have limited implementation of treatment in Australia are continued debate over the trial data for this treatment as only one of the 5 major trials was positive. In addition, virtually no patients aged over 80 years old were included in the previous trials, and as this age group represents about a third of all stroke in Australia, new data in this age group is required. As a result of the difficulty in giving a treatment within such a tight time window and the ongoing debate about the trial data, few Australians are currently treated and thus the public health impact is negligible. In to change clinical practice, we need reliable data from a large convincing further trial of thrombolysis with the more realistic time window of 6 hours. The Third International Stroke Trial (IST-3) is a large international collaborative effort to determine whether thrombolysis treatment offered to a wider range of patients up to 6 hours from stroke onset results in an increase in long-term independent survival. Data from such a trial is most likely to change clinical practice and lead to an important public health benefit.", "title": "The Third International Stroke Trial (IST-3)", "id": "81227", "institutions": ["University of Sydney"], "key": "http://purl.org/au-research/grants/nhmrc/457343", "researchers": ["Prof Christian Lueck", "Dr Stephen Read", "A/Pr Peter Hand", "Prof Mark Parsons", "Prof Christopher Levi", "Prof Richard Lindley"], "status": "closed", "fundingAmount": 218656.8, "fundingScheme": "NHMRC Project Grants", "startDate": 2007, "endDate": 2009, "dateTimeModified": "2015-04-12T07:55:16Z", "dateTimeCreated": "2013-05-15T04:46:56Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["University of Sydney"], "principalInvestigator": ["Prof Richard Lindley"], "purl": "http://purl.org/au-research/grants/nhmrc/457343", "identifiers": ["http://purl.org/au-research/grants/nhmrc/457343", "457343"], "subjects": ["Central Nervous System", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "Health Services Research", "Neuroscience", "Thrombolysis Treatment", "Brain Imaging", "Stroke"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/81227"}]}]}