{"ANU": {"name": "Christine Phillips", "link": "https://researchers.anu.edu.au/researchers/phillips-cb", "colleges": "College of Health & Medicine", "email": "christine.phillips@anu.edu.au", "phone": "61257665", "expertise": ["Primary Health Care", "Public Health And Health Services"], "interest": ["Primary health care systemsRefugee health and the health of vulnerable personsInterprofessional working in health settings"], "biography": "Christine is a general practitioner and health services researcher with interest and expertise in the health and health care of marginalised persons and populations, and quality in health care. She leads the Social Foundations of Medicine group at the ANU Medical School, where she instituted a curriculum integrating the social sciences of medicine and health across all four years  of the curriculun.  Christine is Medical Director of Companion House Medical Service, the ACT's refugee health care service, and has over twenty-five years of clinical experience working in primary care in the context of deep urban poverty, in settings including drug and alcohol medicine, elder care, and prison health.  She is immediate past Chair of the Refugee Health Network of Australia, an organisation she co-founded in 2009, and has been an Advisor for UNHCR, the Migration Council of Australia, and state and federal departments of health and human services. Awards include: Member of the Order of Australia (2020) for service to medical  education, refugee and migrant health and medicine; University of New  England Distinguished Alumnus (2020); Australian Awards for University Teaching Citation for Teaching Excellence (2014); ANU Vice Chancellor's Awards for excellence in teaching (2014),  community outreach and engagement (2011), and programs that enhance  learning  (2015); ANU International Women's Day Award for gender equity (2012); ACT Health  Australia Day Award for Companion House Medical Service (2010); Rotary Australia Evaluation of Rural Health Award (2008); ANU JG Crawford Medal (1999). Her work in refugee health led to her inclusion in the National Library of Australia's Australian Women's Archive project. Her research largely addresses implementation research and diversity and equity in health and health care.", "project": [], "publication": [{"title": "Funeral and interment practices of rural residents: A mixed methods study", "year": "2021", "source": "Death Studies, vol. 45, no. 2, pp. 101-109", "authors": ["Rainsford S", "Christine Phillips", "MacLeod R"]}, {"title": "Lessons for the global primary care response to COVID-19: a rapid review of evidence from past epidemics", "year": "2021", "source": "Family Practice, pp. 1-15", "authors": ["Desborough J", "Hall S", "Christine Phillips"]}, {"title": "COVID-19 and the moral imagination", "year": "2021", "source": "The Lancet 397(10275):648-65", "authors": ["Patel M", "Christine Phillips"]}, {"title": "With the best will in the world: How benevolent sexism shapes medical careers", "year": "2020", "source": "Medical Education, vol. 54, no. 2, pp. 94-97", "authors": ["Stone L", "Christine Phillips", "Douglas K"]}, {"title": "The Sydney Statement 2019: normalizing global health security online", "year": "2020", "source": "The Lancet, vol. 395, no. 10217, pp. 28-29", "authors": ["Christine Phillips", "Patel M", "McLinton E"]}, {"title": "It struck at the heart of who I thought I was: A meta-synthesis of the qualitative literature examining the experiences of people with multiple sclerosis", "year": "2020", "source": "Health Expectations, vol. 23, no. 5, pp. 1007-1027", "authors": ["Desborough J", "Brunoro C", "Parkinson A", "Christine Phillips"]}, {"title": "Towards resilient health systems for increasing climate extremes: insights from the 2019-20 Australian bushfire season", "year": "2020", "source": "International Journal of Wildland Fire, 30(1):1-5", "authors": ["Lal A", "Patel M", "Hunter A", "Christine Phillips"]}, {"title": "Should professional interpreters be allowed to conscientiously object in health care settings? [IN PRESS]", "year": "2019", "source": "Journal of Medical Ethics, vol. 3 December 2019 (epub ahead of print)", "authors": ["Emmerich N", "Christine Phillips"]}, {"title": "re the providers of spiritual care in your hospital capable? Narrative review of professional accountability in Australia", "year": "2019", "source": "Health and Social Care Chaplaincy, vol. 7, no. 2", "authors": ["Eve K", "Christine Phillips"]}, {"title": "Living Guidelines for Absolute Cardiovascular Disease Risk Assessment and Management", "year": "2019", "source": "Heart, Lung and Circulation, vol. 28, no. 6, pp. 829-832", "authors": ["Paige E", "Agostino J", "Christine Phillips"]}, {"title": "Sexual assault and harassment of doctors, by doctors: a qualitative study", "year": "2019", "source": "Medical Education, vol. 53, no. 8, pp. 833-843", "authors": ["Stone L", "Christine Phillips", "Douglas K"]}, {"title": "Sexual Harassment of Junior Doctors: Helping Whistle Blowers Who Reveal a Significant Mental Health Issue", "year": "2019", "source": "Journal of Ethics in Mental Health, vol. 10, no. 2, pp. 1-13", "authors": ["Braid H", "Money T", "Dalpadado R", "Christine Phillips"]}, {"title": "Dying at home in rural residential aged care: A mixed-methods study in the Snowy Monaro region, Australia", "year": "2018", "source": "Health and Social Care in the Community, vol. 26, no. 5, pp. 705-713", "authors": ["Rainsford S", "Christine Phillips", "Glasgow N"]}, {"title": "Place of death in the Snowy Monaro region of New South Wales: A study of residents who died of a condition amenable to palliative care", "year": "2018", "source": "Australian Journal of Rural Health, vol. 26, no. 2, pp. 126-133", "authors": ["Rainsford S", "Glasgow N", "Macleod R", "Christine Phillips"]}, {"title": "The", "year": "2018", "source": "safe death': An ethnographic study exploring the perspectives of rural palliative care patients and family caregivers'Palliative Medicine, vol. 32, no. 10, pp. 1575-1583", "authors": ["Rainsford S", "Christine Phillips", "Glasgow N"]}, {"title": "Developing a Positive Patient Experience With Nurses in General Practice: An Integrated Model of Patient Satisfaction and Enablement", "year": "2017", "source": "Journal of Advanced Nursing, vol. Online, pp. 38pp", "authors": ["Desborough J", "Christine Phillips", "Mills J"]}, {"title": "survey of the experiences of families with bereavement support services following a perinatal loss", "year": "2017", "source": "Australian and New Zealand Journal of Obstetrics and Gynecology, vol. 1, no. 10, pp. 1-10pp", "authors": ["Inati V", "Matic M", "Christine Phillips"]}, {"title": "Rural end-of-life care from the experiences and perspectives of patients and family caregivers: A systematic literature review", "year": "2017", "source": "Palliative Medicine, vol. 31, no. 10, pp. 895-912pp", "authors": ["Rainsford S", "Macleod R", "Glasgow N", "Christine Phillips"]}, {"title": "The process of patient enablement in general practice nurse consultations: a grounded theory study", "year": "2017", "source": "Journal of Advanced Nursing, vol. 73, no. 5, pp. 1085-1096pp", "authors": ["Desborough J", "Banfield M", "Christine Phillips"]}, {"title": "Dangerous sadness: nervoza among first and second generation Macedonian immigrants to Australia", "year": "2017", "source": "Ethnicity and Health, vol. Online, pp. 1-11pp", "authors": ["Misev A", "Christine Phillips"]}, {"title": "People-centred integration in a refugee primary care service: a complex adaptive systems perspective", "year": "2017", "source": "Journal of Integrated Care, vol. 25, no. 1, pp. 26-38", "authors": ["Christine Phillips", "Hall S", "Elmitt N"]}, {"title": "Impact of interprofessional education about psychological and medical comorbidities on practitioners", "year": "2016", "source": "knowledge and collaborative practice: mixed method evaluation of a national program'BMC Health Services Research, vol. 16, no. 465, pp. 1-9pp", "authors": ["Christine Phillips", "Hall S", "Irving M"]}, {"title": "Malaria", "year": "2016", "source": "in N.J. Chaves, G. Paxton, B.A. Biggs, A. Thambiran, M. Smith (ed.), Recommendations for comprehensive post-arrival health assessment for people from refugee-like backgrounds, Australian Society for Infectious Diseases, Surry Hills, Australia, pp. 31-36", "authors": ["Christine Phillips", "Francis J"]}, {"title": "Schistosomiasis", "year": "2016", "source": "in N.J. Chaves, G. Paxton, B.A. Biggs, A. Thambiran, M. Smith (ed.), Recommendations for comprehensive post-arrival health assessment for people from refugee-like backgrounds, Australian Society for Infectious Diseases, Surry Hills, Australia, pp. 55-61", "authors": ["Davis J", "Christine Phillips", "Clifford V"]}, {"title": "Critical case analysis of adverse events associated with failure to use interpreters for non-English speaking patients.", "year": "2016", "source": "", "authors": ["Rowse J", "Anderson K", "Christine Phillips"]}, {"title": "Preventing falls", "year": "2010", "source": "promoting healthengaging community: Evaluation report of the Greater Southern Area Health Service Physical Activity Leaders Network Tai Chi Program", "authors": ["Hall S", "Christine Phillips", "Dubois L"]}, {"title": "", "year": "2016", "source": "Improving health outcomes for linguistically diverse patients. Medical Journal of Australia 204(6): 209-21", "authors": ["Christine Phillips", "ed"]}, {"title": "Tracking Progress toward Health and Equity through the Millennium Development Goals-Lessons for Public Health Surveillance", "year": "2016", "source": "in Scott McNabb, J Mark Conde, Lisa Ferland, William MacWright, Ziad Memish et al (ed.), Transforming Public Health Surveillance: Proactive Measures for Prevention, Detection, and Response, Elsevier, Great Britain, pp. 385-397", "authors": ["Patel M", "Afsana K", "Christine Phillips"]}, {"title": "Using the Freeth/Kirkpatrick model to evaluate interprofessional learning outcomes in a rural setting", "year": "2016", "source": "Focus on Health Professional Education, vol. 17, no. 1, pp. 84-99", "authors": ["Craig P", "Hall S", "Christine Phillips"]}, {"title": "Rural residents", "year": "2016", "source": "perspectives on the rural good death': a scoping review'Health and Social Care in the Community", "authors": ["Rainsford S", "Macleod R", "Glasgow N", "Christine Phillips"]}, {"title": "Health security and political and economic determinants of Ebola", "year": "2015", "source": "The Lancet, vol. 386, no. 9995, pp.  737-738", "authors": ["Patel M", "Christine Phillips"]}, {"title": "Low levels of Vitamin B12 can persist in the early resettlement of refugees: symptoms, screening and monitoring", "year": "2015", "source": "Australian Family Physician, vol. 44, no. 9, pp. 668-673", "authors": ["Benson J", "Christine Phillips", "Kay M"]}, {"title": "Building social capital with interprofessional student teams in rural settings: a service-learning model", "year": "2016", "source": "Australian Journal of Rural Health, vol. 24, no. 4, pp. 271-277", "authors": ["Craig P", "Christine Phillips", "Hall S"]}, {"title": "Beyond resettlement: Long-term care for people who have had refugee-like experiences", "year": "2014", "source": "Australian Family Physician, vol. 43, no. 11, pp. 764-767", "authors": ["Christine Phillips"]}, {"title": "Using qualitative mixed methods to study small health care organizations while maximising trustworthiness and authenticity", "year": "2014", "source": "BMC Health Services Research, vol. 14, no. 559, pp. 1-13", "authors": ["Christine Phillips", "Dwan K", "Hepworth J"]}, {"title": "Impact of nursing care in Australian general practice on the quality of care: A pilot of the Patient Enablement and Satisfaction Survey (PESS)", "year": "2015", "source": "Collegian, vol. 22, no. 2, pp. 207-214", "authors": ["Desborough J", "Christine Phillips", "Banfield M"]}, {"title": "Nurses and the wise organisation: techne and phronesis in Australian general practice", "year": "2013", "source": "Nursing Inquiry, vol. 20, no. 2, pp. 121-132", "authors": ["Christine Phillips", "Hall S"]}, {"title": "Low Vitamin B12 Levels among Newly-Arrived Refugees from Bhutan, Iran and Afghanistan: A Multicentre Australian Study", "year": "2013", "source": "PLOS ONE (Public Library of Science), vol. 8, no. 2, pp. e57998-e57998", "authors": ["Benson J", "Christine Phillips", "Kay M"]}, {"title": "The Computerized Medical Record as a Tool for Clinical Governance in Australian Primary Care", "year": "2013", "source": "Interactive Journal of Medical Research (i-JMR), vol. 2, no. 2, pp. 21-33", "authors": ["Pearce C", "De Lusignan S", "Christine Phillips"]}, {"title": "Remote Telephone Interpretation in Medical Consultations with Refugees: Meta-communications about Care, Survival and Selfhood", "year": "2013", "source": "Journal of Refugee Studies, vol. 26, no. 4, pp. 505-523", "authors": ["Christine Phillips"]}, {"title": "Bearing Witness Through Medicine: An Exploratory Study of Attitudes to Service Among Australian Evangelical Christian Doctors", "year": "2013", "source": "Journal of Religion and Health, vol. 52, no. 4, pp. 1177-1187", "authors": ["Jensen S", "Christine Phillips"]}, {"title": "spatial analysis of the expanding roles of nurses in general practice", "year": "2012", "source": "BMC Nursing, vol. 11, no. 13", "authors": ["Pearce C", "Hall S", "Christine Phillips"]}, {"title": "The many faces of the computer: An analysis of clinical software in the primary care consultation", "year": "2012", "source": "International Journal of Medical Informatics, vol. 81, no. 7, pp. 475-484", "authors": ["Pearce C", "Arnold M", "Christine Phillips"]}, {"title": "The patient and the computer in the primary care consultation", "year": "2011", "source": "Journal of the American Medical Informatics Association, vol. 18, no. 2, pp. 138-142", "authors": ["Pearce C", "Arnold M", "Christine Phillips"]}, {"title": "Views of GPs and practice nurses on support needed to respond to pandemic influenza: a qualitative study", "year": "2011", "source": "Australian Health Review, vol. 35, no. 1, pp. 111-115", "authors": ["Pearce C", "Shearer M", "Christine Phillips"]}, {"title": "Following the funding trail: Financing, nurses and teamwork in Australian General Practice", "year": "2011", "source": "BMC Health Services Research, vol. 11, no. 38, p. 9", "authors": ["Pearce C", "Christine Phillips", "Hall S"]}, {"title": "Resilience among doctors who work in challenging areas: a qualitative study", "year": "2011", "source": "British Journal of General Practice, vol. 61, no. 588, pp. e404-10", "authors": ["Stevenson A", "Christine Phillips", "Anderson K"]}, {"title": "Refugee Health Network of Australia: towards national collaboration on health care for refugees", "year": "2011", "source": "Medical Journal of Australia, vol. 195, no. 4, pp. 185-186", "authors": ["Christine Phillips", "Smith M", "Kay M"]}, {"title": "Low levels of uptake of free interpreters by Australian doctors in private practice: secondary analysis of national data", "year": "2011", "source": "Australian Health Review, vol. 35, no. 4, pp. 475-479", "authors": ["Christine Phillips", "Travaglia J"]}, {"title": "Intern culture, internal resistance: uptake of peer review in two Australian hospital internship programs", "year": "2011", "source": "Australian Health Review, vol. 35, no. 4, pp. 430-435", "authors": ["Owen C", "Mathews P", "Christine Phillips"]}, {"title": "Where there is no gold standard: Mixed method research in a cluster randomised trial of a tool for safe prioritising of patients by medical receptionists", "year": "2011", "source": "International Journal of Multiple Research Approaches, vol. 5, pp. 25-39", "authors": ["Hall S", "Christine Phillips", "Gray P"]}, {"title": "", "year": "2010", "source": "Immigration detention and health", "authors": ["Christine Phillips", "ed"]}, {"title": "Proof of age required: estimating age in adults without birth records", "year": "2010", "source": "Australian Family Physician, vol. 39, no. 7, pp. 518-521", "authors": ["Christine Phillips", "Narayanasamy S"]}, {"title": "Complementary and alternative medicine: representation in popular magazines", "year": "2010", "source": "Australian Family Physician, vol. 39, no. 9, pp. 671-674", "authors": ["Dunne A", "Christine Phillips"]}, {"title": "Health service attendance patterns in an urban Aboriginal health service", "year": "2010", "source": "Medical Journal of Australia, vol. 193, no. 3, pp. 146-148", "authors": ["Flegg K", "Christine Phillips", "Collins A"]}, {"title": "When policy meets the personal: general practice nurses in Australia", "year": "2010", "source": "Journal of Health Services Research and Policy, vol. 15, no. Suppl 2, pp. 26-34", "authors": ["Pearce C", "Hall S", "Christine Phillips"]}, {"title": "General practice as a career: insights for workforce policy", "year": "2010", "source": "Medical Journal of Australia, vol. 193, no. 2, pp. 99-100", "authors": ["Piko L", "Christine Phillips"]}, {"title": "Speaking to the yet unknowing world: Hamlet, Horatio and the problem of imperfect witness", "year": "2010", "source": "Medical Humanities, vol. 36, no. 2, pp. 97-100", "authors": ["Christine Phillips"]}, {"title": "Children in the ACT with Asthma: Are they taking preventer medication according to guidelines?", "year": "2010", "source": "Australian Family Physician, vol. 39, no. 3, pp. 146-149", "authors": ["Brown M", "Christine Phillips", "Ciszek K"]}, {"title": "Using interpreters: a guide for GPs", "year": "2010", "source": "Australian Family Physician, vol. 39, no. 4, pp. 188-195", "authors": ["Christine Phillips"]}, {"title": "Can clinical governance deliver quality improvement in Australian general practice and primary care? A systematic review of the evidence", "year": "2010", "source": "Medical Journal of Australia, vol. 193, no. 10, pp. 602-607", "authors": ["Christine Phillips", "Pearce  C", "Hall S"]}, {"title": "Methodological considerations of digital video observation: beyond conversation analysis", "year": "2010", "source": "International Journal of Multiple Research Approaches, vol. 4, no. 2, pp. 90-99", "authors": ["Pearce C", "Arnold M", "Christine Phillips"]}, {"title": "The health of immigration detainees", "year": "2010", "source": "192", "authors": ["Christine Phillips", "ed"]}, {"title": "Doctor, patient and computer - a framework for the new consultation", "year": "2009", "source": "International Journal of Medical Informatics, vol. 78, no. 1, pp. 32-38.", "authors": ["Pearce C", "Dwan K", "Arnold M", "Christine Phillips"]}, {"title": "Student portfolios and the hidden curriculum on gender: mapping exclusion", "year": "2009", "source": "Medical Education, vol. 43, pp. 847-853", "authors": ["Christine Phillips"]}, {"title": "Potential scope and impact of a transboundary model of nurse practitioners in aged care", "year": "2009", "source": "Australian Journal of Primary Health, vol. 15, pp. 232-237", "authors": ["Bail K", "Arbon P", "Eggert M", "Christine Phillips"]}, {"title": "Performing the good death: the medieval Ars Moriendi and contemporary doctors", "year": "2009", "source": "Medical Humanities, vol. 35, no. 2, pp. 94-97", "authors": ["Christine Phillips", "Thornton K"]}, {"title": "Enhancing Internet literacy as a health promotion strategy for refugees and migrants", "year": "2009", "source": "Health Promotion Journal of Australia, vol. 20, no. 3, p. 147", "authors": ["Sturgess P", "Christine Phillips"]}, {"title": "Reporting a research project on the potential of aged care nurse practitioners in the Australian Capital Territory", "year": "2009", "source": "Journal of Clinical Nursing, vol. 18, no. 2, pp. 255-262", "authors": ["Arbon P", "Bail K", "Eggert M", "Christine Phillips"]}, {"title": "Telephone interpreters in general practice: bridging the barriers to their use", "year": "2009", "source": "Australian Family Physician, vol. 38, no. 6, pp. 443-447", "authors": ["Huang Y", "Christine Phillips"]}, {"title": "Strengthening field-based training in low and middle-income countries to build public health capacity: Lessons from Australia", "year": "2009", "source": "s Master of Applied Epidemiology program'Australia and New Zealand Health Policy, vol. 6, no. 5, p. 9", "authors": ["Patel M", "Christine Phillips"]}, {"title": "Contributions from the lifeworld: quality, caring and the general practice nurse", "year": "2009", "source": "Quality in Primary Care, vol. 17, no. 1, pp. 5-13", "authors": ["Pearce C", "Christine Phillips", "Hall S"]}, {"title": "Computers in the new consultation: within the first minute", "year": "2008", "source": "Family Practice, vol. 25, pp. 202-208", "authors": ["Pearce C", "Trumble S", "Arnold M", "Christine Phillips"]}, {"title": "Trends in medication use for asthma among children", "year": "2008", "source": "Current Opinion in Allergy and Clinical Immunology, vol. 8, no. 3, pp. 232-237", "authors": ["Christine Phillips", "McDonald T"]}, {"title": "Critical health infrastructure for refugee resettlement in rural Australia: Case study of four rural towns", "year": "2008", "source": "Australian Journal of Rural Health, vol. 16, pp. 349-354", "authors": ["Sypek S", "Clugston G", "Christine Phillips"]}, {"title": "General practice and pandemic influenza: a framework for planning and comparison of plans in five countries", "year": "2008", "source": "PLoS ONE (Public Library of Science), vol. 3, no. 5, pp. e2269", "authors": ["Patel M", "Christine Phillips", "Pearce C"]}, {"title": "Institutions and the Health of Prisoners and detainees", "year": "2008", "source": "in Marc Oxenham (ed.), Forensic approaches to death, disaster and abuse, Australian Academic Press Pty Ltd, Bowen Hills, Qld, pp. 299-306", "authors": ["Christine Phillips"]}, {"title": "Better primary health care for refugees: Catch up immunisation", "year": "2007", "source": "Australian Family Physician, vol. 36, no. 6, pp. 440-444", "authors": ["Christine Phillips", "Benson J"]}, {"title": "Trends in medication use for asthma in school-entry children in the Australian Capital Territory, 2000-2005", "year": "2007", "source": "Medical Journal of Australia, vol. 187, no. 1, pp. 10-13", "authors": ["Christine Phillips", "Toyne H", "Ciszek K"]}, {"title": "ustralian general practice and pandemic influenza: models of clinical practice in an established pandemic", "year": "2007", "source": "Medical Journal of Australia, vol. 186, no. 7, pp. 355-358", "authors": ["Christine Phillips", "Patel M", "Glasgow N"]}, {"title": "Time to talk, time to see: Changing microeconomies of professional practice among nurses and doctors in Australian general practice", "year": "2007", "source": "Contemporary Nurse, vol. 26, no. 1, pp. 137-144", "authors": ["Christine Phillips", "Dwan K", "Pearce C"]}, {"title": "Enhancing care, improving quality: the six roles of the general practice nurse", "year": "2007", "source": "Medical Journal of Australia, vol. 191, no. 2, pp. 92-97", "authors": ["Christine Phillips", "Pearce C", "Hall S"]}, {"title": "Medicine goes to school: teachers as sickness brokers for ADHD", "year": "2006", "source": "PLoS Medicine, vol. 3, no. 4, pp. e182", "authors": ["Christine Phillips"]}, {"title": "The switch to new conjugated vaccines may compromise immunisation coverage for refugees", "year": "2006", "source": "Medical Journal of Australia, vol. 184, no. 9, p. 473", "authors": ["Christine Phillips", "Patel M"]}, {"title": "nalysing the doctor-patient-computer relationship: The use of Video Data", "year": "2006", "source": "Informatics in Primary Care, vol. 14, no. 4, pp. 221-226", "authors": ["Pearce C", "Dwan K", "Arnold M", "Christine Phillips"]}, {"title": "Improving response rates to primary and supplementary questionnaires by changing response and instruction burden: cluster randomised trial", "year": "2005", "source": "Australian and New Zealand Journal of Public Health, vol. 29, no. 5, pp. 457-460", "authors": ["Christine Phillips", "Yates R", "Glasgow N"]}, {"title": "Doctors, Patients and Computers: The use of Digital Video Data in the Analysis of General Practice Consultations.", "year": "2005", "source": "National Health Informatics Conference (HIC 2005), ed. Marcus Wise, Heather Grain, Stephen Chu, Health Informatics Society of Australia, Australia", "authors": ["Pearce C", "Trumble S", "Dwan K", "Christine Phillips"]}, {"title": "Temporary protection visas and child refugees", "year": "2004", "source": "Medical Journal of Australia, vol. 181, pp. 171-2", "authors": ["Christine Phillips", "Manning S"]}, {"title": "Learning about refugee health: a human rights approach to continuing medical education", "year": "2003", "source": "Continuing Professional Education Conference 2003, ed. Peter Rushbrook, Charles Sturt University, Australia, p. 1", "authors": ["Christine Phillips", "Ragless K", "Price E"]}, {"title": "Gender, geography and the part time doctor: The case for part time training programs in rural and regional Australia", "year": "2002", "source": "Australian College of Rural and Remote Medicine (ACRRM) 2nd Scientific Forum & Rural Workforce Agency Victoria (RWAV) Conference, Australian College of Rural and Remote Medicine, Brisbane, Australia", "authors": ["Christine Phillips"]}]}, "Microsoft-Academic": [{"title": "patient navigation to increase mammography screening among inner city women", "year": 2011, "source": "journal of general internal medicine", "authors": [{"name": "christine phillips", "affiliation": "boston university"}, {"name": "jessica d rothstein", "affiliation": "boston university"}, {"name": "kristine beaver", "affiliation": "boston university"}, {"name": "bonnie j sherman", "affiliation": "boston university"}, {"name": "karen m freund", "affiliation": "boston university"}, {"name": "tracy a battaglia", "affiliation": "boston university"}], "id": 116608325}, {"title": "the patient and the computer in the primary care consultation", "year": 2011, "source": "journal of the american medical informatics association", "authors": [{"name": "christopher pearce"}, {"name": "michael arnold", "affiliation": "university of melbourne"}, {"name": "christine phillips", "affiliation": "australian national university"}, {"name": "stephen trumble", "affiliation": "university of melbourne"}, {"name": "kathryn dwan", "affiliation": "australian national university"}], "id": 129839026}, {"title": "enhancing care improving quality the six roles of the general practice nurse", "year": 2009, "source": "the medical journal of australia", "authors": [{"name": "christine phillips", "affiliation": "australian national university"}, {"name": "christopher pearce", "affiliation": "university of melbourne"}, {"name": "sally hall", "affiliation": "australian national university"}, {"name": "marjan kljakovic", "affiliation": "australian national university"}, {"name": "bonnie sibbald", "affiliation": "university of manchester"}, {"name": "kathryn dwan", "affiliation": "australian national university"}, {"name": "julie porritt"}, {"name": "rachel yates"}], "id": 13978405}, {"title": "the many faces of the computer an analysis of clinical software in the primary care consultation", "year": 2012, "source": "international journal of medical informatics", "authors": [{"name": "christopher pearce", "affiliation": "monash university"}, {"name": "michael arnold", "affiliation": "university of melbourne"}, {"name": "christine phillips", "affiliation": "australian national university"}, {"name": "stephen trumble", "affiliation": "university of melbourne"}, {"name": "kathryn dwan", "affiliation": "australian national university"}], "id": 53142634}, {"title": "resilience among doctors who work in challenging areas a qualitative study", "year": 2011, "source": "british journal of general practice", "authors": [{"name": "alexander d stevenson", "affiliation": "australian national university"}, {"name": "christine phillips"}, {"name": "katrina anderson"}], "id": 92370695}, {"title": "sexual assault and harassment of doctors by doctors a qualitative study", "year": 2019, "source": "medical education", "authors": [{"name": "louise stone", "affiliation": "australian national university"}, {"name": "christine phillips", "affiliation": "australian national university"}, {"name": "kirsty douglas", "affiliation": "australian national university"}], "id": 54816476}, {"title": "doctor patient and computer a framework for the new consultation", "year": 2009, "source": "international journal of medical informatics", "authors": [{"name": "christopher pearce", "affiliation": "university of melbourne"}, {"name": "kathryn dwan", "affiliation": "australian national university"}, {"name": "michael arnold", "affiliation": "university of melbourne"}, {"name": "christine phillips", "affiliation": "australian national university"}, {"name": "stephen trumble", "affiliation": "university of melbourne"}], "id": 53142634}, {"title": "low levels of uptake of free interpreters by australian doctors in private practice secondary analysis of national data", "year": 2011, "source": "australian health review", "authors": [{"name": "christine phillips", "affiliation": "australian national university"}, {"name": "joanne travaglia", "affiliation": "university of new south wales"}], "id": 176070599}, {"title": "covid 19 and the moral imagination", "year": 2021, "source": "the lancet", "authors": [{"name": "mahomed patel", "affiliation": "australian national university"}, {"name": "christine phillips", "affiliation": "australian national university"}], "id": 49861241}, {"title": "can clinical governance deliver quality improvement in australian general practice and primary care a systematic review of the evidence", "year": 2010, "source": "the medical journal of australia", "authors": [{"name": "christine phillips", "affiliation": "australian national university"}, {"name": "christopher pearce"}, {"name": "sally hall", "affiliation": "australian national university"}, {"name": "joanne travaglia", "affiliation": "university of new south wales"}, {"name": "simon de lusignan", "affiliation": "st george s university of london"}, {"name": "tom love", "affiliation": "university of otago"}, {"name": "marjan kljakovic", "affiliation": "australian national university"}], "id": 13978405}], "ANDS-Grants": [{"description": "Most primary and preventive care in Australia occurs in general practice. Australian general practice will therefore have a critical role to play in control efforts during an influenza pandemic, and also in sustaining other primary health care activities. After an initial surge in attendances, there may be a decline in attendance, as Australians become more reluctant to congregate in a place where they may become ill. This study seeks to complement the Australian Pandemic Influenza Management Plan by developing a range of action plans for use by general practitioners and public health authorities to support essential primary health care functions through a pandemic, and maximize general practice's contribution to control efforts. A range of methods will be used, including systematic review of existing literature, economic modeling of the Medicare costs and savings of different models of health care, interviews with key informants who have helped develop disaster response plans for general practice, or who are in positions of leadership. The project will culminate in the development of a simulation exercise to be used as a self-assessment tool for general practitioners, and a summit of general practice stakeholders who will help to finalise agreed action plans for the general practice response to pandemic influenza.", "title": "Strenthening the contribution of Australian general practice to the control of pandemic influenza", "id": "95025", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/410228", "researchers": ["Prof Nicholas Glasgow", "A/Pr Christine Phillips", "A/Pr Paul Dugdale", "Dr Mohamed Patel", "Prof Marjan Kljakovic"], "status": "closed", "fundingAmount": 110257, "fundingScheme": "NHMRC Strategic Awards", "startDate": 2006, "endDate": 2006, "dateTimeModified": "2015-04-12T07:53:35Z", "dateTimeCreated": "2013-05-15T05:56:28Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Marjan Kljakovic"], "purl": "http://purl.org/au-research/grants/nhmrc/410228", "identifiers": ["http://purl.org/au-research/grants/nhmrc/410228", "410228"], "subjects": ["Infectious Diseases", "MEDICAL AND HEALTH SCIENCES", "CLINICAL SCIENCES", "Community Health", "General practice", "Keywords", "Public health policy"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/95025"}]}]}