{"ANU": {"name": "Christopher Stokes Griffin", "link": "https://researchers.anu.edu.au/researchers/stokes-griffin-c", "colleges": "College of Engineering & Computer Science", "email": "chris.stokes-griffin@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "", "project": [], "publication": [{"title": "Investigation of sub-melt temperature bonding of carbon-fibre/PEEK in an automated laser tape placement process", "year": "2016", "source": "Composites Part A: Applied Science and Manufacturing, vol. 84, pp. 17-25", "authors": ["Christopher Stokes Griffin", "Compston P"]}, {"title": "n inverse model for optimisation of laser heat flux distributions in an automated laser tape placement process for carbon-fibre/PEEK", "year": "2016", "source": "Composites Part A: Applied Science and Manufacturing, vol. 88, no. -, pp. 190-197", "authors": ["Christopher Stokes Griffin", "Compston P"]}, {"title": "combined optical-thermal model for near-infrared laser heating of thermoplastic composites in an automated tape placement process", "year": "2015", "source": "Composites Part A: Applied Science and Manufacturing, vol. 75, pp. 104-115pp", "authors": ["Christopher Stokes Griffin", "Compston P"]}, {"title": "Optical characterisation and modelling for oblique near-infrared laser heating of carbon fibre reinforced thermoplastic composites", "year": "2015", "source": "Optics and Lasers in Engineering, vol. 72, pp. 1-11", "authors": ["Christopher Stokes Griffin", "Compston P"]}, {"title": "The effect of processing temperature and placement rate on the short beam strength of carbon fibre-PEEK manufactured using a laser tape placement process", "year": "2015", "source": "Composites Part A: Applied Science and Manufacturing, vol. 78, pp. 274-283", "authors": ["Christopher Stokes Griffin", "Compston P"]}, {"title": "Laser-assisted tape placement of thermoplastic composites: the effect of process parameters on bond strength", "year": "2014", "source": "5th International Conference on Sustainable Automotive Technologies ICSAT 2013, ed. J Wellnitz, A Subic, R Trufin, Springer International Publishing AG, Switzerland, pp. 133-141", "authors": ["Christopher Stokes Griffin", "Compston P"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}