{"ANU": {"name": "Christie Margrave", "link": "https://researchers.anu.edu.au/researchers/margrave-c", "colleges": "College of Arts and Social Sciences", "email": "Christie.Margrave@anu.edu.au", "phone": "+61 (02) 6125 2768", "expertise": ["Literature In French", "Postcolonial Studies", "Stylistics And Textual Analysis", "Comparative Literature Studies", "Cultural Studies Not Elsewhere Classified", "Culture Gender Sexuality", "Latin And Classical Greek Literature"], "interest": ["18th- and 19th-century French and Francophone literature and culture; 18th- and 19th-century French history and criticism; literary criticism; textual analysis; women's writing; gender; postcolonialism; ecocriticism; ecofeminism; postcolonial ecologies; landscape; Space; Sentimental novel."], "biography": "", "project": ["Writing the Landscape: Exposing Nature in French Women’s Fiction, 1789-1815 (Cambridge: Legenda, 2019)", "This monograph analyses the works of several French female novelists from the period 1789-1815. The penchant of women writers of this era for sentimental novels has led critics to take their writing at face value as apolitical and domestic. And their presentation of nature has, thus far, been dismissed completely. However, the natural landscape was not just a backdrop. On account of the supposed link between women and nature, women in post-revolutionary France were pigeonholed into a very restrictive sphere centred around domesticity and submission to their male counterparts. Yet Cottin, Genlis, Krüdener, Souza and Staël re-appropriate nature in order to reclaim the voice denied to them and to their sex by society. By highlighting self-expression, and by celebrating the figure of the melancholic wanderer, the social misfit, or the visionary, in the setting of an often tempestuous Nature, these writers also exerted substantial influence on the literary Romanticism which was soon to capture the European imagination.", "New Project: Ecocritical Awareness in Eighteenth and early Nineteenth-century French Literature", "The project analyses late 18th- and early 19th-century French literature from an ecocritical perspective. It aims to shed new light on the way we view French literature of the Enlightenment, early Romanticism, the Industrial Revolution and the colonial period. It is a project with great potential for interdisciplinarity, exploring literature, sociological history, the historical portrayal of industrial development and ecological thought and centres around several areas of burgeoning research, including ecocriticism, ecofeminism, ecotheology, and postcolonialism.", "Enlightenment philosophes such as Montesquieu and Voltaire had argued in the early 18th century that geographical climate directly influenced society, politics and culture. However, by the 19th century, this argument had developed into the modern belief that society affects the environment, and that the latter must be conserved. In order to track the development of that about-turn in thought, I examine French literature from the eighteenth and nineteenth centuries.", "Thus far, I have developed two major research areas in the new project:", "1. Ecofeminist thought in 18th- and 19th-C French literature", "I spoke on this topic at the Australasian Association for Literature (AAL) annual conference in July 2017: Literary Environments: Place, Planet and Translation.", "Output: Christie Margrave, ‘Early Developments of Ecofeminist Thought in French Women’s Early Romantic Fiction’, Essays in French Literature and Culture, 55 (2018) pp.43-62.", "2. Postcolonial Ecocriticism in 18th- and 19th-C French lit", "Through the lens of postcolonial ecocritical theory, I analyse the ways in which the history of the land is inseparable from Francophone socio-political history (both on a regional and an international level) in the works of writers including Bernardin de Saint-Pierre (the Indian Ocean), Évariste Parny (Madagascar), Nicolas-Germain Léonard (the Caribbean), Le Vaillant (Africa), Traversay (Martinique), Bergeaud (Haiti), Saint-Lambert (North America), Marceline Desbordes-Valmore (Guadeloupe). Many of these authors’ works are significantly understudied. However, bringing them to light through the lens of postcolonial ecocriticism (Deloughrey and Hangley (2011), Huggan and Tiffin (2010), Grove (1995)), allows the reader to perceive how they foreground landscape as a participant in the changing nature of France and her colonies, and allow us to begin to map the colonial metropole’s relationship to non-metropolitan space.", "I presented a paper on this topic in a panel on Ecoregional Identities in collaboration with colleagues from the UK's Society of Dix-Neuviémistes at the ASFS conference in December 2018. An article based on the paper will appear in a special issue of the journal Dix-Neuf in December 2019.", "", ""], "publication": [{"title": "Early Developments of Ecofeminist Thought in French Women", "year": "2018", "source": "s Early Romantic Fiction'Essays in French Literature and Culture, vol. 55, pp. 45-64", "authors": ["Christie Margrave"]}]}, "Microsoft-Academic": [{"title": "reading the absence the shaping of male characters and their crises in the void", "year": 2021, "source": "women s writing", "authors": [{"name": "christie margrave", "affiliation": "australian national university"}], "id": 193583673}, {"title": "le charme sans la beaute vie de sophie cottin par silvia lorusso", "year": 2020, "source": "french studies", "authors": [{"name": "christie margrave", "affiliation": "australian national university"}], "id": 115629255}, {"title": "evariste parny selected poetry and prose of evariste parny in english translation with french text edited by francoise lionnet translated by peter low and blake smith", "year": 2019, "source": "french studies", "authors": [{"name": "christie margrave", "affiliation": "australian national university"}], "id": 115629255}, {"title": "environment and identity in the nineteenth century french caribbean novel traversay s les amours de zemedare et carina and bergeaud s stella", "year": 2019, "source": "", "authors": [{"name": "christie margrave", "affiliation": "australian national university"}]}, {"title": "rule britannia britain and britishness 1707 1901", "year": 2015, "source": "", "authors": [{"name": "peter lindfield"}, {"name": "christie margrave"}]}, {"title": "early developments of ecofeminist thought in french women s early romantic fiction", "year": 2018, "source": "", "authors": [{"name": "christie margrave"}]}, {"title": "selected poetry and prose of evariste parny in english translation with french text by evariste parny review", "year": 2020, "source": "french studies", "authors": [{"name": "christie margrave"}], "id": 115629255}, {"title": "writing the landscape exposing nature in french women s fiction 1789 1815", "year": 2019, "source": "", "authors": [{"name": "christie margrave"}]}, {"title": "writing the landscape women and nature in the works of french female novelists 1789 1815", "year": 2017, "source": "", "authors": [{"name": "christie margrave"}]}], "ANDS-Grants": []}