{"ANU": {"name": "Cressida Fforde", "link": "https://researchers.anu.edu.au/researchers/fforde-c", "colleges": "College of Arts and Social Sciences", "email": "cressida.fforde@anu.edu.au", "phone": "(02) 6125 9321", "expertise": [], "interest": ["Cressida's primary area of research focus has been the history of the removal and subsequent study of Indigenous human remains by European institutions within the 'race' paradigm in the 19th century and the campaigns to secure their return. She is particularly interested in how this history illustrates mechanisms of identity representation and construction, how similar mechanisms operate today, how to identify their presence and impact, and to invoke change. Associated interests include the legacy of the race paradigm in deficit  discourse about Aboriginal people, the nature and prevalence of such  discourse, and its impact.She is interested in the communication of information about the meaning and value of cultural heritage, particularly in relation to local communities and Indigenous cultural heritage housed in museums and other collecting institutions. She has a significant interest in public archaeology and the politics of the past."], "biography": "From January 2020 she has been a Senior Research Fellow at the Centre for Heritage and Museum Studies at ANU.", "project": ["Projects include:", "[1] Heritage and Reconciliation (DP200102850, CI1) 2020-2023", "Team: Cressida Fforde, Laurajane Smith, Daryle Rigney, Peter Stone, Steve Hemming, Paul Tapsell, Greg Lehman, Lia Kent, Merata Kawharu", "This project will re-conceptualise heritage from a standpoint of reconciliation. In doing so, it will generate new understandings about how heritage and its management can contribute to reconciliation processes. The project will combine Aboriginal, Maori and Western intellectual traditions in order to advance theoretical understandings of heritage and to examine its reconstructive power. It will produce models for practical implementation, including new conservation and management protocols. The project's investigation of a new approach to heritage has the potential for profound social benefit.", "[2]  Profit and Loss: The commercial trade in Indigenous human remains (DP200101814, 2020-2023)", "Team: Cressida Fforde, Paul Turnbull, Richi Nayak, Paul Tapsell, Michael Pickering, Mark Thomas, C Timothy McKeown, Amber Aranui, Honor Keeler, Gavan McCarthy", "This projectinvestigates the global commercial trade in Indigenous human remains. It will employ a multi-disciplinary approach involving history, economic anthropology, economic history, and data science. The project will generate new knowledge about the 19th century global marketplace in Australian Indigenous human remains, and will reveal whether and how these are involved in the trade’s modern manifestations from 1950 tothe present. The project will uncover an unknown history, assist repatriation practice, provide information to helpreduce the modern trade, and contribute to truth-telling as a precondition of healing and reconciliation.", "[3] Restoring Dignity: Networked knowledge for repatriation communities (LE170100017 CI1, 2018-current)", "This project has continued the work of the Return, Reconcile, Renew team (see below) to build a digital archive of repatriation knowledge. For the public face of this archive see: www.returnreconcilerenew.info", "This project is funded through the Australian Research Council Linkage Infrastructure Equipment Facilities (LIEF) scheme and partner organisation cash and in-kind contributions.", "[4] Return, Reconcile, Renew: understanding the history, impact and transformative opportunities of repatriation and building an evidence base for the future. (LP130100131, CI1)", "This project was funded through the Australian Research Council Linkage scheme  and partner organisation cash and in-kind contributions.", "Since 2013, the 'Return, Reconcile, Renew' project has illuminated over forty years of the repatriation of Indigenous human remains. It has brought together Indigenous community organisations, government, cultural institutions, and universities in Australia and overseas. It has assisted repatriation practice, undertaken new research into the removal and return of Ancestral Remains, conducted 50 interviews in the Kimberley, Torres Strait, and Ngarrindjeri country, and developed the first stage of the RRR Digital Archive of repatriation information – best conceptualised as an online repatriation encyclopaedia. The project website and public area of the digital archive will shortly go live at www.returnreconcilerenew.info.", "Major outputs include: the team convened 8 sessions on repatriation at the 8th World Archaeological Congress in Kyoto, Japan (2016), and co-convened the day symposium ‘The Long Journey Home’ with the National Museum of Australia and the ANU’s College of Asia and the Pacific in May 2018. A major scholarly volume containing 56 chapters on repatriation matters from around the world is shortly to be submitted to Routledge. A book of Aboriginal and Torres Strait Islander voices in repatriation will be published in 2020 by Magabala books.", "The team also developed a 5 day intensive course that is an accredited ANU Master course (MUSC8019) and is also available as Professional Development. Each year it is hosted by one of the project’s Indigenous Partner Organisations on their traditional country. Participants learn from traditional owners and Indigenous and non-Indigenous repatriation expertise from Australia, New Zealand and the USA. More information available here: http://ncis.anu.edu.au/study/pdc/", "Partners on the project were: The University of Melbourne, University of Tasmania, Flinders University, Australian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS), Ministry for the Arts (Department of Communication and the Arts), the Kimberley Aboriginal Law and Culture Centre (KALACC), the Ngarrindjeri Regional Authority (NRA), National Museum of Australia, University of Otago, Association on American Indian Affairs (AAIA), Museum of New Zealand Te Papa Tongarewa, and Gur A Baradharaw Kod Torres Strait Sea and Land Council.", "[5] Deficit Discourse and Indigenous Education: mapping the discursive environment, assessing impact, and changing the conversation (IN150100007, CI).", "This project investigated the prevalence of deficit discourse and its influence on Indigenous education. Deficit discourse frames Indigenous identity in a narrative of negativity and deficiency. Recent work indicates that deficit discourse is active in policy, public debate, pedagogy and practice and its prevalence in Indigenous education influences student performance. By mapping the discursive environment and analysing education programs that reject the deficit model, this project assessed whether its removal improves outcomes for Indigenous students. This project provided an original approach to challenge entrenched perceptions, resulting in tangible benefits for the Australian education system and the communities that it serves.", "[6] Reconciling biological and social Indigeneity in the genomic era (DP150102087, CI)", "This project was completed at the end of 2018. It sought to investigate the impact of genomics on contemporary identities, including Indigeneity. Drawing on multidisciplinary expertise, te project examined biological and social influences on Indigeneity in narratives of selfpresentation and in two fields set to be impacted by genomics: ancestry testing and repatriation. The project talked with people who were interested in using genetic ancestry testing to investigate their Indigenous heritage, many of whom discovered their Indigenous ancestry later in life. It also sought the views of  Indigenous and non-Indigenous people in the repatriation sector to assess the potential impact of genetic technologies on the repatriation of human remains."], "publication": [{"title": "Under the Hammer", "year": "2020", "source": ": The role of auction houses and dealers in the distribution of Indigenous Ancestral Remains'in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 335-360", "authors": ["Aranui A", "Cressida Fforde", "Pickering M"]}, {"title": "Inhuman and Very Mischievous Traffic", "year": "2020", "source": ": Early measures to cease the export of Ancestral Remains from Aotearoa New Zealand and Australia'in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 381-399", "authors": ["Cressida Fforde", "Aranui A", "Knapman G"]}, {"title": "The Routledge Companion to Indigenous Repatriation: Return", "year": "2020", "source": "ReconcileRenew, Routledge, Oxon United Kingdom", "authors": ["Cressida Fforde", "McKeown C", "Keeler H", "eds"]}, {"title": "Provenance research and historical sources for understanding Nineteenth-century scientific interest in Indigenous human remains: The scholarly journals and popular science media", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 564-582", "authors": ["Knapman G", "Turnbull P", "Cressida Fforde"]}, {"title": "Dignified Relationships: Repatriation, healing, and reconciliation", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 745-768", "authors": ["Cressida Fforde", "Knapman G", "Walsh C"]}, {"title": "Profit And Loss: Scientific networks and the commodification of Indigenous Ancestral Remains", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 361-380", "authors": ["Knapman G", "Cressida Fforde"]}, {"title": "Repatriation in the Torres Strait", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 128 - 146", "authors": ["David N", "Cressida Fforde", "Pickering M"]}, {"title": "Missionaries and the Removal, Illegal Export, and Return of Ancestral Remains: The case of Father Ernst Worms", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 316-334", "authors": ["Cressida Fforde", "Turnbull P", "Carter N"]}, {"title": "Sharing Reflections on Repatriation: Manchester Museum and Brighton negotiations, a decade on", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 683-695", "authors": ["Sumner M", "Besterman T", "Cressida Fforde"]}, {"title": "Research for Repatriation Practice", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 541-563", "authors": ["Cressida Fforde", "Keeler H", "Aranui A"]}, {"title": "ustralian Aborigine Skulls in a Loft in Birmingham, It seems a Weird Thing", "year": "2020", "source": ": Repatriation work and the search for Jandamarra'in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 588-609", "authors": ["Cressida Fforde", "Oscar J"]}, {"title": "Repatriation in the Kimberley: Practice, approach, and contextual history", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 165-187", "authors": ["Ormond-Parker  L", "Carter N", "Cressida Fforde"]}, {"title": "Introduction", "year": "2020", "source": "in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 1-19", "authors": ["Cressida Fforde", "McKeown C", "Keeler H"]}, {"title": "Identity in applied repatriation research and practice", "year": "2020", "source": "in Chelsea H. Meloche, Laure Spake and Katherine L. Nichols (ed.), Working with and for Ancestors: Collaboration in the Care and Study of Human Ancestral Remains, Routledge Taylor & Francis Group, Abingdon, Oxon, UK, pp. 255-267", "authors": ["Cressida Fforde", "McKeown C", "Keeler H"]}, {"title": "Inhuman and Very Mischievous Traffic", "year": "2020", "source": ": Early measures to cease the export of Ancestral Remains from Aotearoa New Zealand and Australia'in C Fforde, C T McKeown & H Keeler (ed.), The Routledge Companion to Indigenous Repatriation: Return, Reconcile, Renew, Routledge, Oxon United Kingdom, pp. 381-399", "authors": ["Cressida Fforde", "Aranui A", "Knapman G"]}, {"title": "Repatriation Research: Archives and the Recovery of History and Heritage", "year": "2015", "source": "in Ruth Edmond-Cooper (ed.), Human remains and the law, Institute of Art and Law, UK, pp. 39-59pp", "authors": ["Cressida Fforde", "Ormond-Parker L", "Turnbull P"]}, {"title": "The Vermillion Accord on Human Remains (Indigenous Archaeology)", "year": "2014", "source": "in Claire Smith (ed.), Encyclopaedia of Global Archaeology, Springer, New York, USA, pp. 7612-7615pp", "authors": ["Cressida Fforde"]}, {"title": "Human Remains in Museums", "year": "2014", "source": "in Claire Smith (ed.), Encyclopaedia of Global Archaeology, Springer, New York, USA, pp. 3545-3549pp", "authors": ["Cressida Fforde"]}, {"title": "ustralia: Indigenous Cultural Property Return", "year": "2014", "source": "in Claire Smith (ed.), Encyclopaedia of Global Archaeology, Springer, New York, USA, pp. 620-626pp", "authors": ["Cressida Fforde"]}, {"title": "Tamaki Makau-Rau Accord on the Display of Human Remains and Sacred Objects (2005)", "year": "2014", "source": "in Claire Smith (ed.), Encyclopaedia of Global Archaeology, Springer, New York, USA, pp. 7209-7213pp", "authors": ["Cressida Fforde"]}, {"title": "Investment in prisons: an investment in social exclusion? Linking the theories of Justice Reinvestment and Social exclusion to examine Australia", "year": "2013", "source": "s propensity to incarcerate'Griffith Journal of Law and Human Dignity, vol. 1, no. 2, pp. 254-280", "authors": ["Guthrie J", "Levy M", "Cressida Fforde"]}, {"title": "Discourse, deficit and identity: Aboriginality, the race paradigm and the language of representation in contemporary Australia", "year": "2013", "source": "Media International Australia incorporating Culture and Policy, no. 149, pp. 162-173", "authors": ["Cressida Fforde", "Bamblett L", "Lovett R"]}, {"title": "In Search of Others: The history and legacy of", "year": "2013", "source": "race' collections'in Sarah Tarlow and Liv Nilsson Stutz (ed.), The Oxford Handbook of the Archaeology of Death and Burial, Oxford University Press, University of Oxford, UK, pp. 709-731", "authors": ["Cressida Fforde"]}, {"title": "The Long Way Home: the Meanings and Value of Repatriation", "year": "2012", "source": "Book Review'Australian Aboriginal Studies, vol. 2, no. 103-105", "authors": ["Cressida Fforde"]}, {"title": "Reburial and Repatriation", "year": "2012", "source": "in Brian M. Fagan (ed.), The Oxford Companion to Archaeology, Oxford University Press, Oxford, United Kingdom, pp. 1-3pp", "authors": ["Cressida Fforde"]}, {"title": "Repatriation and Reburial", "year": "2012", "source": "in Brian M. Fagan (ed.), The Oxford Companion to Archaeology, Oxford University Press, Oxford, United Kingdom", "authors": ["Cressida Fforde"]}, {"title": "Editorial", "year": "2011", "source": "Australian Aboriginal Studies, vol. 26, no. 67, pp. 1-1", "authors": ["Cressida Fforde"]}, {"title": "Will the Real Aborigine Please Stand Up", "year": "2011", "source": ": Strategies for breaking the stereotypes and changing the conversation", "authors": ["Gorringe S", "Ross J", "Cressida Fforde"]}, {"title": "From Edinburgh University to the Ngarrindjeri nation, South Australia", "year": "2009", "source": "Museum International, vol. 61, no. 1-2, pp. 41-47", "authors": ["Cressida Fforde"]}, {"title": "The Story of Kington Camp", "year": "2008", "source": "Logaston PressHereford, UK", "authors": ["Cressida Fforde", "Cressida Fforde", "Gardner J eds"]}, {"title": "Indigenous Human Remains and Changing Museum Ideology", "year": "2006", "source": "in Robert Layton, Stephen Shennan & Peter Stone (ed.), A Future for Archaeology, UCL Press, United Kingdom, pp. 83-96", "authors": ["Cressida Fforde", "Hubert J"]}, {"title": "Editorial", "year": "2005", "source": "Public Archaeology, vol. 4, no. 2-3, pp. 69-70", "authors": ["Sillar B", "Cressida Fforde"]}, {"title": "Collecting, Repatriation and Identity", "year": "2002", "source": "in Cressida Fforde, Jane Hubert, Paul Turnbull (ed.), The dead and their possessions: repatriation in principle, policy and practice, Routledge, Taylor & Francis Group, New York and London, pp. 25-46", "authors": ["Cressida Fforde"]}, {"title": "Yagan", "year": "2002", "source": "in Cressida Fforde, Jane Hubert, Paul Turnbull (ed.), The dead and their possessions: repatriation in principle, policy and practice, Routledge, Taylor & Francis Group, New York and London, pp. 229-241", "authors": ["Cressida Fforde"]}, {"title": "Introduction: the reburial issue in the 21st century", "year": "2002", "source": "in Cressida Fforde, Jane Hubert, Paul Turnbull (ed.), The dead and their possessions: repatriation in principle, policy and practice, Routledge, Taylor & Francis Group, New York and London, pp. 1-16", "authors": ["Hubert J", "Cressida Fforde"]}]}, "Microsoft-Academic": [{"title": "discourse deficit and identity aboriginality the race paradigm and the language of representation in contemporary australia", "year": 2013, "source": "media international australia incorporating culture and policy", "authors": [{"name": "cressida fforde"}, {"name": "lawrence bamblett"}, {"name": "raymond lovett"}, {"name": "scott gorringe"}, {"name": "bill fogarty"}], "id": 2764985231}, {"title": "the dead and their possessions repatriation in principle policy and practice", "year": 2002, "source": "", "authors": [{"name": "cressida fforde"}, {"name": "jane hubert"}, {"name": "paul turnbull"}]}, {"title": "under the hammer", "year": 2020, "source": "", "authors": [{"name": "amber aranui"}, {"name": "cressida fforde"}, {"name": "michael pickering"}, {"name": "paul turnbull"}, {"name": "gareth knapman"}, {"name": "honor keeler"}]}, {"title": "in search of others the history and legacy of race collections", "year": 2013, "source": "", "authors": [{"name": "cressida fforde", "affiliation": "australian national university"}]}, {"title": "will the real aborigine please stand up strategies for breaking the stereotypes and changing the conversation", "year": 2011, "source": "", "authors": [{"name": "scott gorringe"}, {"name": "joe ross"}, {"name": "cressida fforde"}]}, {"title": "repatriation research archives and the recovery of history and heritage", "year": 2015, "source": "", "authors": [{"name": "cressida fforde"}, {"name": "lyndon ormondparker"}, {"name": "paul turnbull"}]}, {"title": "information technology and indigenous communities", "year": 2013, "source": "", "authors": [{"name": "lyndon ormondparker"}, {"name": "aaron corn"}, {"name": "cressida fforde"}, {"name": "kazuko obata"}, {"name": "sandy osullivan"}]}, {"title": "investment in prisons an investment in social exclusion linking the theories of justice reinvestment and social exclusion to examine australia s propensity to incarcerate", "year": 2014, "source": "", "authors": [{"name": "jillian guthrie"}, {"name": "michael levy"}, {"name": "cressida fforde"}]}, {"title": "from edinburgh university to the ngarrindjeri nation south australia", "year": 2009, "source": "museum international", "authors": [{"name": "cressida fforde"}], "id": 31062579}, {"title": "repatriation developments in the uk", "year": 2001, "source": "indigenous law bulletin", "authors": [{"name": "cressida fforde"}, {"name": "lc ormondparker"}], "id": 2764350672}], "ANDS-Grants": [{"description": "Advances in genomics will have profound impacts on contemporary identities, including Indigeneity. A focus on social processes since the 1970s has left scholarship on Indigenous identity ill-equipped to grapple with the consequences of the genomic era. Drawing on multidisciplinary expertise, Indigenous and non-Indigenous investigators will examine biological and social influences on Indigeneity in narratives of self-presentation and in two fields currently being transformed by genomics: ancestry testing and repatriation. We will develop and test a biosocial model of Indigeneity that will enhance existing knowledge of Indigenous identification as a critical factor in monitoring and improving the health and wellbeing of Indigenous people.", "title": "Discovery Projects - Grant ID: DP150102087", "id": "617924", "institutions": ["University of Melbourne"], "key": "http://purl.org/au-research/grants/arc/DP150102087", "researchers": ["A/Prof Emma Kowal", "Prof Yin Paradies", "A/Prof Cressida Fforde"], "status": "closed", "fundingAmount": 197153, "fundingScheme": "Discovery Projects", "startDate": 2015, "endDate": 2017, "dateTimeModified": "2017-07-05T03:02:02Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Melbourne"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP150102087", "identifiers": ["http://purl.org/au-research/grants/arc/DP150102087", "DP150102087"], "subjects": ["SOCIOLOGY", "STUDIES IN HUMAN SOCIETY", "GENOMICS; IDENTITY; INDIGENEITY"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/617924"}]}, {"description": "This project investigates the prevalence of &lsquo;deficit discourse&rsquo; and its influence on Indigenous education. Deficit discourse frames Indigenous identity in a narrative of negativity and deficiency. Recent work indicates that deficit discourse is active in policy, public debate, pedagogy and practice, and its prevalence in Indigenous education influences student performance. By mapping the discursive environment and analysing education programs that reject the deficit model, this project assesses whether its removal improves outcomes for Indigenous students. This project provides an original approach to challenge entrenched perceptions, resulting in tangible benefits for the Australian education system and the communities that it serves.", "title": "Discovery Indigenous - Grant ID: IN150100007", "id": "618456", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/IN150100007", "researchers": ["Prof Michael Dodson", "Mr Scott Gorringe", "Dr William Fogarty", "A/Prof Kerry McCallum", "A/Prof Patrick Sullivan", "Dr Lisa Waller", "A/Prof Cressida Fforde"], "status": "closed", "fundingAmount": 456000, "fundingScheme": "Discovery Indigenous", "startDate": 2015, "endDate": 2017, "dateTimeModified": "2017-07-05T03:02:08Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/IN150100007", "identifiers": ["http://purl.org/au-research/grants/arc/IN150100007", "IN150100007"], "subjects": ["SPECIALIST STUDIES IN EDUCATION", "EDUCATION", "DEFICIT DISCOURSE; INDIGENOUS EDUCATION; INDIGENOUS IDENTITY"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/618456"}]}, {"description": "This project aims to build a digital facility that supports the repatriation of Indigenous human remains. Repatriation contributes to reconciliation and Indigenous healing and wellbeing, and has been the most important agent of change in the relationship between Indigenous peoples, museums and the academy over the past 40 years. Successful repatriation requires and produces research materials diverse in type, geography and accessibility. Within an Indigenous data-governance framework, this project will gather, preserve and make accessible a critical and extensive record of repatriation information worldwide. The project is expected to support repatriation practice and scholarship and improve the opportunities of repatriation for social good.", "title": "Linkage Infrastructure, Equipment and Facilities - Grant ID: LE170100017", "id": "945112", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LE170100017", "researchers": ["A/Prof Cressida Fforde", "Prof Daryle Rigney", "A/Prof Gavan McCarthy", "Prof Paul Turnbull", "A/Prof Steve Hemming", "Dr Michael Pickering", "Prof Paul Tapsell", "Dr Charles McKeown", "Prof Dr Robin Boast", "Mr Lui David", "Mr Wesley Morris", "Ms Honor Keeler", "Mr Lawrence Rankine", "Dr Larissa Förster", "Dr Blake Singley"], "status": "active", "fundingAmount": 1231000, "fundingScheme": "Linkage Infrastructure, Equipment and Facilities", "startDate": 2017, "endDate": 2018, "dateTimeModified": "2018-10-02T04:21:29Z", "dateTimeCreated": "2017-07-04T23:45:08Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LE170100017", "identifiers": ["http://purl.org/au-research/grants/arc/LE170100017", "LE170100017"], "subjects": ["CURATORIAL AND RELATED STUDIES", "HISTORY AND ARCHAEOLOGY"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/945112"}]}, {"description": "&lsquo;Return, Reconcile, Renew&rsquo; illuminates over forty years of the repatriation of Indigenous ancestral remains. This international project brings together community organisations, government, cultural institutions and universities to significantly advance repatriation research. It will provide in-depth analysis of historical context, reveal rich Indigenous histories, explore the effects of repatriation, and present new understanding about its current and future role in community development. It will deliver publications in scholarly and popular domains and its data archive will forge new ground in the Indigenous development of protocols for the digital archiving of, and online access to, information of high cultural sensitivity.", "title": "Linkage Projects - Grant ID: LP130100131", "id": "517097", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP130100131", "researchers": ["A/Prof Cressida Fforde", "Prof Daryle Rigney", "Prof Paul Turnbull", "Asst Prof Gavan McCarthy", "Mr Lyndon Ormond-Parker", "A/Prof Steve Hemming", "Dr Michael Pickering", "Prof Paul Tapsell", "Dr C. Timothy McKeown", "Mrs Grace Koch", "Mr Thomas (Tom) Trevorrow", "Ms Barbara Poliness", "Mr Warren Gooda", "Mr Lui David", "Ms Amber Aranui", "Ms Honor Keeler"], "status": "closed", "fundingAmount": 629533, "fundingScheme": "Linkage Projects", "startDate": 2013, "endDate": 2016, "dateTimeModified": "2016-05-29T08:52:44Z", "dateTimeCreated": "2015-04-12T05:05:55Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP130100131", "identifiers": ["http://purl.org/au-research/grants/arc/LP130100131", "LP130100131"], "subjects": ["HISTORICAL STUDIES", "HISTORY AND ARCHAEOLOGY", "repatriation of indigenous human remains", "indigenous social", "cultural and economic development", "national and international indigenous engagement"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517097"}]}]}