{"ANU": {"name": "Daniel Fassnacht", "link": "https://researchers.anu.edu.au/researchers/fassnacht-db", "colleges": "College of Health & Medicine", "email": "Daniel.Fassnacht@anu.edu.au", "phone": "", "expertise": ["Health Clinical And Counselling Psychology", "Psychological Methodology Design And Analysis", "Personality Abilities And Assessment"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Therapist-assisted internet-based cognitive behavioral therapy versus progressive relaxation in obsessive-compulsive disorder: Randomized controlled trial", "year": "2018", "source": "Journal of Medical Internet Research, vol. 20, no. 8, pp. 18pp", "authors": ["Kyrios M", "Ahern C", "Daniel Fassnacht"]}, {"title": "ttachment anxiety and self-ambivalence as vulnerabilities toward Obsessive Compulsive Disorder", "year": "2018", "source": "Journal of Obsessive-Compulsive and Related Disorders, vol. 18, pp. 40-46", "authors": ["Seah R", "Daniel Fassnacht", "Kyrios M"]}, {"title": "The cognitive-behavioural model of hoarding disorder: Evidence from clinical and non-clinical cohorts", "year": "2018", "source": "Clinical Psychology and Pyschotherapy, vol. 25, no. 2, pp. 311-321pp", "authors": ["Kyrios M", "Mogan C", "Moulding R", "Daniel Fassnacht"]}, {"title": "Perceived Barriers and Facilitators Towards Help-seeking for Eating Disorders: A Systematic Review", "year": "2017", "source": "International Journal of Eating Disorders, vol. 50, no. 1, pp. 9-21", "authors": ["Ali K", "Farrer L", "Daniel Fassnacht"]}, {"title": "Implicit and explicit anti-fat bias among Asian females", "year": "2017", "source": "Eating and Weight Disorders - Studies on Anorexia, Bulimia and Obesity, vol. 22, no. 3, pp. 457-465", "authors": ["Jiang W", "Tan J", "Daniel Fassnacht"]}, {"title": "The Self in psychological disorders: The example of obsessive-compulsive spectrum disorders", "year": "2016", "source": "in Menzies, Kyrios, Kazantsis (ed.), Innovations and Future Directions in the Behavioural and Cognitive Therapies, Australian Academic Press, Australia, pp. 63-67", "authors": ["Daniel Fassnacht", "Ahern C", "Haymes N"]}, {"title": "Parental comments: Relationship with gender, body dissatisfaction, and disordered eating in Asian young adults", "year": "2016", "source": "Body Image, vol. 16, pp. 93-99", "authors": ["Chng S", "Daniel Fassnacht"]}, {"title": "Recruiting for health, medical or psychosocial research using Facebook: Systematic review", "year": "2016", "source": "Internet Interventions, vol. 4, no. Part 1, pp. 72-81", "authors": ["Thornton L", "Batterham P", "Daniel Fassnacht"]}, {"title": "Use of Text Messaging Services to Promote Health Behaviors in Children", "year": "2015", "source": "Journal of Nutrition Education and Behavior, vol. 47, no. 1, pp. 75-80", "authors": ["Daniel Fassnacht", "Ali K", "Silva C"]}, {"title": "Predictors of response to cognitive behaviour therapy for obsessive-compulsive disorder", "year": "2015", "source": "International Journal of Clinical and Health Psychology, vol. 15, no. 3, pp. 181-190", "authors": ["Kyrios M", "Hordern C", "Daniel Fassnacht"]}, {"title": "Demographic and psychosocial predictors of major depression and generalised anxiety disorder in Australian university students", "year": "2016", "source": "BMC Psychiatry, vol. 16, no. 241, pp. 1-9", "authors": ["Farrer L", "Gulliver A", "Bennett K", "Daniel Fassnacht"]}, {"title": "Promoting health behaviour in Portuguese children via Short Message Service: The efficacy of a text-messaging programme", "year": "2015", "source": "Journal of Health Psychology, vol. 20, no. 6, pp. 806-815", "authors": ["Silva C", "Daniel Fassnacht", "Ali K"]}, {"title": "Online assessment of eating disorders: The Clinical and Research Inventory for Eating Disorders (CR-EAT)", "year": "2015", "source": "Mental Health & Prevention, vol. 3, no. 4, pp. 170-177", "authors": ["Moessner M", "Daniel Fassnacht", "Bauer S"]}, {"title": "The Portuguese version of the Outcome Questionnaire (OQ-45): Normative data, reliability, and clinical significance cut-offs scores", "year": "2015", "source": "Psychology and Psychotherapy: Theory, Research and Practice, vol. 88, no. 4, pp. 427-437", "authors": ["Machado P", "Daniel Fassnacht"]}, {"title": "Time to improve and recover from depressive symptoms and interpersonal problems in a clinical trial", "year": "2015", "source": "Clinical Psychology and Pyschotherapy, vol. 22, no. 2, pp. 97-105", "authors": ["Lopes R", "Goncalves M", "Daniel Fassnacht"]}, {"title": "Long-term effects of psychotherapy on moderate depression: A comparative study of narrative therapy and cognitive-behavioral therapy", "year": "2014", "source": "Journal of Affective Disorders, vol. 167, no. -, pp. 64-73", "authors": ["Lopes R", "Goncalves M", "Daniel Fassnacht"]}, {"title": "Feeling\" (and feeding) the body: The role of body and emotional awareness, body responsiveness, and body appreciation in intuitive eating", "year": "2013", "source": "International Conference on Managing the Asian Century ICMAC 2013, ed. P Mandal, Springer, Singapore, pp. 311-318", "authors": ["Suthendran S", "Daniel Fassnacht"]}, {"title": "Parental influences on young adult body dissatisfaction and disordered eating: the role of gender", "year": "2013", "source": "International Conference on Managing the Asian Century ICMAC 2013, ed. P Mandal, Springer, Singapore, pp. 303-309", "authors": ["Chng S", "Daniel Fassnacht"]}]}, "Microsoft-Academic": [{"title": "the relationship between men s early maladaptive schemas rape myth acceptance and self reported likelihood of using force and raping", "year": 2016, "source": "journal of psychology & clinical psychiatry", "authors": [{"name": "sanveen k kang"}, {"name": "nenna ndukwe"}, {"name": "daniel fassnacht"}], "id": 2764577009}], "ANDS-Grants": []}