{"ANU": {"name": "Darren R. Halpin", "link": "https://researchers.anu.edu.au/researchers/halpin-dr", "colleges": "College of Arts and Social Sciences", "email": "darren.halpin@anu.edu.au", "phone": "02 6125 4825", "expertise": ["Australian Government And Politics", "Comparative Government And Politics", "Public Policy"], "interest": ["I am a political scientist who researches and writes about organised interests (interest groups, thinks tanks, corporations and lobbyists) and political representation, and the connections between the two. I explore these themes in work on Australia, the US, United Kingdom and comparatively. My first book Groups, Democracy and Representation: Between Promise and Practice (2010, Manchester University Press), probed what we should expect groups to contribute to democratic representation. My follow up book The Organization of Political Interest Groups: Designing Advocacy (2014, Routledge), pioneers an organisational social science perspective on interest groups, spanning group formation through to policy influence.Later this year my new book, with Anthony J. Nownes, The New Entrepreneurial Advocacy: Silicon Valley Elites in American Politics, comes out with Oxford University Press.My work has attracted competitive funding from the Australian Research Council, UK Economic and Social Research Council, the Leverhulme Trust and the British Academy."], "biography": "", "project": ["See my website. Link below."], "publication": [{"title": "Laying the Groundwork: Linking Internal Agenda-Setting Processes of Interest Groups to Their Role in Policy Making", "year": "2019", "source": "Administration and Society, vol. 51, no. 8, pp. 1337-1359", "authors": ["Darren R. Halpin", "Fraussen B"]}, {"title": "Change or stability in the structure of interest group networks? Evidence from Scottish Public Policy Consultations", "year": "2019", "source": "Journal of Public Policy, vol. 39, no. 2, pp. 267-294", "authors": ["Ackland R", "Darren R. Halpin"]}, {"title": "Does group engagement with members constitute a \"beneficial inefficiency\"?", "year": "2019", "source": "Governance: an International journal of Policy, Administration and Institutions, vol. 32, no. 3, pp. 511-529", "authors": ["Groemping M", "Darren R. Halpin"]}, {"title": "How do interest groups legitimate their policy advocacy? Reconsidering linkage and internal democracy in times of digital disruption", "year": "2018", "source": "Public Administration, vol. 96, no. 1, pp. 23-35", "authors": ["Fraussen B", "Darren R. Halpin"]}, {"title": "Online petitioning and politics: the development of Change.org in Australia", "year": "2018", "source": "Australian Journal of Political Science, vol. 53, no. 4, pp. 428-445", "authors": ["Darren R. Halpin", "Vromen A", "Vaughan M"]}, {"title": "Interest Groups and the Election", "year": "2018", "source": "in Anika Gauja, Peter Chen, Jennifer Curtin and Juliet Pietsch (ed.), Double Disillusion: The 2016 Australian Federal Election, ANU Press, Canberra, Australia, pp. 381-396pp", "authors": ["Darren R. Halpin", "Fraussen B"]}, {"title": "ssessing the prominence of interest groups in parliament: a supervised machine learning approach", "year": "2018", "source": "The Journal of Legislative Studies, vol. 24, no. 4, pp. 450-474", "authors": ["Fraussen B", "Graham T", "Darren R. Halpin"]}, {"title": "Think tanks and strategic policy-making: the contribution of think tanks to policy advisory systems", "year": "2017", "source": "Policy Sciences, vol. 50, no. 1, pp. 105-124pp", "authors": ["Fraussen B", "Darren R. Halpin"]}, {"title": "Diversity in the News? A Study of Interest Groups in the Media in the UK, Spain and Denmark", "year": "2017", "source": "British Journal of Political Science, vol. 47, no. 2, pp. 313-328pp", "authors": ["Binderkrantz A", "Bonafont L", "Darren R. Halpin"]}, {"title": "Conceptualising the policy engagement of interest groups: Involvement, access and prominence", "year": "2017", "source": "European Journal of Political Research, vol. Online, pp. 5pp", "authors": ["Darren R. Halpin", "Fraussen B"]}, {"title": "Conceptualising the policy engagement of interest groups: Involvement, access and prominence", "year": "2017", "source": "European Journal of Political Research, vol. Online, pp. 5pp", "authors": ["Darren R. Halpin", "Fraussen B"]}, {"title": "The balancing act of establishing a policy agenda: Conceptualizing and measuring drivers of issue prioritization within interest groups", "year": "2017", "source": "Governance: an International Journal of Policy and Administration, vol. online, pp. 1-23pp", "authors": ["Darren R. Halpin", "Fraussen B", "Nownes A"]}, {"title": "The balancing act of establishing a policy agenda: Conceptualizing and measuring drivers of issue prioritization within interest groups", "year": "2017", "source": "Governance: an International journal of Policy, Administration and Institutions, vol. online, pp. 1-23pp", "authors": ["Darren R. Halpin", "Fraussen B", "Nownes A"]}, {"title": "Neoliberal governance and", "year": "2017", "source": "responsibilization' of agents: reassessing the mechanisms of responsibility-shift in neoliberal discursive environments'Distinktion: Scandinavian Journal of Social Theory, vol. Online, pp. 1-21pp", "authors": ["Pyysiainen J", "Darren R. Halpin", "Guilfoyle A"]}, {"title": "Commercial Lobbying in Australia: Exploring the Australian Lobby Register", "year": "2016", "source": "Australian Journal of Public Administration, vol. 75, no. 1, pp. 100-111", "authors": ["Darren R. Halpin", "Warhurst J"]}, {"title": "ssessing the Composition and Diversity of the Australian Interest Group System", "year": "2016", "source": "Australian Journal of Public Administration, vol. 75, no. 4, pp. 476-491pp", "authors": ["Fraussen B", "Darren R. Halpin"]}, {"title": "Political Parties and Interest Organizations at the Crossroads: Perspectives on the Transformation of Political Organizations", "year": "2016", "source": "Political Studies Review", "authors": ["Fraussen B", "Darren R. Halpin"]}, {"title": "Images of an Unbiased Interest System", "year": "2015", "source": "Journal of European Public Policy, vol. 22, no. 8, pp. 1212-1231", "authors": ["Lowery D", "Baumgartner F", "Berkhout J", "Darren R. Halpin"]}, {"title": "Identity as Constraint and Resource in Interest Group Evolution: A Case of Radical Organizational Change", "year": "2015", "source": "The British Journal of Politics and International Relations, vol. 17, no. 1, pp. 31-48", "authors": ["Darren R. Halpin", "Daugbjerg C"]}, {"title": "Farm Protest and Militancy in Australia: Supporting or undermining interest-group politics?", "year": "2015", "source": "in D.Strijker, G. Voerman and I.J.Terluin (ed.), Rural Protest Groups and Populist Political Parties, Wageningen Academic Publishers, Wageningnen, pp. 145-161", "authors": ["Darren R. Halpin"]}, {"title": "Interest Group \"Policy Agendas\" What Are They? And How Might We Study Them?", "year": "2015", "source": "in Allan J. Cigler, Burdett A. Loomis, Anthony J. Nownes (ed.), Interest Group Politics (9th Ed.), SAGE Publications, Washington", "authors": ["Darren R. Halpin"]}, {"title": "Still in the shadows? Interest Groups and Political Parties in the Australian Political System", "year": "2015", "source": "in Narelle Miragliotta, Anika Gauja & Rodney Smith (ed.), Contemporary Australian Political Party Organizations, Monash University Publishing, Clayton, pp. 103-114", "authors": ["Darren R. Halpin"]}, {"title": "The Influence of Organization Ecology Research on Population Ecology of Interest Representation: Present Practices and Future Prospects", "year": "2015", "source": "in David Lowery, Darren Halpin and Virginia Gray (ed.), The Organization Ecology of Interest Communities. Assessment and Agenda, Palgrave Macmillan Ltd, Basingstoke and New York, pp. 225-247", "authors": ["Darren R. Halpin"]}, {"title": "The Organization Ecology of Interest Communities. Assessment and Agenda", "year": "2015", "source": "Palgrave Macmillan LtdBasingstoke and New York", "authors": ["Lowery D", "Darren R. Halpin", "Gray V", "eds"]}, {"title": "Parliamentary committees and inquiries", "year": "2015", "source": "in Brian Head, Kate Crowley (ed.), Policy analysis in Australia, The Policy Press, Bristol, pp. 137-150", "authors": ["Marsh M", "Darren R. Halpin"]}, {"title": "Who Gives Evidence to Parliamentary Committees? A Comparative Investigation of Parliamentary Committees and their Constituencies", "year": "2015", "source": "Journal of Legislative Studies, vol. 21, no. 3, pp. 408-427", "authors": ["Pedersen H", "Darren R. Halpin", "Rasmussen A"]}, {"title": "The Organization of Political Interest Groups: Designing advocacy", "year": "2014", "source": "Routledge Taylor & Francis GroupAbingdon and New York", "authors": ["Darren R. Halpin"]}, {"title": "Committee Hearings of the Scottish Parliament: Evidence Giving and Policy Learning", "year": "2012", "source": "The Journal of Legislative Studies, vol. 18, no. 1, pp. 1 - 20", "authors": ["Darren R. Halpin", "MacLeod I", "McLaverty P"]}, {"title": "Explaining breadth of policy engagement: Patterns of interest group mobilization in public policy", "year": "2011", "source": "Journal of European Public Policy, vol. 18, no. 2, pp. 201-219", "authors": ["Darren R. Halpin", "Binderkrantz A"]}, {"title": "Interest-group capacities and infant industry development: State-sponsored growth in organic farming", "year": "2011", "source": "International Political Science Review, vol. 32, no. 2, pp. 147-166", "authors": ["Darren R. Halpin", "Daugbjerg C", "Schvartzman Y"]}, {"title": "Explaining Policy Bandwagons: Organized Interest Mobilization and Cascades of Attention", "year": "2011", "source": "Governance: an International Journal of Policy and Administration, vol. 24, no. 2, pp. 205-230", "authors": ["Darren R. Halpin"]}, {"title": "Groups", "year": "2010", "source": "Representation and Democracy: Between Promise and PracticeManchester University Press, Manchester", "authors": ["Darren R. Halpin"]}, {"title": "Legitimating NGO advocacy: The case of internal democracies", "year": "2010", "source": "in J Steffek and K Hahn (ed.), Evaluating transnational NGOs: Legitimacy, Accountability, Representation, Palgrave Macmillan Ltd, Denmark", "authors": ["Darren R. Halpin", "McLaverty P"]}, {"title": "Generating Policy Capacity in Emerging Green Industries: The Development of Organic Farming in Denmark and Australia", "year": "2010", "source": "Journal of Environmental Policy and Planning, vol. 12, no. 2, pp. 141-157", "authors": ["Daugbjerg C", "Darren R. Halpin"]}, {"title": "Interpreting environments: Interest group response to population ecology pressures", "year": "2009", "source": "British Journal of Political Science, vol. 39, no. 2, pp. 243-265", "authors": ["Darren R. Halpin", "Jordan G"]}, {"title": "New Scottish Parliament, Same Old Interest Group Politics?", "year": "2009", "source": "in Charlie Jeffery and James Mitchell (ed.), The Scotish Parliament 1999-2009: The First Decade, Luath Press Ltd, Glasgow, p. 167", "authors": ["Darren R. Halpin", "Jordan G", "Cairney P"]}, {"title": "ssociative deadlocks and transformative capacity: Engaging in Australian organic farm industry development", "year": "2008", "source": "Australian Journal of Political Science, vol. 43, no. 2, pp. 189-206", "authors": ["Darren R. Halpin", "Daugbjerg C"]}, {"title": "Deliberative drift: The emergence of deliberation in the policy process", "year": "2008", "source": "International Political Science Review, vol. 29, no. 2, pp. 197-214", "authors": ["McLaverty P", "Darren R. Halpin"]}, {"title": "Committee Hearings of the Scottish Parliament: Evidence-giving and Policy Learning", "year": "2012", "source": "Journal of Legislative Studies, 18 (1), 1-20", "authors": ["Darren R. Halpin", "MacLeod I and McLaverty P ("]}, {"title": "Evaluating the Breadth of Policy Engagement by Organized Interests", "year": "2012", "source": "Public Administration, vol. 90, no. 3, pp. 582-599", "authors": ["Darren R. Halpin", "Thomas H"]}, {"title": "Interest group survival: Explaining sources of mortality anxiety", "year": "2012", "source": "Interest Groups and Advocacy, vol. 1, no. 2, pp. 215-238", "authors": ["Darren R. Halpin", "Thomas H"]}, {"title": "Organized Interests and Cascades of Attention: Unpacking Policy Bandwagon Dynamics", "year": "2011", "source": "Governance24(2), 205-30.", "authors": ["Darren R. Halpin"]}, {"title": "Explaining Breadth of Policy Engagement: Patterns of Interest Group Mobilization in Public Policy", "year": "2011", "source": "Journal of European Public Policy18 (2), 201-19", "authors": ["Darren R. Halpin"]}, {"title": "Interest Group Capacities and Infant Industry Development: State-sponsored Growth in Organic Farming", "year": "2011", "source": "International Political Science Review32 (2), 147-66.", "authors": ["Darren R. Halpin", "Daugbjerg C", "and Schwartzman J ("]}, {"title": "Generating Policy Capacity in Emerging Green Industries: The Development of Organic Farming in Denmark and Australia", "year": "2010", "source": "Journal of Environmental Policy and Planning12 (2), 141-57", "authors": ["Daugbjerg C", "Darren R. Halpin"]}, {"title": "Interpreting Environments: Interest group response to population ecology pressures", "year": "2009", "source": "British Journal of Political Science, 39 (2), 243-65.", "authors": ["Darren R. Halpin"]}, {"title": "Deliberative Drift: The Emergence of Deliberation in the Policy Process", "year": "2008", "source": "International Political Science Review, 29 (2), 197-214.", "authors": ["Darren R. Halpin"]}, {"title": "The Scale of Interest Organization in Democratic Politics Data and Research Methods", "year": "2012", "source": "Palgrave Macmillan LtdGreat Britain", "authors": ["Darren R. Halpin", "Jordan G", "eds"]}, {"title": "Reappraising the Survival Question: Why We Should Focus on Interest Group Organizational Form and Careers", "year": "2012", "source": "in Allan J. Cigler and Burdett A Loomis (ed.), Interest Group Politics (8th ed), CQ Press (a division of SAGE), Washington DC, USA, pp. 52-73", "authors": ["Darren R. Halpin", "Nownes A"]}, {"title": "Pressure groups and lobbying", "year": "2012", "source": "in R Smith, A Vromen & I Cook (ed.), Contemporary Politics in Australia: Theories, Practices and Issues, Cambridge University Press, Melbourne, pp. 177-187", "authors": ["Darren R. Halpin"]}, {"title": "NGOs and Democratisation: Assessing Variation in the Internal Democratic Practices of NGOs", "year": "2009", "source": "in N. Crowson, M.Hilton. J. McKay (ed.), NGOs in Contemporary Britain: Non-State Actors in Society and Politics since 1945, Palgrave Macmillan Ltd, Hampshire, UK, pp. 261-280", "authors": ["Darren R. Halpin"]}, {"title": "Surviving Global Change?", "year": "2005", "source": "Ashgate Publishing LtdEngland", "authors": ["Darren R. Halpin", "ed"]}, {"title": "Going Organic: Mobilizing Networks for Environmentally Responsible Food Production", "year": "2006", "source": "CABI PublishingWallingford UK", "authors": ["Lockie S", "Lyons K", "Lawrence G", "Darren R. Halpin"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}