{"ANU": {"name": "David L. Ollis", "link": "https://researchers.anu.edu.au/researchers/ollis-dl", "colleges": "College of Science", "email": "david.ollis@anu.edu.au", "phone": "(02) 6125 4377", "expertise": ["Structural Biology Incl. Macromolecular Modelling", "Medicinal And Biomolecular Chemistry", "Environmental Biotechnology", "Other Biological Sciences"], "interest": ["Protein engineering  - including directed evolution. We are interested in evolving enzymes for practical purposes and as a way of geining a better understanding of how they function. The sysytems we work on include enzymes involved in the breakdown of pesticides and enzymes involved in the production of bofuels. We are also interested using directed evolution to predict antibiotic resistance and have developed protocols to evolve proteins to be more soluble.Structural biology - we use protein crystallography to determine the structures of interesting proteins - cell surface receptors such as the IL5 beta common receptor being one example. Most of our structure work is aimed at looking at the structures of proteins that have been evolved to have enhanced activities."], "biography": "For his PhD, David Ollis worked in the laboratory of Professor Hans Freeman of the Department of Inorganic Chemistry, Sydney University. He was the first graduate student to solve a protein structure in Australia - this led to  post-doctoral position in the laboraory of Professor Tom Steitz (Nobel Prize in Chemistry, 2008) of Yale University. During this time, Professor Ollis worked on the first structure of a DNA polymerase as well as the structures of a number of other proteins. This work resulted in a faculty position in the Department of Biochemistry, Molecular Biology and cell Biology, Northestern Univerisy in Chicago.During this time he worked on the structure and function of the enzyme Dienelactone Hydrolase and as part of this study he was involved in the identification of a new protein fold - the alpha / beta hydroalse fold.  He managed to gain tenure and promotion Associate professor before returning to Australai to take up a position as a Senior Fellow in the Research School of Chemistry, of the Australian NNational University. He was promoted to promoted to the rank of Professor in 2005 and served as Head of the Chemistry Department from 2006 till 2008. His current research interests include protein engineering (direcetd evolution) and structural biology (protein crystallography).", "project": ["Evolving better enzymes"], "publication": [{"title": "High resolution crystal structure of a fluoride-inhibited organophosphate-degrading metallohydrolase", "year": "2017", "source": "Journal of Inorganic Biochemistry, vol. 177, pp. 287-290", "authors": ["Selleck C", "Guddat L", "David L. Ollis"]}, {"title": "Insights into an evolutionary strategy leading to antibiotic resistance", "year": "2017", "source": "Scientific Reports, vol. 7, no. 40357, pp. 1-13pp", "authors": ["Hou C", "Liu J", "Collyer C", "David L. Ollis"]}, {"title": "Directed Evolution of Enzymes for Industrial Biocatalysis", "year": "2016", "source": "ChemBioChem, vol. 17, no. 3, pp. 197-203", "authors": ["Porter J", "Rusli R", "David L. Ollis"]}, {"title": "Ca-II Binding Regulates and Dominates the Reactivity of a Transition-Metal-Ion-Dependent Diesterase from Mycobacterium tuberculosis", "year": "2016", "source": "Chemistry, A European Journal, vol. 22, no. 3, pp. 999-1009", "authors": ["Pedroso M", "Larrabee J", "Ely F", "David L. Ollis"]}, {"title": "Organophosphate-degrading metallohydrolases: Structure and function of potent catalysts for applications in bioremediation", "year": "2016", "source": "Coordination Chemistry Reviews, vol. 317, pp. 122-131", "authors": ["Schenk G", "Mateen I", "Ng T", "David L. Ollis"]}, {"title": "Directed evolution of new and improved enzyme functions using an evolutionary intermediate and multidirectional search", "year": "2015", "source": "ACS chemical biology, vol. 10, no. 2, pp. 611-621", "authors": ["Porter J", "Boon P", "Murray T", "David L. Ollis"]}, {"title": "Compensatory Stabilizing Role of Surface Mutations During the Directed Evolution of Dienelactone Hydrolase for Enhanced Activity", "year": "2015", "source": "Protein Journal, vol. 34, no. 1, pp. 82-89", "authors": ["Porter J", "Collyer C", "David L. Ollis"]}, {"title": "ltering the substrate specificity of methyl parathion hydrolase with directed evolution", "year": "2015", "source": "Archives of Biochemistry and Biophysics, vol. 573, pp. 59-68", "authors": ["Ng T-K Gahan L", "David L. Ollis"]}, {"title": "Pseudomonas aeruginosa arylsulfatase: A purified enzyme for the mild hydrolysis of steroid sulfates", "year": "2015", "source": "Drug Testing and Analysis, (www.drugtestinganalysis.com) DOI 10.1002/dta.1782", "authors": ["Stevenson B", "Waller C", "Ma P", "David L. Ollis"]}, {"title": "Unusual metallo-Î²-lactamases may constitute a new subgroup in this family of enzymes", "year": "2014", "source": "American Journal of Molecular Biology, vol. 4, no. 1, pp. 11-15", "authors": ["Hou C", "Phelan E", "Miraula M", "David L. Ollis"]}, {"title": "Immobilization of the enzyme GpdQ on magnetite nanoparticles for organophosphate pesticide bioremediation", "year": "2014", "source": "Journal of Inorganic Biochemistry, vol. 131, pp. 1-7", "authors": ["Daumann L", "Larrabee J", "David L. Ollis"]}, {"title": "Spectroscopic and mechanistic studies of dinuclear metallohydrolases and their biomimetic complexes", "year": "2014", "source": "Dalton Transactions, vol. 43, no. 3, pp. 910-928", "authors": ["Daumann L", "Schenk G", "David L. Ollis"]}, {"title": "Use of OpdA, an organophosphorus (OP) hydrolase, prevents lethality in an African green monkey model of acute OP poisoning", "year": "2014", "source": "Toxicology, vol. 317, pp. 1-5", "authors": ["Jackson C", "Carville A", "Ward J", "David L. Ollis"]}, {"title": "Determination of the catalytic activity of binuclear metallohydrolases using isothermal titration calorimetry", "year": "2014", "source": "Journal of Biological Inorganic Chemistry, vol. 19, no. 3, pp. 389-398", "authors": ["Pedroso M", "Ely F", "Lonhienne T", "David L. Ollis"]}, {"title": "Crystallization of dienelactone hydrolase in two space groups: structural changes caused by crystal packing", "year": "2014", "source": "Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 70, no. 7, pp. 884-889", "authors": ["Porter J", "Carr P", "Collyer C", "David L. Ollis"]}, {"title": "The Escherichia coli glucuronylsynthase promoted synthesis of steroid glucuronides: improved practicality and broader scope", "year": "2014", "source": "Organic and Biomolecular Chemistry, vol. 12, no. 32, pp. 6208-6214", "authors": ["Ma P", "Kanizaj N", "Chan S", "David L. Ollis"]}, {"title": "Crystal structure of the mouse interleukin-3 Î²-receptor: insights into interleukin-3 binding and receptor activation", "year": "2014", "source": "Biochemical Journal, vol. 463, no. 3, pp. 393-403", "authors": ["Carr P", "Ewens C", "Dai J", "David L. Ollis"]}, {"title": "Metallo-Î²-lactamases: a major threat to human health", "year": "2014", "source": "American Journal of Molecular Biology, vol. 4, no. 3, pp. 89-104", "authors": ["Phelan E", "Miraula M", "Selleck C", "David L. Ollis"]}, {"title": "Comparative investigation of the reaction mechanisms of the organophosphate-degrading phosphotriesterases from Agrobacterium radiobacter (OpdA) and Pseudomonas diminuta (OPH)", "year": "2014", "source": "Journal of Biological Inorganic Chemistry, vol. 19, no. 8, pp. 1263-1275", "authors": ["Pedroso M", "Ely F", "Mitic N", "David L. Ollis"]}, {"title": "Promiscuity comes at a price: Catalytic versatility vs efficiency in different metal ion derivatives of the potential bioremediator GpdQ", "year": "2013", "source": "Biochimica et Biophysica Acta: Proteins & Proteomics, vol. 1834, no. 1, pp. 425-432", "authors": ["Daumann L", "McCarthy B", "Hadler K", "David L. Ollis"]}, {"title": "SCREENING LIBRARIES FOR IMPROVED SOLUBILITY USING E COLI DIHYDROFOLATE REDUCTASE AS A REPORTER", "year": "2013", "source": "Methods in Molecular Biology, vol. 978, pp. 229-236", "authors": ["Liu J", "David L. Ollis"]}, {"title": "IN VITRO DIRECTED EVOLUTION OF ENZYMES EXPRESSED BY E COLI IN MICROTITER PLATES", "year": "2013", "source": "Methods in Molecular Biology, vol. 978, pp. 237-249", "authors": ["Stevenson B", "Yip S", "David L. Ollis"]}, {"title": "Structure and function of an insect Î±-carboxylesterase (Î±Esterase7) associated with insecticide resistance", "year": "2013", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 110, no. 25, pp. 10177-10182", "authors": ["Jackson C", "Liu J", "Carr P", "David L. Ollis"]}, {"title": "Identification and characterization of an unusual metallo-Î²-lactamase from Serratia proteamaculans", "year": "2013", "source": "Journal of Biological Inorganic Chemistry, vol. 18, no. 7, pp. 855-863", "authors": ["Vella P", "Miraula M", "Phelan E", "David L. Ollis"]}, {"title": "Substrate-induced conformational change and isomerase activity of dienelactone hydrolase and its site-specific mutants", "year": "2012", "source": "ChemBioChem, vol. 13, no. 11, pp. 1645-1651", "authors": ["Walker I", "Hennessy J", "David L. Ollis"]}, {"title": "Binuclear Metallohydrolases: Complex Mechanistic Strategies for a Simple Chemical Reaction", "year": "2012", "source": "Accounts of Chemical Research, vol. 45, no. 9, pp. 1593-1603", "authors": ["Schenk G", "Mitic N", "Gahan L", "David L. Ollis"]}, {"title": "Synthesis and kinetic testing of tetrahydropyrimidine-2-thione and pyrrole derivatives as inhibitors of the metallo-Î²-lactamase from Klebsiella pneumonia and Pseudomonas aeruginosa", "year": "2012", "source": "Chemical Biology and Drug Design, vol. 80, no. 4, pp. 500-515", "authors": ["Hussein W", "Fatahala S", "Mohamed Z", "David L. Ollis"]}, {"title": "Phosphate-bound structure of an organophosphate-degrading enzyme from Agrobacterium radiobacter", "year": "2012", "source": "Journal of Inorganic Biochemistry, vol. 106, no. 1, pp. 19-22", "authors": ["Ely F", "Pedroso M", "Gahan L", "David L. Ollis"]}, {"title": "Mercapto-1,2,4-triazoles and N-acylated thiosemicarbazides as metallo-Î²-lactamase inhibitors", "year": "2012", "source": "Bioorganic and Medicinal Chemistry Letters, vol. 22, no. 1, pp. 380-386", "authors": ["Faridoon M", "Hussein W", "Vella P", "David L. Ollis"]}, {"title": "The role of Zn-OR and Zn-OH nucleophiles and the influence of para-substituents in the reactions of binuclear phosphatase mimetics", "year": "2012", "source": "Dalton Transactions, vol. 41, no. 6, pp. 1695-1708", "authors": ["Daumann L", "Dalle K", "Schenk G", "David L. Ollis"]}, {"title": "Engineering enzymes for energy production", "year": "2012", "source": "Australian Journal of Chemistry, vol. 65, no. 6, pp. 652-655", "authors": ["David L. Ollis"]}, {"title": "Improving a natural enzyme activity through incorporation of unnatural amino acids", "year": "2011", "source": "Journal of the American Chemical Society, vol. 133, no. 2, pp. 326-333", "authors": ["Ugwumba I", "Ozawa K", "Xu Z", "David L. Ollis"]}, {"title": "Electronic and geometric structures of the organophosphate-degrading enzyme from Agrobacterium radiobacter (OpdA)", "year": "2011", "source": "Journal of Biological Inorganic Chemistry, vol. 16, no. 5, pp. 777-787", "authors": ["Ely F", "Hadler K", "Mitic N", "David L. Ollis"]}, {"title": "The identification of new metallo-Î²-lactamase inhibitor leads from fragment-based screening", "year": "2011", "source": "Bioorganic and Medicinal Chemistry Letters, vol. 21, no. 11, pp. 3282-3285", "authors": ["Vella P", "Hussein W", "Leung E", "David L. Ollis"]}, {"title": "Directed evolution combined with rational design increases activity of GpdQ toward a non-physiological substrate and alters the oligomeric structure of the enzyme", "year": "2011", "source": "Protein Engineering Design and Selection, vol. 24, no. 12, pp. 861-872", "authors": ["Yip S", "Foo J", "Schenk G", "David L. Ollis"]}, {"title": "The organophosphate-degrading enzyme from Agrobacterium radiobacter displays mechanistic flexibility for catalysis", "year": "2010", "source": "Biochemical Journal, vol. 432, no. 3, pp. 565-573", "authors": ["Ely F", "Hadler K", "Gahan L", "David L. Ollis"]}, {"title": "Directed evolution of enzymes", "year": "2010", "source": "in Lew Mander and Hung-Wen (Ben) Liu (ed.), Comprehensive Natural Products Chemistry II: Chemistry and Biology, Elsevier, Oxford, pp. 723-749", "authors": ["Jackson C", "Gillam E", "David L. Ollis"]}, {"title": "Pharmacokinetics of OpdA, an organophosphorus hydrolase, in the African green monkey", "year": "2010", "source": "Biochemical Pharmacology, vol. 80, no. 7, pp. 1075-1079", "authors": ["Jackson C", "Scott C", "Carville A", "David L. Ollis"]}, {"title": "Directed evolution of enzymes", "year": "2010", "source": "in Lew Mander and Hung-Wen (Ben) Liu (ed.), Comprehensive Natural Products Chemistry II: Chemistry and Biology, Elsevier, Oxford, pp. 723-749", "authors": ["Jackson C", "Gillam E", "David L. Ollis"]}, {"title": "Mutation of outer-shell residues modulates metal ion co-ordination strength in a metalloenzyme", "year": "2010", "source": "Biochemical Journal, vol. 429, no. 2, pp. 313-321", "authors": ["Foo J", "Jackson C", "Carr P", "David L. Ollis"]}, {"title": "The bioremediator glycerophosphodiesterase employs a non-processive mechanism for hydrolysis.", "year": "2010", "source": "Journal of Inorganic Biochemistry, vol. 104, no. 2, pp. 211-213", "authors": ["Hadler K", "Grahan L", "David L. Ollis"]}, {"title": "Electronic Structure Analysis of the Dinuclear Metal Center in the Bioremediator Glycerophosphodiesterase (GpdQ) from Enterobacter aerogenes", "year": "2010", "source": "Inorganic Chemistry, vol. 49, no. 6, pp. 2727-2734", "authors": ["Hadler K", "Mitic N", "Yip S", "David L. Ollis"]}, {"title": "Structure of the adenylylation domain of E. coli glutamine synthetase adenylyl transferase: evidence for gene duplication and evolution of a new active site", "year": "2010", "source": "Journal of Molecular Biology, vol. 396, no. 3, pp. 773-784", "authors": ["Xu Y", "Carr P", "Vasudevan S", "David L. Ollis"]}, {"title": "Enzymes and bioscavengers for prophylaxis and treatment of organophosphate poisoning", "year": "2010", "source": "Frontiers in Bioscience, vol. 2, no. 1, pp. 209-220", "authors": ["Bird S", "Dawson A", "David L. Ollis"]}, {"title": "Conformational sampling, catalysis, and evolution of the bacterial phosphotriesterase.", "year": "2009", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 106, no. 51, pp. 21631-21636", "authors": ["Jackson C", "Foo J", "Tokuriki L", "David L. Ollis"]}, {"title": "Î±/Î² Hydrolase Fold: An Update", "year": "2009", "source": "Protein and Peptide Letters, vol. 16, no. 10, pp. 1137-1148", "authors": ["Carr P", "David L. Ollis"]}, {"title": "Structural Flexibility Enhances the Reactivity of the Bioremediator Glycerophosphodiesterase by Fine-Tuning its Mechanism of Hydrolysis", "year": "2009", "source": "Journal of the American Chemical Society, vol. 131, no. 33, pp. 11900-11908", "authors": ["Hadler K", "Mitic N", "Ely F", "David L. Ollis"]}, {"title": "Lime-free removal of non-collagen proteins from sheepskins: quantitative analysis by gel electrophoresis", "year": "2009", "source": "Journal of the Society of Leather Technologists and Chemists, vol. 93, no. 6, pp. 229-232", "authors": ["Shan Z", "Li S", "Liu J", "David L. Ollis"]}, {"title": "Malonate-bound structure of the glycerophosphodiesterase from Enterobacter aerogenes (GpdQ) and characterization of the native Fe2+ metal-ion preference", "year": "2008", "source": "Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 64, no. 8, pp. 681-685", "authors": ["Jackson C", "Hadler K", "Carr P", "David L. Ollis"]}, {"title": "Cadmium(II) complexes of the glycerophosphodiester-degrading enzyme GpdQ and a biomimetic N,O ligand", "year": "2008", "source": "Journal of Biological Inorganic Chemistry, vol. 13, no. 7, pp. 1065-1072", "authors": ["Mirams R", "Smith S", "Hadler K", "David L. Ollis"]}, {"title": "Cloning, expression, purification, crystallization and preliminary X-ray studies of a pyridoxine 5", "year": "2008", "source": "-phosphate oxidase from Mycobacterium smegmatis'Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 64, no. 5, pp. 435-437", "authors": ["Jackson C", "Taylor M", "Tattersall D", "David L. Ollis"]}, {"title": "Substrate-promoted formation of a catalytically competent binuclear center and regulation of reactivity in a glycerophosphodiesterase from Enterobacter aerogenes", "year": "2008", "source": "Journal of the American Chemical Society, vol. 130, no. 43, pp. 14129-14138", "authors": ["Hadler K", "Tanifum E", "Yip S", "David L. Ollis"]}, {"title": "In crystallo capture of a Michaelis complex and product-binding modes of a bacterial phosphotriesterase*", "year": "2008", "source": "Journal of Molecular Biology, vol. 375, no. 5, pp. 1189-1196", "authors": ["Jackson C", "Foo J", "Kim H", "David L. Ollis"]}, {"title": "Directed evolution of yeast pyruvate decarboxylase 1 for attenuated regulation and increased stability", "year": "2008", "source": "Biochemistry, vol. 47, no. 9, pp. 3013-3025", "authors": ["David L. Ollis"]}, {"title": "Crystal structure of the N-terminal domain of the TyrR transcription factor responsible for gene regulation of aromatic amino acid biosynthesis and transport in Escherichia coli K12", "year": "2007", "source": "Journal of Molecular Biology, vol. 367, no. 1, pp. 102-112", "authors": ["Verger D", "Carr P", "Kwok T", "David L. Ollis"]}, {"title": "The structure and function of a novel glycerophosphodiesterase from Enterobacter aerogenes", "year": "2007", "source": "Journal of Molecular Biology, vol. 367, no. 4, pp. 1047-1062", "authors": ["Jackson C", "Carr P", "Liu J", "David L. Ollis"]}, {"title": "Directed evolution of trimethoprim resistance in Escherichia coli", "year": "2007", "source": "The FEBS Journal, vol. 274, no. 10, pp. 2661-2671", "authors": ["Watson M", "Liu J", "David L. Ollis"]}, {"title": "The domains carrying the opposing activities in adenylyltransferase are separated by a central regulatory domain", "year": "2007", "source": "The FEBS Journal, vol. 274, no. 11, pp. 2865-2877", "authors": ["Clancy P", "Xu Y", "van Heeswijk W", "David L. Ollis"]}, {"title": "Enzymatic bioremediation: organophosphate degradation by binuclear metallo-hydrolases", "year": "2007", "source": "Current Topics in Biochemical Research, vol. 9, no. 2, pp. 63-78", "authors": ["Ely F", "Foo J", "Jackson C", "David L. Ollis"]}, {"title": "Using directed evolution to improve the solubility of the C- terminal domain of Escherichia coli aminopeptidase P: Implications for metal binding and protein stability", "year": "2007", "source": "The FEBS Journal, vol. 274, no. 18, pp. 4742-4751", "authors": ["Liu J", "Hadler K", "Schenk G", "David L. Ollis"]}, {"title": "Improving protein solubility: the use of the Escherichia coli dihydrofolate reductase gene as a fusion reporter", "year": "2006", "source": "Protein Expression and Purification, vol. 47, no. 1, pp. 258-263", "authors": ["Liu J", "Boucher Y", "Stokes H", "David L. Ollis"]}, {"title": "Functional effects of amino acid substitutions within the large binding pocket of the phosphotriesterase OpdA from Agrobacterium sp. P230", "year": "2006", "source": "FEMS Microbiology Letters, vol. 259, no. 2, pp. 187-194", "authors": ["Horne I", "Qiu X", "David L. Ollis"]}, {"title": "n improved resolution structure of the human Î² common receptor involved in IL-3, IL-5 and GM-CSF signalling which gives better definition of the high-affinity binding epitope", "year": "2006", "source": "Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 62, no. Pt 6, pp. 509-513", "authors": ["Carr P", "Conlan F", "Ford S", "David L. Ollis"]}, {"title": "nomalous scattering analysis of Agrobacterium radiobacter phosphotriesterase: the prominent role of iron in the heterobinuclear active site", "year": "2006", "source": "Biochemical Journal, vol. 397, no. 3, pp. 501-508", "authors": ["Jackson C", "Carr P", "Kim H", "David L. Ollis"]}, {"title": "The purification, crystallization and preliminary diffraction of a glycerophosphodiesterase from Enterobacter aerogenes", "year": "2006", "source": "Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 62, no. 7, pp. 659-661", "authors": ["Jackson C", "Carr P", "Kim H", "David L. Ollis"]}, {"title": "Following directed evolution with crystallography: structural changes observed in changing the substrate specificity of dienelactone hydrolase", "year": "2005", "source": "Acta Crystallographica Section D: Biological Crystallography, vol. 61, no. 7, pp. 920-931", "authors": ["Kim H", "Liu J", "Carr P", "David L. Ollis"]}, {"title": "Expression, purification and crystallization of the C-terminal domain of Escherichia coli adenylyltransferase", "year": "2005", "source": "Acta Crystallographica Section F: Structural Biology and Crystallization Communications, vol. 61, no. 7, pp. 663-665", "authors": ["Xu Y", "Wen D", "Brown C", "David L. Ollis"]}, {"title": "The structure of an enzyme-product complex reveals the critical role of a terminal hydroxide nucleophile in the bacterial phosphotriesterase mechanism", "year": "2005", "source": "Biochimica et Biophysica Acta: International journal of Biochemistry and Biophysics, vol. 1752, no. 1, pp. 56-64", "authors": ["Jackson C", "Kim H", "Carr P", "David L. Ollis"]}, {"title": "The effects of substrate orientation on the mechanism of a phosphotriesterase", "year": "2005", "source": "Organic and Biomolecular Chemistry, vol. 3, no. 24, pp. 4343-4350", "authors": ["Jackson C", "Liu J", "Coote M", "David L. Ollis"]}, {"title": "Increased expression of a bacterial phosphotriesterase in Escherichia coli through directed evolution", "year": "2005", "source": "Protein Expression and Purification, vol. 41, no. 2, pp. 433-440", "authors": ["Yu McLoughlin S", "Jackson C", "Liu J", "David L. Ollis"]}, {"title": "The Role of Inhibition in Enzyme Evolution", "year": "2004", "source": "Chemistry and Biology, vol. 11, no. 6, pp. 735-737", "authors": ["Yu McLoughlin S", "David L. Ollis"]}, {"title": "Expression, purification, crystallization, and preliminary X-ray analysis of the N-terminal domain of Escherichia coli adenylyl transferase", "year": "2004", "source": "Protein Expression and Purification, vol. 34, no. 1, pp. 142-146", "authors": ["Xu Y", "Wen D", "Clancy P", "David L. Ollis"]}, {"title": "Interleukin-3 Binding to the Murine Î²IL-3 and Human Î²c Receptors Involves Functional Epitopes Formed by Domains 1 and 4 of Different Protein Chains", "year": "2004", "source": "Journal of Biological Chemistry, vol. 279, no. 25, pp. 26500-26508", "authors": ["Murphy J", "Ford S", "Olsen J", "David L. Ollis"]}, {"title": "Growth of Escherichia coli coexpressing phosphotriesterase and glycerophosphodiester phosphodiesterase, using paraoxon as the sole phosphorus source", "year": "2004", "source": "Applied and Environmental Microbiology, vol. 70, no. 1, pp. 404-412", "authors": ["Yu McLoughlin S", "Jackson C", "Liu J", "David L. Ollis"]}, {"title": "Structure of the N-Terminal Domain of Escherichia coli Glutamine Synthetase Adenylyltransferase", "year": "2004", "source": "Structure, vol. 12, no. 5, pp. 861-869", "authors": ["Xu Y", "Zhang R", "Joachimiak A", "David L. Ollis"]}, {"title": "Novel Functional Epitope Formed by Domains 1 and 4 of the Human Common beta -Subunit Is Involved in Receptor Activation by Granulocyte Macrophage Colony-stimulating Factor and Interleukin 5*", "year": "2003", "source": "Journal of Biological Chemistry, vol. 278, no. 12, pp. 10572-10577", "authors": ["Murphy J", "Ford S", "Wiedemann U", "David L. Ollis"]}, {"title": "Evolution of an organophosphate-degrading enzyme: a comparison of natural and directed evolution", "year": "2003", "source": "Protein Engineering, vol. 16, no. 2, pp. 135-145", "authors": ["Yang H", "Carr P", "Yu McLoughlin S", "David L. Ollis"]}, {"title": "The structures of the PII proteins from the cyanobacteria Synechococcus sp. PCC7942 and Synechocystis sp. PCC 6803", "year": "2003", "source": "Acta Crystallographica Section D: Biological Crystallography, vol. D59, pp. 2183-2190", "authors": ["Xu Y", "Carr P", "Clancy P", "David L. Ollis"]}, {"title": "Hydrolysis of the 5", "year": "2002", "source": "-p-Nitrophenyl Ester of TMP by the Proofreading Exonuclease (Îµ) Subunit of Escherichia coli DNA Polymerase III'Biochemistry, vol. 41, no. 16, pp. 5266-5275", "authors": ["Hamdan S", "Bulloch E", "Thompson P", "David L. Ollis"]}, {"title": "Structural Basis for Proofreading during Replication of the Escherichia coli Chromosome", "year": "2002", "source": "Structure, vol. 10, no. 4, pp. 535-546", "authors": ["Hamdan S", "Carr P", "Brown S", "David L. Ollis"]}, {"title": "The structure of the PII-ATP complex", "year": "2001", "source": "European Journal of Biochemistry, vol. 268, no. 7, pp. 2028-2037", "authors": ["Xu Y", "Carr P", "Huber T", "David L. Ollis"]}, {"title": "Structure of the Complete Extracellular Domain of the Common beta Subunit of the Human GM-CSF, IL-3, and IL-5 Receptors Reveals a Novel Dimer Configuration", "year": "2001", "source": "Cell, vol. 104, pp. 291-300", "authors": ["Carr P", "Gustin S", "Church A", "David L. Ollis"]}, {"title": "Expression, crystallization and derivatization of the complete extracellular domain of the Î²c subunit of the human lL-5, lL-3 and GM-CSF receptors", "year": "2001", "source": "European Journal of Biochemistry, vol. 268, no. 10, pp. 2905-2911", "authors": ["Gustin SE  Church A", "Ford S", "David L. Ollis"]}, {"title": "Expression, purification and preliminary crystallographic studies of a hyperthermophilic esterase from Archaeoglobus fulgidus", "year": "2000", "source": "Acta Crystallographica Section D: Biological Crystallography, vol. D56, no. 7, pp. 900-901", "authors": ["Liu J", "Verger D", "Carr P", "David L. Ollis"]}, {"title": "Preliminary X-ray Crystallographic and NMR Studies on the Exonuclease Domain of the e Subunit of Escherichia coli DNA Polymerase III", "year": "2000", "source": "Journal of Structural Biology, vol. 131, no. 2, pp. 164-169", "authors": ["Hamdan S", "Brown S", "Thompson P", "David L. Ollis"]}, {"title": "The Escherichia coli signal transducers PII (GlnB) and GlnK form heterotrimers in vivo: Fine tuning the nitrogen signal cascade", "year": "2000", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 97, no. 8, pp. 3942-3947", "authors": ["Van Heeswijk W", "Wen D", "Clancy P", "David L. Ollis"]}, {"title": "Site-directed mutagenesis of dienelactone hydrolase produces dienelactone isomerase", "year": "2000", "source": "Chemical Communications, vol. 8, pp. 671-672", "authors": ["Walker I", "Easton C", "David L. Ollis"]}, {"title": "Structural basis for the light regulation of chloroplast NADP malate dehydrogenase", "year": "2000", "source": "Physiologia Plantarum, vol. 110, no. 3, pp. 314-321", "authors": ["Ashton A", "Trevanion S", "Carr P", "David L. Ollis"]}, {"title": "Structure of the C123S mutant of dienelactone hydrolase (DLH) bound with the PMS moiety of the protease inhibitor phenylmethylsulfonyl fluoride (PMSF)", "year": "2000", "source": "Acta Crystallographica Section D: Biological Crystallography, vol. 56, pp. 1376-1384", "authors": ["Robinson A", "Edwards K", "Carr P", "David L. Ollis"]}, {"title": "Crystallization of the N-terminal domain of the Escherichia coli regulatory protein TyrR", "year": "1999", "source": "Acta Crystallographica Section D: Biological Crystallography, vol. 55, pp. 1923?1924", "authors": ["MacPherson K", "Carr P", "Verger D", "David L. Ollis"]}, {"title": "Chloroplast NADP-malate dehydrogenase: structural basis of light-dependent regulation of activity by thiol oxidation and reduction", "year": "1999", "source": "Structure, vol. 7, pp. 461-475", "authors": ["Carr P", "Verger D", "Ashton A", "David L. Ollis"]}, {"title": "Of barn owls and bankers: A lush variety of a/b hydrolases", "year": "1999", "source": "Structure, vol. 7, pp. R141?R146", "authors": ["Heikinheimo P", "Goldman A", "Jeffries C", "David L. Ollis"]}, {"title": "Pyruvate formate lyase is structurally homologous to type I ribonucleotide reductase", "year": "1999", "source": "Structure, vol. 7, no. 7, pp. 733-744", "authors": ["Lappaenen V", "Merckel M", "David L. Ollis"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}