{"ANU": {"name": "David Tscharke", "link": "https://researchers.anu.edu.au/researchers/tscharke-dc", "colleges": "College of Health & Medicine", "email": "david.tscharke@anu.edu.au", "phone": "", "expertise": ["Virology", "Medical Virology", "Immunology", "Cellular Immunology", "Gene And Molecular Therapy", "Immunogenetics Incl. Genetic Immunology", "Medical Molecular Engineering Of Nucleic Acids And Proteins", "Infectious Diseases", "Applied Immunology Incl. Antibody Engineering Xenotransplantation And T Cell Therapies"], "interest": ["The overall theme of my research is to understand the interactions between virus infection and anti-viral immunityHerpes simplex virus (and herpesviruses in general), especially latencyAntigen presentation, especially to CD8+ T cellsVaccinia virus as a vaccine vectorVaccinia virus (and poxviruses in general)"], "biography": "David Tscharke began his research career at the University of Adelaide and IMVS in Adelaide, studying interactions between the immune system and herpes simplex virus (HSV, the cause of cold sores). After gaining his PhD he worked in postdoctoral positions at Oxford University and then Imperial College London in the UK, working on projects related to viral pathogenesis and vaccine design. Following this, he moved to the US National Institutes of Health (Bethesda, MD) where he focused on understanding how the immune system recognises viruses and vaccines. He then returned to Australia, working first at QIMR in Brisbane, before starting his own lab and taking on undergraduate teaching in the former department of Biochemistry and Molecular Biology at the ANU in 2006. Since then he has received a Young Tall Poppy Award and has held an NHMRC Career Development Award and ARC Future Fellowship. In 2016 he moved his laboratory across campus to the John Curtin School of Medical Research (JCSMR) and took up an NHMRC Senior Research Fellowship. Since mid-2017 he has been Head of the Department of Immunology and Infectious Diseases at JCSMR. Throughout his career he has had the benefit of working with excellent mentors, generous collaborators and brilliant students. His current research combines all the themes he has developed throughout his career, from understanding the dormant phase of infection with HSV to gaining new insight into the way our immune system recognises and responds to viruses and vaccines.", "project": ["Understanding the role of ongoing viral activity in herpes simplex virus latencyHerpes simplex viruses (HSV) type 1 and 2 are highly prevalent pathogens that cause substantial morbidity and occasional deaths. Recurrent ocular infections can lead to blindness and increasing genital HSV-1 infections and shedding during childbirth are a growing risk to neonates. These two important clinical situations highlight the importance of understanding HSV latency and the significance of any therapy that could inhibit the reactivation of the virus. Despite this importance, the mechanisms controlling the HSV latency remain poorly understood. In part this is due to an understanding of latent infection that emphasises the importance of the restriction of viral gene expression. Our finding that multiple HSV genes can be expressed during latency and that neurons are responding, suggests a new paradigm and hope for therapeutic interventions that boost the ability of the host to maintain latent infection. The way forward is to 1) further explore this new paradigm in our highly tractable mouse model, 2) to translate it to human neurons and then 3) identify and test host pathways that restrict HSV infection. This approach forms the aims of this proposal. Ultimately the pathways we identify might yield targets for future therapies that aim to keep HSV latency truly silent.", "Recognition of virus-infected cells by CD8+ T cellsHypothesis: A systematic approach to immunopeptidomes and their immunogenicity will provide insights for anti-viral immunity, vaccine design and mechanisms of autoimmunity.Viral infections constitute a significant health burden world-wide and a better understanding of anti-viral immunity is required to improve vaccines. The other side of effective immunity is autoimmunity, and there is a long history of association between infection and autoimmune diseases. In each case a clearer understanding of the interaction between pathogens and the immune system is needed. One of the most vital interfaces between host and virus is the display of virus peptides in the context of MHC I on infected cells and the response of CD8+ T cells. Despite this clear significance, our understanding of the full range of peptides that are presented (or immunopeptidomes) and how they shape the specificityof anti-viral CD8+ T cell responses remains highly fragmented. We are exploring these issues using vaccinia virus, arguably the most successful human vaccine and also a virus for which we have well characterised models in mice, enabling the quantitative study of immunopeptidomes and responding T cells. Using this model we are establishing and comparing detailed immunopeptidomes for vaccinia virus on cell lines, primary cells and cells from infected mice. Next we are determining what fraction of an immunopeptidome elicits CD8+ T cell responses. We are also investigating whether central tolerance mechanisms narrow the range of epitopes targeted by anti-viral immunity and whether immunodomination and competition amongst peptides for presentation reduces immunogenicity of some epitopes."], "publication": [{"title": "Bacillus cereus non-haemolytic enterotoxin activates the NLRP3 inflammasome", "year": "2020", "source": "Nature Communications, vol. 11, no. 760, pp. 1-16", "authors": ["Fox D", "Mathur A", "Xue Y", "David Tscharke"]}, {"title": "Tissue-resident memory T cells in tissue homeostasis, persistent infection, and cancer surveillance", "year": "2018", "source": "Immunological Reviews, vol. 283, no. 1, pp. 54-76pp", "authors": ["David Tscharke"]}, {"title": "Increasing antigen presentation on HSV-1-infected cells increases lesion size but does not alter neural infection or latency", "year": "2018", "source": "Journal of General Virology, vol. 99, no. 5, pp. 682-692", "authors": ["David Tscharke"]}, {"title": "Effective priming of herpes simplex virus specific CD8+ T cells in vivo does not require infected dendritic cells", "year": "2018", "source": "Journal of Virology, vol. 92, no. 3, pp. 1-13", "authors": ["Whitney P", "Makhlouf C", "MacLeod B", "David Tscharke"]}, {"title": "n ultrastructural investigation of tumors undergoing regression mediated by immunotherapy", "year": "2017", "source": "Oncotarget, vol. 8, no. 70, pp. 115215-115229pp", "authors": ["Westwood J", "Ellis S", "Danne J", "David Tscharke"]}, {"title": "Dual-specific chimeric antigen receptor T cells and an indirect vaccine eradicate a variety of large solid tumors in an immunocompetent, self-antigen setting", "year": "2017", "source": "Clinical Cancer Research, vol. 23, no. 10, pp. 2478-2490pp", "authors": ["Slaney C", "von Scheidt B", "Davenport A", "David Tscharke"]}, {"title": "Immunology by numbers: Quantitation of antigen presentation completes the quantitative milieu of systems immunology!", "year": "2016", "source": "Current Opinion in Immunology, vol. 40, pp. 88-95", "authors": ["Purcell A", "Croft N", "David Tscharke"]}, {"title": "Lytic Promoters Express Protein during Herpes Simplex Virus Latency", "year": "2016", "source": "PLoS Pathogens, vol. 12, no. 6, pp. e1005729-e1005729", "authors": ["Russell T", "David Tscharke"]}, {"title": "The Epstein-Barr Virus Glycoprotein gp150 Forms an Immune-Evasive Glycan Shield at the Surface of Infected Cells", "year": "2016", "source": "PLoS Pathogens, vol. 12, no. 4, pp. e1005550-e1005550", "authors": ["Gram A", "Oosenbrug T", "Lindenbergh M", "David Tscharke"]}, {"title": "The primary immune response to Vaccinia virus vaccination includes cells with a distinct cytotoxic effector CD4 T-cell phenotype", "year": "2016", "source": "Vaccine, vol. 34, no. 44, pp. 5251-5261", "authors": ["Munier M", "Van Bockel D", "Bailey M", "David Tscharke"]}, {"title": "Quantifying epitope presentation using mass spectrometry", "year": "2015", "source": "Molecular Immunology, vol. 68, no. 2, pp. 77-80", "authors": ["Croft N", "Purcell A", "David Tscharke"]}, {"title": "Redundancy complicates the definition of essential genes for vaccinia virus", "year": "2015", "source": "Journal of General Virology, vol. 96, no. 11, pp. 3326-3337", "authors": ["Dobson B", "David Tscharke"]}, {"title": "Engineering herpes simplex viruses by infection-transfection methods including recombination site targeting by CRISPR/Cas9 nucleases", "year": "2015", "source": "Journal of Virological Methods, vol. 213, pp. 18-25", "authors": ["Russell T", "Stefanovic T", "David Tscharke"]}, {"title": "Strikingly poor CD8+ T-cell immunogenicity of vaccinia virus strain MVA in BALB/c mice", "year": "2014", "source": "Immunology and Cell Biology, vol. 92, no. 5, pp. 466-469", "authors": ["David Tscharke"]}, {"title": "Truncation of gene F5L partially masks rescue of vaccinia virus strain MVA growth on mammalian cells by restricting plaque size", "year": "2014", "source": "Journal of General Virology, vol. 95, pp. 466-471", "authors": ["Dobson B", "David Tscharke"]}, {"title": "Systemic toll-like receptor ligation and selective killing of dendritic cell subsets fail to dissect priming pathways for anti-vaccinia virus CD8+ T cells", "year": "2013", "source": "Journal of Virology, vol. 87, no. 22, pp. 11978-11986", "authors": ["Wong Y", "Smith S", "David Tscharke"]}, {"title": "Immunodomination during Peripheral Vaccinia Virus Infection", "year": "2013", "source": "PLoS Pathogens, vol. 9, no. 4, pp. e100332", "authors": ["Lin C", "Flesch I", "David Tscharke"]}, {"title": "Evolutionary History and Attenuation of Myxoma Virus on Two Continents", "year": "2012", "source": "PLoS Pathogens, vol. 8, no. 10, p. e1002950", "authors": ["Kerr P", "Ghedin E", "DePasse J", "David Tscharke"]}, {"title": "Linear fidelity in quantification of anti-viral CD8+ T cells", "year": "2012", "source": "PLoS ONE, vol. 7, no. 6, p. e39533", "authors": ["Flesch I", "Wong Y", "David Tscharke"]}, {"title": "n intradermal model for vaccinia virus pathogenesis in mice", "year": "2012", "source": "in Stuart N. Isaacs (ed.), Vaccinia Virus and Poxvirology. Methods and Protocols, Humana Press, Springer New York, pp. 147-159", "authors": ["Lin C", "Smith S", "David Tscharke"]}, {"title": "Engineering recombinant poxviruses using a compact GFP-blasticidin resistance fusion gene for selection", "year": "2011", "source": "Journal of Virological Methods, vol. 171, no. 1, pp. 295-298", "authors": ["Wong Y", "Lin C", "Rezende Melo Da Silva C", "David Tscharke"]}, {"title": "ltered CD8+ T cell immunodominance after vaccinia virus infection and the naive repertoire in inbred and F1 mice", "year": "2010", "source": "Journal of Immunology, vol. 184, no. 1, pp. 45-55", "authors": ["Flesch I", "Woo W", "Wang Y", "David Tscharke"]}, {"title": "Uncovering the interplay between CD8, CD4 and antibody responses to complex pathogens", "year": "2010", "source": "Future Microbiology, vol. 5, no. 2, pp. 221-239", "authors": ["Moutaftsi M", "David Tscharke", "Vaughan K"]}, {"title": "nalysis of A47, an Immunoprevalent Protein of Vaccinia Virus, leads to a reevaluation of the total antiviral CD8+ T cell response", "year": "2010", "source": "Journal of Virology, vol. 84, no. 19, pp. 10220-10229", "authors": ["Yuen T", "Flesch I", "Noel N", "David Tscharke"]}, {"title": "Optimization of LMP-specific CTL expansion for potential adoptive immunotherapy in NPC patients", "year": "2009", "source": "Immunology and Cell Biology, vol. 87, pp. 481-488", "authors": ["Lutzky V", "Davis J", "Crooks P", "David Tscharke"]}, {"title": "Vaccinia Virus CD8+ T-Cell Dominance Hierarchies Cannot Be Altered by Prior Immunization with Individual Peptides", "year": "2009", "source": "Journal of Virology, vol. 83, no. 17, pp. 9008-9012", "authors": ["Wang Y", "Flesch I", "David Tscharke"]}, {"title": "Definition of epitopes and antigens recognized by vaccinia specific immune responses: Their conservation in variola virus sequences, and use as a model system to study complex pathogens", "year": "2009", "source": "Vaccine, vol. 27S, pp. G21-G26", "authors": ["Sette A", "Grey H", "Oseroff C", "David Tscharke"]}, {"title": "Kinetic analysis of a complete poxvirus transcriptome reveals an immediate-early class of genes", "year": "2008", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 105, no. 6, pp. 2140-2145", "authors": ["Assarsson E", "Greenbaum J", "Sundstrom M", "David Tscharke"]}, {"title": "Regulation of protein translation through mRNAstructure influences MHC class I loading andT cell recognition", "year": "2008", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 105, no. 27, pp. 9319-9324", "authors": ["Tellam J", "Smith C", "Rist M", "David Tscharke"]}, {"title": "Dissociation between epitope hierarchy and immunoprevalence in CD8 responses to vaccinia virus Western Reserve", "year": "2008", "source": "Journal of Immunology, vol. 180, no. 11, pp. 7193-7202", "authors": ["Oseroff C", "Peters B", "Pasquetto V", "David Tscharke"]}, {"title": "Terminal Deoxynucleotidyl Transferase Establishes and Broadens Antiviral CD8+ T Cell Immunodominance Hierarchies", "year": "2008", "source": "Journal of Immunology, vol. 181, pp. 649-659", "authors": ["Haeryfar S", "Hickman H", "Irvine K", "David Tscharke"]}, {"title": "Reduction of vector gene expression increases foreign antigen-specific CD8+ T-cell priming", "year": "2007", "source": "Journal of General Virology, vol. 88, pp. 2378-2386", "authors": ["Fischer M", "David Tscharke", "Donohue K"]}, {"title": "Use of CD107-based cell sorting ex vivo to enrich subdominant CD8+ T cells in culture", "year": "2007", "source": "Immunology and Cell Biology, vol. 85, pp. 546-550", "authors": ["Moor R", "Morrison L", "Moss D", "David Tscharke"]}, {"title": "Influence of translation efficiency of homologous viral proteins on the endogenous presentation of CD8+ T cell epitopes", "year": "2007", "source": "Journal of Experimental Medicine, vol. 204, no. 3, pp. 525-532", "authors": ["Tellam J", "Fogg M", "Rist M", "David Tscharke"]}, {"title": "daptive immunity to vaccinia virus: revisiting an old friend", "year": "2007", "source": "Future Virology, vol. 2, no. 2, pp. 163-172", "authors": ["David Tscharke"]}, {"title": "Deletion of gene A41L enhances vaccinia virus immunogenicity and vaccine efficacy", "year": "2006", "source": "Journal of General Virology, vol. 87, pp. 29-38", "authors": ["Clark R", "Kenyon J", "Bartlett N", "David Tscharke"]}, {"title": "consensus epitope prediction approach identifies the breadth of murine TCD8+-cell responses to vaccinia virus", "year": "2006", "source": "Nature Biotechnology, vol. 24, no. 7, pp. 817-19", "authors": ["Moutaftsi M", "Peters B", "Pasquetto V", "David Tscharke"]}, {"title": "Poxvirus CD8+ T-cell determinants and cross-reactivity in BALB/c mice", "year": "2006", "source": "Journal of Virology, vol. 80, pp. 6318-23", "authors": ["David Tscharke", "Woo W", "Sakala I"]}, {"title": "Regulatory T cells suppress CD8+ T cell responses induced by direct priming and cross-priming and moderate immunodominance disparities", "year": "2005", "source": "Journal of Immunology, vol. 174, no. 6, pp. 3344-51", "authors": ["Haeryfar S", "DiPaolo R", "David Tscharke"]}, {"title": "HLA-A*0201, HLA-A*1101, and HLA-B*0702 transgenic mice recognize numerous poxvirus determinants from a wide variety of viral gene products", "year": "2005", "source": "Journal of Immunology, vol. 175, no. 8, pp. 5504-15", "authors": ["Pasquetto V", "Bui H", "Giannino R", "David Tscharke"]}, {"title": "From mice to humans. Murine intelligence for human CD8+ T cell vaccine design", "year": "2005", "source": "Expert Opinion on Biological Therapy, vol. 5, no. 2, pp. 263-71", "authors": ["David Tscharke", "Suhrbier A"]}, {"title": "Identification of poxvirus CD8+ T cell determinants to enable rational design and characterization of smallpox vaccines", "year": "2005", "source": "Journal of Experimental Medicine, vol. 201, no. 1, pp. 95-104", "authors": ["David Tscharke", "Karupiah G", "Zhou J"]}, {"title": "HLA class I-restricted responses to vaccinia recognize a broad array of proteins mainly involved in virulence and viral gene regulation", "year": "2005", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 102, no. 39, pp. 13980-13985", "authors": ["Oseroff C", "Kos F", "Bui H", "David Tscharke"]}, {"title": "Immunodominance of poxviral-specific CTL in a human trial of recombinant-modified vaccinia Ankara", "year": "2005", "source": "Journal of Immunology, vol. 175, no. 10, pp. 8431-37", "authors": ["Smith C", "Mirza F", "Pasquetto V", "David Tscharke"]}, {"title": "CD8+ T Cell Cross-Priming via Transfer of Proteasome Substrates", "year": "2004", "source": "Science, vol. 304, pp. 1318-1321", "authors": ["Norbury C", "Basta S", "Donohue K", "David Tscharke"]}, {"title": "T cells bite the hand that feeds them (News and Views)", "year": "2003", "source": "Nature Medicine, vol. 9, pp. 647-48", "authors": ["David Tscharke", "Yewdell J"]}, {"title": "The vaccinia virus C12L protein inhibits mouse IL-18 and promotes virus virulence in the murine intranasal model", "year": "2002", "source": "Journal of General Virology, vol. 83, pp. 2833-2844", "authors": ["Symons J", "Adams E", "David Tscharke"]}, {"title": "Dermal infection with vaccinia virus reveals roles for virus proteins not seen using other inoculation routes", "year": "2002", "source": "Journal of General Virology, vol. 83, pp. 1977-86", "authors": ["David Tscharke", "Reading P", "Smith G"]}, {"title": "The vaccinia virus B9R protein is a 6 kDa intracellular protein that is non-essential for virus replication and virulence", "year": "2002", "source": "Journal of General Virology, vol. 83, pp. 873-878", "authors": ["Price N", "David Tscharke", "Smith G"]}, {"title": "study of the vaccinia virus interferon-y receptor and its contribution to virus virulence", "year": "2002", "source": "Journal of General Virology, vol. 83, pp. 1953-64", "authors": ["Symons J", "David Tscharke", "Price N"]}, {"title": "The vaccinia virus N1L protein is an intracellular homodimer that promotes virulence", "year": "2002", "source": "Journal of General Virology, vol. 83, pp. 1965-1976", "authors": ["Bartlett N", "Symons J", "David Tscharke"]}, {"title": "Notes on transient host range selection for engineering vaccinia virus strain MVA", "year": "2002", "source": "BioTechniques, vol. 33, pp. 186-8", "authors": ["David Tscharke", "Smith G"]}, {"title": "Inside the professionals (News and Views)", "year": "2002", "source": "BioTechniques, vol. 418, pp. 923-4", "authors": ["Yewdell J", "David Tscharke"]}, {"title": "Vaccinia virus semaphorin A39R is a 50-55 kDa secreted glycoprotein that affects the outcome of infection in a murine intradermal model", "year": "2001", "source": "Journal of General Virology, vol. 82, pp. 2083-2093", "authors": ["Gardner J", "David Tscharke", "Reading P"]}, {"title": "The vaccinia virus A41L protein is a soluble 30 kDa glycoprotein that affects virus virulence", "year": "2001", "source": "Journal of General Virology, vol. 82, pp. 2095-2105", "authors": ["Ng A", "David Tscharke", "Reading P"]}, {"title": "The vaccinia virus superoxide dismutase-like protein (A45R) is a virion component that is nonessential for virus replication", "year": "2001", "source": "Journal of Virology, vol. 75, pp. 7018-7029", "authors": ["Almazan F", "David Tscharke", "Smith G"]}]}, "Microsoft-Academic": [{"title": "immunisation when science isn t enough", "year": 2014, "source": "", "authors": [{"name": "upulie divisekera"}, {"name": "rachael dunlop"}, {"name": "david tscharke"}, {"name": "anne kelso"}]}], "ANDS-Grants": [{"description": "Herpes simplex virus (HSV) causes cold sores and genital herpes, diseases that persist and recur. This persistence is because HSV has several ways of stopping the body from detecting and eliminating the cells that it infects. This project will generate new tools that will help us to understand one of the ways that HSV hides from our defences and may be useful in developing immune-based therapies to treat the infection.", "title": "A humanised mouse model for herpes simplex virus pathogenesis", "id": "1345555", "key": "http://purl.org/au-research/grants/nhmrc/GNT1084342", "researchers": ["Prof David Tscharke"], "institutions": null, "status": "active", "fundingAmount": 268539, "fundingScheme": "Project Grants", "startDate": 2015, "endDate": null, "dateTimeModified": "2019-06-03T04:23:18Z", "dateTimeCreated": "2018-10-03T01:49:35Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1084342", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1084342", "GNT1084342"], "subjects": ["Basic Science", "herpes simplex virus (hsv) | latency | pathogenesis | host response | animal model"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1345555"}]}, {"description": "We know that many parts of viruses are displayed to the immune system, but at present the exact fragments are difficult to predict, we do not know all the genes in our bodies that control this process and we also need better methods to study the way some viruses (e.g. the cold sore virus) avoid detection. This project will study these problems with the overall goal of improving vaccine design, understanding immune deficiency and how viruses fight back against our immune system.", "title": "A proteome-wide approach to anti-viral immunity and vaccine development", "id": "1346351", "key": "http://purl.org/au-research/grants/nhmrc/GNT1104329", "researchers": ["Prof David Tscharke"], "institutions": null, "status": "active", "fundingAmount": 622655, "fundingScheme": "Research Fellowships", "startDate": 2016, "endDate": null, "dateTimeModified": "2019-06-03T04:23:24Z", "dateTimeCreated": "2018-10-03T01:49:44Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1104329", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1104329", "GNT1104329"], "subjects": ["Basic Science", "viral immunology | herpes simplex virus (hsv) | antigen presentation | vaccine biology | immunogenetics"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1346351"}]}, {"title": "Defining the T cell epitopes of vaccinia and ectromelia viruses: exploring immunodominance in recombinant vaccines and r", "id": "113312", "institutions": ["Queensland Institute of Medical Research"], "key": "http://purl.org/au-research/grants/nhmrc/224273", "researchers": ["Prof David Tscharke"], "description": null, "status": "closed", "fundingAmount": 201251.66, "fundingScheme": "Early Career Fellowships", "startDate": 2003, "endDate": 2005, "dateTimeModified": "2017-07-10T03:55:54Z", "dateTimeCreated": "2013-05-15T07:25:35Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Queensland Institute of Medical Research"], "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/224273", "identifiers": ["http://purl.org/au-research/grants/nhmrc/224273", "224273"], "subjects": ["320299", "Epitope mapping", "Immunodominance", "Poxviruses", "Recombinant vaccines"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/113312"}]}, {"description": "When confronted with an invading microbe, the human immune system does not recognise its overall shape. Instead, the microbe is chopped up into tiny fragments, called peptides, and these can be recognised by special cells of the immune system called T cells which orchestrate a response. We have a good understanding of this chopping process and can predict many of these peptides, but this is only part of the story. Not all peptides will be recognized by a T cell. Further, through processes we do not understand well, T cells that recognize only a few out of the many peptides will dominate an entire immune response. As a result, immune responses are focused in such a way that they recognize only a tiny portion of an invading microbe. Focusing of immune responses also occurs during immunization with vaccines. Some new, genetically engineered vaccines use a harmless microbe to carry small parts of more dangerous pathogens. The parts chosen will not cause any disease by themselves, so the whole vaccine is safe. Vaccines built in this way are in clinical trials for diseases such as AIDS and malaria, but do not work as well as was hoped. These new vaccines are largely made up of the carrier and the parts of the microbe we wish to immunize against (e.g. a part of the AIDS virus) will be only a small fraction of the whole vaccine. Ideally we would like the immune system to focus on this small part of our choosing, but the few studies done suggest that this is not the case. In this project we will study vaccines that use a carrier called vaccinia virus. We will test to what extent immune responses are focused inappropriately. We will then genetically alter the virus and use new immunisation strategies to try and shift the focus of the immune response so that it targets the right parts of the vaccine. The ultimate aim is to improve vaccines, but in the process we may learn more about how the immune system chooses its targets.", "title": "Immunodominance in vaccinia virus and recombinant vaccinia vaccines", "id": "95480", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/389819", "researchers": ["Prof David Tscharke"], "status": "closed", "fundingAmount": 388455.12, "fundingScheme": "NHMRC Project Grants", "startDate": 2006, "endDate": 2008, "dateTimeModified": "2015-04-12T07:52:22Z", "dateTimeCreated": "2013-05-15T05:56:49Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/389819", "identifiers": ["http://purl.org/au-research/grants/nhmrc/389819", "389819"], "subjects": ["IMMUNOLOGY", "MEDICAL AND HEALTH SCIENCES", "immunodominance", "poxvirus", "vaccine development", "viral immunity", "T cell immunity", "development of immunological memory", "vaccination immunology", "vaccine vectors"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/95480"}]}, {"description": "Herpes simplex virus (HSV) causes cold sores and genital herpes, diseases that persist and recur. This persistence is because HSV has several ways of stopping the body from detecting and eliminating the cells that it infects. This project will generate new tools that will help us to understand one of the ways that HSV hides from our defences and may be useful in developing immune-based therapies to treat the infection.", "title": "A humanised mouse model for herpes simplex virus pathogenesis", "id": "518997", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1084342", "researchers": ["Prof David Tscharke"], "status": "active", "fundingAmount": 277109.94, "fundingScheme": "Project Grants", "startDate": 2015, "endDate": 2018, "dateTimeModified": "2018-03-07T07:53:00Z", "dateTimeCreated": "2015-04-12T08:18:15Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/1084342", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1084342", "1084342"], "subjects": ["Medical Virology", "MEDICAL AND HEALTH SCIENCES", "MEDICAL MICROBIOLOGY", "Herpes simplex virus (HSV)", "latency", "pathogenesis", "host response", "animal model"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518997"}]}, {"description": "We know that many parts of viruses are displayed to the immune system, but at present the exact fragments are difficult to predict, we do not know all the genes in our bodies that control this process and we also need better methods to study the way some viruses (e.g. the cold sore virus) avoid detection. This project will study these problems with the overall goal of improving vaccine design, understanding immune deficiency and how viruses fight back against our immune system.", "title": "A proteome-wide approach to anti-viral immunity and vaccine development", "id": "662743", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1104329", "researchers": ["Prof David Tscharke"], "status": "active", "fundingAmount": 643821.25, "fundingScheme": "Research Fellowships", "startDate": 2016, "endDate": 2020, "dateTimeModified": "2018-03-07T07:53:12Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/1104329", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1104329", "1104329"], "subjects": ["Immunology not elsewhere classified", "MEDICAL AND HEALTH SCIENCES", "IMMUNOLOGY", "viral immunology", "Herpes simplex virus (HSV)", "antigen presentation", "vaccine biology", "immunogenetics"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/662743"}]}, {"title": "CD8+ T cell immunity to viruses and recombinant vaccines", "id": "114880", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/418108", "researchers": ["Prof David Tscharke"], "description": null, "status": "closed", "fundingAmount": 471058.72, "fundingScheme": "Career Development Fellowships", "startDate": 2007, "endDate": 2011, "dateTimeModified": "2015-04-12T07:53:39Z", "dateTimeCreated": "2013-05-15T07:28:31Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof David Tscharke"], "purl": "http://purl.org/au-research/grants/nhmrc/418108", "identifiers": ["http://purl.org/au-research/grants/nhmrc/418108", "418108"], "subjects": ["Cellular Immunology", "MEDICAL AND HEALTH SCIENCES", "IMMUNOLOGY", "T cells", "Vaccinia virus", "infections"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/114880"}]}]}