{"ANU": {"name": "Deborah Argue", "link": "https://researchers.anu.edu.au/researchers/argue-dd", "colleges": "College of Arts and Social Sciences", "email": "debbie.argue@anu.edu.au", "phone": "", "expertise": ["Archaeological Science", "Biological Physical Anthropology"], "interest": ["Homo floresiensis; human evolution in Africa, Asia and Europe; palaeoanthropology."], "biography": "Debbie is an ARC Postdoctoral Fellow who is researching Homo floresiensis, and, in particular, is seeking to identify the ancestors of this new species of Homo and to discover its place in the human evolutionary tree. Her team comprises Professor Colin Groves (ANU) and Professor William Jungers (Stonybrook, New York). Her PhD focused on human evolution in Africa and Europe in the Early Pleistocene; her MA focused on human evolution in the Middle Pleistocene. Previously Debbie was an archaeologist specialized in Australian prehistory, particularly of the Australian Alps. Prior to undertaking her PhD, she was a Heritage Officer in local government, engaged in the identification and conservation of Aboriginal and historic heritage in the ACT.", "project": [], "publication": [{"title": "The Homo floresiensis Puzzle", "year": "2011", "source": "pp. 18-21", "authors": ["Deborah Argue"]}, {"title": "Reply to Trueman", "year": "2010", "source": "s \"A new cladistic analysis of Homo floresiensis.\"'Journal of Human Evolution, vol. 59, no. 2, pp. 227-230", "authors": ["Deborah Argue", "Morwood M", "Sutikna T"]}, {"title": "Homo floresiensis: A cladistic analysis", "year": "2009", "source": "Journal of Human Evolution, vol. 57, no. 5, pp. 623-639", "authors": ["Deborah Argue", "Morwood M", "Sutikna T"]}, {"title": "Homo floresiensis: What is it? Where Does It fit in the Human Story?", "year": "2007", "source": "in Indriati, E (ed.), Recent Advances on Southeast Asian Palaeoanthropolgy and Archaeology: Proceedings International Seminar on Southeast Asian Palaeoanthropolgy, Gadjah Mada University, Indonesia, pp. 47-53", "authors": ["Deborah Argue", "Moorwood M", "Sutikna T"]}, {"title": "Homo floresiensis: Microcephalic, pygmoid, Australopithecus, or Homo?", "year": "2006", "source": "Journal of Human Evolution, vol. 51, pp. 360-374", "authors": ["Deborah Argue", "Donlon D", "Groves C"]}, {"title": "morphometric analysis of Homo floriensis", "year": "2005", "source": "Homo: Journal of comparative human biology, vol. 56, p. 265", "authors": ["Deborah Argue"]}, {"title": "The Muddle in the middle", "year": "2005", "source": "Homo: Journal of comparative human biology, vol. 56, pp. 265-6", "authors": ["Deborah Argue"]}]}, "Microsoft-Academic": [{"title": "comments response forth g 2012 are legendary hominoids worth looking for views from ethnobiology and paleoanthropology", "year": 2012, "source": "", "authors": [{"name": "deborah argue"}]}], "ANDS-Grants": []}