{"ANU": {"name": "Denise Angelo", "link": "https://researchers.anu.edu.au/researchers/angelo-d", "colleges": "College of Arts and Social Sciences", "email": "denise.angelo@anu.edu.au", "phone": "0423 434 101", "expertise": [], "interest": ["I have a longterm research interest in describing \"shifting langscapes\" at a local level, and have worked in Kriol-speaking communities in the Katherine region of the Northern Territory, as well as many sites throughout Queensland and the Torres Strait with contact language ecologies. My research focuses on changing broad and underdifferentiated narratives about language contact into localised, community-generated descriptions. As such I have initiated a number of community-based investigations into local contact language ecologies in Queensland which have resulted in visual representations of the local vernacular (e.g. At da Crick, a poster in Yarrie Lingo). This work includes detailed linguistic description of local contact languages. Other aspects to this research include detailed historical research to reveal specific factors which have led to distinctive features in local varieties, as well as the documentation of changes afoot in intergenerational and current communication technology usages.An associated line of translational research involves the place of speakers of contact languages educational and other policy responses for students and communities. The local constellation of languages, the local language ecology, is of  particular interest here, as it represents a mechanism for understanding  Aboriginal and Torres Strait islander people's uses and experiences of  languages in daily life and mismatches between service provisions and  individuals' language repertoires. For example, Aboriginal and Torres Strait Islander school students speaking English-lexified contact language varieties undertake their schooling through English-medium instruction in \"mainstream curriculum\". I am interested in how these learners' second language acquisition trajectories differ from those with first languages which are clearly separated from the target, including the invisibility of their language backgrounds, their multilingualism and additional language learning pathways in school curriculum, effective pedagogy and assessment validity. I collaborate with Dr Catherine Hudson in this education research."], "biography": "", "project": [], "publication": [{"title": "Teacher Views on the Implementation of English Language Proficiency Scales for Young Indigenous Learners of Standard English", "year": "2020", "source": "Language Assessment Quarterly, vol. -, no. -, pp. 1-28", "authors": ["Hudson C", "Denise Angelo"]}, {"title": "Translanguaging the Curriculum: A Critical Language Awareness Curriculum for silenced Indigenous voices", "year": "2020", "source": "in P Mickan and I Wallace (ed.), The Routledge Handbook of Language Education Curriculum Design, Routledge Taylor and Francis Group, United States, pp. 144-174", "authors": ["Carter N", "Denise Angelo", "Hudson C", ""]}, {"title": "", "year": "2020", "source": "Language use is connected to indicators of wellbeing: Evidence from the National Aboriginal and Torres Strait Islander Social Survey 2014-15", "authors": ["Dinku Y", "Markham F", "Venn D", "Denise Angelo"]}, {"title": "", "year": "2019", "source": "Well-being & Indigenous Language Ecologies (WILE): A strengths-based approach", "authors": ["Denise Angelo", "O'Shannessy C", "Simpson J"]}, {"title": "Learning and teaching Gumbaynggirr through story: Behind the scenes of professional learning workshops for teachers of an Aboriginal language", "year": "2019", "source": "Language Documentation and Conservation, vol. 13, pp. 231-252", "authors": ["Poetsch S", "Jarrett M", "Denise Angelo"]}, {"title": "From the ground up: How Aboriginal languages teachers design school-based programs in their local language ecology, with Carmel Ryan, Marmingee Hand, Nathan Schrieber and Michael Jarrett", "year": "2019", "source": "Babel, vol. 54, no. 1&2, pp. 11-20", "authors": ["Denise Angelo", "Poetsch S"]}, {"title": "The art of recognition: Visualising contact languages with community vernacular language posters", "year": "2019", "source": "Babel, vol. 54, no. 1&2, pp. 34-40", "authors": ["Denise Angelo", "Fraser H", "Yeatman B"]}, {"title": "Dangerous Conversations: Teacher-Student Interactions with Unidentified English Language Learners", "year": "2018", "source": "in G Wigglesworth, J Simpson, J Vaughan (ed.), Language Practices of Indigenous Children and Youth: The Transition from Home to School, Palgrave Macmillan, United Kingdom, pp. 207-235", "authors": ["Denise Angelo", "Hudson C"]}, {"title": "Beware bambai-lest it be apprehensive", "year": "2016", "source": "in Felicity Meakins and Carmel O'Shannessy (ed.), Loss and Renewal: Australian Languages Since Colonisation, De Gruyter Mouton, Boston/Berlin, pp. 255-296", "authors": ["Denise Angelo", "Schultze-Berndt E"]}, {"title": "Same but different: Understanding language contact in Queensland Indigenous settlements", "year": "2016", "source": "in Jean-Christophe Verstraete and Diane Hafner (ed.), Land and Language in Cape York Peninsula and the Gulf Country, John Benjamins Publishing Company, Amsterdam and Philadelphia, pp. 383-407", "authors": ["Mushin I", "Denise Angelo", "Munro J"]}, {"title": "Schooling within shifting langscapes: Educational responses in complex Indigenous language contact ecologies", "year": "2015", "source": "in Androula Yiakoumetti (ed.), Multilingualism and Language in Education: Sociolinguistic and Pedagogical Perspectives from Commonwealth Countries, Cambridge University Press, Cambridge United Kingdom, pp. 119-140", "authors": ["Denise Angelo", "Carter N"]}, {"title": "Dodgy data, language invisibility and the implications for social inclusion: A critical analysis of indigenous student language data in Queensland Schools", "year": "2014", "source": "Australian Review of Applied Linguistics (print edition), vol. 37, no. 3, pp. 213-233", "authors": ["Dixon S", "Denise Angelo"]}, {"title": "Concepts underpinning innovations to second language proficiency scales inclusive of Aboriginal and Torres Strait Islander learners: a dynamic process in progress", "year": "2014", "source": "Papers in Language Testing and Assessment, vol. 3, no. 1, pp. 44-85", "authors": ["Hudson C", "Denise Angelo"]}, {"title": "nomalous data about Aboriginal and Torres Strait Islander Language Ecologies", "year": "2014", "source": "in Elke Stracke (ed.), Intersections: Applied Linguistics as a Meeting Place, Cambridge Scholars Publishing, Newcastle upon Tyne, pp. 270-293pp.", "authors": ["Denise Angelo", "McIntosh S"]}, {"title": "nomalous data about Aboriginal and Torres Strait Islander language ecologies in Queensland", "year": "2014", "source": "Stracke, E., (Ed) Intersections: Applied linguistics as a meeting place. Cambridge Scholars Publishin", "authors": ["Denise Angelo", "McIntosh S"]}, {"title": "NAPLAN implementation: Implications for classroom learning and teaching, with recommendations for improvement", "year": "2013", "source": "TESOL in Context, vol. 23, no. 1&2, pp. 53-73", "authors": ["Denise Angelo"]}, {"title": "Identification and assessment contexts of Aboriginal and Torres Strait Islander learners of Standard Australian English: Challenges for the language testing community", "year": "2013", "source": "Papers in Language Testing & Assessment, Vol. 2, Issue 2, 67-102.", "authors": ["Denise Angelo"]}, {"title": "Everywhere and nowhere: Invisibility of Aboriginal and Torres Strait Islander contact languages in education and indigenous language contexts", "year": "2013", "source": "Australian Review of Applied Linguistics (print edition), vol. 36, no. 3, pp. 250-266", "authors": ["Sellwood J", "Denise Angelo"]}]}, "Microsoft-Academic": [{"title": "everywhere and nowhere invisibility of aboriginal and torres strait islander contact languages in education and indigenous language contexts", "year": 2013, "source": "australian review of applied linguistics", "authors": [{"name": "juanita sellwood", "affiliation": "james cook university"}, {"name": "denise angelo"}], "id": 193796672}, {"title": "naplan implementation implications for classroom learning and teaching with recommendations for improvement", "year": 2013, "source": "tesol in context", "authors": [{"name": "denise angelo"}], "id": 2764423261}, {"title": "the in visibility of language within australian educational documentation differentiating language from literacy and exploring particular ramifications for a group of hidden esl d learners", "year": 2012, "source": "", "authors": [{"name": "sophie mcintosh"}, {"name": "renae ohanlon"}, {"name": "denise angelo"}]}, {"title": "translating translanguaging into our classrooms possibilities and challenges", "year": 2021, "source": "language teaching research", "authors": [{"name": "rhonda oliver", "affiliation": "curtin university"}, {"name": "gillian wigglesworth", "affiliation": "university of melbourne"}, {"name": "denise angelo", "affiliation": "australian national university"}, {"name": "carly steele", "affiliation": "university of melbourne"}], "id": 179605291}, {"title": "dodgy data language invisibility and the implications for social inclusion a critical analysis of indigenous student language data in queensland schools", "year": 2014, "source": "australian review of applied linguistics", "authors": [{"name": "sally dixon", "affiliation": "australian national university"}, {"name": "denise angelo", "affiliation": "australian national university"}], "id": 193796672}, {"title": "steps for encouraging early independent writing a language perspective on whole class literacy learning inclusive of eal d learners", "year": 2013, "source": "practically primary", "authors": [{"name": "denise angelo"}], "id": 2764871935}, {"title": "beware bambai lest it be apprehensive", "year": 2016, "source": "", "authors": [{"name": "denise angelo", "affiliation": "australian national university"}, {"name": "eva schultzeberndt"}]}, {"title": "concepts underpinning innovations to second language proficiency scales inclusive of aboriginal and torres strait islander learners a dynamic process in progress", "year": 2014, "source": "", "authors": [{"name": "catherine hudson", "affiliation": "australian national university"}, {"name": "denise angelo", "affiliation": "australian national university"}]}, {"title": "teacher views on the implementation of english language proficiency scales for young indigenous learners of standard english", "year": 2020, "source": "language assessment quarterly", "authors": [{"name": "catherine hudson", "affiliation": "australian national university"}, {"name": "denise angelo", "affiliation": "australian national university"}], "id": 198862774}, {"title": "dangerous conversations teacher student interactions with unidentified english language learners", "year": 2018, "source": "", "authors": [{"name": "denise angelo", "affiliation": "australian national university"}, {"name": "catherine hudson", "affiliation": "australian national university"}]}], "ANDS-Grants": []}