{"ANU": {"name": "Diana James", "link": "https://researchers.anu.edu.au/researchers/james-dm", "colleges": "College of Arts and Social Sciences", "email": "diana.james@anu.edu.au", "phone": "02 61250338", "expertise": ["Aboriginal And Torres Strait Islander Cultural Studies", "Comparative And Cross Cultural Education", "Tourism", "Performing Arts And Creative Writing", "Visual Arts And Crafts"], "interest": ["Indigenous cultural and ecological knowledge.Visual anthropology.Performance and visual arts.Western Desert language, oral song cycles, storytelling and music.Cross-cultural translation of philosophy, metaphors and meaning."], "biography": "Currently she is working on activating the archive of the Western Desert  Songlines research project. Working with Indigenous co-researchers in  the massive archive of  film, photography, aural and written data. Diana is also completing the biography of Nganyinytja, a Pitjantjatjara woman, who lived from the  late  1920s to 2007; a charismatic teacher, philosopher and political  leader in the  Anangu Pitjantjatjara Yankunytjatjara Land Rights struggle and the  development of the NPY Women’s Council. Diana is also woring with Indigenous researcher Inawinytji Williamson on the SEven Sisters Songline of her people on the APY Lands of South Australia.", "project": ["Current research projects:", "Activating the Archive of the Western Desert Songlines research project. Working with Indigenous co-researchers in the massive archive of  film, photography, aural and written data available for the next generations in their communities. Supporting CARCLEW recording of Tjitjiku Tjukurpa in South Australia and making the archives accessible to communities through Ara Irititja.", "National Centre for Aboriginal Language and Music Studies,CASM: Dr Diana James is working with Indigenous scholar Inawinytji Williamson at the University of Adelaide on the Seven Sisters Songline of her people on the APY Lands of South  Australia.", "Nganyinytja Biography of a Thought Leader: Writing the biography of a Pitjantjatjara woman Nganyinytja, from the  late 1920s to 2007; a charismatic teacher, philosopher and political  leader in the rehabilitation of young petrol sniffers, leading women in the Anangu Pitjantjatjara Yankunytjatjara Land Rights struggle and the development of the NPY Women’s Council. She was also a reconciliation leader welcoming visitors to her homeland to learn about Indigenous connection to country, she opened her country and her heart to the world.", "2012-2018 Alive with the Dreaming! Songlines of the Western Desert ARC Linkage - Dr Diana James ANU was the co-ordinator and Senior Research Associate on this major  collaborative research project with Martu, Ngaanyatjarra, Pitjantjatjara and Yankunytjatjara people.", "Major public outputs of this research included:", "Songlines: Tracking the Seven Sisters exhibition at the National Museum of Australia, September 2017 – February 2018. Public outcome of the Alive with the Dreaming! Songlines of the Western Desert ARC Project. Senior Research Associate and Co-ordinator, Dr Diana James 2010- 2017.", "Research significance", "Sharing Australia's Indigenous heritage with the wider public by interpreting and communicating the importance of Songlines as repositories of Indigenous heritage knowledge of places, ancestors, ecological and cultural landscapes across the continent of Australia.", "Evidence of excellence", "This exhibition is acclaimed nationally for the excellence of communication of research material into the significance of Indigenous Songlines to the national cultural heritage of Australia.", "Ngintaka Exhibition, South Australian Museum, 29 March – 22June 2014. This cexhibition was co-curated with the Indigenous custodians of the APY Ngintaka Songline who with the ANU and a multidisciplinary research team recorded the Anangu Pitjantjatjara Yankunytjatjara oral, dance and song tradition of the Ngintaka (Perentie Lizard) Songline across APY Lands of South Australia.", "Kungkarangkalpa: Seven Sisters Songline 2013 performance at the National Museum of Australia in March 2013. Kungkarangkalpa was a unique performance of an ancient Songline by traditional APY Lands dancers and singers with nationally acclaimed indigenous artistic direct Wesley Enoch. It was celebrated nationally and internationally by viewers of the live broadcast. The film was shown during NAIDOC Week 2016 as a strong and powerful presentation Aboriginal cultural tradition.", "Kuru Ala: Kungkarangkalpa Seven Sisters Songline, 2015, Director/ researcher/translator: Dr Diana James and Cinematographer: Caro Macdonald", "2017 November - Published on the website http://sevensisterssongline.com", "", "Waters of the Songline,2016,  Director/ Producer/ Researcher: Dr Diana James and Filmmaker /Cinematographer/Editor: Caro Macdonald", "2017 November - Published on the website  http://sevensisterssongline.com", "", "", "", "", "", ""], "publication": [{"title": "Indigenous heritage at Australia", "year": "2016", "source": "s northern and western pastoral frontiers'Historic Environment, vol. 28, no. 1, pp. 70-84", "authors": ["Blair S", "Diana James"]}, {"title": "Tjukurpa Time", "year": "2015", "source": "in Ann McGrath and Mary Anne Jebb (ed.), Long History, Deep Time: Deepening Histories of Place, ANU Press, Canberra, Australian Capital Territory, pp. 33-46", "authors": ["Diana James"]}, {"title": "Ngintaka", "year": "2014", "source": "Wakefield PressKent Town, South Australia", "authors": ["Diana James", "Tregenza E", "eds"]}, {"title": "Inma Ngintaka: song and story of the perentie lizard man", "year": "2014", "source": "in Diana James, Elizabeth Tregenza (ed.), Ngintaka, Wakefield Press, Kent Town, South Australia, pp. 26-77", "authors": ["Diana James", "Williamson I"]}, {"title": "Ngintaka Ngura Walytja: Nganyinytja", "year": "2014", "source": "s Country of Her Spirit'in Diana James, Elizabeth Tregenza (ed.), Ngintaka, Wakefield Press, Kent Town, South Australia, pp. 14-23", "authors": ["Diana James"]}, {"title": "Ngintaka", "year": "2014", "source": "Wakefield PressAdelaide", "authors": ["Diana James", "Tregenza J (eds)"]}, {"title": "Signposted by song: cultural routes of the Australian desert", "year": "2013", "source": "Historic Environment, vol. 25, no. 3, pp. 30-42", "authors": ["Diana James"]}, {"title": "Inside: Life in children", "year": "2013", "source": "s homes and institutions'reCollections: Journal of the National Museum of Australia, vol. 8, no. 1", "authors": ["Diana James"]}, {"title": "DVD) Kungkarangkalpa: Seven Sisters Songline: traditional Pitjantjatjara Yankunytjatjara Inma", "year": "2013", "source": "dancesong and story performance at National Museum of Australia 1st and 2nd March 2013", "authors": ["Diana James"]}, {"title": "", "year": "2011", "source": "(DVD) Living In The Desert: Welcome to Putijarra country", "authors": ["Diana James", "Macdonald C"]}, {"title": "Colour comes up from the ground", "year": "2010", "source": "in Matt Ward & Jim Bell (ed.), Tjukurpa - Law, Outstation, Australia, pp. 1-2", "authors": ["Diana James"]}, {"title": "Kaltjiti Arts and Crafts", "year": "2010", "source": "in Elizabeth Tregenza (ed.), Tjukurpa Pulkatjara: The Power of the Law, Wakefield Press, Australia, pp. 76-80", "authors": ["Diana James"]}, {"title": "The Indigenous Heritage of Australia Pastoral Frontier: Identifying and Managing the Social Values of Stock Routes and Remote Stations", "year": "2010", "source": "Outback & Beyond: The Future of Historic Towns, Industrial Heritage and Pastoralism, Australia ICOMOS, DVD", "authors": ["Blair S", "Diana James"]}, {"title": "Painting the Song: Kaltjiti artists of the Sand Dune Country", "year": "2009", "source": "McCulloch & McCullochMelbourne Australia", "authors": ["Diana James"]}]}, "Microsoft-Academic": [{"title": "clinical ladder nurses perceptions and satisfiers", "year": 2009, "source": "journal of nursing administration", "authors": [{"name": "joann k riley"}, {"name": "debbie h rolband"}, {"name": "diana james"}, {"name": "h james norton"}], "id": 194945867}, {"title": "problematic use of mobile phones measuring the behaviour its motivational mechanism and negative consequences", "year": 2012, "source": "", "authors": [{"name": "diana james"}]}, {"title": "exploring addictive consumption of mobile phone technology", "year": 2005, "source": "", "authors": [{"name": "diana james"}, {"name": "judy drennan"}]}, {"title": "there s a nasty smell in the kitchen gender and power in the tourism workplace in wales", "year": 2005, "source": "tourism culture & communication", "authors": [{"name": "alan white"}, {"name": "eleri jones"}, {"name": "diana james"}], "id": 39854068}, {"title": "signposted by song cultural routes of the australian desert", "year": 2013, "source": "the historic environment", "authors": [{"name": "diana james"}], "id": 2764646822}, {"title": "painting the song kaltjiti artists of the sand dune country", "year": 2009, "source": "", "authors": [{"name": "diana james"}]}, {"title": "indigenous heritage at australia s northern and western pastoral frontiers", "year": 2016, "source": "the historic environment", "authors": [{"name": "sandy blair"}, {"name": "diana james"}], "id": 2764646822}, {"title": "toward an ethics of decolonizing allyship in climate organizing reflections on extinction rebellion vancouver", "year": 2020, "source": "journal of human rights and the environment", "authors": [{"name": "diana james"}, {"name": "trevor mack"}], "id": 147783800}, {"title": "enriching the experience a story audit tool", "year": 2010, "source": "", "authors": [{"name": "diana james"}, {"name": "joc schmiechen"}]}, {"title": "a case study of the effects of the use of paget gorman signed speech in supporting communication of four pupils with specific language impairment at a special school", "year": 2010, "source": "", "authors": [{"name": "diana james"}]}], "ANDS-Grants": []}