{"ANU": {"name": "Dimity Crisp", "link": "https://researchers.anu.edu.au/researchers/crisp-da", "colleges": "College of Health & Medicine", "email": "dimity.crisp@anu.edu.au", "phone": "", "expertise": ["Mental Health"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Can positive social exchanges buffer the detrimental effects of negative social exchanges? Age and gender differences", "year": "2013", "source": "Gerontology, vol. 59, no. 1, pp. 40-52", "authors": ["Dimity Crisp", "Fiori K", "Windsor T"]}, {"title": "What are older adults seeking? Factors encouraging or discouraging Retirement Village living", "year": "2013", "source": "Australasian Journal on Ageing, vol. 32, no. 3, pp. 163-170", "authors": ["Dimity Crisp", "Windsor T", "Anstey K"]}, {"title": "Normative data and longitudinal invariance of the Life Engagement Test (LET) in a community sample of older adults", "year": "2013", "source": "Quality of Life Research, vol. 22, no. 2, pp. 327-331", "authors": ["Pearson E", "Windsor T", "Dimity Crisp"]}, {"title": "Considering relocation to a retirement village: Predictors from a community sample", "year": "2013", "source": "Australasian Journal on Ageing, vol. 32, no. 2, pp. 97-102", "authors": ["Dimity Crisp", "Windsor T", "Anstey K"]}, {"title": "Unmet depression information needs in the community", "year": "2013", "source": "Journal of Affective Disorders, vol. 146, no. 3, pp. 348-354", "authors": ["Griffiths K", "Dimity Crisp"]}, {"title": "The Effectiveness of an Online Support Group for Members of the Community with Depression: A Randomised Controlled Trial", "year": "2012", "source": "PLOS ONE (Public Library of Science), vol. 7, no. 12, pp. 1-9", "authors": ["Griffiths K", "Mackinnon A", "Dimity Crisp"]}, {"title": "Personal and neighborhood resources, future time perspective, and social relations in middle and older adulthood", "year": "2012", "source": "Journals of Gerontology Series B: Psychological Sciences and Social Sciences, vol. 67, no. 4, pp. 423-431", "authors": ["Windsor T", "Fiori K", "Dimity Crisp"]}, {"title": "Volunteering and subjective well-being in midlife and older adults: The role of supportive social networks", "year": "2012", "source": "Journals of Gerontology Series B: Psychological Sciences and Social Sciences, vol. 67, no. 2, pp. 249-260", "authors": ["Pilkington P", "Windsor T", "Dimity Crisp"]}, {"title": "Oral folic acid and vitamin B-12 supplementation to prevent cognitive decline in community-dwelling older adults with depressive symptoms-the Beyond Ageing Project: a randomized controlled trial", "year": "2012", "source": "American Journal of Clinical Nutrition, vol. 95, no. 1, pp. 194-203", "authors": ["Walker J", "Batterham P", "Mackinnon A", "Dimity Crisp"]}, {"title": "Does stigma predict a belief in dealing with depression alone?", "year": "2011", "source": "Journal of Affective Disorders, vol. 132, no. 3, pp. 413-417", "authors": ["Griffiths K", "Dimity Crisp", "Jorm A"]}, {"title": "Seeking help for depression from family and friends: A qualitative analysis of perceived advantages and disadvantages", "year": "2011", "source": "BMC Psychiatry, vol. 11, pp. 196-196", "authors": ["Griffiths K", "Dimity Crisp", "Barney L"]}, {"title": "The ANU WellBeing study: a protocol for a quasi-factorial randomised controlled trial of the effectiveness of an Internet support group and an automated Internet intervention for depression", "year": "2010", "source": "BMC Psychiatry, vol. 10, no. 20, p. 11", "authors": ["Griffiths K", "Dimity Crisp", "Christensen H"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}