{"ANU": {"name": "Ed (Edward) Wensing", "link": "https://researchers.anu.edu.au/researchers/wensing-eg", "colleges": "College of Arts and Social Sciences", "email": "edward.wensing@anu.edu.au", "phone": "041 930 2887", "expertise": ["Urban And Regional Planning", "Community Planning", "Regional Analysis And Development", "Urban And Regional Planning Not Elsewhere Classified", "Aboriginal And Torres Strait Islander Policy", "Public Policy"], "interest": ["Ed's current research interests include:native title rights and interests, statutory land rights regimes and conventional land tenure systems;land use planning and the accommodation of Aboriginal and Torres Strait Islander peoples rights, interests, needs, values and aspirations;land use planning and emergency planning and managent, especially in remote Indigenous communities;Canberra's unique planning history and land tenure system;local government restructurung and reform."], "biography": "Ed is an experienced urban and regional planner, policy analyst and academic.  Ed has held senior positions in government, the private sector and with NGOs and professional associations.  Ed has worked across all jurisdictions in Australia and has an extensive practical knowledge and understanding of Commonwealth, State and Territory laws and regulations relating to land tenure, statutory Aboriginal and Torres Strait Islander land rights, native title rights and interests, land use planning, environmental protection, cultural heritage protection and management, naturka resource management and the roles and resoponsibilities of local government.  Ed has also engaged in teaching and research in various fields at the Australian National University, University of Canberra, Griffith University, University of Western Sydney, University of New South Wales and James Cook University.", "project": [], "publication": [{"title": "", "year": "2018", "source": "Background Report on Aboriginal and Torres Strait Islander Planning Policy for the Queensland Division of the Planning Institute of Australia", "authors": ["Harwood S", "Ed (Edward) Wensing"]}, {"title": "Dealings in native title and statutory Aboriginal land rights lands in Australia: What land tenure reform is needed?", "year": "2016", "source": "in Will Sanders (ed.), Engaging Indigenous Economy: Debating diverse approaches, ANU Press, Acton ACT 2601, pp. 207-222", "authors": ["Ed (Edward) Wensing"]}, {"title": "Unsettling planning", "year": "2016", "source": "s paradigms: towards a just accommodation of Indigenous rights and interests in Australian urban planning?'Australian Planner, vol. 53, no. 2, pp. 91-102", "authors": ["Ed (Edward) Wensing", "Porter L"]}, {"title": "", "year": "2015", "source": "In denial and disarray: Recent history of funding for municipal and essential services in discrete/remote Aboriginal Communities", "authors": ["Ed (Edward) Wensing"]}, {"title": "boriginal and Torres Strait Islander peoples", "year": "2014", "source": "relationships to Country''in Jason Byrne, Neil Sipe, Jago Dodson (ed.), Australian Environmental Planning: Challenges and future prospects, Routledge, Abingdon, UK and New York, USA, pp. 9-20", "authors": ["Ed (Edward) Wensing"]}, {"title": "Book Review: Reclaiming indigenous planning", "year": "2014", "source": "Urban Policy and Research, vol. 32, no. 3, pp. 1-5", "authors": ["Ed (Edward) Wensing"]}, {"title": "Conflicting World Views: Disjuncture between Climate Change Knowledge, Land Use Planning and Disaster Resilience in Remote Indigenous Communities in Northern Australia", "year": "2014", "source": "Geography Research Forum, vol. 34, no. 2014, pp. 92-107", "authors": ["Ed (Edward) Wensing", "Harwood S", "Bird D"]}, {"title": "Designing Social Change Beyond Talk, Taking action", "year": "2014", "source": "ACTCOSS & UC Conference 2014, Designing Social Change, Beyond Talk, Taking action, ACTCOSS, Canberra", "authors": ["Ed (Edward) Wensing"]}, {"title": "Natural Hazard Resilient Communities and Land Use Planning: The Limitations of Planning Governance in Tropical Australia", "year": "2014", "source": "Journal of Geography & Natural Disasters, vol. 4, no. 2, p. 15", "authors": ["Harwood S", "Carson D", "Ed (Edward) Wensing"]}, {"title": "Land Justice for Indigenous Australians: Dealings in native title lands and statutory Aboriginal land rights regimes in Australia and why land tenure reform is critical for the social reconstruction of Aboriginal people and communities", "year": "2014", "source": "A Seminar on Development on Aboriginal Freehold Land, Conference Organising Committee, TBC", "authors": ["Ed (Edward) Wensing"]}, {"title": "Just Accommodation of Customary Land Rights in Land Use Planning Systems", "year": "2013", "source": "International Urban Planning and Environment Symposium 2012, ICMS PTY LTD, Australia, pp. 164-180", "authors": ["Ed (Edward) Wensing", "Garrick S"]}, {"title": "Indigenous land tenure reforms: Implications for land use planning", "year": "2013", "source": "National Congress of the Planning Institute of Australia 2013, Planning Institute Australia, Australia, pp. 27pp", "authors": ["Ed (Edward) Wensing"]}, {"title": "Secure tenure for home ownership and economic development on land subject to native title", "year": "2013", "source": "7th Australasian Housing Researchers Conference 2013, ed. Steven Rowley, Rachel Ong & Sanna Markkanen, Curtin Business School, Curtin Business School, pp. 25pp", "authors": ["Taylor J", "Ed (Edward) Wensing"]}, {"title": "boriginal and Torres Strait Islander Australians", "year": "2012", "source": "in S Thompson and P J Maginn (ed.), Planning Australia (2nd ed), Cambridge University Press, Australia, pp. 254-275", "authors": ["Ed (Edward) Wensing"]}, {"title": "Research Discussion Paper No. 31: Secure tenure for home ownership and economic development on land subject to native title", "year": "2012", "source": "AIATSIS Research PublicationsCanberra", "authors": ["Ed (Edward) Wensing", "Taylor J"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}