{"ANU": {"name": "Ehsan Tavakoli Nabavi", "link": "https://researchers.anu.edu.au/researchers/tavakoli-nabavi-se", "colleges": "College of Science", "email": "Ehsan.Nabavi@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "Ehsan was a visiting Research Fellow with the Program on Science, Technology and Society (STS) at the John F. Kennedy School of Government in 2016-17, where started his research on integrating the concept of ‘socio-technical imaginaries’ into sustainability science. In 2015 he was also a visiting scholar at Centre for Water and Development, School of African and Oriental Studies (SOAS) at University of London and Center for Development Research (ZEF) at University of Bonn. Ehsan is also Associate Fellow in the ANU's Centre for European Studies and ANU Energy Change Institute. Ehsan has received many awards and honours for his work including Inspiring the ACT Award 2018, Research Fellowship from Harvard Kennedy School of Government, full scholarship from Institute of Development Studies (IDS)-STEPS summer school in 2015, Helmholtz Centre for Environmental Research Fellowship 2014, and ANU PhD Scholarship.", "project": [], "publication": [{"title": "Begin with the human: Designing for safety and trustworthiness in cyber-physical systems", "year": "2020", "source": "in W F Lawless, R Mittue & D A Sofge (ed.), Human-Machine Shared Contexts, Academic Press - Elsevier, London, pp. 341-357", "authors": ["Williams E", "Ehsan Tavakoli Nabavi", "Bell G"]}, {"title": "Failed Policies, Falling Aquifers: Unpacking Groundwater\r\nOverabstraction in Iran", "year": "2018", "source": "Water Alternatives, vol. 11, no. 3, pp. 699-724", "authors": ["Ehsan Tavakoli Nabavi"]}, {"title": "Ground)Water Governance and Legal Development in Iran, 1906-2016", "year": "2017", "source": "Middle East law and governance, vol. 9, no. 1, pp. 43-70", "authors": ["Ehsan Tavakoli Nabavi"]}, {"title": "Boundary matters: The potential of system dynamics to support sustainability?", "year": "2017", "source": "Journal of Cleaner Production, 140(1) pp. 312–323", "authors": ["Ehsan Tavakoli Nabavi", "Daniell KA Najafi H"]}, {"title": "Rediscovering social-ecological systems: taking inspiration from actor-networks", "year": "2017", "source": "Sustainability Science, pp. 1-Sep", "authors": ["Ehsan Tavakoli Nabavi", "Daniell KA"]}, {"title": "Politics of innovation and the spirit of justice", "year": "2017", "source": "in Lukasiewicz, A, Dovers, S, Robin, L, McKay, JM, Schilizzi, S, Graham, S (ed.), Natural Resources and Environmental Justice: Australian Perspectives, CSIRO Publishing, Clayton South, Victoria, Australia, pp. 185-203", "authors": ["Ehsan Tavakoli Nabavi", "Benham C"]}, {"title": "System dynamic approach to hydro-politics in Hirmand transboundary river basin from sustainability perspective", "year": "2013", "source": "International Journal of Hydrology Science and Technology, vol. 3, no. 4, pp. 378-398", "authors": ["Bazrkar M", "Ehsan Tavakoli Nabavi", "Zamani N"]}, {"title": "Towards process-based sustainability indicators", "year": "2013", "source": "Sustainable Engineering Society (SENG) 2013 conference: Looking back...looking forward, Engineers Australia, Barton, ACT", "authors": ["Ehsan Tavakoli Nabavi"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}