{"ANU": {"name": "Eleni Daskalaki", "link": "https://researchers.anu.edu.au/researchers/daskalaki-e", "colleges": "College of Engineering & Computer Science", "email": "ELENI.DASKALAKI@anu.edu.au", "phone": "", "expertise": ["Artificial Intelligence And Image Processing", "Control Systems Robotics And Automation", "Pattern Recognition And Data Mining", "Electrical And Electronic Engineering", "Signal Processing", "Biomedical Engineering Not Elsewhere Classified", "Simulation And Modelling", "Performing Arts And Creative Writing"], "interest": ["Machine/deep learning, reinforcement learning, control systems, signal processing, time-series analysis, unsupervised learning, sensing applications"], "biography": "Dr Eleni Daskalaki received her 5-year Dipl-Ing in Electrical and Computer Engineering from the National Technical University of Athens, Greece in 2009 and her PhD in Biomedical Engineering from the University of Bern, Switzerland in 2013. Her doctoral research was on the design and development of reinforcement learning-based control algorithms and adaptive prediction models for glucose regulation in type 1 diabetes. Her main contribution on personalisation of insulin treatment resulted in a patent application. After her PhD, Dr. Daskalaki was engaged for two years as project associate at the European Organization for Nuclear Research (CERN), Geneva, where she worked in different engineering areas, among which, the design of control algorithms for the phase regulation of the Compact Linear Collider klystrons.  Subsequently she was engaged at the Swiss Center for Electronics and Microtechnology (CSEM), Neuchatel, a private research company, first as a post-doctoral researcher and then as a R&D engineer. Her work focused on the development of signal processing algorithms for radiofrequency-based sensing applications and radar-based remote sensing of human vital signs. She led a research project on the development of machine/deep learning (ML/DL) algorithms for anomalies and events detection in multivariate time-series. Currently, she is a research fellow in Computer Science, mainly working for the OHIOH grand challenge. Her work focuses on the development of ML/DL strategies for the improvement of diagnosis and management of diabetes and multiple sclerosis, but also expands in the broader field of data processing in medical applications.", "project": ["Journal Publications", "[1] E. Daskalaki, P. Diem, S. Mougiakakou, \"Model-free machine learning in biomedicine: Feasibility study in type 1 diabetes,\" PloS one, vol. 11, no. 7, July 2016.", "[2] E. Daskalaki, S. Doebert, “Low-level feedback control for the phase regulation of CLIC Drive Beam klystrons”, CERN-ACC-2015-0138, CLIC-Note-1055, September 2015.", "[3] A. Pfützner, J. Weissmann, S. Mougiakakou, E. Daskalaki, N. Weis, R. Ziegler, “Glycemic variability Is associated with frequency of blood glucose testing and bolus: post hoc analysis results from the ProAct study”, Diabetes Technology and Therapeutics, vol.17, no. 6, pp. 392-397, June 2015.", "[4] E. Daskalaki, K. Nørgaard, A. Prountzou, T. Züger, P. Diem, S. Mougiakakou, ”An early-warning system for hypo-/hyperglycemic events based on fusion of adaptive prediction models,” Journal of Diabetes Science and Technology, vol. 7, no. 3, May 2013. (invited)", "[5] E. Daskalaki, P. Diem, S. Mougiakakou, ”An Actor-Critic based controller for glucose regulation in type 1 diabetes,” Computer Methods and Programs in Biomedicine, vol. 109, no. 2, pp. 116-125, February 2013. (invited)", "[6] E. Daskalaki, A. Prountzou, P. Diem, S. Mougiakakou, ”Real-time models for the personalized prediction of glycemic profile in type 1 diabetes patients,” Diabetes Technology and Therapeutics, vol. 14, no. 2, pp. 168-174, January 2012.", "Book Chapters", "[1] E. Daskalaki, P. Diem, S. Mougiakakou, “Adaptive algorithms for personalized diabetes management,” In: Data-driven Modeling Diabetes, in Lecture Notes in Bioengineering, G. Mitsis, V. Marmarelis, Ed. Springer, 2014, pp. 91-116.", "Conference Proceedings", "[1] A. Vorobyov, E. Daskalaki, J. Farserotu, “Feasibility of Remote Vital Signs Sensing with a mm-Wave CW Reflectometer,” 38th IEEE International Conference on Electronics and Nanotechnology (ELNANO), Kiev, Ukraine, April 24-26, 2018.", "[2] A. Vorobyov, E. Daskalaki, C. Hennemann, J. D. Decotignie, “Human physical condition RF sensing at THz range”, 38th Annual Internation Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), Orlando, Florida, USA, August 16-20, 2016.", "[3] E. Daskalaki, V. Rude, A. Vamvakas, M. Duquenne, H. Mainaud-Durand, S. Doebert, “Study of the dynamic response of CLIC accelerating structures”, 6th International Particle Accelerator Conference (IPAC), Richmond, Virginia, USA, May 3-8, 2015.", "[4] R. Botwey, E. Daskalaki, P. Diem, S. Mougiakakou, “Multi-model data fusion to improve an early-warning system for hypo-/hyperglycemic events,” 36th Annual Internation Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), Illinois, Chicago, USA, August 26-30, 2014.", "[5] E. Daskalaki, P. Diem, S. Mougiakakou, ”Personalized tuning of a reinforcement learning control algorithm for glucose regulation,” 35th Annual Internation Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), Osaka, Japan, July 3-7, 2013.", "[6] E. Daskalaki, L. Scarnato, P. Diem, S. Mougiakakou, ”Preliminary results of a novel approach for glucose regulation using an actor-critic learning based controller,” United Kingdom Automatic Control Council (UKACC) International Conference on Control, Conventry, UK, September 2010.", ""], "publication": []}, "Microsoft-Academic": [{"title": "glycemic variability is associated with frequency of blood glucose testing and bolus post hoc analysis results from the proact study", "year": 2015, "source": "diabetes technology & therapeutics", "authors": [{"name": "andreas pfutzner"}, {"name": "joerg weissmann"}, {"name": "stavroula mougiakakou"}, {"name": "eleni daskalaki"}, {"name": "norbert weis"}, {"name": "ralph ziegler"}], "id": 67495602}, {"title": "thermo mechanical tests for the clic two beam module study", "year": 2014, "source": "", "authors": [{"name": "anastasia xydou"}, {"name": "eleni daskalaki"}, {"name": "germana riddone"}, {"name": "alexios vamvakas"}]}, {"title": "postoperative c reactive protein to albumin ratio as a diagnostic tool for predicting complications after abdominal surgery", "year": 2018, "source": "clinical nutrition espen", "authors": [{"name": "dimitrios karayiannis"}, {"name": "zoi bouloubasi"}, {"name": "a baschali"}, {"name": "dimitrios constantinou"}, {"name": "eleni daskalaki"}, {"name": "vassilis kalatzis"}, {"name": "sotirios voulgaris"}, {"name": "constantinos botsakis"}, {"name": "dimitrios magganas"}, {"name": "vasileios vougas"}], "id": 2764915710}, {"title": "feasibility of remote vital signs sensing with a mm wave cw reflectometer", "year": 2018, "source": "", "authors": [{"name": "alexander vorobyov"}, {"name": "eleni daskalaki"}, {"name": "john farserotu"}]}, {"title": "sandidoc at clef 2020 consumer health search adhoc ir task", "year": 2020, "source": "", "authors": [{"name": "sandaru seneviratne"}, {"name": "eleni daskalaki"}, {"name": "md zakir hossain"}, {"name": "artem lenskiy"}]}, {"title": "cern european organization for nuclear research low level feedback control for the phase regulation of clic drive beam klystrons", "year": 2015, "source": "", "authors": [{"name": "eleni daskalaki"}]}, {"title": "low level feedback control for the phase regulation of clic drive beam klystrons", "year": 2015, "source": "", "authors": [{"name": "eleni daskalaki"}, {"name": "steffen doebert"}]}], "ANDS-Grants": []}