{"ANU": {"name": "Elisa deCourcy", "link": "https://researchers.anu.edu.au/researchers/decourcy-e", "colleges": "College of Arts and Social Sciences", "email": "Elisa.DeCourcy@anu.edu.au", "phone": "", "expertise": [], "interest": ["Nineteenth and early twentieth-century photography, particularly systems of photographic transmission, and photography's creation and consumption alongside other media and modes of portraiture."], "biography": "Dr Elisa deCourcy is an art historian with a broad interest in the use and development of visual technologies in the nineteenth and early twentieth centuries. Elisa's work largely examines photo histories, including but going beyond European and American metropoles, assessing cultures of experimentation and appropriation. From 2016-2019 she was the Research Fellow on 'Heritage in the Limelight: The magic lantern in Australia and the world' ARC Discovery Project run out of the School of Art and Design, ANU. During this period she also worked on a second Discovery Project, 'Curating Photography in the Age of Photosharing' (2015-2019), co-administered between ANU and RMIT. She has spoken and published about her research in Australia and abroad. In 2018 she was awarded a Harry Ransom Fellowship from the University of Texas at Austin and an Australian Academy of the Humanities Publishing Subsidy Award in 2019. Both of these grants contribute to an extended book project 'Empire, Early Photography and Spectacle: the global career of showman daguerreotypist J.W. Newland', co-authored with Martyn Jolly, released by Routledge in January 2021. From April 2020 she will be an Australian Research Council DECRA fellow on her own project 'Capturing Foundational Australian Photography in a Globalising World' also based at ANU. Her scholarship is informed by deep archival research, practice-led investigation and a re-thinking of digital design for photographically-centred heritage collections. Her work has been covered by The Guardian, The Smithsonian Magazine, and The Conversation.", "project": ["Capturing foundational Australian photography in a globalising world (DECRA 2020-2023) DE200101322", "This project will combine archival research on the foundational years of Australian photography, 1839-54, with new methods of multimedia database design to network early photographs: daguerreotypes, ambrotypes and calotypes, with dispersed manuscripts, journalism and legal proceedings that document their creation. These images are prized by Australian collecting institutions but their significance to our cultural heritage remains unrecognised. This project will analyse how colonial Australian photographers’ distance from Europe prompted them to innovate with processes, materials and apparatuses. It will excavate this neglected dimension of colonial modernity, assessing its resonance for media heritage, culture, and law."], "publication": [{"title": "Review: \"The Business of Photography at\r\nSydney University", "year": "2021", "source": "s new Chau Chak Wing Museum\"Australian Book Review, 11 March 2021", "authors": ["Elisa deCourcy"]}, {"title": "Empire", "year": "2021", "source": "Early Photography and Spectacle: The Global Career of Showman Daguerreotypist J.W. NewlandRoutledge, Abingdon", "authors": ["Elisa deCourcy", "Jolly M"]}, {"title": "Portrait of Hemi Pômare as a young man: how we uncovered the oldest surviving photograph of a Mâori", "year": "2020", "source": "pp. The Conversation  30 June 2020; Re-reported in The Smithsonian 1 July 2020", "authors": ["Elisa deCourcy", "Jolly M"]}, {"title": "The Magic Lantern at Work: Witnessing", "year": "2020", "source": "PersuadingExperiencing and Connecting, Routledge, New York", "authors": ["Jolly M", "Elisa deCourcy", "eds"]}, {"title": "The Circus and the Magic Lantern: A Portfolio of Hand-Painted Mechanical Magic Lantern Slides", "year": "2020", "source": "in Anna-Sophie J?rgens (ed.), Circus, Science and Technology: Dramatising Innovation, Palgrave Macmillan, London, pp. 123-141", "authors": ["Jolly M", "Elisa deCourcy"]}, {"title": "Mapping with a Car and a Camera: Ralph Bagnold in the Libyan Desert", "year": "2019", "source": "Photography and Culture, vol. 12, no. 1, pp. 109-11", "authors": ["Elisa deCourcy"]}, {"title": "nimating the hand of the scientist: women colourists at the Australian Museum in the early twentieth century", "year": "2019", "source": "Early Popular Visual Culture, vol. 17, no. 2. pp.386-39", "authors": ["Elisa deCourcy", "V Finney"]}, {"title": "Heritage in the Limelight, a Collection in Progress: Uncovering, Connecting, Researching and Animating Australia", "year": "2018", "source": "s Magic Lantern Past'Open Library of the Humanities, vol. 4, no. 1, pp. 1-25", "authors": ["Jolly M", "Elisa deCourcy"]}, {"title": "Magic Lantern Culture as a Challenge to Area Studies: mobility, recombination and experimentation", "year": "2018", "source": "in Nakajima, Pickering & Zhang (ed.), Papers from the 2018 PKU-ANU-Tokyo Winter Institute, University of Tokyo Center for Philosophy Press, Tokyo, pp. 81-88", "authors": ["Elisa deCourcy"]}, {"title": "The Dreadnought Hoax portrait as an Affront to the Edwardian Age", "year": "2017", "source": "Early Popular Visual Culture, vol. 15, no. 4, pp. 405-42", "authors": ["Elisa deCourcy"]}]}, "Microsoft-Academic": [{"title": "heritage in the limelight a collection in progress uncovering connecting researching and animating australia s magic lantern past", "year": 2018, "source": "", "authors": [{"name": "martyn jolly", "affiliation": "australian national university"}, {"name": "elisa decourcy", "affiliation": "australian national university"}]}, {"title": "the circus and the magic lantern a portfolio of hand painted mechanical magic lantern slides", "year": 2020, "source": "", "authors": [{"name": "martyn jolly", "affiliation": "australian national university"}, {"name": "elisa decourcy", "affiliation": "australian national university"}]}, {"title": "animating the hand of the scientist women colourists at the australian museum in the early twentieth century", "year": 2019, "source": "early popular visual culture", "authors": [{"name": "elisa decourcy", "affiliation": "australian national university"}, {"name": "vanessa finney", "affiliation": "australian museum"}], "id": 152232416}, {"title": "mapping with a car and a camera ralph bagnold in the libyan desert", "year": 2019, "source": "photography and culture", "authors": [{"name": "elisa decourcy", "affiliation": "australian national university"}], "id": 20903574}, {"title": "the dreadnought hoax portrait as an affront to the edwardian age", "year": 2017, "source": "early popular visual culture", "authors": [{"name": "elisa decourcy", "affiliation": "australian national university"}], "id": 152232416}, {"title": "just a grain of salt symbolic construction during the indian nationalist movement", "year": 2010, "source": "melbourne historical journal", "authors": [{"name": "elisa decourcy"}], "id": 2765029864}, {"title": "the magic lantern at work witnessing persuading experiencing and connecting", "year": 2020, "source": "", "authors": [{"name": "martyn jolly"}, {"name": "elisa decourcy"}]}, {"title": "portrait of hemi pomare as a young man how we uncovered the oldest surviving photograph of a māori", "year": 2020, "source": "the conversation", "authors": [{"name": "elisa decourcy"}, {"name": "martyn jolly"}], "id": 2764582943}, {"title": "empire early photography and spectacle the global career of showman daguerreotypist j w newland", "year": 2020, "source": "", "authors": [{"name": "elisa decourcy"}, {"name": "martyn jolly"}]}, {"title": "archive in the spotlight", "year": 2017, "source": "", "authors": [{"name": "martyn jolly"}, {"name": "elisa decourcy"}]}], "ANDS-Grants": []}