{"ANU": {"name": "Elizabeth Rieger", "link": "https://researchers.anu.edu.au/researchers/rieger-e", "colleges": "College of Health & Medicine", "email": "elizabeth.rieger@anu.edu.au", "phone": "", "expertise": ["Health Clinical And Counselling Psychology"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Exploring the psychometric properties of the Working Alliance Inventory in general practice: a cross-sectional study", "year": "2021", "source": "BJGP Open\r\n, vol. 5, no. 1, pp. 1-9", "authors": ["Hunik L", "Galvin S", "Olde Hartman T", "Elizabeth Rieger"]}, {"title": "What prevents young adults from seeking help? Barriers toward help-seeking for eating disorder symptomatology", "year": "2020", "source": "International Journal of Eating Disorders, vol. 53, no. 6, pp. 894-906", "authors": ["Ali K", "Fassnacht D", "Farrer L", "Elizabeth Rieger"]}, {"title": "daption and validation of the Working Alliance Inventory for General Practice: qualitative review and cross-sectional surveys", "year": "2019", "source": "Family Practice, vol. 36, no. 4, pp. 516-522", "authors": ["Sturgiss E", "Elizabeth Rieger", "Haesler E"]}, {"title": "Drive for Thinness Versus Fear of Fat: Approach and Avoidance Motivation Regarding Thin and Non-thin Images in Women", "year": "2019", "source": "Cognitive Therapy and Research, vol. 43, no. 3, pp. 585-593", "authors": ["Dondzilo L", "Elizabeth Rieger", "Jayawardena N"]}, {"title": "Evidence for a perceptual mechanism relating body size misperception and eating disorder symptoms", "year": "2019", "source": "Eating and Weight Disorders, vol. 24, no. 4, pp. 615-621", "authors": ["Alexi J", "Palermo R", "Elizabeth Rieger"]}, {"title": "Editorial: Sex and Gender Differences in Body Image", "year": "2019", "source": "Frontiers in Psychology, vol. 10", "authors": ["Hartmann A", "Elizabeth Rieger", "Vocks S"]}, {"title": "Eating disorder symptoms and proneness in gay men, lesbian women, and transgender and non-conforming adults: Comparative levels and a proposed mediational model", "year": "2019", "source": "Frontiers in Psychology, vol. 9, no. JAN, pp. -", "authors": ["Bell K", "Elizabeth Rieger", "Hirsch J"]}, {"title": "Inhibition of return regarding body images in women with shape/weight-based self-worth [IN PRESS]", "year": "2018", "source": "Journal of Experimental Psychopathology, vol. Online, pp. 1-13", "authors": ["Forsyth M", "Elizabeth Rieger", "Bell J"]}, {"title": "Inhibition of return for body images in individuals with shape/weight based self-worth", "year": "2018", "source": "Journal of Eating Disorders, vol. 6, no. 25, pp. 1-10", "authors": ["Cobb A", "Elizabeth Rieger", "Bell J"]}, {"title": "Measuring social support for healthy eating and physical activity in obesity", "year": "2018", "source": "British Journal of Health Psychology, vol. 23, no. 4, pp. 1021-1039", "authors": ["Elizabeth Rieger", "Sellbom M", "Murray K"]}, {"title": "Indicators of clinical significance among women in the community with binge-eating disorder symptoms: Delineating the roles of binge frequency, body mass index, and overvaluation", "year": "2018", "source": "International Journal of Eating Disorders, vol. 51, no. 2, pp. 165-169", "authors": ["Mitchison D", "Elizabeth Rieger", "Harrison C"]}, {"title": "The causal role of selective attention for thin-ideal images on negative affect and rumination", "year": "2018", "source": "Journal of Behavior Therapy and Experimental Psychiatry, vol. 61, pp. 128-133pp", "authors": ["Dondzilo L", "Elizabeth Rieger", "Palermo R"]}, {"title": "Reducing the stigma associated with anorexia nervosa: An evaluation of a social consensus intervention among Australian and Chinese young women", "year": "2018", "source": "International Journal of Eating Disorders, vol. 51, no. 1, pp. 62-70pp", "authors": ["Yan Y", "Elizabeth Rieger", "Shou Y"]}, {"title": "Body image predictors of depressive symptoms in adolescence", "year": "2018", "source": "Journal of Adolescence, vol. 69, pp. 130-139pp", "authors": ["Murray K", "Elizabeth Rieger", "Byrne D"]}, {"title": "How eating disordered and non-eating disordered women differ in their use (and effectiveness) of cognitive self-regulation strategies for managing negative experiences", "year": "2017", "source": "Eating and Weight Disorders, vol. 24, no. 5, pp. 897-904", "authors": ["Crino N", "Touyz S", "Elizabeth Rieger"]}, {"title": "The social psychology of disordered eating: The Situated Identity Enactment model", "year": "2016", "source": "European Review of Social Psychology, vol. 27, no. 1, pp. 160-195", "authors": ["Cruwys T", "Platow M", "Elizabeth Rieger"]}, {"title": "The use of support people to improve the weight-related and psychological outcomes of adults with obesity: A randomised controlled trial", "year": "2017", "source": "Behaviour Research and Therapy, vol. 94, pp. 48-59", "authors": ["Elizabeth Rieger", "Treasure J", "Murray K"]}, {"title": "The mediating role of rumination in the relation between attentional bias towards thin female bodies and eating disorder symptomatology", "year": "2017", "source": "PLOS ONE (Public Library of Science), vol. 12, no. 5, pp. e0177870-e0177870", "authors": ["Dondzilo L", "Elizabeth Rieger", "Palermo R"]}, {"title": "The mediating role of rumination in the relation between attentional bias towards thin female bodies and eating disorder symptomatology", "year": "2017", "source": "PLOS ONE (Public Library of Science), vol. 12, no. 5, pp. e0177870-e0177870", "authors": ["Dondzilo L", "Elizabeth Rieger", "Palermo R"]}, {"title": "The effect of interpersonal rejection on attentional biases regarding thin-ideal and non-thin images: The moderating role of body weight- and shape-based self-worth", "year": "2017", "source": "Body Image, vol. 22, no. September 2017, pp. 78-86", "authors": ["Elizabeth Rieger", "Dolan A", "Thomas B"]}, {"title": "ssociation between rumination factors and eating disorder bahaviours in young women", "year": "2016", "source": "Advances in Eating Disorders (Abingdon): Theory, Research and Practice, vol. 4, no. 1, pp. 84-98pp", "authors": ["Dondzilo L", "Elizabeth Rieger", "Palermo R"]}, {"title": "The Effect of Peer Stress on Body Dissatisfaction in Female and Male Young Adults", "year": "2016", "source": "Journal of Experimental Psychopathology, vol. 7, no. 2, pp. 261-276pp", "authors": ["Murray K", "Elizabeth Rieger", "Byrne D"]}, {"title": "High or low intensity text-messaging combined with group treatment equally promote weight loss maintenance in obese adults", "year": "2016", "source": "Obesity Research and Clinical Practice, vol. 10, no. 6, pp. 680-691pp", "authors": ["Zwickert K", "Elizabeth Rieger", "Swinbourne J"]}, {"title": "The social psychology of disordered eating: The Situated Identity Enactment model", "year": "2016", "source": "European Review of Social Psychology, vol. 27, no. 1, pp. 160-195", "authors": ["Cruwys T", "Platow M", "Elizabeth Rieger"]}, {"title": "Therapeutic alliance and obesity management in primary care - a cross-sectional pilot using the Working Alliance Inventory", "year": "2016", "source": "Clinical Obesity, vol. 6, no. 6, pp. 376-379pp", "authors": ["Sturgiss E", "Sargent G", "Haesler E", "Elizabeth Rieger"]}, {"title": "Emotion regulation difficulties in binge eating disorder with and without the overvaluation of weight and shape", "year": "2016", "source": "Psychiatry Research, vol. 245, pp. 436-442", "authors": ["Harrison C", "Mitchison D", "Elizabeth Rieger"]}, {"title": "Correlates of binge eating with and without overvaluation of weight or shape: Further evidence from a general population sample of women", "year": "2015", "source": "Advances in Eating Disorders (Abingdon): Theory, Research and Practice, vol. 3, no. 1, pp. 20-33", "authors": ["Harrison C", "Mond J", "Elizabeth Rieger"]}, {"title": "Generic and eating disorder-specific impairment in binge eating disorder with and without overvaluation of weight or shape", "year": "2015", "source": "Behaviour Research and Therapy, vol. 72, pp. 93-99", "authors": ["Harrison C", "Mond J", "Elizabeth Rieger"]}, {"title": "Reduced inhibition of return to food images in obese individuals", "year": "2015", "source": "PLOS ONE (Public Library of Science), vol. 10, no. 9, pp. -", "authors": ["Carters M", "Elizabeth Rieger", "Bell J"]}, {"title": "Obesity: Its Relationship with Cardiovascular Disease and Management", "year": "2015", "source": "in Marlies E Alvarenga & Don Byrne (ed.), Handbook of Psychocardiology, Springer Singapore, Singapore, pp. 1109-1124pp", "authors": ["Elizabeth Rieger"]}, {"title": "The relationship between stress and body satisfaction in female and male adolescents", "year": "2015", "source": "Stress and Health, vol. 31, no. 1, pp. 13-23", "authors": ["Murray K", "Elizabeth Rieger", "Byrne D"]}, {"title": "Motivational Approaches", "year": "2017", "source": "in Tracey Wade (ed.), Encyclopedia of Feeding and Eating Disorders, Springer Singapore, Singapore, pp. 2-5", "authors": ["Elizabeth Rieger"]}, {"title": "qualitative investigation into the relationship between stress and eating disordered behaviours in patients with anorexia nervosa", "year": "2014", "source": "Australia and New Zealand Academy for Eating Disorders (ANZAED) Conference, ed. Stephen Touyz, Philipa Hay, BioMed Central Ltd., London, United Kingdom, pp. Volume 2, Issue 1, Number O49", "authors": ["Hale A", "Elizabeth Rieger", "Russell J"]}, {"title": "bnormal Psychology: Leading researcher perspectives 3rd Edition", "year": "2014", "source": "McGaw-Hill Education (Australia) Pty LtdNorth Ryde", "authors": ["Elizabeth Rieger", "ed"]}, {"title": "Persistent body image disturbance following recovery from eating disorders", "year": "2014", "source": "International Journal of Eating Disorders, vol. 47, no. 4, pp. 400-409", "authors": ["Eshkevari E", "Elizabeth Rieger", "Longo M"]}, {"title": "Loss of control eating with and without the undue influence of weight or shape on self-evaluation: evidence from an adolescent population", "year": "2014", "source": "Journal of Eating Disorders, vol. 2, no. 1, pp. 31-31", "authors": ["Harrison C", "Mond J", "Bentley C", "Elizabeth Rieger"]}, {"title": "n investigation of interoceptive sensitivity in eating disorders using a heartbeat detection task and a self-report measure", "year": "2014", "source": "European Eating Disorders Review, vol. 22, no. 5, pp. 383-388", "authors": ["Eshkevari E", "Elizabeth Rieger", "Musiat P"]}, {"title": "n internet-based program to enhance motivation to change in females with symptoms of an eating disorder: A randomized controlled trial", "year": "2014", "source": "Psychological Medicine, vol. 44, no. 9, pp. 1947-1963", "authors": ["Hotzel K", "von Brachel R", "SChmidt U", "Elizabeth Rieger"]}, {"title": "Internet-based motivation program for women with eating disorders: Eating disorder pathology and depressive mood predict dropout", "year": "2014", "source": "Journal of Medical Internet Research, vol. 16, no. 3, pp. 145-157", "authors": ["von Brachel R", "Hotzel K", "Hirschfeld G", "Elizabeth Rieger"]}, {"title": "n Investigation of the Transdiagnostic Model of Eating Disorders in the Context of Muscle Dysmorphia", "year": "2013", "source": "European Eating Disorders Review, vol. 21, no. 2, pp. 160-164", "authors": ["Murray S", "Elizabeth Rieger", "Karlov L"]}, {"title": "longitudinal investigation of the mediating role of self-esteem and body importance in the relationship between stress and body dissatisfaction in adolescent females and males", "year": "2013", "source": "Body Image, vol. 10, no. 4, pp. 544-551", "authors": ["Murray K", "Elizabeth Rieger", "Byrne D"]}, {"title": "Popularity, likeability, and risk-taking in middle adolescence", "year": "2013", "source": "Health, vol. 5, no. 6A3, pp. 41-52", "authors": ["Hawke S", "Elizabeth Rieger"]}, {"title": "Masculinity and femininity in the divergence of male body image concerns", "year": "2013", "source": "Journal of Eating Disorders, vol. 1, pp. 11-11", "authors": ["Murray S", "Elizabeth Rieger", "Karlov L"]}, {"title": "The Development and Validation of the Dieting Intentions Scale (DIS)", "year": "2013", "source": "Psychological Assessment, vol. 25, no. 1, pp. 264-278", "authors": ["Cruwys T", "Platow M", "Elizabeth Rieger"]}, {"title": "Stigmatizing attitudes towards individuals with anorexia nervosa: an investigation of attribution theory", "year": "2013", "source": "Journal of Eating Disorders, vol. 1, no. 5, pp. 5-5", "authors": ["Zwickert K", "Elizabeth Rieger"]}, {"title": "Therapeutic Alliance in Two Treatments for Adults with Severe and Enduring Anorexia Nervosa", "year": "2013", "source": "International Journal of Eating Disorders, vol. 46, no. 8, pp. 783-789", "authors": ["Stiles-Shields C", "Touyz S", "Hay P", "Elizabeth Rieger"]}, {"title": "The effectiveness of including support people in a cognitive behavioural weight loss maintenance programme for obese adults: study rationale and design", "year": "2014", "source": "Clinical Obesity, vol. 4, no. 2, pp. 77-90", "authors": ["Elizabeth Rieger", "Treasure J", "Swinbourne J"]}, {"title": "comparison of compulsive exercise in male and female presentations of anorexia nervosa", "year": "2013", "source": "Advances in Eating Disorders: Theory, Research and Practice, vol. Online", "authors": ["Murray S", "Griffiths S", "Elizabeth Rieger"]}, {"title": "comparison of eating, exercise, shape, and weight related symptomatology in males with muscle dysmorphia and anorexia nervosa", "year": "2012", "source": "Body Image, vol. 9, no. 2, pp. 193-200", "authors": ["Murray S", "Elizabeth Rieger", "Hildebrandt T"]}, {"title": "How self-perception, emotion and beliefs influence eating and weight-related behaviour", "year": "2012", "source": "in Louise A Baur, Stephen M Twigg & Roger S Magnusson (ed.), A Modern Epidemic Expert perspectives on obesity and diabetes, Sydney University Press, Sydney Australia, p. 12", "authors": ["Adam B", "Elizabeth Rieger"]}, {"title": "Increased plasticity of the bodily self in eating disorders", "year": "2012", "source": "Psychological Medicine, vol. 42, no. 4, pp. 819-828", "authors": ["Eshkevari E", "Elizabeth Rieger", "Longo M"]}, {"title": "Muscle dysmorphia symptomatology during a period of religious fasting: A case report", "year": "2011", "source": "European Eating Disorders Review, vol. 19, no. 2, pp. 162-168", "authors": ["Murray S", "Elizabeth Rieger", "Touyz S"]}, {"title": "Investigating adolescent stress and body image", "year": "2011", "source": "Journal of Adolescence, vol. 34, no. 2, pp. 269-278", "authors": ["Murray K", "Byrne D", "Elizabeth Rieger"]}, {"title": "Eating Disorders", "year": "2011", "source": "in Elizabeth Rieger (ed.), Abnormal Psychology: Leading Researcher Perspectives (2nd ed), McGraw Hill Australia Pty Ltd, North Ryde Australia, pp. 221-264", "authors": ["Touyz S", "Hay P", "Elizabeth Rieger"]}, {"title": "Muscle dysmorphia and the DSM-V conundrum: Where does it belong? A review paper", "year": "2010", "source": "International Journal of Eating Disorders, vol. 43, no. 6, pp. 483-491", "authors": ["Murray S", "Elizabeth Rieger", "Touyz S"]}, {"title": "n eating disorder-specific model of interpersonal psychotherapy (IPT-ED): Causal pathways and treatment implications", "year": "2010", "source": "Clinical Psychology Review, vol. 30, no. 4, pp. 400-410", "authors": ["Elizabeth Rieger", "Van Buren D", "Bishop M"]}, {"title": "n Investigation of the Effect of Body Dissatisfaction on Selective Attention Toward Negative Shape and Weight-Related Information", "year": "2010", "source": "International Journal of Eating Disorders, vol. 43, no. 4, pp. 358-364", "authors": ["Smith E", "Elizabeth Rieger"]}, {"title": "The effect of attentional training on body dissatisfaction and dietary restriction", "year": "2009", "source": "European Eating Disorders Review, vol. 17, no. 3, pp. 169-176", "authors": ["Smith E", "Elizabeth Rieger"]}, {"title": "The use of motivational enhancement strategies for the maintenance of weight loss among obese individuals: A preliminary investigation", "year": "2009", "source": "Diabetes, Obesity and Metabolism: a journal of pharmacology and therapeutics, vol. 11, no. 6, pp. 637-640", "authors": ["Elizabeth Rieger", "Dean H", "Steinbeck K"]}, {"title": "Interpersonal Psychotherapy for Eating Disorders", "year": "2009", "source": "in Paxton, SJ & Hay, PJ (ed.), Interventions for Body Image and Eating Disorders: Evidence and Practice, IP Communications, Melbourne, pp. 217-233", "authors": ["Elizabeth Rieger"]}, {"title": "Nutrition knowledge in young women with eating disorders in Australia and Singapore: A pilot study", "year": "2009", "source": "Australian and New Zealand Journal of Psychiatry, vol. 43, no. 12, pp. 1178-1184", "authors": ["Soh N", "Touyz S", "Dobbins T", "Elizabeth Rieger"]}, {"title": "Eating disorders", "year": "2008", "source": "in Elizabeth Rieger (ed.), Abnormal Psychology: Leading Researcher Perspectives (1st Edition), McGraw Hill Australia Pty Ltd, Australia, pp. 209-252", "authors": ["Touyz S", "Hay P", "Elizabeth Rieger"]}, {"title": "Group motivational enhancement therapy as an adjunct to inpatient treatment for eating disorders: A preliminary study", "year": "2008", "source": "European Eating Disorders Review, vol. 16, pp. 256-267", "authors": ["Dean H", "Touyz S", "Elizabeth Rieger"]}, {"title": "Physical activitiy and body composition in outpatients recovering from anorexia nervosa and healthy controls", "year": "2008", "source": "Adapted Physical Activity Quarterly, vol. 25, no. 2, pp. 159-173", "authors": ["Hechler T", "Elizabeth Rieger", "Touyz S"]}, {"title": "Body Image Disturbance in Young North European and East Asian Women with and without Eating Disorders in Australia and in Singapore", "year": "2008", "source": "European Eating Disorders Review, vol. 16, no. 4, pp. 287-296", "authors": ["Soh N", "Touyz S", "Dobbins T", "Elizabeth Rieger"]}, {"title": "Cross-Cultural Differences in the Macronutrient Intakes of Women with Anorexia Nervosa in Australia and Singapore", "year": "2008", "source": "European Eating Disorders Review, vol. 16, no. 6, pp. 427-435", "authors": ["Soh N", "Touyz S", "Dobbins T", "Elizabeth Rieger"]}, {"title": "Physical activity and body composition across the seasons: A preliminary analysis in outpatients with a current or past diagnosis of anorexia nervosa and healthy controls", "year": "2008", "source": "Adapted Physical Activity Quarterly, vol. 25, no. 2, pp. 159-173", "authors": ["Hechler T", "Elizabeth Rieger", "Touyz S"]}, {"title": "Can Motivational Enhancement Therapy Improve a Cognitive Behaviourally Based Inpatient Program for Eating Disorders?", "year": "2007", "source": "in Danielle A. Einstein (ed.), Innovations and Advances in Cognitive Behaviour Therapy, Australian Academic Press Pty Ltd, Australia, pp. 171 - 183", "authors": ["Dean H", "Touyz S", "Elizabeth Rieger"]}, {"title": "Restraint and eating concern in North European and East Asian women with and without eating disorders in Australia and Singapore", "year": "2007", "source": "Australian and New Zealand Journal of Psychiatry, vol. 41, pp. 536-545", "authors": ["Soh N", "Touyz S", "Dobbins T", "Elizabeth Rieger"]}, {"title": "ssessing motivation to change in bulimia nervosa: The bulimia nervosa stages of change questionnaire", "year": "2007", "source": "European Eating Disorders Review, vol. 15, pp. 13-23", "authors": ["Martinez E", "Castro J", "Bigorra A", "Elizabeth Rieger"]}, {"title": "Binge Eating Tendencies and Anger Coping:Investigating the Confound of Trait Neuroticism in a Non-Clinical Sample", "year": "2007", "source": "European Eating Disorders Review, vol. 15, pp. 479-486", "authors": ["Connolly A", "Elizabeth Rieger", "Caterson I"]}, {"title": "The Effect of Attentional Bias Toward Shape- and Weight-Related Information on Body Dissatisfaction", "year": "2006", "source": "International Journal of Eating Disorders, vol. 39, no. 6, pp. 509-515", "authors": ["Smith E", "Elizabeth Rieger"]}, {"title": "n Investigation of the Factorial Structure of Motivation to Recover in Anorexia Nervosa Using the Anorexia Nervosa Stages of Change Questionnaire", "year": "2006", "source": "European Eating Disorders Review, vol. 14, no. 4, pp. 269-275", "authors": ["Elizabeth Rieger", "Touyz S"]}, {"title": "comparison of maladaptive schemata in treatment-seeking obese adults and normal weight controls", "year": "2006", "source": "Journal of Psychosomatic Research, vol. 60, no. 3, pp. 245-252", "authors": ["Anderson K", "Elizabeth Rieger", "Caterson I"]}, {"title": "comparison of quality of life in obese individuals with or without binge eating disorder", "year": "2005", "source": "International Journal of Eating Disorders, vol. 37, no. 3, pp. 234-240", "authors": ["Elizabeth Rieger", "Wilfley D", "Stein R"]}]}, "Microsoft-Academic": [{"title": "a comparison of eating exercise shape and weight related symptomatology in males with muscle dysmorphia and anorexia nervosa", "year": 2012, "source": "body image", "authors": [{"name": "stuart b murray", "affiliation": "university of sydney"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "tom hildebrandt", "affiliation": "icahn school of medicine at mount sinai"}, {"name": "lisa karlov", "affiliation": "university of sydney"}, {"name": "janice russell", "affiliation": "university of sydney"}, {"name": "evelyn boon", "affiliation": "singapore general hospital"}, {"name": "robert t dawson"}, {"name": "stephen touyz", "affiliation": "university of sydney"}], "id": 177391433}, {"title": "increased plasticity of the bodily self in eating disorders", "year": 2012, "source": "psychological medicine", "authors": [{"name": "ertimiss eshkevari", "affiliation": "australian national university"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "matthew r longo", "affiliation": "birkbeck university of london"}, {"name": "patrick haggard", "affiliation": "university college london"}, {"name": "janet treasure", "affiliation": "king s college london"}], "id": 71144982}, {"title": "an eating disorder specific model of interpersonal psychotherapy ipt ed causal pathways and treatment implications", "year": 2010, "source": "clinical psychology review", "authors": [{"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "dorothy j van buren", "affiliation": "washington university in st louis"}, {"name": "monica bishop", "affiliation": "washington university in st louis"}, {"name": "marian tanofskykraff", "affiliation": "uniformed services university of the health sciences"}, {"name": "r robinson welch", "affiliation": "washington university in st louis"}, {"name": "denise e wilfley", "affiliation": "washington university in st louis"}], "id": 4632444}, {"title": "muscle dysmorphia and the dsm v conundrum where does it belong a review paper", "year": 2010, "source": "international journal of eating disorders", "authors": [{"name": "stuart b murray", "affiliation": "university of sydney"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "stephen touyz", "affiliation": "university of sydney"}, {"name": "yolanda de la garza garcia", "affiliation": "university of monterrey"}], "id": 74080386}, {"title": "persistent body image disturbance following recovery from eating disorders", "year": 2014, "source": "international journal of eating disorders", "authors": [{"name": "ertimiss eshkevari", "affiliation": "king s college london"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "matthew r longo", "affiliation": "birkbeck university of london"}, {"name": "patrick haggard", "affiliation": "university college london"}, {"name": "janet treasure", "affiliation": "king s college london"}], "id": 74080386}, {"title": "a comparison of quality of life in obese individuals with and without binge eating disorder", "year": 2005, "source": "international journal of eating disorders", "authors": [{"name": "elizabeth rieger", "affiliation": "university of sydney"}, {"name": "denise e wilfley", "affiliation": "washington university in st louis"}, {"name": "richard i stein", "affiliation": "washington university in st louis"}, {"name": "valentina marino", "affiliation": "university of rome tor vergata"}, {"name": "scott j crow", "affiliation": "university of minnesota"}], "id": 74080386}, {"title": "investigating adolescent stress and body image", "year": 2011, "source": "journal of adolescence", "authors": [{"name": "kristen murray", "affiliation": "australian national university"}, {"name": "d g byrne", "affiliation": "australian national university"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}], "id": 179289126}, {"title": "indicators of clinical significance among women in the community with binge eating disorder symptoms delineating the roles of binge frequency body mass index and overvaluation", "year": 2018, "source": "international journal of eating disorders", "authors": [{"name": "deborah mitchison", "affiliation": "macquarie university"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "carmel harrison", "affiliation": "australian national university"}, {"name": "stuart b murray", "affiliation": "university of california san francisco"}, {"name": "scott griffiths", "affiliation": "macquarie university"}, {"name": "jonathan mond", "affiliation": "university of tasmania"}], "id": 74080386}, {"title": "development of an instrument to assess readiness to recover in anorexia nervosa", "year": 2000, "source": "international journal of eating disorders", "authors": [{"name": "elizabeth rieger", "affiliation": "university of sydney"}, {"name": "stephen touyz", "affiliation": "university of sydney"}, {"name": "david schotte", "affiliation": "university of sydney"}, {"name": "p j v beumont", "affiliation": "university of sydney"}, {"name": "janice russell", "affiliation": "university of sydney"}, {"name": "simon clarke", "affiliation": "westmead hospital"}, {"name": "michael kohn", "affiliation": "alexandra hospital"}, {"name": "rosalyn a griffiths", "affiliation": "university of sydney"}], "id": 74080386}, {"title": "masculinity and femininity in the divergence of male body image concerns", "year": 2013, "source": "the journal of eating disorders", "authors": [{"name": "stuart b murray"}, {"name": "elizabeth rieger", "affiliation": "australian national university"}, {"name": "lisa karlov", "affiliation": "university of sydney"}, {"name": "stephen touyz", "affiliation": "university of sydney"}], "id": 2764870630}], "ANDS-Grants": [{"description": "Tbe obesity pandemic has been described by leading researchers as a problem out of control, with lifestyle interventions generally resulting in regain of treatment-induced weight losses. The present study will evaluate the effectiveness of motivational enhancement therapy (MET) for both patients and their support partners in helping obese patients to achieve long-term weight losses by sustaining their motivation for making difficult lifestyle changes over time.", "title": "The Effectiveness of Motivational Enhancement Therapy for Obese Patients and Support Partners", "id": "96497", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/632621", "researchers": ["Prof Ian Caterson", "A/Pr Elizabeth Rieger", "Prof Janet Treasure"], "status": "closed", "fundingAmount": 547644.44, "fundingScheme": "Project Grants", "startDate": 2010, "endDate": 2013, "dateTimeModified": "2016-05-16T09:54:31Z", "dateTimeCreated": "2013-05-15T05:57:34Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["A/Pr Elizabeth Rieger"], "purl": "http://purl.org/au-research/grants/nhmrc/632621", "identifiers": ["http://purl.org/au-research/grants/nhmrc/632621", "632621"], "subjects": ["Health, Clinical and Counselling Psychology", "PSYCHOLOGY AND COGNITIVE SCIENCES", "PSYCHOLOGY", "behavioural intervention", "body weight regulation", "lifestyle factors", "obesity", "randomised controlled trial", "behavioural stages of change", "health outcomes", "lifestyle"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/96497"}]}]}