{"ANU": {"name": "Elizabeth Beckmann", "link": "https://researchers.anu.edu.au/researchers/beckmann-ea", "colleges": "College of Science", "email": "elizabeth.beckmann@anu.edu.au", "phone": "", "expertise": ["Higher Education", "Educational Technology And Computing", "Environmental Education And Extension", "Other Education", "Teacher Education And Professional Development Of Educators"], "interest": ["Professional recognition of university educatorsTechnology-enhanced learningAuthentic and research-led learning"], "biography": "", "project": [], "publication": [{"title": "Leadership through fellowship: distributed leadership in a professional recognition scheme for university educators", "year": "2017", "source": "Journal of Higher Education Policy and Management, vol. 39, no. 2, pp. 155-168pp", "authors": ["Elizabeth Beckmann"]}, {"title": "Teaching excellence: Recognising the many as well as the few", "year": "2016", "source": "39th HERDSA Annual International Conference 2016, Higher Education Research and Development Society of Australasia (HERDSA), Hammondville, Australia, pp. 13-22pp", "authors": ["Elizabeth Beckmann"]}, {"title": "The evolution and evaluation of an online role play through design-based research", "year": "2016", "source": "Australasian Journal of Educational Technology, vol. 32, no. 5, pp. 35-47", "authors": ["Elizabeth Beckmann"]}, {"title": "The Doubters", "year": "2016", "source": "DilemmaANU Press, Canberra. 210 pages. https://press.anu.edu.au/publications/doubters-dilemma", "authors": ["Martin M", "Jansen L", "Elizabeth Beckmann"]}, {"title": "The plant detectives: Innovative undergraduate teaching to inspire the next generation of plant biologists", "year": "2015", "source": "Frontiers in Plant Science, vol. 6, no. 729, pp. 1-7", "authors": ["Elizabeth Beckmann", "Estavillo G", "Mathesius U"]}, {"title": "Leadership through Fellowship: professional recognition as a pathway to improving scholarship of teaching and learning in Australian universities", "year": "2015", "source": "The 12th annual conference of the International Society for the Scholarship of Teaching and Learning, ed. Conference organising committee, Monash University, Melbourne, p. 56", "authors": ["Elizabeth Beckmann"]}, {"title": "Global Impact: Professional Recognition as an influence on the Quality of University Teaching", "year": "2014", "source": "Higher Education Research Group Adelaide HERGA 2014, ed. T. Wanner, Conference Organising Committee, Adelaide, p. 43", "authors": ["Elizabeth Beckmann"]}, {"title": "Why I am still here: The Resilience of Women Research Students", "year": "2014", "source": "Quality in Postgraduate Research (QPR 2014), ed. Michelle Picard, Alistair McCulloch, QPR - Quality in Postgraduate Research, Adelaide, p. 198", "authors": ["Elizabeth Beckmann"]}, {"title": "How mobile learning facilitates student engagement: A case study from the teaching of Spanish", "year": "2013", "source": "in  Berge, Z.L. & Muilenburg, L. Y. (ed.), Handbook of Mobile Learning, Routledge, Taylor & Francis Group, New York, USA and Abingdon, UK, pp. 534-544", "authors": ["Elizabeth Beckmann", "Martin M"]}, {"title": "Medical science in the workplace: A course alternative to work placements", "year": "2013", "source": "Focus on Health Professional Education, vol. 15, no. 1, pp. 90-92", "authors": ["Ferru I", "Elizabeth Beckmann"]}, {"title": "Softly, softly: introducing research-led education into a successful first year course.", "year": "2013", "source": "Australian Conference on Science and Mathematics Education, ed. Sharma, M. & Yeung, A., The University of Sydney, Sydney, pp. 115-121", "authors": ["Beckman J", "Ferru I", "Elizabeth Beckmann"]}, {"title": "Internships in museum studies: learning at the interface", "year": "2013", "source": "in Anne Boddington, Jos Boys and Catherine Speight (ed.), Museums and Higher Education Working Together:\r\nChallenges and Opportunities, Ashgate Publishing Ltd, Farnham, Surrey, UK", "authors": ["Elizabeth Beckmann"]}, {"title": "Designing", "year": "2012", "source": "implementing and evaluating a consultancy approach to teaching environmental management to undergraduatesInternational Research in Geographical and Environmental Education, vol. 21, no. 1, pp. 71-92", "authors": ["Beavis S", "Elizabeth Beckmann"]}, {"title": "community of opinion and debate: Postgraduate students", "year": "2012", "source": "reactions to compulsory online discussions'in Guus Wijngaards & Kathryn Moyle (ed.), Student Reactions to Learning with Technologies: Perceptions and Outcomes, Information Science Reference, United States, pp. 69-90", "authors": ["Elizabeth Beckmann"]}, {"title": "Simulating Immersion: Podcasting in Spanish Teaching", "year": "2011", "source": "in Betty Facer & Mohammed Abdous (ed.), Academic Podcasting and Mobile Assisted Language Learning: Applications and Outcomes, Information Science Reference, Hershey New York, pp. 111-131", "authors": ["Martin M", "Elizabeth Beckmann"]}, {"title": "Internships: students and collections", "year": "2010", "source": "Museums Australian National Conference 2010, Museums Australia, web, pp. 136-141", "authors": ["Peoples S", "Elizabeth Beckmann", "Message K"]}, {"title": "Learners on the move: mobile modalities in development studies", "year": "2010", "source": "Distance Education, vol. 31, no. 2, pp. 159-173", "authors": ["Elizabeth Beckmann"]}, {"title": "Transnational postgraduate study for development workers: using technology to bridge the gap", "year": "2010", "source": "in Siran Mukerji & Purnendu Tripathi (ed.), Cases on Technological Adaptability and Transnational Learning: Issues and Challenges, IGI Global Publishing, Hershey, USA, pp. 103-122", "authors": ["Elizabeth Beckmann", "Kilby P"]}, {"title": "Internships in Museum Studies: Teaching and learning at the interface. Paper presented at Learning at the interface: Museum and university collaborations", "year": "2010", "source": "1-2 July 2010Sackler Centre for Arts Education, Victoria and Albert Museum, London.", "authors": ["Elizabeth Beckmann"]}, {"title": "Skilful methods can achieve what power cannot: Flexible Delivery of Sanskrit at the Australian National University as a Model for Small-enrolment Languages", "year": "2009", "source": "Electronic Journal of Foreign Language Teaching, vol. 6, no. 1, pp. 245-253", "authors": ["Taylor M", "Elizabeth Beckmann"]}, {"title": "On-line, Off-campus but in the Flow: Learning from Peers in Development Studies", "year": "2008", "source": "Australasian Journal of Peer Learning, vol. 1, pp. 61-69", "authors": ["Elizabeth Beckmann", "Kilby P"]}, {"title": "So, what happened in Kabul today? -Flexible Learning in Conflict and Social Justice Programs at the Australian National University", "year": "2008", "source": "Pan-Commonwealth Forum on Open Learning 2008, ed. Conference Program Committee, Conference Organising Committee, London UK, p. 6", "authors": ["Kilby P", "Elizabeth Beckmann"]}, {"title": "Listening between the lines: using research-based knowledge to support the development of interpretive text", "year": "2003", "source": "in Black, R. & Weiler, B. (ed.), Interpreting the Land Downunder: Australian Heritage Interpretation and Tour Guiding, Fulcrum Books, Golden, Colorado", "authors": ["Elizabeth Beckmann"]}, {"title": "Evaluation of dingo education strategy and programs for Fraser Island; and Literature Review - Communicating to the public about potentially dangerous wildlife in natural settings", "year": "2003", "source": "Queensland GovernmentBrisbane, Queensland", "authors": ["Savage G", "Elizabeth Beckmann"]}]}, "Microsoft-Academic": [{"title": "targeted interpretation exploring relationships among visitors motivations activities attitudes information needs and preferences", "year": 1998, "source": "", "authors": [{"name": "roy ballantyne"}, {"name": "jan packer"}, {"name": "elizabeth beckmann"}]}, {"title": "heinz oeser lecture where would the field of computer assisted radiology and surgery be without sir godfrey hounsfield", "year": 2005, "source": "", "authors": [{"name": "elizabeth beckmann"}, {"name": "stephen j golding", "affiliation": "university of oxford"}]}, {"title": "fellowship as resistance how women educators in higher education benefit from international professional recognition", "year": 2019, "source": "", "authors": [{"name": "elizabeth beckmann"}]}, {"title": "interpretation in environmental education an introduction to the papers in this issue", "year": 1996, "source": "australian journal of environmental education", "authors": [{"name": "elizabeth beckmann"}, {"name": "pat devlin", "affiliation": "lincoln university"}, {"name": "stephen wearing"}], "id": 2764670897}, {"title": "surgeons face growing need to interpret images", "year": 2008, "source": "", "authors": [{"name": "elizabeth beckmann"}]}, {"title": "interpretation during a school visit to a nature reserve", "year": 1988, "source": "australian journal of environmental education", "authors": [{"name": "elizabeth beckmann", "affiliation": "university of new england"}], "id": 2764670897}], "ANDS-Grants": []}