{"ANU": {"name": "Emilie Dotte", "link": "https://researchers.anu.edu.au/researchers/dotte-emj", "colleges": "College of Arts and Social Sciences", "email": "Emilie.Dotte@anu.edu.au", "phone": "+61 2 6125 3775", "expertise": ["Archaeological Science", "Archaeology Of New Guinea And Pacific Islands Excl. New Zealand", "Pacific History Excl. New Zealand And Maori", "Quaternary Environments"], "interest": ["Main research interests and areas of expertise:Relationships between Francophone and Anglophone traditions in Pacific ArchaeologyHistoriography and Epistemology of Francophone traditions in the Archaeology of the Pacific IslandersInter-relations between Ethnology and Archaeology in the PacificPrecolonial, contacts and early colonial periods in the Pacific Islands - the interface between indigenous oral traditions, ethnohistorical, historical and archaeological sourcesNew Caledonia and French Polynesia archaeology (including environmental archaeology)Arboriculture and the hisotry of people, plants and forests in the Pacific IslandsOceania indigenous perceptions of the \"environment\" in relation to the western concepts of wild/domesticated plants or nature/culture, and their uses in interpretation of archaeobotanical/palaeoenvironmental dataThe development of anthracology in Oceania archaeology - from arid Australia to tropical Pacific Islands (including through supervision of students' research projects)"], "biography": "Emilie recently joined the ANU as a Postdoctoral Research Fellow within Prof. Matthew Spriggs's ARC Laureate Project \"The Collective Biography of Archaeology in the Pacific - a Hidden History\".", "project": ["As part of the ARC Laureate Project \"The Collective Biography of Archaeology in the Pacific - a Hidden Histor\", Emilie is investigating the development of Francophone literature and traditions in Pacific scholarship.", "This project seeks to better understand the distinct historiography and epistemology of the Francophone tradition of archaeology in the Pacific. It also aims at investigating the relations between the over-represented Anglophone research and the more discrete Francophone one, from co-ignorance to co-influences and the creation of particular partnerships between researchers; to examine their role in the development of current narratives, practices and concepts in Pacific Archaeology.", "Emilie maintains an interest in archaeobotany projects she has launched with international collaborators in the Pacific and Australia.", ""], "publication": [{"title": "rchaeobotany of Aboriginal plant foods during the Holocene at Riwi, south central Kimberley, Western Australia [IN PRESS]", "year": "2019", "source": "Vegetation History and Archaeobotany, vol. Online", "authors": ["Dilkes-Hall I", "Balme J", "O'Connor S", "Emilie Dotte"]}, {"title": "Lapita before Lapita: the early story of the Meyer/O", "year": "2019", "source": "Reilly Watom Island archaeological collection'Journal of Pacific History, vol. 54, no. 3, pp. 354-378", "authors": ["Emilie Dotte", "Howes H"]}, {"title": "Home Is Where the Hearth Is: Anthracological and Microstratigraphic Analyses of Pleistocene and Holocene Combustion Features, Riwi Cave (Kimberley, Western Australia)", "year": "2018", "source": "Journal of Archaeological Method and Theory, vol. 25, no. 3, pp. 739-776", "authors": ["Whitau R", "Vannieuwenhuyse D", "Emilie Dotte"]}, {"title": "Wood charcoal analysis in tropical rainforest: a pilot study identifying firewood used at toxic nut processing sites in northeast Queensland, Australia [IN PRESS]", "year": "2018", "source": "Vegetation History and Archaeobotany, vol. online, pp. 1-23", "authors": ["King F", "Emilie Dotte"]}, {"title": "ncient woodlands of Polynesia: A pilot anthracological study on Maupiti Island, French Polynesia", "year": "2017", "source": "Quaternary International, vol. 457: 6-28. http://dx.doi.org/10.1016/j.quaint.2016.10.03", "authors": ["Emilie Dotte", "Kahn J"]}, {"title": "Evidence of forest management and arboriculture from wood charcoal data: an anthracological case study from two New Caledonia Kanak pre-colonial sites", "year": "2016", "source": "Vegetation History and Archaeobotany, vol. -, no. -, pp. 1-17. First Online: doi:10.1007/s00334-016-0580-", "authors": ["Emilie Dotte"]}, {"title": "Book Review: Unearthing the Polynesian Past: explorations and adventures of an island archaeologist", "year": "2017", "source": "Journal of Pacific History, vol. 52, no. 1, pp. 119-120", "authors": ["Emilie Dotte"]}, {"title": "How Dare Our", "year": "2017", "source": "Prehistoric' Have a Prehistory of Their Own?! The interplay of historical and biographical contexts in early French archaeology of the Pacific.'Journal of Pacific Archaeology, vol. 8, no. 1, pp. 25-34pp", "authors": ["Emilie Dotte"]}, {"title": "Book Review: Tupaia. Le pilote polynesien du capitaine Cook", "year": "2016", "source": "Journal of the Societe des Oceanistes (Journal de la societe des oceanistes/Journal societe des oceanistes), vol. 142-143, pp. 150-152", "authors": ["Emilie Dotte"]}, {"title": "The lost art of stratigraphy? A consideration of excavation strategies in Australian indigenous archaeology", "year": "2016", "source": "Australian Archaeology, vol. 82, no. 3, pp. 263-274", "authors": ["Ward I", "Winter S", "Emilie Dotte"]}, {"title": "The settlement at Barmup: Britain", "year": "2016", "source": "s first farm in Western Australia'Australasian Historical Archaeology, vol. 34, pp. 34-43pp", "authors": ["Winter S", "Forsey C", "Emilie Dotte"]}, {"title": "Human Ecodynamics in the Mangareva Islands: A stratified Sequence from Nenega-Iti Rock Shelter (site AGA-3, Agakauitai Island)", "year": "2015", "source": "Archaeology in Oceania, vol. 50, no. 1, pp. 23-42", "authors": ["Kirch P", "Molle G", "Nickelsen C", "Emilie Dotte"]}, {"title": "Mid- to late Holocene landscape change and anthropogenic transformations on Mo", "year": "2015", "source": "oreaSociety Islands: a multi-proxy approach', Holocene, vol. 25, no. 2, pp. 333-347", "authors": ["Kahn J", "Nickelsen C", "Stevenson J", "Emilie Dotte"]}, {"title": "Not Just Carbon : assessment and prospects for the application of anthracology in Oceania", "year": "2015", "source": "Archaeology in Oceania, vol. 50, no. 01, pp. 01-22", "authors": ["Emilie Dotte", "Carah X", "Byrne C"]}, {"title": "Landscape Change, Settlement Histories and Agricultural Practices on Maupiti, Society Islands.", "year": "2015", "source": "Journal of Island & Coastal Archaeology, vol. 10, no. 3, pp. 363-391", "authors": ["Kahn J", "Emilie Dotte", "Molle G"]}, {"title": "Plant Remains", "year": "2013", "source": "in Jane Balme and Alistair Paterson (ed.), Archaeology in Practice: A Student Guide to Archaeological Analyses, Blackwell Publishing Ltd, Oxford, UK, pp. 336-360", "authors": ["Beck W", "Emilie Dotte"]}, {"title": "Charcoals as indicators of ancient tree and fuel strategies: An application of anthracology in the Australian Midwest", "year": "2013", "source": "Australian Archaeology, vol. 77, pp. 94-106", "authors": ["Byrne C", "Emilie Dotte", "Winton V"]}, {"title": "Of Charcoals and Forests: Results and Perspectives from an Archaeobotanical Investigation of Precolonial Kanak Settlement Sites in New Caledonia", "year": "2013", "source": "Pacific Archaeology: Documenting the Past 50,000 years. papers from the 2011 Lapita Pacific Archaeology Conference, ed. Glenn R. Summerhayes & Hallie Buckley, University of Otago, Dunedin, pp. 120-137", "authors": ["Emilie Dotte", "Ouetcho A", "Bole J"]}, {"title": "rcheogeography and pre-contact territorial processes in Northern Grande Terre\r\n(New Caledonia)", "year": "2013", "source": "(in French), Journal de la Societe des Oceanistes, no. 136-137, pp. 195-207", "authors": ["Emilie Dotte", "Sand C", "Bole J"]}, {"title": "The Ancestor Wood - trees, forests and Kanak pre-colonial spatial occupation in New Caledonia", "year": "2012", "source": "s Grande Terre : case study and anthracological approach in the Tiwaka valley' (in French)in Frederic Angleviel (ed.), La Melanesie, l'Harmattan, Paris France, pp. 133-154", "authors": ["Emilie Dotte"]}, {"title": "Perspectives on Pre-Colonial Human Introduction of Woody and forest Species in the Pacific Islands: Prospective Ethno-Anthracological Research in New Caledonia", "year": "2010", "source": "2007 - VII International Conference on Easter Island and the Pacific: Migration, Identity and Cultural Heritage, ed. Paul Wallin, Hele Martinsson-Wallin, Gotland University Press, Gotland Sweden, pp. 431-454", "authors": ["Emilie Dotte", "Sand C", "Bole J"]}, {"title": "Management and Integration within precolonial kanak territories of vegetation ressources. Ethno-archaeo-anthracological approach in New-Caledonia", "year": "2010", "source": "(in French)in Theopane Nicolas, Aurelie Salavert (ed.), Territoires et Economies, Publications de la Sorbonne, Paris France, pp. 155-189", "authors": ["Emilie Dotte"]}]}, "Microsoft-Academic": [{"title": "le bois ancetre arbres forets et occupation kanak precoloniale sur la grande terre de nouvelle caledonie etude de cas et apporche anthracologique dans la vallee de la tiwaka nord est the ancestor wood trees forests and precolonial kanak settlement on new caledonia grand terre an anthracological case study in the tiwaka valley north eastern grand terre", "year": 2012, "source": "", "authors": [{"name": "emilie dotte"}]}, {"title": "modes d exploitation et d integration au sein des territoires kanak precoloniaux des ressources vegetales forestieres iie millenaire ap j c", "year": 2010, "source": "", "authors": [{"name": "emilie dotte"}]}], "ANDS-Grants": []}