{"ANU": {"name": "Erica Seccombe", "link": "https://researchers.anu.edu.au/researchers/seccombe-ej", "colleges": "College of Arts and Social Sciences", "email": "erica.seccombe@anu.edu.au", "phone": "61258930", "expertise": ["Visual Arts And Crafts", "Art Theory And Criticism"], "interest": ["Printmedia & DrawingContemporary Practices in Art & DesignInterdisciplinary Practice-Led ResearchScience and Technology"], "biography": "Notably, Erica's work 'Metamorphosis' 2016, won the 2018 Waterhouse Natural Science Art prize; In 2017 Erica was awarded the Capital Arts Patrons Fellowship, and in 2015 her work, 'Virtual Life' 2014 won the Inaugural Paramor Prize: Art + Innovation Casula Powerhouse Art Centre, Liverpool, NSW", "project": ["Solo Exhibitions", "2019 - BIG PINK, Gallerie Pompom, Sydney, 30 October - 24 November.2017 - The Lady Botanist, Megalo Print Studio & Gallery, Canberra, 6-31 April", "2016 - Out of Season, ANU School of Art Gallery (2/2016 Visual Arts Graduate Season) 7-15 October", "2016 - Metamorphosis, Brenda May Gallery, Dank St, Waterloo, Sydney. 9 July – 4 Aug.", "2013 - Science Fiction, Canberra Contemporary Art Space, Curated by David Broker, 16 Aug – 16 Sep", "2008 - Nanoplastica, 23 May - 5 July, Canberra Contemporary Art Space, Gormon House, Canberra, ACT", "International exhibitions", "2019 - Boundless Objects, Curated by Monika Bakke, Centro de Arte e Cultura, Evora, Portugal, October 12, 2019 - March 29, 2020", "2015 - Aesthetics of Manufacture, Sheffield Design Week, Butcher Works Galley, UK, curated by Carle Baugh, Sheffield, UK. 13-20 June. http://www.galvanizesheffield.org/events/aesthetics-of-manufacture-2015/", "2014 - Tomography for Scientific Advancement, highly commended finalist, Natural History Museum London, UK,", "2012 - Time & Vision, Curated by Paul Bayley, 20 years Australia Council for the Arts London Studio Residency Exhibition, Barge House, London, 20 Oct – 11 Nov", "2012 - Nanoplastica, So far The Future, London, UK 21-23 June (solo)", "2006 - Super Natural, with Alison Munro. Alsager Art Centre, Faculty of Performing and Visual Arts Manchester University, Cheshire, UK.", "2003 - A Borderless State, the Miskolci Galleria, Prague, curator Dr Paul Thirkell, Centre for Fine Print Research, University of West England.", "Curated Exhibitions", "2019 - Baldessin Press - The Story, curated by Baldessin Press, Monsalvat, Victoria,  25 July - 15 September", "2019 - Promised the Moon, curated by Dr Ursula K Frederick, an ARC Discovery Early Career Researcher Award Fellow at the School of Archaeology & Anthropology and School of Art & Design. SOAD Gallery, 20 June - 27 July.", "2019 - Plant + Human, curated by Allison Holland, Australian Centre for Photography, 15 Feb - 27 April.", "2018 - The Art and Consequence of Collaboration. Curated by Jonathan Parsons - Artistic Director - Experimenta, for Spectra 2018 presented by Australian Network for Art and Technology (ANAT) with University of South Australia and Experimenta Media Arts, and support from Arts South Australia. Location: South Australian School of Art Gallery (SASA Gallery), University of South Australia, Adelaide. Exhibition Dates: 4 – 26 October 2018. Travelling to UTS Gallery, 2019.", "2018, Image(in)ing, Ewart Art Gallery, Sydney, curated by Jane Theau, 27 February - 17 March", "2017 - Backyards, curated by Waratah Lahy and Anne-Marie Jean, May Space Sydney, 19 September to 7 October", "2016 - Contour 556: interventions in the landscape, curated by Neil Hobbs, Public Art Festival 22 Oct - 13 Nov", "2016 - Notfair: Sign O’ the Times, curated by Kirsten Rann, 16-21 August 2016, 524 Flinders St, Melbourne.", "2015 - Light Speculation, The Carlton Connect Initiative, The University of Melbourne, curated by Dr Renee Beale, 23 July - 9 Sept. http://carltonconnect.com.au/light-speculation/erica-seccombe/", "2014 - A zone of Living things, Dominik Mersche Gallery, Rushcutters Bay, Sydney, 8-31May", "2013 - Think it, make it share it,  RiAus, The Science Exhange. Adelaide. SALA Festival, Curated by ANAT, 2 August - 30  August 2013", "2013 - Synapse a Selection, Powerhouse Museum, Sydney, 8 June- 14July", "2013 - Bad Girls, Gorman House, Canberra Contemporary Art Space, curated by Annie Doyle Wawrzynaczak, 8 February – 16 March", "2012 - Crossing the Rubicon, with Ellis Hutch, ANCA Studios & Gallery, Dickson, Canberra, 24 October – 4 November", "2011 - Natural Digression,  University of Technology, Sydney 8 March - 12 April.", "2011 - Imitation of Life, Canberra Musuem & Gallery, curated by Deborah Clark", "2011 - Genart_sys | a window on digital culture, Australia Council for the arts, 28 Jan- 16 March URL http://www.genartsys.com/", "2010 - Natural Digression, Level17 Artspace,  Victorian University, 12-23 October, 2010", "2003 - 24/7 Exhibition Home, artsACT public art project in conjunction with ACT housing and ACT Craft. Curated by Barbara McConchie", "2001 - No Muttering, contemporary  printmedia, Ivan Dougherty Gallery, The University of NSW; Gosford  Regional Art Gallery, NSW; The Queensland University of Technology Art Gallery, Brisbane; curator Rilka Oakley.", "2001 - Wild Sheep Chase. Group show of contemporary Print and Photo media. Curated by Patsy Payne and Denise Ferris. CSA Gallery. ANU. ACT.", "2000 - Vacant Possession.  Collaborative Installation with video projection, sound and mixed media.  with Scot Gordon, Cassie McCullagh and Rob Laurie. PROJECT, Centre for  Contemporary Art. Wollongong.", "Selected Finalist", "2018: Waterhouse Natural Science Art Prize, Selected Finalist, South Australian Museum, 8 June - 5 August.", "2018: The 40th Alice Prize. Selected Finalist. Araluen Arts Centre Alice Springs, NT.", "2013 - Fremantle Print Award Exhibition, Fremantle WA 21 September – 17 November", "2012 - The 37th Alice Prize, selected contestant, The Araluen Centre, Alice Springs NT, 11 May - 10 June", "2015:  Inaugural Paramor Prize: Art + Innovation Casula Powerhouse Art Centre, Liverpool, NSW (Winner)", "Screenings", "2013 - This is Not Art Festival Building Projection Screening, Hunter Street, Newcastle, October – November", "2010 - Linear Progressions: where art meets science, (panel selection) curated by QUT Creative Industries, screening at Precinct Parer Place, Kelvin Grove Urban Village screens, selected Screens at Gardens Point & Federation Square, 14th – 22nd August.", "2010 - VIRION, QUT, from 19 July to 1 August 2010, a screen based digital art exhibition that links to public sites across Brisbane, focused in the Kelvin Grove Urban Screen Network http://virion2012.com.au/submission/paro-mental-commitment-robot", "2009 - Oct 19 – Nov 19  Nanoplastica on the Big Screen, Federation Square, Melbourne Central Business District, curator by Melissa Delayney, notes on the underground.", "1996 - Tool2ob Sydney/Berlin First International Virtual Exhibition Screening.  ARTSPACE, Woolloomooloo, curated by Uban Excile, Graham Crawford and Gavyn Lister", "Research Residencies", "2018: Baldessin Press & Studio, St Andrews, Victoria", "2015: Natural History Museum, Imaging and Analysis Center, Micro-CT laboratory, London, June – July", "2006 (ongoing):  Artist in resident, Department of Applied Mathematics, School of  Physics and Engineering, ANU", "2012: Australia Council for the Arts London Studio Residency 14 May – 18 August", "2012: Millennium Seedbank, RBG Kew, Wakehurst Place, West Sussex, UK. 1-14 May", "2010: Plants Under the Microscope, High Resolution Plant Phenomics Centre, CSIRO, 1 October – 30 November", "2007: Megalo Print Studio + Gallery, Artist in Residence + Materials Award, Watson", "2002: Megalo Print Studio + Gallery, Artist in Residence + Materials Award, Hackett", "1994-96: Artist in residence, VisLab, The University of Sydney", "Academic Grants, Scholarships and Awards", "2019: Innovative Research Award, ACUADS Awards 2019.", "2017: Recipient ANU Vice-Chancellor's Teaching Enhancement Grants for Semester 1, 2017, The Open Studio: Supporting Student Learning in Visual Art Settings with Digital Demonstrations. Dr Al Munro (School of Art, Textiles)  and Ms Erica Seccombe (Foundation):.", "2013: Inaugural ANU Vice Chancellor’s College Artist Fellowship Scheme ANU School of Art, EASS Postgraduate Materials Award", "2013: ANU School of Art Materials Award", "2012: HDR Travel Research Field Trip, UK", "2011: Australian Postgraduate Award 2011-14", "2003: ANU School of Art Materials Award.", "1986-87: Northern Territory Government Bachelor of Arts Scholarship (4yrs)", "", "", "Awards, Grants, Scholarhips & Commissions", "2017: artsACT project grant to learn photgravure techniques at Baldessin Press & Studio.", "2017: Capital Arts Patrons Organisation Fellowship. CAPO Fellow 2017.", "2015:  Winner: Inaugural Paramor Prize: Art + Innovation Casula Powerhouse Art Centre, Liverpool, NSW", "2014: artsACT project Grant to take up Artist in Residence, Natural History Museum, London in 2015", "2013: Commission, Centenary of Canberra, Canberra Contemporary Art Space, Science Fiction", "2010: Commission, High Resolution Plant Phenomics Centre, CSIRO, Permanent foyer installation", "2010:  Australia Council for the Arts London Studio Residency - May - August 2012", "2010: Synapse Art Science Collaborations, Australian Network for Art and Technology ANAT, Visiting Fellow, ANU Department of Applied Mathematics", "2009: ArtsACT project grant for 2010 Visiting Fellow, ANU Department of Applied Mathematics", "2007: George Mora Foundation Fellowship - Inaugural short-listed award recipient", "2007: Megalo Print Studio Artist in Residence and Materials Award (Watson Studios)", "2006: ArtsACT grant for 3-month artist in Residence, ANU Department of Applied Maths,", "2005: Craft ACT, Craft-in-site writing grant for unMagazine, issue 5", "2002: Megalo Print Studio Artist in Residence and Materials Award. (Hackett Studios)", "", "", "Public Collections", "2016: Australian War Memorial, Crossing the line, 2016", "2015: Casula Powerhouse Art Centre Permanent Collection. Virtual Life, 2015", "2015: National Gallery of Australia Print Collection, Creaturepede, 2003", "2015: Australian War Memorial, Rosette, 2015", "2014: New Parliament House, Australia, Canberra. Nanoplastica 2008-2014, single channel digital projection installation", "2008: Canberra Museum and Gallery, Nanoplastica 2008, digital projection installation", "2002: National Gallery of Australia, 1994 Partners in Print portfolio, Strange light, 1994, digital image screenprint on paper", "1997: Wagga Wagga Art Gallery permanent Collection, do you read me over? portrait of an astronaut, 1995, digital image, screenprint on paper", "1996: UWS, Macarthur National Printmedia Acquisitive collection, Snake, 1995, digital image screenprint on paper.", "1993: Wollongong University permanent Collection, Mothers, death, 2 worlds and sea things, 1992, linocut on paper.", "", "Presenting at Conferences/Symposia", "2018: Aesthetics, Politics and Histories: The Social Context of Art, AAANZ Conference 2018, December 5-7, 2018, School of Art, RMIT University, Melbourne, Australia", "2018: Imagineers in Circus & Science: Scientific Knowledge & Creative Imagination. ANU Humanties Research Centre, 3-5 April", "2017: ACUADs Conference, ANU School of Art + Design, 28-29 September", "2017: Time, Technologies and the Anthropocene: Asian and Pacific Perspective. ANU College of Asia & the Pacific, 11-12 September", "2016: OzViz, University of Southern Queensland, 1-3 December", "2015: OzViz, University of Technology, Sydney 1-3 December", "2015: The Known World, the 8th Australian Print Symposium, National Gallery of Australia 1-3 May 2015", "2014: ToScA, Tomography for Scientific Advancement, Natural History Museum, London, 1-3 September", "2014: Museum of Contemporary Art, Vivid Festival of ideas, 31 May", "2014: Affective Habitus, (Peer Reviewed) ARC Centre of Excellence for the History of Emotions, Australian National University, 20 June", "2013: AAANZ Conference 2013 – Inter-Discipline. (Peer Reviewed) Panel ‘Art, Environment, Interdisciplinarity: New Perspectives in Australian Art Practice’. Presented by the Australian Centre, Uni of Melbourne, Convened by Chris McAuliffe & Jolanta Nowak, Uni of Melbourne: panellists, Erica Seccombe, Malcolm Bywaters, Amanda Stuart, Janine Burke, 7-9 December.", "2013: Critical Animals, ‘Systematic Wonder’  The Lock Up, Hunter Street, Newcastle, Friday 4 October 3pm", "2013: ISEA 2013, 10-13 June Conference, Panel discussion, ‘Sensation meaning and affect in art/science collaborations’. with Prof. Sue Best, A.Prof Barbara Rauch, Elizabeth Eastlake, Chris Henchke,", "2012: Postgraduate Photography Symposium, at the MCA’s Centre for Creative Learning, 31 August 2012 |", "2012 EVA LONDON 2012 - (Peer Reviewed) Electronic Visualisation and the arts, 10 July - 12 July", "2012: Understanding Interdisciplinarity: Theory and Practice, Sheffield Hallam University, UK m 12 - 14 June", "2011: Animating Time-space symposium Raglan, New Zealand, The University of  Waikato, 30 Sept - 2 October,", "2011: The Art of Fact & Fiction – with Katrina Schlunke amd Lian Loke, UTS Gallery, Thursday 7 April 2011", "2011: 5th World Summit on Arts & Culture Melbourne: The outer limits: How can policy support artists working in the innovation territories at the very edge of our  comprehension? 4 October", "2010: The first International Conference on Transdisciplinary Imaging at the Intersections between Art, Science and Culture. “New Imaging: transdisciplinary strategies for art beyond the new media” 5th – 6th November 2010, Artspace, 43/51 Cowper Wharf Rd, Sydney, NSW 2011.  http://blogs.unsw.edu.au/tiic/.", "2000 Latest Editions, 2001 postgraduate seminar, 24-25 April, ANU School of Art", "", "Documentary, features & interviews", "TED X Canberra. Erica Seccombe, Experiencing Nature in the Fifth Dimension, online Youtube, published 2014", "Beautiful Monster ABC 7.30 Report, 29 September 2013", "Cover, Art Monthly Australia #254, August 2013", "Benson, Tracey M. ‘All about X,O and 1 – an interview with Erica Seccombe, http://mediakult.wordpress.com/2011/09/22/all-about-x-0-and-1-an-interview-with-erica-seccombe/ 2011", "Damien McDermett, 5 Part documentary series, Series 4, featuring Erica Seccombe and Professor Tim Senden, SBS, STVDIO channel, aired DEC 2011, SBS television and Youtube, ‘Artbreak", "From Research to Reality (Season 1, Episode 3) Part 1 of 3, Queensland University of Technology", "", "", "curatorial projects", "2007: RAW: Science week an exhibition showcasing work from the ANU Department of Applied Mathematics, Photography and Digital Arts, ANU, School of art, curator  Erica Seccombe", "2004: Place original face down, an exhibition showcasing 24 Canberra region artists who   use photocopy in their practice, to run concurrently with the National Gallery of Australia National Print Symposium. Curated by Al Munro and Erica Seccombe", "Published articles and essays not yet visible on the Aries database", "Seccombe, E., review, ‘Coral Empire: Underwater Oceans, Colonial Tropics, Visual Modernity, by Anne Elias’, Australian Humanities Review, AHR65, (November 2019)."], "publication": [{"title": "", "year": "2019", "source": "Standing Ceremony", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Offering of Death", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Ritual Thought", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Safe Return", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Purity in Form", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Isabell", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Cassandra", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Talulah", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Roberta", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Jenny", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Fiona", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Sonia", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Tiffany", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Helï¿½ne", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Anna-Maria", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Josephine", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Paloma", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Odessa", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Siobhan", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Valentina", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "BIG PINK", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Fixed Pleasure", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Seraphina", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "Rowanne", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2019", "source": "CELESTIAL BODY: SO NEAR YET SO FAR", "authors": ["Erica Seccombe"]}, {"title": "Review: Coral Empire: Underwater Oceans, Colonial Tropics, Visual Modernity, by Anne Elias", "year": "2019", "source": "Australian Humanities Review, no. 65, pp. 134-137", "authors": ["Erica Seccombe"]}, {"title": "view from the Arboretum", "year": "2018", "source": "Art and Australia, vol. 3, no. 54.2 Unnaturalism, pp. 78-81", "authors": ["Erica Seccombe"]}, {"title": "Christmas Beetle", "year": "2018", "source": "(back)", "authors": ["Erica Seccombe"]}, {"title": "Christmas Beetle", "year": "2018", "source": "(front)", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2017", "source": "Microplastica", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2017", "source": "COMMISSION: ANU RESEARCH SCHOOL OF BIOLOGY 2017", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2017", "source": "In Our Time", "authors": ["Erica Seccombe"]}, {"title": "D X-ray Art", "year": "2015", "source": "Australian Physics, vol. 52, no. 1, pp. 18-22", "authors": ["Erica Seccombe", "Robins V"]}, {"title": "Relocating the real: experiencing nature in the fifth dimension", "year": "2014", "source": "Inter-discipline: AAANZ Conference 2013, Art Association of Australia and New Zealand, Victoria, Australia, pp. 1-15", "authors": ["Erica Seccombe"]}, {"title": "Grow: Visualising Nature at Nanoscale (2012)", "year": "2012", "source": "Electronic Visualisation and the Arts (EVA 2012), BCS Academy eWIC publishing, UK, pp. 49-57", "authors": ["Erica Seccombe"]}, {"title": "Book review: Synthetics: Aspects of Art and Technology in Australia", "year": "2012", "source": "1956-1975 by Stephen Jonespp. 48-49", "authors": ["Erica Seccombe"]}, {"title": "Oz East Ender", "year": "2012", "source": "pp. 44-46pp", "authors": ["Erica Seccombe"]}, {"title": "The Lady Botanist", "year": "2017", "source": "", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2016", "source": "Metamorphosis", "authors": ["Erica Seccombe"]}, {"title": "Crossing the line", "year": "2016", "source": "24.8.1916", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2016", "source": "Rara avis (2016)", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2016", "source": "Out of Season", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2015", "source": "Virtual Life", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2015", "source": "Earth Bound M16 Artspace (2015)", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2015", "source": "Grow: experiencing nature in the fifth dimension", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2015", "source": "Printing time", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2014", "source": "Tomography for Scientific Advancement", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2013", "source": "Collective Unconscious", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2013", "source": "Modern Prometheus (after Shelly)", "authors": ["Erica Seccombe"]}, {"title": "Monster and Modern Prometheus (after Shelly) Canberra Contemporary Art Space (2013)", "year": "2013", "source": "", "authors": ["Erica Seccombe"]}, {"title": "Grow (2013-2015)", "year": "2013", "source": "", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2013", "source": "Monster", "authors": ["Erica Seccombe", "Senden T", "Limaye A"]}, {"title": "", "year": "2013", "source": "Necessary Torture: George. W. Bush", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2013", "source": "Grow: visualising nature at nanoscale (2013)", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2012", "source": "Ocularanagluphos : Existing Work (new representation)", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2012", "source": "Ocularanagluphos II", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2012", "source": "Nanoplastica : Existing Work (new representation)", "authors": ["Erica Seccombe"]}, {"title": "Dawn series", "year": "2012", "source": "Morning seriesFrozen horizon, Midnight series", "authors": ["Murphy K", "Erica Seccombe"]}, {"title": "", "year": "2012", "source": "Constructed Landscape", "authors": ["Erica Seccombe"]}, {"title": "Vault Door", "year": "2012", "source": "Millennium Seed BankRoyal Botanic Gardens, Kew, Wakehurst Place, Sussex, UK, 2012", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2011", "source": "Nanoplastica", "authors": ["Erica Seccombe"]}, {"title": "CT imaging and nature (2011-2014)", "year": "2011", "source": "", "authors": ["Erica Seccombe"]}, {"title": "", "year": "2011", "source": "Grow: visualising nature at Nanoscale (2011)", "authors": ["Erica Seccombe", "Senden T"]}, {"title": "", "year": "2011", "source": "Ocularanagluphos", "authors": ["Erica Seccombe"]}]}, "Microsoft-Academic": [{"title": "grow visualising nature at nanoscale", "year": 2012, "source": "", "authors": [{"name": "erica seccombe", "affiliation": "australian national university"}]}, {"title": "purity in form", "year": 2019, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "oz east ender", "year": 2012, "source": "art monthly australia", "authors": [{"name": "erica seccombe"}], "id": 2764719320}, {"title": "synthetics aspects of art and technology in australia 1956 1975 book review", "year": 2012, "source": "art monthly australia", "authors": [{"name": "erica seccombe"}], "id": 2764719320}, {"title": "offering of death", "year": 2019, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "in our time", "year": 2017, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "celestial body so near yet so far", "year": 2020, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "grow experiencing nature in the fifth dimension", "year": 2016, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "christmas beetle back", "year": 2018, "source": "", "authors": [{"name": "erica seccombe"}]}, {"title": "christmas beetle front", "year": 2018, "source": "", "authors": [{"name": "erica seccombe"}]}], "ANDS-Grants": []}