{"ANU": {"name": "Evan Kidd", "link": "https://researchers.anu.edu.au/researchers/kidd-ej", "colleges": "College of Health & Medicine", "email": "evan.kidd@anu.edu.au", "phone": "", "expertise": ["Psychology", "Linguistics", "Linguistic Processes Incl. Speech Production And Comprehension"], "interest": ["Psycholinguistics (Language Acquisition & Language Processing); Developmental Psychology; Social Cognition."], "biography": "My research is in psycholinguistics and developmental psychology. My current research interests include sentence processing in children and adults, the acquisition of complex sentences, the acquisition of verb argument structure and verbal morphology, how children deal with lexical and syntactic ambiguity in acquisition, and the role of symbolic play in language and socio-cognitive development. I conduct research on a number of languages, including English, German, Italian, Finnish, Cantonese, and Persian.", "project": ["Current Grants", "2014 - 2021: ARC Centre of Excellence for the Dynamics of Language ($AUD28 million).", "Past grants", "2012: Our Aussie Lingo: How and Why we use Australian Diminutives (Funding Body: Australian Geographic: $AUD1771). Nenagh Kemp (UTas) & Evan Kidd (ANU).", "2012 – 2013: Language socialisation and the transmission of Qaqet Baining (Papua New Guinea): Towards a documentation project. (Funding body: Endangered Languages Documentation Project (UK): £8406). Birgit Helliwig (La Trobe) & Evan Kidd (ANU).", "2010 – 2012: Language processing in children with high functioning autism: Evidence from eye tracking. (Funding body: ARC, $AUD150K). Edith Bavin (La Trobe), Cheryl Dissanayake (La Trobe), Evan Kidd (ANU), Margot Prior (UMelb).", "2008 – 2011: Charles La Trobe Research Fellowship, La Trobe University ($AUD 250K).", "2007 – 2009: Investigating the memory systems that support the acquisition of morphology: evidence from Finnish (Funding body: ESRC: £93K). (CI: Evan Kidd).", "2007 – 2008: Investigating the memory systems responsible for syntactic priming during language acquisition. (Funding body: The Nuffield Foundation: £6, 440). (CI: Evan Kidd).", "2006 – 2007: The influence of readers’ goals on the online construction and updating of situation models. (CIs: Andrew Stewart, Evan Kidd, ESRC, £39K).", "2006 – 2007: What exactly do preferential looking studies measure? Eye-tracking as a more sensitive measure of young children’s knowledge of argument structure. (Funding body: The Royal Society, £15K). (CI: Evan Kidd).", "2006: An investigation of the memory mechanisms underlying the acquisition of past tense morphology (Funding body: The British Academy, £6, 777). (CI: Evan Kidd, co-applicant: Jarrad  Lum).", "2006: Leonardo da Vinci travel grant to support fieldwork in Romania (£1485.62)."], "publication": [{"title": "Four-year-old Mandarin-speaking children", "year": "2020", "source": "s online comprehension of relative clauses'Cognition, vol. 196", "authors": ["Yang W", "Chan A", "Chang F", "Evan Kidd"]}, {"title": "Bliss is blue and bleak is grey: Abstract word-colour associations influence objective performance even when not task relevant", "year": "2020", "source": "Acta Psychologica, vol. 206, no. Online, pp. -", "authors": ["Goodhew S", "Evan Kidd"]}, {"title": "Individual differences in lexical processing efficiency and vocabulary in toddlers: A longitudinal investigation", "year": "2020", "source": "Journal of Experimental Child Psychology, vol. 192", "authors": ["Donnelly S", "Evan Kidd"]}, {"title": "Individual Differences in First Language Acquisition", "year": "2020", "source": "Annual Review of Linguistics\r\n, vol. 6, pp. 319-340", "authors": ["Evan Kidd", "Donnelly S"]}, {"title": "Mandarin-English speaking bilingual and Mandarin speaking monolingual children", "year": "2019", "source": "s comprehension of relative clauses'Applied Psycholinguistics, vol. 40, no. 4, pp. 933-964", "authors": ["Tsoi Y", "Yang W", "Chan A", "Evan Kidd"]}, {"title": "Gestures and Words in Naming: Evidence From Crosslinguistic and Crosscultural Comparison", "year": "2019", "source": "Language Learning: a journal of research in language studies, vol. 69, no. 3, pp. 709-746", "authors": ["Cattani A", "Floccia C", "Evan Kidd"]}, {"title": "The spatial mapping of concepts in English and Mandarin", "year": "2019", "source": "Journal of Cognitive Psychology, vol. 31, no. 7, pp. 703-724", "authors": ["Wu Q", "Evan Kidd", "Goodhew S"]}, {"title": "critical period for faces: Other-race face recognition is improved by childhood but not adult social contact", "year": "2019", "source": "Scientific Reports, vol. 9, no. 0", "authors": ["McKone E", "Wan L", "Pidcock M", "Evan Kidd"]}, {"title": "Individual Differences in Infant Speech Segmentation: Achieving the Lexical Shift", "year": "2018", "source": "Infancy, vol. 23, no. 6, pp. 770-794pp", "authors": ["Evan Kidd", "Junge C", "Spokes T"]}, {"title": "Individual Differences in Language Acquisition and Processing", "year": "2018", "source": "Trends in Cognitive Sciences, vol. 22, no. 2, pp. 154-169pp", "authors": ["Evan Kidd", "Donnelly S", "Christiansen M"]}, {"title": "The development of fast-mapping and novel word retention strategies in monolingual and bilingual infants", "year": "2018", "source": "Developmental Science, vol. 21, no. 6, pp. 11pp", "authors": ["Kalashnikova M", "Escudero P", "Evan Kidd"]}, {"title": "The relationship between symbolic play and language acquisition: A meta-analytic review", "year": "2018", "source": "Developmental Review, vol. 49, pp. 121-135pp", "authors": ["Quinn S", "Donnelly S", "Evan Kidd"]}, {"title": "Four-year-old Cantonese-speaking children", "year": "2018", "source": "s online processing of relative clauses: a permutation analysis'Journal of Child Language, vol. 45, no. 1, pp. 174-203", "authors": ["Chan A", "Yang W", "Chang F", "Evan Kidd"]}, {"title": "Language use statistics and prototypical grapheme colours predict synaesthetes", "year": "2017", "source": "and non-synaesthetes' word-colour associations'Acta Psychologica, vol. 173, pp. 73-86pp", "authors": ["Goodhew S", "Evan Kidd"]}, {"title": "Priming the Comprehension of German Object Relative Clauses", "year": "2017", "source": "Language Learning and Development, vol. 13, no. 3, pp. 1-21pp", "authors": ["Brandt S", "Nitschke S", "Evan Kidd"]}, {"title": "How do language-specific characteristics affect the acquisition of different relative clause types? Evidence from Finnish", "year": "2017", "source": "Journal of Child Language, vol. 44, no. 1, pp. 120-157", "authors": ["Kirjavainen M", "Evan Kidd", "Lieven E"]}, {"title": "The Effect of Steiner, Montessori, and National Curriculum Education Upon Children", "year": "2017", "source": "s Pretence and Creativity'Journal of Creative Behavior, vol. 51, no. 1, pp. 20-34", "authors": ["Kirkham J", "Evan Kidd"]}, {"title": "Individual Differences in Statistical Learning Predict Children", "year": "2016", "source": "s Comprehension of Syntax'Child Development, vol. 87, no. 1, pp. 184-193", "authors": ["Evan Kidd", "Arciuli J"]}, {"title": "Online processing of sentences containing noun modification in young children with high-functioning autism", "year": "2016", "source": "International Journal of Language and Communication Disorders, vol. 51, no. 2, pp. 137-147", "authors": ["Bavin E", "Prendergast L", "Evan Kidd"]}, {"title": "Language, Culture, and Group Membership: An Investigation Into the Social Effects of Colloquial Australian English", "year": "2016", "source": "Journal of Cross-Cultural Psychology, vol. 47, no. 5, pp. 713-733", "authors": ["Evan Kidd", "Kemp N", "Kashima E"]}, {"title": "The conceptual cueing database: Rated items for the study of the interaction between language and attention", "year": "2016", "source": "Behavior Research Methods, vol. 48, no. 3, pp. 1004-1007", "authors": ["Goodhew S", "Evan Kidd"]}, {"title": "Young children with ASD use lexical and referential information during on-line sentence processing", "year": "2016", "source": "Frontiers in Psychology, vol. 7, no. 171, pp. 171-171", "authors": ["Bavin E", "Evan Kidd", "Prendergast L"]}, {"title": "n investigation into the effect of play-based instruction on the development of play skills and oral language", "year": "2016", "source": "Journal of Early Childhood Research, vol. 14, no. 4, pp. 389-406pp", "authors": ["Stagnitti K", "Bailey A", "Stevenson E", "Evan Kidd"]}, {"title": "Shared abstract representation of linguistic structure in bilingual sentence comprehension", "year": "2015", "source": "Psychonomic Bulletin & Review, vol. 22, no. 4, pp. 1062-1067", "authors": ["Evan Kidd", "Tennant E", "Nitschke S"]}, {"title": "The ubiquity of frequency effects in first language acquisition", "year": "2015", "source": "Journal of Child Language, vol. 42, no. 2, pp. 239-273", "authors": ["Ambridge B", "Evan Kidd", "Rowland C"]}, {"title": "Incorporating learning into theories of parsing", "year": "2015", "source": "Linguistic Approaches to Bilingualism, vol. 5, no. 4, pp. 487-493", "authors": ["Evan Kidd"]}, {"title": "Indigenous children", "year": "2015", "source": "s language: Acquisitionpreservation and evolution of language in minority contexts', First Language, vol. 35, no. 4-5, pp. 279-285", "authors": ["Kelly B", "Evan Kidd", "Wigglesworth G"]}, {"title": "Cross-linguistic influence in simultaneous Cantonese-English bilingual children", "year": "2015", "source": "s comprehension of relative clauses'Bilingualism: Language and Cognition, vol. 18, no. 3, pp. 438-452", "authors": ["Evan Kidd", "Chan A", "Chiu J"]}, {"title": "Resumptive elements aid comprehension of object relative clauses: Evidence from Persian", "year": "2014", "source": "Journal of Child Language, vol. 41, no. 4, pp. 937-948", "authors": ["Rahmany R", "Marefat H", "Evan Kidd"]}, {"title": "Severity of Autism is Related to Children", "year": "2014", "source": "s Language Processing'Autism Research, vol. 7, no. 6, pp. 687-694", "authors": ["Bavin E", "Evan Kidd", "Prendergast L"]}, {"title": "Language and Culture", "year": "2014", "source": "in Thomas M Holtgraves (ed.), The Oxford handbook of Language and Social Psychology, Oxford University Press, New York, pp. 46-61", "authors": ["Kashima Y", "Kashima E", "Evan Kidd"]}, {"title": "The effect of linguistic nativeness on structural priming in comprehension", "year": "2014", "source": "Language, Cognition and Neuroscience, vol. 29, no. 5, pp. 525-542", "authors": ["Nitschke S", "Serratrice L", "Evan Kidd"]}, {"title": "Why is the sunny side always up? Explaining the spatial mapping of concepts by language use", "year": "2014", "source": "Psychonomic Bulletin & Review, vol. 21, no. 5, pp. 1287-1293", "authors": ["Goodhew S", "Sinclair B", "Evan Kidd"]}, {"title": "Concurrent and longitudinal relationships between development in graphic, language and symbolic play domains from the fourth to the fifth year", "year": "2013", "source": "Infant and Child Development, vol. 22, no. 3, pp. 297-319", "authors": ["Kirkham J", "Stewart A", "Evan Kidd"]}, {"title": "ssociations among play, gesture and early spoken language acquisition", "year": "2013", "source": "First Language, vol. 33, no. 3, pp. 294-312", "authors": ["Hall S", "Rumney L", "Holler J", "Evan Kidd"]}, {"title": "The Role of Verbal Working Memory in Children", "year": "2013", "source": "s Sentence Comprehension A Critical Review'Topics in Language Disorders, vol. 33, no. 3, pp. 208-223", "authors": ["Evan Kidd"]}, {"title": "Prediction in processing is a by-product of language learning", "year": "2013", "source": "Behavioral and Brain Sciences, vol. 36, no. 4, pp. 350-351", "authors": ["Chang F", "Evan Kidd", "Rowland C"]}, {"title": "The role of the lexicon in the development of the language processor", "year": "2013", "source": "in Dirk Geeraerts & John R Taylor (ed.), Lexical Bootstrapping: The Role of Lexis and Semantics in Child Language Development, De Gruyter Mouton, Germany, pp. 217-244", "authors": ["Evan Kidd", "Bavin E", "Brandt S"]}, {"title": "Investigating the role of verbal working memory in young children", "year": "2013", "source": "s sentence comprehension'Language Learning, vol. 63, no. 2, pp. 211-242", "authors": ["Boyle W", "Lindell A", "Evan Kidd"]}, {"title": "The role of the lexicon in the development of the language processor. In D. Bittner & N. Ruhlig (Eds.)", "year": "2013", "source": "Lexical Bootstrapping: The role of lexis and semantics in child language development (pp. 217 - 244). Berlin: De Gruyter.", "authors": ["Evan Kidd", "Bavin E L Brandt S ("]}, {"title": "Consumers Favor \"Right Brain\" Training: The Dangerous Lure of Neuromarketing", "year": "2013", "source": "MindBrain, and Education, vol. 7, 35-39", "authors": ["Lindell A", "Evan Kidd"]}, {"title": "Experience and Processing of Relative Clauses in German", "year": "2012", "source": "Annual Boston Conference on Language Development 2011, ed. A K Biller, E Y Chung, A E Kimball, Cascadilla Press, USA, pp. 1-14", "authors": ["Brandt S", "Nitschke S", "Evan Kidd"]}, {"title": "The effect of frequency and phonological neighbourhood density on the acquisition of past tense verbs by Finnish children", "year": "2012", "source": "Cognitive Linguistics, vol. 23, no. 2, pp. 273-315", "authors": ["Kirjavainen M", "Nikolaev A", "Evan Kidd"]}, {"title": "Individual differences in syntactic priming in language acquisition", "year": "2012", "source": "Applied Psycholinguistics, vol. 33, no. 2, pp. 393-418", "authors": ["Evan Kidd"]}, {"title": "Implicit statistical learning is directly associated with the acquisition of syntax", "year": "2012", "source": "Developmental Psychology, vol. 48, no. 1, pp. 171-184", "authors": ["Evan Kidd"]}, {"title": "n examination of the associations among multiple memory systems, past tense, and vocabulary in typically developing 5-year-old children", "year": "2012", "source": "Journal of Speech, Language, and Hearing Research, vol. 55, no. 4, pp. 989-1006", "authors": ["Lum J", "Evan Kidd"]}, {"title": "Persian speaking children", "year": "2011", "source": "s acquisition of relative clauses'European Journal of Developmental Psychology, vol. 8, no. 3, pp. 367-388", "authors": ["Rahmany R", "Marefat H", "Evan Kidd"]}, {"title": "Play, language and social skills of children attending a play-based curriculum school and a traditionally structured classroom curriculum school in low socioeconomic areas", "year": "2011", "source": "Australasian Journal of Early Childhood, vol. 36, no. 4, pp. 120-130", "authors": ["Reynolds E", "Stagnitti K", "Evan Kidd"]}, {"title": "Children do not overcome lexical biases where adults do: The role of the referential scene in garden-path recovery", "year": "2011", "source": "Journal of Child Language, vol. 38, no. 1, pp. 222-234", "authors": ["Evan Kidd", "Stewart A", "Serratrice L"]}, {"title": "Why Right-Brain Teaching is Half-Witted: A Critique of the Misapplication of Neuroscience to Education", "year": "2011", "source": "Mind, Brain, and Education, vol. 5, no. 3, pp. 121-127", "authors": ["Lindell A", "Evan Kidd"]}, {"title": "Structural priming in comprehension of relative clause sentences: In search of a frequency x regularity interaction", "year": "2011", "source": "in Evan Kidd (ed.), The Acquisition of Relative Clauses, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 227-242", "authors": ["Hutton J", "Evan Kidd"]}, {"title": "Relative clause acquisition and representation: Evidence from spontaneous speech, sentence repetition, and comprehension", "year": "2011", "source": "in Doris Schonefeld (ed.), Converging Evidence: Methodological and theoretical issues for linguistic research, John Benjamins Publishing Company, Amsterdam/Philadelphia, pp. 273-292", "authors": ["Brandt S", "Evan Kidd"]}, {"title": "Did you have a choccie bickie this arvo? A quantitative look at Australian hypocoristics", "year": "2011", "source": "Language Sciences, vol. 33, no. 3, pp. 359-368", "authors": ["Evan Kidd", "Kemp N", "Quinn S"]}, {"title": "Investigating the contribution of procedural and declarative memory to the acquisition of past tense morphology: Evidence from Finnish", "year": "2011", "source": "Language and Cognitive Processes, vol. 26, no. 4-6, pp. 794-829", "authors": ["Evan Kidd", "Kirjavainen M"]}, {"title": "The Acquisition of Relative Clauses: Processing", "year": "2011", "source": "typology and functionJohn Benjamins Publishing Company, Amsterdam/Philadelphia", "authors": ["Evan Kidd", "ed"]}, {"title": "Lexical frequency and exemplar-based learning effects in language acquisition: evidence from sentential complements", "year": "2010", "source": "Language Sciences, vol. 32, no. 1, pp. 132-142", "authors": ["Evan Kidd", "Lieven E", "Tomasello M"]}, {"title": "First language transfer and long-term structural priming in comprehension", "year": "2010", "source": "Language and Cognitive Processes, vol. 25, no. 1, pp. 94-114", "authors": ["Nitschke S", "Evan Kidd", "Serratrice L"]}, {"title": "The personality correlates of adults who had imaginary companions in childhood", "year": "2010", "source": "Psychological Reports, vol. 107, no. 1, pp. 163-172", "authors": ["Evan Kidd", "Rogers P", "Rogers C"]}, {"title": "Longitudinal study of declarative and procedural memory in primary school-aged children", "year": "2010", "source": "Australian Journal of Psychology, vol. 62, no. 3, pp. 139-148", "authors": ["Lum J", "Evan Kidd", "Davis S"]}, {"title": "Investigating the psycholinguistic correlates of speechreading in preschool age children", "year": "2009", "source": "International Journal of Language and Communication Disorders, vol. 44, no. 2, pp. 164-174", "authors": ["Davies R", "Evan Kidd", "Lander K"]}, {"title": "n investigation into the online processing of counterfactual and indicative conditionals", "year": "2009", "source": "Quarterly Journal of Experimental Psychology, vol. 62, no. 11, pp. 2113-2125", "authors": ["Stewart A", "Haigh M", "Evan Kidd"]}, {"title": "Children", "year": "2009", "source": "s use of gesture to resolve lexical ambiguity'Developmental Science, vol. 12, no. 6, pp. 903-913", "authors": ["Evan Kidd", "Holler J"]}, {"title": "Early sensitivity to discourse-level anomalies: Evidence from self-paced reading", "year": "2009", "source": "Discourse Processes, vol. 46, no. 1, pp. 46-69", "authors": ["Stewart A", "Evan Kidd", "Haigh M"]}, {"title": "The discourse bases of relativization: An investigation of young German and English-speaking children", "year": "2009", "source": "s comprehension of relative clauses'Cognitive Linguistics, vol. 20, no. 3, pp. 539-570", "authors": ["Brandt S", "Evan Kidd", "Lieven E"]}, {"title": "The acquisition of the multiple senses of with", "year": "2008", "source": "Linguistics: an interdisciplinary journal of the language sciences, vol. 46, no. 1, pp. 33-61", "authors": ["Evan Kidd", "Cameron-Faulkner T"]}, {"title": "Sex differences in past tense overregularization", "year": "2008", "source": "Developmental Science, vol. 11, no. 6, pp. 882-889", "authors": ["Lum J", "Evan Kidd"]}, {"title": "The referential communication skills of children with imaginary companions", "year": "2008", "source": "Developmental Science, vol. 11, no. 4, pp. 531-540", "authors": ["Roby A", "Evan Kidd"]}, {"title": "Implicit statistical learning is directly associated with the \tacquisition of syntax. Developmental Psychology", "year": "2012", "source": "48171 - 184", "authors": ["Evan Kidd"]}, {"title": "Individual differences in syntactic priming in language \tacquisition. Applied Psycholinguistics", "year": "2012", "source": "33393 - 418.", "authors": ["Evan Kidd"]}, {"title": "Investigating the contribution of procedural \tand declarative memory to the acquisition of past tense morphology: Evidence \tfrom Finnish. Language and Cognitive Processes", "year": "2011", "source": "26794 - 829", "authors": ["Evan Kidd", " Kirjavainen E ("]}, {"title": "Children do not overcome lexical \tbiases where adults do: The role of the referential scene in garden path \trecovery. Journal of Child Language", "year": "2011", "source": "38222 - 234", "authors": ["Evan Kidd", "Stewart A", " Serratrice L ("]}, {"title": "Did you have a choccie bickie this arvo? \tA quantitative look at Australian hypocoristics. Language Sciences", "year": "2011", "source": "33359 -368", "authors": ["Evan Kidd", "Kemp N", " Quinn S ("]}, {"title": "Why right-brain teaching is half-witted: A critique \tof the misapplication of neuroscience to education. Mind", "year": "2011", "source": "Brain& Education, \t5, 121 - 127", "authors": ["Lindell A", "Evan Kidd"]}, {"title": "Persian-speaking children", "year": "2011", "source": "s \tacquisition of relative clauses. European Journal of Developmental \tPsychology8, 367-388", "authors": ["Ramany R", "Marefat H", "Evan Kidd"]}, {"title": "The acquisition of relative clauses: typology", "year": "2011", "source": "processing& function. Amsterdam: John Benjamin", "authors": ["Evan Kidd"]}, {"title": "Structural priming in comprehension of relative \tclauses: In search of a frequency by regularity interaction. In E. Kidd (Ed.)", "year": "2011", "source": "The acquisition of relative clauses: typologyprocessing, and function (pp. \t227 - 242). Amsterdam: John Benjamins.", "authors": ["Hutton J", "Evan Kidd"]}, {"title": "Relative Clause Acquisition and Representation: \tEvidence from spontaneous speech", "year": "2011", "source": "sentence repetitionand comprehension. \tIn D. Schoenefeld (Ed.), Converging evidence discussing and extending the \tmethodological tool-\tkit of the linguist (pp. 273 - 292). Amsterdam: John \tBenjamins", "authors": ["Brandt S", "Evan Kidd"]}, {"title": "First language transfer and long-\tterm structural priming in comprehension. Language and Cognitive Processes", "year": "2010", "source": "2594-114", "authors": ["Nitschke S", "Evan Kidd", " Serratrice L ("]}, {"title": "Lexical frequency and exemplar-\tbased learning effects in language acquisition: Evidence from sentential \tcomplements. Language Sciences", "year": "2010", "source": "32132 -142", "authors": ["Evan Kidd", "Lieven E", " Tomasello M ("]}, {"title": "The personality correlates of adults who had \timaginary companions in childhood. Psychological Reports", "year": "2010", "source": "107163-172", "authors": ["Evan Kidd", "Rogers P", " Rogers C ("]}, {"title": "Childen", "year": "2009", "source": "s use of gesture to resolve lexical \tambiguity. Developmental Science12, 903-913", "authors": ["Evan Kidd", " Holler J ("]}, {"title": "n investigation into the online \tprocessing of counterfactual and indicative conditionals. Quarterly Journal of \tExperimental Psychology", "year": "2009", "source": "622113-2125", "authors": ["Stewart A", "Haigh M", "Evan Kidd"]}, {"title": "Discourse-level inconsistencies in text \tprocessing: evidence for an early sensitivity. Discourse Processes", "year": "2009", "source": "4646-69", "authors": ["Stewart A", "Evan Kidd", " Haigh M ("]}, {"title": "The acquisition of the multiple senses \tof with. Linguistics", "year": "2008", "source": "4633-62", "authors": ["Evan Kidd", " Cameron-Faulkner T ("]}, {"title": "Sex differences in past tense overregularalization. \tDevelopmental Science", "year": "2008", "source": "11882-889", "authors": ["Evan Kidd", " Lum J ("]}, {"title": "The referential communication skills of children \twith imaginary companions. Developmental Science", "year": "2008", "source": "11531-540", "authors": ["Roby A", "Evan Kidd"]}, {"title": "I", "year": "2007", "source": "m are what I'm are: the acquisition of \t1PS-present BE. Cognitive Linguistics18, 1-22", "authors": ["Cameron-Faulkner T", "Evan Kidd"]}, {"title": "Lexical and referential constraints on on-line \tspoken language comprehension: A comparison of adults and primary-school \tage children. First Language", "year": "2007", "source": "2729-52", "authors": ["Evan Kidd", " Bavin E L ("]}, {"title": "Shallow processing of ambiguous \tpronouns: Evidence for delay. Quarterly Journal of Experimental Psychology", "year": "2007", "source": "601680-1696", "authors": ["Stewart A", "Holler J", "Evan Kidd"]}, {"title": "The acquisition of complement clause constructions. In E. V. Clark & B. F. Kelly (Eds.)", "year": "2006", "source": "Constructions in acquisition (pp. 311-331). StanfordCA:CSLI Publications", "authors": ["Evan Kidd"]}, {"title": "Examining the role of lexical frequency in \tchildren", "year": "2006", "source": "s acquisition of sentential complements. Cognitive Development21, 93 -107", "authors": ["Evan Kidd", "Lieven E", " Tomasello M ("]}, {"title": "Lexical and referential cues to interpretation: An\t\t\t investigation of children", "year": "2005", "source": "s interpretations of ambiguous sentences. Journal of Child Language32, 855-876", "authors": ["Evan Kidd", "Bavin E L ("]}, {"title": "English-speaking children", "year": "2002", "source": "s understanding of relative clauses: Evidence for general-cognitive and language-specific constraints on \tdevelopment. Journal of Psycholinguistic Research31, 599-617", "authors": ["Evan Kidd", "Bavin E L ("]}]}, "Microsoft-Academic": [{"title": "the ubiquity of frequency effects in first language acquisition", "year": 2015, "source": "journal of child language", "authors": [{"name": "ben ambridge", "affiliation": "university of liverpool"}, {"name": "evan kidd", "affiliation": "australian national university"}, {"name": "caroline f rowland", "affiliation": "university of liverpool"}, {"name": "anna l theakston", "affiliation": "university of manchester"}], "id": 31497010}, {"title": "individual differences in language acquisition and processing", "year": 2018, "source": "trends in cognitive sciences", "authors": [{"name": "evan kidd", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "max planck society"}, {"name": "seamus donnelly", "affiliation": "australian national university"}, {"name": "morten h christiansen"}], "id": 192051125}, {"title": "implicit statistical learning is directly associated with the acquisition of syntax", "year": 2012, "source": "developmental psychology", "authors": [{"name": "evan kidd", "affiliation": "university of manchester"}], "id": 126635229}, {"title": "object relatives made easy a cross linguistic comparison of the constraints influencing young children s processing of relative clauses", "year": 2007, "source": "language and cognitive processes", "authors": [{"name": "evan kidd", "affiliation": "max planck society"}, {"name": "silke brandt", "affiliation": "max planck society"}, {"name": "elena lieven", "affiliation": "max planck society"}, {"name": "michael tomasello", "affiliation": "max planck society"}], "id": 58535122}, {"title": "individual differences in statistical learning predict children s comprehension of syntax", "year": 2016, "source": "child development", "authors": [{"name": "evan kidd", "affiliation": "australian national university"}, {"name": "joanne arciuli", "affiliation": "university of sydney"}], "id": 109723506}, {"title": "a critical period for faces other race face recognition is improved by childhood but not adult social contact", "year": 2019, "source": "scientific reports", "authors": [{"name": "elinor mckone", "affiliation": "australian national university"}, {"name": "lulu wan", "affiliation": "australian national university"}, {"name": "madeleine pidcock", "affiliation": "australian national university"}, {"name": "kate crookes", "affiliation": "australian national university"}, {"name": "kate crookes", "affiliation": "university of western australia"}, {"name": "katherine j reynolds", "affiliation": "australian national university"}, {"name": "amy dawel", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "max planck society"}, {"name": "chiara fiorentini", "affiliation": "australian national university"}], "id": 196734849}, {"title": "individual differences in first language acquisition", "year": 2020, "source": "social science research network", "authors": [{"name": "evan kidd", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "max planck society"}, {"name": "evan kidd", "affiliation": "australian research council"}, {"name": "seamus donnelly", "affiliation": "australian national university"}, {"name": "seamus donnelly", "affiliation": "australian research council"}], "id": 2751751161}, {"title": "symbolic play promotes non verbal communicative exchange in infant caregiver dyads", "year": 2019, "source": "british journal of development psychology", "authors": [{"name": "sara quinn", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "max planck society"}], "id": 98289679}, {"title": "the discourse bases of relativization an investigation of young german and english speaking children s comprehension of relative clauses", "year": 2009, "source": "cognitive linguistics", "authors": [{"name": "silke brandt", "affiliation": "max planck society"}, {"name": "evan kidd", "affiliation": "max planck society"}, {"name": "elena lieven", "affiliation": "max planck society"}, {"name": "michael tomasello", "affiliation": "max planck society"}], "id": 207053439}, {"title": "statistically induced chunking recall a memory based approach to statistical learning", "year": 2020, "source": "cognitive science", "authors": [{"name": "erin s isbilen", "affiliation": "cornell university"}, {"name": "stewart m mccauley", "affiliation": "university of iowa"}, {"name": "evan kidd", "affiliation": "australian national university"}, {"name": "evan kidd", "affiliation": "max planck society"}, {"name": "morten h christiansen"}], "id": 78735424}], "ANDS-Grants": [{"description": "This project aims to investigate the processes of language acquisition to support the development of evidence-based strategies for improving children's early language. Some children learn language earlier and more easily than others. Understanding why this is the case is important because successful acquisition is strongly associated with positive life outcomes such as academic achievement and psychological wellbeing. This project focuses on typically developing children, investigating how their ability to detect frequently occurring patterns in the environment significantly contributes to their acquisition of grammar in early childhood. The project plans to use an innovative triangulation of experimental methods from developmental psychology, longitudinal analysis and cognitive modelling to drive the development of new models of language acquisition and transform our understanding of both typical and atypical acquisition.", "title": "Discovery Projects - Grant ID: DP160101917", "id": "663988", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP160101917", "researchers": ["A/Prof Evan Kidd", "A/Prof Joanne Arciuli", "Prof Michael Smithson"], "status": "active", "fundingAmount": 274000, "fundingScheme": "Discovery Projects", "startDate": 2016, "endDate": 2020, "dateTimeModified": "2018-10-02T04:21:36Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP160101917", "identifiers": ["http://purl.org/au-research/grants/arc/DP160101917", "DP160101917"], "subjects": ["PSYCHOLOGY", "PSYCHOLOGY AND COGNITIVE SCIENCES"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/663988"}]}, {"description": "ARC Centre of Excellence for the Dynamics of Language. Language is central to human existence and to the flow of information. The Centre will address the most critical questions about language: How do languages evolve? How different can languages be? How do our brains acquire and process them? How can technologies deal with the complexity and enormous variability of language in its central role in human information processing? What can Australia do to increase its linguistic abilities at a time of increasingly multilingual demands in trade and information? The Centre will also secure language heritage, develop new language technologies, connect policy with indigenous and migrant communities, and build strategies to help 1st and 2nd language learning and those isolated by language difficulties.", "title": "ARC Centres of Excellences - Grant ID: CE140100041", "id": "518499", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/CE140100041", "researchers": ["Prof Nicholas Evans", "Prof Jane Simpson", "A/Prof Rachel Nordlinger", "Prof Anne Cutler", "Prof Gillian Wigglesworth", "Dr Simon Greenhill", "Dr Nicholas Thieberger", "Prof Janet Wiles", "Prof Helen Chenery", "Prof Alan Rumsey", "Prof Kim Sterelny", "Dr Paola Escudero", "A/Prof Janet Fletcher", "A/Prof Caroline Jones", "Dr Evan Kidd", "Prof Catherine Travis", "Dr Judith Bishop", "Dr Franklin Chang", "Prof Morten Christiansen", "Prof Greville Corbett", "Prof Russell Gray", "Prof Dr Stephen Levinson", "Prof Elena Lieven", "Prof Miriam Meyerhoff", "Prof Caroline Rowland", "Prof Rena TorresCacoullos", "Dr Jakelin Troy", "A/Prof Bee Ng", "Prof Virginia Yip", "Prof Stephen Matthews"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 28000000, "fundingScheme": "ARC Centres of Excellences", "startDate": 2014, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:26Z", "dateTimeCreated": "2015-04-12T05:08:04Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/CE140100041", "identifiers": ["http://purl.org/au-research/grants/arc/CE140100041", "CE140100041"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518499"}]}]}