{"ANU": {"name": "Fouzieyha Towghi", "link": "https://researchers.anu.edu.au/researchers/towghi-f", "colleges": "College of Arts and Social Sciences", "email": "fouzieyha.towghi@anu.edu.au", "phone": "", "expertise": [], "interest": ["Areas of Expertise: Medical Anthropology; anthropology of health, medicine, and the body; gender and feminist techno-science/medicine studies; anthropology of reproduction, kinship, and reproductive technologies; decolonial and postcolonial theories; race, gender, and sexuality studies; Childbirth, midwifery, and women's health; critical global health and development studies; histories of colonial medical sciences; transnational feminisms and human rights; Indigenous and \"alternative\" medicines; ethnographic/feminist research methods; Geographic areas of focus: Bolochistan; Pakistan; India; and South Asia.As a medical anthropologist and an ethnographer of health, medicine and science, I have examined the socio-cultural, historical and political economic dimensions of health, illness, medicine, biotechnologies, and the technologies of rule. Linking theories from anthropology, feminist techno-science studies and postcolonial feminist theories and methods, I have analysed the entanglements of biomedical and global health development policies to trace the corporeal and social effects of trans-historical and transnational mobilities of bio-scientific ideas, biotechnologies, and human rights policies and experts. I have explicated the impacts of these processes particularly on poor and rural women’s bodies and social material/environmental conditions in South Asian contexts.I have published on the relationship between the HPV vaccine, local biologies, and the  epigenetics of cervical cancer; cultural politics of reproductive health; debates on the role of indigenous midwives and traditional medicines in women’s care; impact of health development policies on local midwifery and women’s access to care consequent to the United Nations Millennium Development Goals outlined for the reduction of global maternal mortality rates; and the risks for poor and rural women of advocating off-label low-tech pharmaceuticals in homebirths in Pakistan. My work has appeared in peer-reviewed journals, Medical Anthropology and Ethnos as well as in the books, Negotiating Normativity (2016), Critical Mobilties (2013); and Unhealthy Policy (2004). In 2015, my article, “Normalizing Off-Label Experiments and the Pharmaceuticalization of Homebirths in Pakistan,” was awarded the Rudolph Virchow Professional Award, by the Critical Anthropology for Global Health Caucus of the Society for Medical Anthropology.I am currently writing my first book, provisionally titled, Caring ‘In the Times of the Ladies’: Contesting Humanitarian Imaginaries of Women’s Health, Midwives, and the Tribal in Rural Balochistan. The ethnography draws on over six years of work and fifteen months of sustained ethnographic research in Balochistan, Pakistan to trace the biopolitics of global reproductive health and rights policies and pharmaceutical globalization and the impact of these processes on Baloch women and their culture of midwifery."], "biography": "", "project": ["As a postdoctoral research fellow with the Swiss Network for Mobilities Studies in the Department of Social and Cultural Anthropology at the University of Zürich (2009-2012), I developed my ideas for my second book tentatively titled, Biopolitics of Reproductive Technologies Beyond the Clinic: Remaking Adolescents in the Era of Molecular Biology. For this project, I initiated a new ethnographic research project in India, Switzerland,and the United States to investigate the effects of the globalization of HPV vaccine on Indian women’s health, cervical cancer prevention efforts, and India’s public health care system. Phase one of the project investigated the links between the innovations in the molecular biology of cervical cancer and the rise of the HPV-vaccine and how this is reconfiguring global reproductive health policies and public health care practices in India. My fieldwork in several Indian cities and rural areas in 2009, 2011, and 2012 traced the simultaneous emergence of the HPV vaccine and global health cervical cancer prevention programs, in the context of the shifting nexus between biomedicine, biotechnologies, the state, and population health care there. I examined some of the public health and scientific claims as well as the policy and institutional arrangements crafted to facilitate the flow of the vaccine and localize its distribution in rural and urban Indian locales through the public health system. (For preliminary findings see: Towghi 2013; Towghi and Randeria 2013). I am currently developing Phase II of this research that aims to study how the introduction of the HPV vaccine and HPV screening technologies in clinical settings is mediating pre-existing cervical cancer prevention and therapeutic practices and the hospital preventive services that are inceasinlgy linked to public health community outreach efforts in India.", "I joined ANU with 10 years of prior teaching experience in Anthropology and Gender & Women's Studies. I am currently teaching the following courses:", "ANTH 2138/6138: Doing Medical Anthropology", "CHMD 8006: Global Health and Development", "CHMD 8021: Indigenous Medicines, Health and Healing [commencing in 2018]", "CHMD 8022: Biotechnolgies in Biomedicine [commencing in 2018]", "CHMD 8008: Medicine and Society in History [commencing in 2019 with revised descripton]", ""], "publication": [{"title": "Haunting Expectations of Hospital Births Challenged by Traditional Midwives", "year": "2018", "source": "Medical Anthropology: Cross-cultural Studies in Health and Illness, vol. 37, no. 8, pp. 674-687", "authors": ["Fouzieyha Towghi"]}, {"title": "Book Review:", "year": "2018", "source": "Biomedical Entanglements: Conceptions of Personhood in a Papua New Guinea Society'The Asia Pacific Journal of Anthropology, vol. 19, no. 4, pp. 378-380pp", "authors": ["Fouzieyha Towghi"]}, {"title": "The Re-colonization of South Asian Women", "year": "2016", "source": "s Bodies: Normalizing Off-Label Experiments in the Pharmaceuticalization of Homebirths'in Nikita Dhawan; Elizabeth Fink; Johanna Leinius; Rirhandu Mageza-Barthel (ed.), Negotiating Normativity: Postcolonial, Contestations, and Transformations, Springer, US, pp. 113 - 130", "authors": ["Fouzieyha Towghi"]}, {"title": "Normalizing Off-Label Experiments and the Pharmaceuticalization of Homebirths in Pakistan", "year": "2014", "source": "Ethnos: Journal of Anthropology, vol. 79, no. 1, pp. 108-137pp. [Winner of the Rudolph Virchow Prize, 2015-Awarded by Society for Medical Anthropology", "authors": ["Fouzieyha Towghi"]}, {"title": "Bodies, Markets, and the Experimental in South Asia", "year": "2014", "source": "Ethnos: Journal of Anthropology, vol. 79, no. 1, pp. 1-18", "authors": ["Fouzieyha Towghi", "Vora K"]}, {"title": "The Biopolitics of Reproductive Technologies beyond the Clinic: Localizing HPV Vaccines in India", "year": "2013", "source": "Medical Anthropology: Cross-cultural Studies in Health and Illness, vol. 32, no. 4, pp. 325-342", "authors": ["Fouzieyha Towghi"]}, {"title": "Pharmaceutical Mobilities and the Market for Women", "year": "2013", "source": "s Reproductive Health: Moving HPV Vaccines and Contraceptives through NGOs and the State in India'in O. Soderstrom, S. Randeria, D. Ruedin, G. D'Amato, F. Panese (ed.), Critical Mobilities, EPFL Press, Switzerland, pp. 177 - 212", "authors": ["Fouzieyha Towghi", "Randeria S"]}, {"title": "Cutting Inoperable Bodies: Particularizing Rural Sociality to Normalize Hysterectomies in Balochistan, Pakistan", "year": "2012", "source": "Medical Anthropology: Cross-cultural Studies in Health and Illness, vol. 31, no. 3, pp. 229-248pp", "authors": ["Fouzieyha Towghi"]}, {"title": "Book Review: Terrorist Assemblages: homonationalism in queer times - Jasbir Puar", "year": "2011", "source": "International Journal of Okinawan Studies, vol. 2, no. 2, pp. 101-104", "authors": ["Fouzieyha Towghi"]}, {"title": "Book Review: In Amma", "year": "2007", "source": "s Healing Room: Gender and Vernacular Islam in South India (review)'AQ Anthropological Quarterly, vol. 80, no. 3, pp. 915-918", "authors": ["Fouzieyha Towghi"]}, {"title": "Health Policies: South Asia", "year": "2006", "source": "in Joseph Suad (ed.), Encyclopedia of Women & Islamic Cultures, Brill Academic Publishers, online, pp. 169-171pp", "authors": ["Fouzieyha Towghi"]}, {"title": "Reproduction, Medicalization of: South Asia", "year": "2006", "source": "in Joseph Suad (ed.), Encyclopedia of Women & Islamic Cultures, Brill Academic Publishers, online, pp. 344-347pp", "authors": ["Fouzieyha Towghi"]}, {"title": "Shifting Policies toward Traditional Midwives: Implications for Reproductive Health Care in Pakistan,", "year": "2004", "source": "in Arachu Castro; Merrill Singer (eds.)Unhealthy Health Policy: A Critical Anthropological Examination, AltaMira Press, United States of America, pp. 79-95", "authors": ["Fouzieyha Towghi"]}]}, "Microsoft-Academic": [{"title": "bodies markets and the experimental in south asia", "year": 2014, "source": "ethnos", "authors": [{"name": "fouzieyha towghi", "affiliation": "university of zurich"}, {"name": "kalindi vora", "affiliation": "university of california san diego"}], "id": 43131466}, {"title": "the re colonization of south asian women s bodies normalizing off label experiments in the pharmaceuticalization of homebirths", "year": 2016, "source": "", "authors": [{"name": "fouzieyha towghi", "affiliation": "university of california berkeley"}]}, {"title": "the biopolitics of reproductive technologies beyond the clinic localizing hpv vaccines in india", "year": 2013, "source": "medical anthropology", "authors": [{"name": "fouzieyha towghi", "affiliation": "university of zurich"}], "id": 91080920}, {"title": "cutting inoperable bodies particularizing rural sociality to normalize hysterectomies in balochistan pakistan", "year": 2012, "source": "medical anthropology", "authors": [{"name": "fouzieyha towghi", "affiliation": "university of zurich"}], "id": 91080920}, {"title": "normalizing off label experiments and the pharmaceuticalization of homebirths in pakistan", "year": 2014, "source": "ethnos", "authors": [{"name": "fouzieyha towghi", "affiliation": "university of zurich"}], "id": 43131466}, {"title": "haunting expectations of hospital births challenged by traditional midwives", "year": 2018, "source": "medical anthropology", "authors": [{"name": "fouzieyha towghi", "affiliation": "australian national university"}], "id": 91080920}, {"title": "biomedical entanglements conceptions of personhood in a papua new guinea society", "year": 2018, "source": "asia pacific journal of anthropology", "authors": [{"name": "fouzieyha towghi", "affiliation": "australian national university"}], "id": 191816521}, {"title": "scales of marginalities transformations in women s bodies medicines and land in postcolonial balochistan pakistan", "year": 2007, "source": "", "authors": [{"name": "fouzieyha towghi"}]}, {"title": "book review jasbia puar 2007 terrorist assemblages homonationalism in queer times", "year": 2011, "source": "", "authors": [{"name": "fouzieyha towghi"}]}, {"title": "in amma s healing room gender and vernacular islam in south india review", "year": 2007, "source": "anthropological quarterly", "authors": [{"name": "fouzieyha towghi"}], "id": 127531613}], "ANDS-Grants": []}