{"ANU": {"name": "Frank M.P. van Haren PhD", "link": "https://researchers.anu.edu.au/researchers/van-haren-f", "colleges": "College of Health & Medicine", "email": "frank.vanharen@anu.edu.au", "phone": "", "expertise": [], "interest": ["Dr van Haren’s main research interests include respiratory failure (ARDS), sepsis, nutritional therapy in the ICU, as well as organ donation and end-of-life."], "biography": "He is section Editor for the Journal of Critical Care, which is the official journal of the World Federation of Societies of Intensive and Critical Care Medicine.", "project": ["", "We are leading an international meta-trial of multicentre randomised studies in intensive care patients, to determine if treatment with standard care + nebulised heparin, compared to standard care alone, reduces the duration of invasive mechanical ventilation in ICU patients with SARS-CoV-2.", "We are also leading an international meta-trial of multicentre randomised studies in hospitalised COVID-19 patients, to determine if treatment with standard care + nebulised heparin, compared to standard care alone, reduces the duration of oxygen treatment, length of stay and the proportion of patients requiring ICU admission.", "SAGE ANZ is a bi-national study assess the management of moderate-severe ARDS in patients with and without COVID-19 in intensive care units in Australia and New Zealand.", "WEAN SAFE is a global multi-centre, prospective, observational, 4-week inception cohort study. WEAN SAFE will prospectively assess the burden of, management and spectrum of approaches to weaning from ventilation, in patients that require invasive mechanical ventilation for any reason, for a time period of at least 24 hours.", "LUNG SAFE is a global, multicentre, prospective, observational, 4-week inception cohort study. We will prospectively study patients with acute hypoxaemic respiratory failure requiring ventilatory support during the winter months. The study will focus on the epidemiology, disease burden, natural history, management, mortality and resource utilization for this patient cohort.", "This is a research programme, led by Dr Bernie Bissett, to explore whether IMT in critically ill patients improves respiratory muscle strength and is associated with improved clinical outcomes.", "This PhD research programme has several elements, including: the assessment of sleep in critically ill patients; comparison of different methods to measure sleep in ICU; assessment of the impact the intensive care environment has on sleep.", "PROMEDIC is a multicentre randomised placebo-controlled trial of melatonin in intensive care patients for the prevention of delirium, and to improve sleep quality.", "CAPA is a prospective observational study and part of a PhD project, investigating the effects of delirium during intensive care stay, on long-term cognitive and psychosocial outcomes.", "This PhD programme contains several elements: study of the long-term psychological outcomes of intensive care survivors and their families; barriers to providing health care to intensive care survivors after discharge from ICU; long-term renal outcomes of intensive care survivors who required dialysis during their ICU stay.", "This PhD programme aims to investigate the bereavement of families of potential organ donors, and to develop a psychological model to guide further research of family experiences.", "The overarching aim of the 100LPS study is to investigate two important and clinically relevant immunological phenomena: sepsis-induced immunoparalysis; and immunological memory mediated through B lymphocytes (B cells).", "REACT SHOCK is a research program, investigating whether targeting individualised blood pressure levels based on patients’ pre-morbid blood pressure levels reduce the incidence of new onset kidney injury and improve outcomes in critically ill patients with shock.", "This research programme has several elements, including: research to establish the effects of fluid resuscitation in sepsis; observational research assessing the physiological effects of fluid bolus therapy in intensive care patients; and investigation of the haemodynamic profiles of patients with sepsis before and directly after fluid resuscitation.", "TARGET (The Augmented versus Routine approach to Giving Energy Trial) was a 4000 patients multicentre randomised controlled study, investigating the effects of hypercaloric versus standard caloric naso-gastric feeding in ICU on 90 day mortality and long term functional outcome. We are currently conducting several sub-studies of TARGET.", "ICU FM is a multicentre randomised controlled trial comparing intermittent enteral feeding while in right lateral tilt position to standard care among mechanically ventilated adult ICU patients.", "This registry, the first of its kind in the world, prospectively collects data on parenteral nutrition and outcomes in Australia, to inform and improve clinical practice and to generate hypotheses for further research. The registry is funded through an industry grant.", "This is an annually recurring point prevalence study to assess our nutrition practice in ICU and benchmark this against the rest of the world and against best available evidence.", "As a result of INS, we have changed our nutrition practice, implemented new policies and guidelines, which has resulted in a significant improvement, assessed by subsequent point prevalence outcomes.", ""], "publication": [{"title": "Nebulised heparin as a treatment for COVID-19: Scientific rationale and a call for randomised evidence", "year": "2020", "source": "Critical Care, vol. 24, pp. 1-11", "authors": ["Frank M.P. van Haren PhD", "Page C", "Laffey J"]}, {"title": "Compliance Phenotypes in Early Acute Respiratory Distress Syndrome before the COVID-19 Pandemic", "year": "2020", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 202, no. 9, pp. 1244-1252", "authors": ["Panwar R", "Madotto F", "Laffey J", "Frank M.P. van Haren PhD"]}, {"title": "Effect of Stress Ulcer Prophylaxis With Proton Pump Inhibitors vs Histamine-2 Receptor Blockers on In-Hospital Mortality Among ICU Patients Receiving Invasive Mechanical Ventilation The PEPTIC Randomized Clinical Trial", "year": "2020", "source": "JAMA Network Open, vol. 323, no. 7, pp. 616-626", "authors": ["Young P", "Bagshaw S", "Forbes A", "Frank M.P. van Haren PhD"]}, {"title": "Spontaneous Breathing in Early Acute Respiratory Distress Syndrome: Insights From the Large Observational Study to UNderstand the Global Impact of Severe Acute Respiratory FailurE Study*", "year": "2019", "source": "Critical Care Medicine, vol. 47, no. 2, pp. 229-238", "authors": ["Frank M.P. van Haren PhD", "Pham T", "Brochard L"]}, {"title": "Fluid resuscitation in sepsis: the great 30 mL per kg hoax", "year": "2020", "source": "Journal of Thoracic Disease\r\n, vol. 12, pp. S37-S47", "authors": ["Marik P", "Byrne L", "Frank M.P. van Haren PhD"]}, {"title": "Hyperoxemia and excess oxygen use in early acute respiratory distress syndrome: Insights from the LUNG SAFE study", "year": "2020", "source": "Critical Care, vol. 24, no. 1, pp. -", "authors": ["Madotto F", "Rezoagli E", "Pham T", "Frank M.P. van Haren PhD"]}, {"title": "Cognitive and psychosocial outcomes of mechanically ventilated intensive care patients with and without delirium", "year": "2020", "source": "Annals of Intensive Care, vol. 10, no. 1, pp. -", "authors": ["Bulic D", "Bennett M", "Georgousopoulou E", "Frank M.P. van Haren PhD"]}, {"title": "Outcomes Six Months after Delivering 100% or 70% of Enteral Calorie Requirements during Critical Illness (TARGET). A Randomized Controlled Trial", "year": "2020", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 201, no. 7, pp. 814-822", "authors": ["Deane A", "Little L", "Bellomo R", "Frank M.P. van Haren PhD"]}, {"title": "Respiratory Muscle Rehabilitation in Patients with Prolonged Mechanical Ventilation: A Targeted Approach", "year": "2020", "source": "Critical Care, vol. 24, no. 1", "authors": ["Bissett B", "Gosselink R", "Frank M.P. van Haren PhD"]}, {"title": "Relative hypotension and adverse kidney-related outcomes among critically ill patients with shock a multicenter, prospective cohort study", "year": "2020", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 202, no. 10, pp. 1407-1418", "authors": ["Panwar R", "Tarvade S", "Lanyon  N", "Frank M.P. van Haren PhD"]}, {"title": "Randomised evaluation of active control of temperature versus ordinary temperature management (REACTOR) trial", "year": "2019", "source": "Intensive Care Medicine, vol. 45, no. 10, pp. 1382-1391", "authors": ["Young P", "Bailey M", "Bass F", "Frank M.P. van Haren PhD"]}, {"title": "Practice and Attitudes of Donor Coordinator Roles Regarding Physical Examination of Potential Organ and Tissue Donors in Australia", "year": "2019", "source": "Transplantation Direct, vol. 5, no. 8", "authors": ["Holloway J", "Ranse K", "Bail K", "Frank M.P. van Haren PhD"]}, {"title": "The effectiveness of noise interventions in the ICU", "year": "2019", "source": "Current Opinion in Anaesthesiology, vol. 32, no. 2, pp. 144-149", "authors": ["Delaney L", "Litton E", "Frank M.P. van Haren PhD"]}, {"title": "External Validation of Two Models to Predict Delirium in Critically Ill Adults Using Either the Confusion Assessment Method-ICU or the Intensive Care Delirium Screening Checklist for Delirium Assessment", "year": "2019", "source": "Critical Care Medicine, vol. 47, no. 10, pp. 827-835", "authors": ["Wassenaar A", "Schoonhoven L", "Devlin J", "Frank M.P. van Haren PhD"]}, {"title": "Internet health information use by surrogate decision makers of patients admitted to the intensive care unit: a multicentre survey", "year": "2019", "source": "Critical Care and Resuscitation, vol. 21, no. 4, pp. 305-310", "authors": ["Das A", "Anstey M", "Bass F", "Frank M.P. van Haren PhD"]}, {"title": "n Integrative Review of the Physical Examination Performed on Deceased Potential Organ and Tissue Donors", "year": "2019", "source": "Progress in Transplantation, vol. 29, no. 1, pp. 84-94", "authors": ["Holloway J", "Ranse K", "Frank M.P. van Haren PhD"]}, {"title": "Investigating the application of motion accelerometers as a sleep monitoring technique and the clinical burden of the intensive care environment on sleep quality: study protocol for a prospective observational study in Australia", "year": "2018", "source": "BMJ Open, vol. 8, no. 1, pp. 9pp", "authors": ["Delaney L", "Currie M", "Huang H", "Frank M.P. van Haren PhD"]}, {"title": "Delirium prediction in the intensive care unit: comparison of two delirium prediction models", "year": "2018", "source": "Critical Care, vol. 22, pp. 1-9", "authors": ["Wassenaar A", "Schoonhoven L", "Devlin J", "Frank M.P. van Haren PhD"]}, {"title": "Resolved versus confirmed ARDS after 24 h: insights from the LUNG SAFE study", "year": "2018", "source": "Intensive Care Medicine, no. Online, pp. 1-14", "authors": ["Madotto F", "Pham T", "Bellani G", "Frank M.P. van Haren PhD"]}, {"title": "Inspiratory muscle rehabilitation in critically ill adults a systematic review and meta-analysis", "year": "2018", "source": "Annals of the American Thoracic Society, vol. 15, no. 6, pp. 735-744", "authors": ["Vorona S", "Umberto S", "Al-Maqbali S", "Frank M.P. van Haren PhD"]}, {"title": "They can rest at home\": An observational study of patients", "year": "2018", "source": "quality of sleep in an Australian hospital'BMC Health Services Research, vol. 18, no. 524, pp. 9pp", "authors": ["Delaney L", "Currie M", "Huang H", "Frank M.P. van Haren PhD"]}, {"title": "Immunocompromised patients with acute respiratory distress syndrome: secondary analysis of the LUNG SAFE database", "year": "2018", "source": "Critical Care, vol. 22, no. 1, p. 157", "authors": ["Cortegiani A", "Madotto F", "Gregoretti C", "Frank M.P. van Haren PhD"]}, {"title": "n exploration of the relationship between families of deceased organ donors and transplant recipients: A systematic review and qualitative synthesis", "year": "2018", "source": "Health Psychology Open, vol. January-June 2018, pp. 25pp", "authors": ["Dicks S", "Northam H", "Frank M.P. van Haren PhD"]}, {"title": "Discrepancy between factors associated with long-term outcome in very old patients referred to the intensive care unit, and prevalence of treatment limitations", "year": "2018", "source": "Anaesthesia and Intensive Care, vol. 46, no. 3, pp. 344-346pp", "authors": ["Hoffman K", "Loong B", "Mitchell I", "Frank M.P. van Haren PhD"]}, {"title": "Unintended consequences: Fluid resuscitation worsens shock in an ovine model of endotoxemia", "year": "2018", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 198, no. 8, pp. 1043-1054pp", "authors": ["Byrne L", "Obonyo N", "Diab S", "Frank M.P. van Haren PhD"]}, {"title": "Predicting Intensive Care Unit Length of Stay After Cardiac Surgery", "year": "2018", "source": "Journal of Cardiothoracic and Vascular Anesthesia, vol. 32, no. 6, pp. 2683-2684", "authors": ["Litton E", "McCann M", "Frank M.P. van Haren PhD"]}, {"title": "Noninvasive Ventilation of Patients with Acute Respiratory Distress Syndrome. Insights from the LUNG SAFE Study", "year": "2017", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 195, no. 1, pp. 67-77pp", "authors": ["Bellani G", "Laffey J", "Pham T", "Frank M.P. van Haren PhD"]}, {"title": "Personalised fluid resuscitation in the ICU: Still a fluid concept?", "year": "2017", "source": "Critical Care, vol. 21, no. Supplement 3, pp. 43-50pp", "authors": ["Frank M.P. van Haren PhD"]}, {"title": "Seven unconfirmed ideas to improve future ICU practice", "year": "2017", "source": "Critical Care, vol. 21, no. 315, pp. 7pp", "authors": ["Marini J", "De Backer D", "Ince C", "Frank M.P. van Haren PhD"]}, {"title": "Fluid resuscitation in human sepsis: Time to rewrite history?", "year": "2017", "source": "Annals of Intensive Care, vol. 7, no. 4, pp. 1-8pp", "authors": ["Byrne L", "Frank M.P. van Haren PhD"]}, {"title": "The nocturnal acoustical intensity of the intensive care environment: An observational study", "year": "2017", "source": "Journal of Intensive Care, vol. 5, no. 1, pp. 1-8", "authors": ["Delaney L", "Currie M", "Huang H", "Frank M.P. van Haren PhD"]}, {"title": "Chamber with a View: The Size of the Right Ventricle during Cardiopulmonary Resuscitation", "year": "2017", "source": "Critical Care Medicine, vol. 45, no. 7, pp. 1258-1260pp", "authors": ["Frank M.P. van Haren PhD"]}, {"title": "In-hospital experiences of families of potential organ donors: A systematic review and qualitative synthesis", "year": "2017", "source": "Health Psychology Open, vol. 4, no. 2, pp. 2055102917709370-2055102917709370", "authors": ["Dicks S", "Ranse K", "Frank M.P. van Haren PhD"]}, {"title": "ssociation between augmented renal clearance and clinical outcomes in patients receiving Î²-lactam antibiotic therapy by continuous or intermittent infusion: a nested cohort study of the BLING-II randomised, placebo-controlled, clinical trial", "year": "2017", "source": "International Journal of Antimicrobial Agents, vol. 49, no. 5, pp. 624-630pp", "authors": ["Udy A", "Dulhunty J", "Roberts J", "Frank M.P. van Haren PhD"]}, {"title": "Mildly elevated lactate levels are associated with microcirculatory flow abnormalities and increased mortality: a microSOAP post hoc analysis", "year": "2017", "source": "Critical Care, vol. 21, no. 1", "authors": ["Vellinga N", "Boerma C", "Koopmans M", "Frank M.P. van Haren PhD"]}, {"title": "Geo-economic variations in epidemiology, patterns of care, and outcomes in patients with acute respiratory distress syndrome: Insights from the LUNG SAFE prospective cohort study", "year": "2017", "source": "The Lancet Respiratory Medicine, vol. 5, no. 8, pp. 627-638pp", "authors": ["Laffey J", "Madotto F", "Bellani G", "Frank M.P. van Haren PhD"]}, {"title": "The development of a narrative describing the bereavement of families of potential organ donors: A systematic review", "year": "2017", "source": "Health Psychology Open, vol. 4, no. 2, pp. 1-17", "authors": ["Dicks S", "Ranse K", "Northam H", "Frank M.P. van Haren PhD"]}, {"title": "Safety of nicotine replacement therapy in critically ill smokers: A retrospective cohort study", "year": "2016", "source": "Anaesthesia and Intensive Care, vol. 44, no. 6, pp. 758-761pp", "authors": ["Kerr A", "McVey J", "Wood A", "Frank M.P. van Haren PhD"]}, {"title": "Very old patients urgently referred to the intensive care unit: Long-term outcomes for admitted and declined patients", "year": "2016", "source": "Critical Care and Resuscitation, vol. 18, no. 3, pp. 157-164", "authors": ["Hoffman K", "Loong B", "Frank M.P. van Haren PhD"]}, {"title": "Potentially modifiable factors contributing to outcome from acute respiratory distress syndrome: the LUNG SAFE study", "year": "2016", "source": "Intensive Care Medicine, vol. 42, no. 12, pp. 1865-1876", "authors": ["Laffey J", "Bellani G", "Pham T", "Frank M.P. van Haren PhD"]}, {"title": "Epidemiology, Patterns of Care, and Mortality for Patients With Acute Respiratory Distress Syndrome in Intensive Care Units in 50 Countries", "year": "2016", "source": "JAMA: The Journal of the American Medical Association, vol. 315, no. 8, pp. 788-800", "authors": ["Bellani G", "Laffey J", "Pham T", "Frank M.P. van Haren PhD"]}, {"title": "Effect of dexmedetomidine added to standard care on ventilator-free time in patients with agitated delirium a randomized clinical trial", "year": "2016", "source": "JAMA: The Journal of the American Medical Association, vol. 315, no. 14, pp. 1460-1468", "authors": ["Reade M", "Eastwood G", "Bellomo R", "Frank M.P. van Haren PhD"]}, {"title": "cetaminophen for Fever in Critically Ill Patients with Suspected Infection", "year": "2015", "source": "New England Journal of Medicine, vol. 373, no. 23, pp. 2215-2224", "authors": ["Young P", "Saxena M", "Bellomo R", "Frank M.P. van Haren PhD"]}, {"title": "multicenter randomized trial of continuous versus intermittent Î²-lactam infusion in severe sepsis", "year": "2015", "source": "American Journal of Respiratory and Critical Care Medicine, vol. 192, no. 11, pp. 1298-1305", "authors": ["Dulhunty J", "Roberts J", "Davis J", "Frank M.P. van Haren PhD"]}, {"title": "Sleeping on a problem: the impact of sleep disturbance on intensive care patients - a clinical review", "year": "2015", "source": "Annals of Intensive Care, vol. 5, no. 3, pp. 1-10", "authors": ["Delaney L", "Frank M.P. van Haren PhD", "Frank M.P. van Haren PhD"]}, {"title": "Infection control in times of Ebola: How well are we training the next generation of intensivists in Australia and New Zealand?", "year": "2015", "source": "Critical Care and Resuscitation, vol. 17, no. 2, pp. 65-66", "authors": ["Frank M.P. van Haren PhD", "Cohen J", "McKee A"]}, {"title": "International study on microcirculatory shock occurrence in acutely Ill patients", "year": "2015", "source": "Critical Care Medicine, vol. 43, no. 1, pp. 48-56", "authors": ["Vellinga N", "Boerma E", "Koopmans M", "Frank M.P. van Haren PhD"]}, {"title": "Preliminary report of a novel model using human umbilical vein endothelium in whole umbilical cord preparations to examine the in vitro effects of lipopolysaccharide and hypertonic saline on the gene expression of inflammatory mediators", "year": "2015", "source": "Anaesthesia and Intensive Care, vol. 43, no. 2, pp. 277-279", "authors": ["Frank M.P. van Haren PhD", "Sleigh J", "Cursons J"]}, {"title": "Sepsis and Pharmacogenomics: Can the VAS(S)T Majority of Vasopressor Treatment Be Individualized?", "year": "2014", "source": "Critical Care Medicine, vol. 42, no. 8, pp. 1944-1945", "authors": ["WESTPHAL M", "Frank M.P. van Haren PhD"]}, {"title": "Sodium bicarbonate infusion to reduce cardiac surgery-associated acute kidney injury: a phase II multicenter double-blind randomized controlled trial", "year": "2013", "source": "Critical Care Medicine, vol. 41, no. 7, pp. 1599-1607", "authors": ["McGuinness S", "Parke R", "Bellomo R", "Frank M.P. van Haren PhD"]}, {"title": "Prognostic value of enterocyte injury in critically ill patients: no gut, no glory?", "year": "2013", "source": "Critical Care Medicine, vol. 41, no. 9, pp. 2238-2239", "authors": ["Frank M.P. van Haren PhD"]}, {"title": "The use of hypertonic solutions in sepsis", "year": "2013", "source": "Trends in Anaesthesia and Critical Care, vol. 3, no. 1, pp. 37-41", "authors": ["Frank M.P. van Haren PhD"]}, {"title": "Endoscopic findings during placement of postpyloric feeding tubes in intensive care patients: A retrospective observational study", "year": "2012", "source": "Critical Care and Resuscitation, vol. 14, no. 2, pp. 101-104", "authors": ["Frank M.P. van Haren PhD", "Ram S", "Hill J"]}, {"title": "Hypertonic fluid administration in patients with septic shock: A prospective randomized controlled pilot study", "year": "2012", "source": "Shock, vol. 37, no. 3, pp. 268-275", "authors": ["Frank M.P. van Haren PhD", "Sleigh J", "Boerma C"]}, {"title": "Electrocardiogram interpretation for ischemia in patients with septic shock: A disheartening exercise", "year": "2011", "source": "Critical Care Medicine, vol. 39, no. 9, pp. 2187 - 2189", "authors": ["Frank M.P. van Haren PhD"]}, {"title": "The effects of hypertonic fluid administration on the gene expression of inflammatory mediators in circulating leucocytes in patients with septic shock: A preliminary study", "year": "2011", "source": "Annals of Intensive Care, vol. 1, no. 44, pp. 1-8", "authors": ["Frank M.P. van Haren PhD", "Sleigh J", "Cursons R"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}