{"ANU": {"name": "Gary Buttriss", "link": "https://researchers.anu.edu.au/researchers/buttriss-gj", "colleges": "College of Business& Economics", "email": "gary.buttriss@anu.edu.au", "phone": "", "expertise": ["Marketing", "Corporate Governance And Stakeholder Engagement", "Environmental Science And Management Not Elsewhere Classified", "Business And Management", "Ecological Impacts Of Climate Change"], "interest": ["Sustainability including individual, organization and market responses to climate change. Including how consumers derive value and the potential this has for developing new business models and markets.Sustainable enterprise - including organizational identity - becoming a sustainable organizationbusiness ethicsSustainable Development Goals and businessOrganizational resilience - resilience as a process of organization continual renewalMethods for understanding the deeper processes of change and innovationAn analytical approach to business decision-making and performance -including systems thinking"], "biography": "", "project": ["Organizational Identity - Becoming a sustainable organization", "Including how organization identity influences their adaptation to climate change and approach to innovation. How organizations manage their brand in rapidly evolving and unpredictable markets including technology markets and markets impacted by climate change.", "Business model innovation in product service systems (PSS)", "Developing the business case around servicizing the business model and the role of customer life time value", "Supply chain risks and business opportunities resulting from cliamte change", "Resilience in supply chains - Examining the impact of climate change on supply chains in the wellness industry. What risks and business opprtunities may emerge.", "Is business rewarded for doing good?", "Exploring issues in business legitimacy and brand sacrifices.", "Consumer sustainable practice - Paradox or investment in nature", "How consumers who participate in outdoor recreation value ecosystems services - and does this influence their broader consumption behaviour.", "Integrating culture as a dimension of sustainability", "Sustainable cities – How the interactions in arts and cultural networks – in particualr indigenous knowledge, contribute to a sustainable city. The case of Canberra, Australia", "Mechanisms and change", "Exploring how we map the processes of change and the impact on decision making and individual and organizational responses.", ""], "publication": [{"title": "dapting to climate change: Becoming a resilient organisation", "year": "2016", "source": "International Sustainable Development Research Conference, Wiley Interscience, TBC", "authors": ["Gary Buttriss"]}, {"title": "The peer-to-peer, crowd-enabling mechanism of emergent brand communities", "year": "2015", "source": "4th Annual International Conference on Enterprise Marketing and Globalization (EMG 2015), TBC, TBC", "authors": ["Wallace A", "Gary Buttriss"]}, {"title": "Organizational Identity Evolving: Developing a Process Model", "year": "2014", "source": "European Group of Organizational Studies (EGO), SAGE Publications, TBC, pp. 1-23", "authors": ["Gary Buttriss"]}, {"title": "International Process Models and Methods", "year": "2014", "source": "Industrial Marketing & Purchasing (IMP) Conference, TBC, TBC, pp. 34pp", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Pinpointing the deeper structures, processes and mechanisms of change within interactional fields", "year": "2014", "source": "Australasian Marketing Journal, vol. 22, no. 1, pp. 45-50", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "triss", "year": "But", "source": "G.J. (forthcoming). Organizational identity evolving: Developing a process model. EGOS RotterdamNetherlands, Jul", "authors": ["", "Gary Buttriss"]}, {"title": "triss", "year": "But", "source": "G.J. and I.F. Wilkinson (forthcoming) Developing a Complex Adaptive Systems Models the Internationalisation Process. IMP BordeauxFrance Septembe", "authors": ["", "Gary Buttriss"]}, {"title": "Brokering in dynamic front-end innovation collaborations", "year": "2013", "source": "Fifth International Symposium on Process Organization Studies, TBC, tbc, pp. 1-44", "authors": ["Harpley S", "Gary Buttriss"]}, {"title": "Brokering in dynamic front-end innovation collaborations: A Process Approach. Fifth International Symposium on Process Organization Studies. Crete", "year": "2013", "source": "Greece June 201", "authors": ["Gary Buttriss"]}, {"title": "The power of negative brand messages: a case of angry customers in an online forum. Academy of Management Annual Conference", "year": "2013", "source": "LiverpoolUK Sept 2013", "authors": ["Gary Buttriss"]}, {"title": "Interactional Fields: Social Kinds in Processes of Development and Change", "year": "2011", "source": "Industrial Marketing and Purchasing Conference 2011, Industrial Marketing and Purchasing Group, Glasgow UK", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Mechanisms, Interactional Fields and Functional Kinds of Explaining Organizational Change", "year": "2011", "source": "Annual Conference of the Australian and New Zealand Academy of Management (ANZAM 2011), ed. Kevin Voges, Australian and New Zealand Academy of Management (ANZAM), Wellington New Zealand, pp. 1-12", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Forgoing ownership in exchange: Customer choice and Service-Dominant Logic", "year": "2009", "source": "Australia and New Zealand Marketing Academy Conference 2009, ed. Dewi Tojib, Australian and New Zealand Marketing Academy (ANZMAC), Melbourne Australia, pp. 1-9", "authors": ["Riethmuller S", "Gary Buttriss"]}, {"title": "Explaining Organizational Change through Generative Mechanisms", "year": "2009", "source": "Annual Conference of the Australian and New Zealand Academy of Management (ANZAM 2009), ed. Nicholas Beaumont, Promaco Conventions Pty Ltd, Australia, pp. cd rom", "authors": ["Gary Buttriss"]}, {"title": "Closing the Gap Between Pro-environmental Attitudes and Behaviour in Australia", "year": "2008", "source": "Australia and New Zealand Marketing Academy Conference 2008, ed. D. Spanjaard, S. Denize, N. Sharma, Australian and New Zealand Marketing Academy (ANZMAC), Sydney, pp. 1-8", "authors": ["Riethmuller S", "Gary Buttriss"]}, {"title": "Organisational sustainability: Local responses to global issues", "year": "2007", "source": "Australia and New Zealand Marketing Academy Conference 2007, ed. M Thyne, K Deans, J Gnoth, University of Otago, New Zealand, pp. 2375-2382", "authors": ["Gary Buttriss"]}, {"title": "The Determinants of Pharmacy Channel Selection in Australia", "year": "2007", "source": "Australia and New Zealand Marketing Academy Conference 2007, ed. M Thyne, K Deans, J Gnoth, University of Otago, New Zealand, pp. 155-162", "authors": ["Gary Buttriss", "Noronha K"]}, {"title": "Using Narrative Sequence Methods to Advance International Entrepreneurship Theory", "year": "2006", "source": "Journal of International Entrepreneurship, vol. 4, no. 4", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Explanation through causal mechanisms", "year": "2005", "source": "Australia and New Zealand Marketing Academy Conference 2005, ed. Sharon Purchase, Australian and New Zealand Marketing Academy (ANZMAC), Fremantle, pp. 1-7", "authors": ["Gary Buttriss"]}, {"title": "Reflection on an Undergraduate Market Analysis Subject - Informing Course Refinement", "year": "2005", "source": "Australia and New Zealand Marketing Academy Conference 2005, ed. Sharon Purchase, Australian and New Zealand Marketing Academy (ANZMAC), Fremantle, pp. 45-50", "authors": ["Burford M", "Harris J", "Gary Buttriss"]}, {"title": "Mapping mechanisms of internationalisation", "year": "2005", "source": "IMP Asia Conference 2005, ed. Peter J. Batt, Curtin University of Technology, Sydney", "authors": ["Gary Buttriss", "Wilkinson I", "Andersson P"]}, {"title": "Embodied, embedded and emergent - pinpointing deeper causes in complex systems", "year": "2004", "source": "Australia and New Zealand Marketing Academy Conference 2004, ed. Jim Wiley and Peter Thirkell, Victoria University Press, Wellington, p. 7", "authors": ["Gary Buttriss"]}, {"title": "From", "year": "2004", "source": "snap-shots' to moving pictures': Tracing processes using Narrative Sequence Analysis in the evolution of an E-Business'Annual IMP Conference 2004, ed. Thomas Ritter, P.V. Freytage, Laurids Hedda, Copenhagen Business School Press, University of Southern Denmark", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Towards a process of model of Internetalisation", "year": "2003", "source": "Annual IMP Conference 2003, ed. R. Fiocca, C. Hatteland, I.Juon, I. Snehota, L. Steigum, BI Norwegian School of Management, BI Norwegian School of Management", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Narrative Sequence Analysis: A New method for marketers", "year": "2003", "source": "Australia and New Zealand Marketing Academy Conference 2003, ed. Rachel Kennedy, Australian and New Zealand Marketing Academy (ANZMAC), Adelaide", "authors": ["Gary Buttriss", "Wilkinson I"]}, {"title": "Making Marketing Analysis relevant: Expanding the analysis experience through an integrated two-session project", "year": "2003", "source": "Australia and New Zealand Marketing Academy Conference 2003, ed. Rachel Kennedy, Australian and New Zealand Marketing Academy (ANZMAC), Adelaide", "authors": ["Gary Buttriss", "Burford M", "Harris J"]}]}, "Microsoft-Academic": [{"title": "using narrative sequence methods to advance international entrepreneurship theory", "year": 2007, "source": "journal of international entrepreneurship", "authors": [{"name": "gary buttriss", "affiliation": "australian national university"}, {"name": "ian wilkinson", "affiliation": "university of new south wales"}], "id": 175138789}, {"title": "processes of business model evolution through the mechanism of anticipation and realisation of value", "year": 2020, "source": "industrial marketing management", "authors": [{"name": "christopher nailer", "affiliation": "australian national university"}, {"name": "gary buttriss", "affiliation": "australian national university"}], "id": 31748134}, {"title": "pinpointing the deeper structures processes and mechanisms of change within interactional fields", "year": 2014, "source": "australasian marketing journal (amj)", "authors": [{"name": "gary buttriss", "affiliation": "australian national university"}, {"name": "ian wilkinson", "affiliation": "university of sydney"}], "id": 11782782}, {"title": "from snap shots to moving pictures tracing processes using narrative sequence analysis in the evolution of an e business", "year": 2004, "source": "", "authors": [{"name": "gary buttriss", "affiliation": "university of new south wales"}, {"name": "ian wilkinson"}]}, {"title": "making marketing analysis relevant expanding the analysis experience through an integrated two session project", "year": 2003, "source": "", "authors": [{"name": "gary buttriss"}, {"name": "marion r burford"}, {"name": "jennifer a harris"}]}, {"title": "forgoing ownership in exchange customer choice and service dominant logic", "year": 2009, "source": "", "authors": [{"name": "sam riethmuller", "affiliation": "australian national university"}, {"name": "gary buttriss", "affiliation": "australian national university"}]}, {"title": "explaining organizational change through generative mechanisms", "year": 2009, "source": "", "authors": [{"name": "gary buttriss", "affiliation": "australian national university"}]}, {"title": "towards a process of model of internetalisation", "year": 2003, "source": "", "authors": [{"name": "gary buttriss", "affiliation": "university of new south wales"}, {"name": "ian wilkinson"}]}, {"title": "closing the gap between pro environmental attitudes and behaviour in australia", "year": 2008, "source": "", "authors": [{"name": "sam riethmuller"}, {"name": "gary buttriss"}]}, {"title": "mapping mechanisms of internationalisation", "year": 2005, "source": "", "authors": [{"name": "gary buttriss"}, {"name": "ian wilkinson"}, {"name": "per andersson"}, {"name": "lars gunner mattsson"}]}], "ANDS-Grants": []}