{"ANU": {"name": "Gavin J.D. Smith", "link": "https://researchers.anu.edu.au/researchers/smith-gjd", "colleges": "College of Arts and Social Sciences", "email": "gavin.smith@anu.edu.au", "phone": "", "expertise": ["Social Theory", "Sociology And Social Studies Of Science And Technology", "Environmental Sociology", "Landscape Ecology"], "interest": ["I am a generalist sociologist and snake ecologist interested in conceptualising more-than-human relations in various ecosocial fields.That is to say, I am interested in the social relations that shape and emerge from interactions that occur between human and non-human social agents, things and environments.Most of my research has explored the social impacts of surveillance, specifically looking at the intersubjective meanings ascribed to everyday practices of watching and being watched, be that through CCTV camera surveillance systems or via social media cultures. I am now actively researching these kinds of relations as they pertain to the use of facial recognition technologies in various contexts as part of an ARC Discovery Project, When your face is your ID: Public responses to automated facial recognition (2020-2024)Other current research I'm doing explores the ambiguous figure of the snake in Australian society. This is a double edged project examining social and cultural perceptions of snakes, both historically and in the contemporary period, but also how social agents engage with these animals in everyday life. Building on the sociality of snakes, the second component of the research involves conducting snake ecology research, and tracking a sample of Eastern brown snakes (Pseudonaja textilis) in Canberra to better determine habitat use and movement profiles post-release. Twitter: @gavin_jd_smith"], "biography": "I am an international collaborator on The New Transparency Project (an MCRI project funded by the Social Sciences and Humanities Research Council of Canada) and an editor of Surveillance & Society. I am on the executive board of the Surveillance Studies Network. I have previously been a Research Associate in the Centre for Criminology at the University of Oxford, and a Visiting Researcher at Concordia University, Canada. I am currently a Visiting Fellow in the School of Social and Political Science at The University of Edinburgh. I am also a Research Associate in The Centre for Law, Justice and Journalism, City University London, and an International Research Associate in the Centre for Business Information Ethics, Meiji University, Japan. I am regularly consulted by the media on surveillance and security matters.", "project": ["I am currently engaged in four research projects:"], "publication": [{"title": "Governing Habits in the Simulated City. In Bennett", "year": "2021", "source": "TDibley, B, Hawkins, G, Noble, G (Eds) Assembling and Governing Habits. Abingdon, Oxon: Routledge", "authors": ["Gavin J.D. Smith"]}, {"title": "‘Pre-crime", "year": "2021", "source": "control and mass preventive justice’ in B. Arrigo and B. Sellers (Eds.) The Pre-Crime Society: Crime Culture and Control in the Ultramodern Age. Bristol: Bristol University Press", "authors": ["O’Malley P", "Gavin J.D. Smith"]}, {"title": "Smart’ Crime Prevention? Digitization and Racialized Crime Control in a Smart City. Theoretical Criminology", "year": "2020", "source": "https://journals.sagepub.com/doi/10.1177/1362480620972703", "authors": ["O'Malley P", "Gavin J.D. Smith"]}, {"title": "The politics of algorithmic governance in the black box city", "year": "2020", "source": "Big Data & Societyvol. 7, no. 2, pp. 1-9", "authors": ["Gavin J.D. Smith"]}, {"title": "Promoting interdisciplinary research through transversality - an aid to communicating more effectively with health sociologists", "year": "2020", "source": "Family Practicevol. 37, no. 2, pp. 283-285", "authors": ["Sturgiss E", "Gavin J.D. Smith"]}, {"title": "Mapping Platform Urbanism: Charting the Nuance of the Platform Pivot", "year": "2020", "source": "Urban Planningvol. 5, no. 1, pp. 116-128", "authors": ["Lee A", "Mackenzie A", "Gavin J.D. Smith"]}, {"title": "Conversations about obesity need to be realistic and informed", "year": "2019", "source": "Australian Journal of General Practicevol. 48, no. 5, pp. 247-247", "authors": ["Sturgiss E", "Agostino J", "Gavin J.D. Smith"]}, {"title": "Health by Numbers? Exploring the practice and experience of datafied health. In Lupton", "year": "2018", "source": "D (Ed.) Self-TrackingHealth and Medicine: Sociological Perspectives. Abingdon, Oxon: Routledge", "authors": ["Gavin J.D. Smith"]}, {"title": "Data doxa: The affective consequences of data practices", "year": "2018", "source": "Big Data & Society, 5(1): 1-15, DOI: https://doi.org/10.1177/2053951717751551", "authors": ["Gavin J.D. Smith"]}, {"title": "Much Better Person", "year": "2018", "source": ": The Agential Capacities of Self-Tracking Practices'in B. Ajana (ed.) Metric Culture: Ontologies of Self-Tracking Practices, London: Emerald Publishing", "authors": ["Lupton D", "Gavin J.D. Smith"]}, {"title": "The challenges of doing criminology in the Big Data era: towards a digital and data-driven approach", "year": "2017", "source": "The British Journal of Criminology, 57(2): 259-274, available at: https://doi.org/10.1093/bjc/azw096", "authors": ["Gavin J.D. Smith"]}, {"title": "Theorising digital media cultures: The politics of watching and being watched. In Tumber", "year": "2017", "source": "H and WaisbordS (eds) The Routledge Companion to Media and Human Rights. Abingdon, Oxon: Routledge, pp.126-135", "authors": ["Gavin J.D. Smith"]}, {"title": "Driving politics: data-driven governance and resistance", "year": "2017", "source": "The British Journal of Criminology,  57(2): 275-298, available at: https://doi.org/10.1093/bjc/azw075", "authors": ["Gavin J.D. Smith"]}, {"title": "Health by Numbers? Exploring the practice and experience of datafied health", "year": "2017", "source": "Health Sociology Review, 26(1): 6-21, DOI: 10.1080/14461242.2016.1196600", "authors": ["Gavin J.D. Smith"]}, {"title": "Surveillance and Embodiment: Dispositifs of Capture", "year": "2016", "source": "Body & Society, 22(2): 3-27, DOI: 10.1177/1357034X16643169", "authors": ["Gavin J.D. Smith"]}, {"title": "Companion Surveillance and Surveillant Subjectivities:\r\nOn the Seduction of Seeing and Being Seen", "year": "2016", "source": "Media Fields Journal: Critical Explorations in Media and Space, 11, Surveillance States', http://mediafieldsjournal.squarespace.com/companion-surveillance/", "authors": ["Gavin J.D. Smith"]}, {"title": "Life through a Lens: risk, surveillance and subjectivity", "year": "2016", "source": "International Journal of Crime, Justice and Social Democracy, 5(1): 82-97, DOI: 10.5204/ijcjsd.v5i1.281", "authors": ["Gavin J.D. Smith"]}, {"title": "Surveillance, Data and Embodiment: On the Work of Being Watched", "year": "2016", "source": "Body & Society, 22(2): 108-139, DOI: 10.1177/1357034X15623622", "authors": ["Gavin J.D. Smith"]}, {"title": "Life in the Goldfish Bowl", "year": "2015", "source": "Inside Story, http://insidestory.org.au/life-in-the-goldfish-bowl", "authors": ["Gavin J.D. Smith"]}, {"title": "Opening the Black Box: The Work of Watching", "year": "2015", "source": "AbingdonOxon: Routledg", "authors": ["Gavin J.D. Smith"]}, {"title": "Les répercussions sociales de l’e-living", "year": "2014", "source": "in P-Y. Badillo and D. Roux (eds) Le futur est-il e-media?, Paris: Economica, pp. 168-175", "authors": ["Gavin J.D. Smith"]}, {"title": "Surveillance Technology and Policing", "year": "2014", "source": "in G. Bruinsma and D. Weisburd (eds) Encyclopedia of Criminology and Criminal Justice, New York: Springer Science and Business Media, pp. 5094-5104, DOI: 10.1007/978-1-4614-5690-2_25", "authors": ["Gavin J.D. Smith"]}, {"title": "‘Health’ surveillance: new modes of monitoring bodies, populations, and polities", "year": "2013", "source": "Critical Public Health, 23(4):  383–392", "authors": ["Gavin J.D. Smith"]}, {"title": "Visibility Cultures and Transparent Subjects: Governing through Revelation", "year": "2012", "source": "Emerging and Enduring Inequalities, The Australian Sociological Association Peer-Reviewed Conference Proceedings, Brisbane: The University of Queensland", "authors": ["Gavin J.D. Smith"]}, {"title": "Surveillance Workers", "year": "2012", "source": "in K. Ball, K.D. Haggerty and D. Lyon (eds) Routledge Handbook of Surveillance Studies, Abingdon, Oxon: Routledge, pp. 107-11", "authors": ["Gavin J.D. Smith"]}, {"title": "What Goes Up, Must Come Down: On the moribundity of camera networks in the UK", "year": "2012", "source": "in A. Doyle, R. Lippert and D. Lyon (eds) Eyes Everywhere: The Global Growth of Camera Surveillance, Abingdon, Oxon: Routledge, pp. 46-6", "authors": ["Gavin J.D. Smith"]}, {"title": "Theorizing Surveillance in Crime Control", "year": "2011", "source": "Theoretical Criminology, 15(3): 231-23", "authors": ["Gavin J.D. Smith"]}, {"title": "Empowered Watchers or Disempowered Workers? The ambiguities of power within technologies of security", "year": "2009", "source": "in K.F. Aas, H.O. Gundhus and H.M. Lomell (eds) Technologies of Insecurity: The Surveillance of Everyday Life, Abingdon, Oxon: Routledge-Cavendish, pp. 125-14", "authors": ["Gavin J.D. Smith"]}, {"title": "Exploring Relations Between Watchers and Watched in Control(led) Systems: Strategies and Tactics", "year": "2007", "source": "Surveillance & Society, 4(4): 280-31", "authors": ["Gavin J.D. Smith"]}, {"title": "Violent Night: Urban Leisure and Contemporary Culture", "year": "2007", "source": "Urban Studies, 44(10): 2053-205", "authors": ["Gavin J.D. Smith"]}, {"title": "The night-time economy: exploring tensions between agents of control", "year": "2007", "source": "in R. Atkinson and G. Helms (eds) Securing an Urban Renaissance: Crime, Community and British Urban Policy, Bristol: The Policy Press, pp. 183-20", "authors": ["Gavin J.D. Smith"]}, {"title": "Behind the Screens: examining constructions of deviance and informal practices among CCTV control room operators in the UK", "year": "2004", "source": "Surveillance & Society, 2(2/3): 376-39", "authors": ["Gavin J.D. Smith"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}