{"ANU": {"name": "Geoff Cary", "link": "https://researchers.anu.edu.au/researchers/cary-gj", "colleges": "College of Science", "email": "Geoffrey.Cary@anu.edu.au", "phone": "", "expertise": ["Environmental Management", "Conservation And Biodiversity", "Forestry Fire Management", "Terrestrial Ecology", "Landscape Ecology", "Environmental Science And Management"], "interest": [], "biography": "Geoff is on the Editorial Advisory Committee, and an Associate Editor, for the International Journal of Wildland Fire. He was a Discipline Panel Member for the Excellence in Research for Australia 2015 and 2018 ANU submissions, and has served on the NSW Parks & Wildlife Advisory Council. Geoff serves on the CoS Reserch Committee and Reconciliation Action Plan Committee, FSES Local Area Consultative Committee, and recently the ANU WHS Fieldwork Advisory Group, ANU Statistical Consulting Unit Advisory Committee and was a mentor in the NECTAR early career Mentoring Program. Geoff is Associate Director (Research) in the Fenner School and has previouly served as Associate Director for Higher Degree Research.", "project": ["ARC Discovery Project (funded from 2021)", "‘Can animal dispersal inform fire management for species conservation?’ with Sam Banks, Geoff Cary, Hugh Davies, Graeme Gillespie, and others", "ARC Discovery Project", "‘Managing Australian landscapes to reduce house loss during fire’ with Phil Gibbons, Geoff Cary, Steve Dovers, Max Moritz", "ARC Linkage Project", "‘Fauna, Fuel and effects of native animals on fuel dynamics and bushfire  risks' with David Lindenmayer, Geoff Cary, Paul Kardol, David Wardle, and  Postdoctoral Research Fellow Claire Foster", "ARC Linkage Infrastructure, Equipment and Facilities Grant", "‘Australian mountain environmental research infrastructure facility' with Adrienne Nicotra and others", "Bushfire and Natural Hazards Cooperative Research Centre Project", "'Mapping Bushfire Hazards and Impacts' with Marta Yebra, Albert van Dijk, Geoff Cary", "ACIAR Project", "‘Improving community fire management and peatland restoration in  Indonesia' with ANU Investigators Luca Tacconi, Geoff Cary, Peter Kanowski,  John McCarthy, Lisa Robins, Lorrae Van Kerkhoff, and others", "Other recent projects", "National Health & Medical Research Council (NHMRC) Project", "‘Climate Change and Rural Communities: Integrated Study of Physical and Social Impacts, Health Risks and Adaptive Options’ with ANU NCEPH", "Bushfire Cooperative Research Centre project", "'Future Scenarios & Economics' with Steve Dovers, Malcolm Gill & Helena Clayton", "US-NZ-Aus collaborative project funded by NSF", "'Wildfire-PIRE: Feedbacks and consequences of altered fire regimes in the face of climate and land-use change in Tasmania, New Zealand, and the western U.S.'"], "publication": [{"title": "The disproportionate importance of long-unburned forests and woodlands for reptiles. Ecology and Evolution 8(22)", "year": "2018", "source": "10952–10963", "authors": ["Geoff Cary"]}, {"title": "Relationships between mature trees and fire fuel hazard in Australian forest. International Journal of Wildland Fire 27", "year": "2018", "source": "353-362", "authors": ["Geoff Cary"]}, {"title": "You own the fuel", "year": "2017", "source": "but who owns the fire? International Journal of Wildland Fire 26999-1008", "authors": ["Geoff Cary"]}, {"title": "Seed viability of early maturing alpine ash (Eucalyptus delegatensis subsp. delegatensis) in the Australian Alps", "year": "2017", "source": "south-eastern Australiaand its implications for management under changing fire regimes. Australian Journal of Botany 65(7): 517-523", "authors": ["Geoff Cary"]}, {"title": "When can refuges mediate the genetic effects of fire regimes? A simulation study of the effects of topography and weather on neutral and adaptive genetic diversity in fire-prone landscapes. Molecular Ecology 26", "year": "2017", "source": "4935-4954", "authors": ["Geoff Cary"]}, {"title": "Using alternative soil moisture estimates in the McArthur Forest Fire Danger Index. International Journal of Wildland Fire", "year": "2017", "source": "26(9)806-819", "authors": ["Geoff Cary"]}, {"title": "", "year": "2016", "source": "Repeatability of free-burning fire experiments using heterogeneous forest fuel beds in a combustion wind tunnel. International Journal of Wildland Fire 25: 445-455", "authors": ["Geoff Cary"]}, {"title": "Landscape fires. In: Lindenmayer, D., Dovers, S., Morton, S. (ed.),Ten Commitments Revisited: Securing Australia", "year": "2014", "source": "s Future EnvironmentCSIRO Publishing, Australia, pp. 281-287", "authors": ["Gill M", "Geoff Cary"]}, {"title": "", "year": "2014", "source": "Evaluating benefits and costs of wildland fires: Critical review and future applications. Environmental Hazards 13: 114-132", "authors": ["Geoff Cary"]}, {"title": "Exploring the role of fire", "year": "2013", "source": "successionclimate, and weather on landscape dynamics using comparative modelling. Ecological Modelling 266: 172-186", "authors": ["Geoff Cary"]}, {"title": "", "year": "2013", "source": "The Effect of Patch Area on Birds in Central Australian Mulga (Acacia aneura) Woodland of Different Times-since-fire. Pacific Conservation Biology 19: 28-38", "authors": ["Geoff Cary"]}, {"title": "", "year": "2013", "source": "The worldwide \"wildfire\" problem. Ecological Applications 23: 438-454", "authors": ["Geoff Cary"]}, {"title": "Global change and fire regimes in Australia. In: Ross A Bradstock", "year": "2012", "source": "A. Malcolm Gill and Richard Williams (eds.)Flammable Australia: Fire Regimes, Biopdiversity and Ecosystems in a Changing World, CSIRO Publishing, Australia, pp. 149-169", "authors": ["Geoff Cary"]}, {"title": "", "year": "2012", "source": "Future scenarios for Australian bushfires: Report on a Bushfire CRC workshop. Australian Journal of Emergency Management 27: 34-40", "authors": ["Geoff Cary"]}, {"title": "", "year": "2012", "source": "Modelling the potential for prescribed burning to mitigate carbon emissions from wildfires in fire-prone forests of Australia. International Journal of Wildland Fire 21: 629-63", "authors": ["Geoff Cary"]}, {"title": "", "year": "2012", "source": "Implications of changing climate and atmospheric CO2 for grassland fire in south-east Australia: insights using the GRAZPLAN grassland simulation model. International Journal of Wildland Fire 21: 695-708", "authors": ["Geoff Cary"]}, {"title": "", "year": "2012", "source": "Relationship between leaf traits and fire-response strategies in shrub species of a mountainous region of south-eastern Australia. Annals of Botany 109: 197-208", "authors": ["Geoff Cary"]}, {"title": "Socially Disastrous Landscape Fires in South-eastern Australia: Impacts", "year": "2012", "source": "ResponsesImplications. In: Douglas Paton, Fantina Tedim (eds.), Wildfire and Community - Facilitating Preparedness and Resilience, Charles C Thomas Publisher Ltd, Springfield, Illinois, USA, pp. 14-32", "authors": ["Geoff Cary"]}, {"title": "Challenges and Needs in Fire Management: A Landscape Simulation Modeling Perspective In: Chao Li", "year": "2011", "source": "Raffaele LafortezzaJiquan Chen (ed.), Landscape Ecology in Forest Management and Conservation, Springer, Berlin, pp. 75-98", "authors": ["Geoff Cary"]}, {"title": "", "year": "2011", "source": "Fire and carbon dynamics under climate change in south-eastern Australia: Insights from FullCAM and FIRESCAPE modelling. International Journal of Wildland Fire 20: 563-577", "authors": ["Geoff Cary"]}, {"title": "", "year": "2010", "source": "Classifying the fire-responses of plants: How reliable are species-level classifications? Austral Ecology 35: 264-273", "authors": ["Geoff Cary"]}, {"title": "", "year": "2010", "source": "The effect of fire on birds of mulga woodland in arid central Australia. International Journal of Wildland Fire 19: 949-960", "authors": ["Geoff Cary"]}, {"title": "Relative importance of fuel management", "year": "2009", "source": "ignition management and weather for area burned: evidence from five landscape-fire-succession models. International Journal of Wildland Fire 18: 147-156", "authors": ["Geoff Cary"]}, {"title": "Changes in fire and carbon dynamics for projected future climates in the south eastern Australian high country. International Congress on Modelling and Simulation (MODSIM 2009)", "year": "2009", "source": "ed. AnderssenR.S., R.D. Braddock and L.T.H. Newham, Modelling and Simulation Society of Australia and New Zealand Inc., Australia, pp. 2569-2575", "authors": ["Geoff Cary"]}, {"title": "", "year": "2008", "source": "World congress highlights need for action. Landscape Ecology 23: 1-2", "authors": ["Geoff Cary"]}, {"title": "Influence of fire severity on the regeneration", "year": "2008", "source": "recruitment and distribution of eucalypts in the Cotter River CatchmentAustralian Capital Territory. Austral Ecology 33: 55-67", "authors": ["Geoff Cary"]}, {"title": "Modelling applications of the Australian forest fire danger index. NRIFD Symposium 2005", "year": "2005", "source": "ed. Kohyu SatohResearch Centre for Fire and Disasters, Tokyo", "authors": ["Geoff Cary"]}, {"title": "Climate change and bushfire incidence. Clean Air Forum 2004", "year": "2005", "source": "NSW Department of Environment and ConservationSydney, pp. 15-18", "authors": ["Geoff Cary"]}, {"title": "", "year": "2005", "source": "Research priorities arising from the 2002-2003 bushfire season in south-eastern Australia. Australian Forestry 68: 104-111", "authors": ["Geoff Cary"]}, {"title": "", "year": "2004", "source": "A classification of landscape fire succession models: Spatial simulations of fire and vegetation dynamics. Ecological Modelling 179: 3-27", "authors": ["Geoff Cary"]}, {"title": "Fire research and policy priorities: insights from the 2003 national fire forum. Australian Journal of Emergency Management", "year": "2004", "source": "1976-84", "authors": ["Geoff Cary"]}, {"title": "Importance of climate change for fire regimes. Bushfire in a Changing Environment: New Directions in Management", "year": "2004", "source": "ed. Angela BakerMatthew Sparks, Bruce Diekman, Sian Edmondson, Matthew Misdale, An, Nature Conservation Council NSW Inc, Sydney, pp. 155-161", "authors": ["Geoff Cary"]}, {"title": "Optimal risk-management of bushfires in a changing world. Bushfire CRC Conference 2004", "year": "2004", "source": "Bushfire CRCAustralia, p. 2", "authors": ["Geoff Cary"]}, {"title": "Research and policy priorities: A synthesis. In: Cary", "year": "2003", "source": "G.Lindenmayer, D., and Dovers, S. (ed.), Australia Burning: Fire Ecology, Policy and Management Issues, CSIRO Publishing, Melbourne, pp. 252-265", "authors": ["Geoff Cary"]}, {"title": "ustralia Burning: Fire Ecology", "year": "2003", "source": "Policy and Management IssuesCSIRO Publishing, Melbourne", "authors": ["Geoff Cary"]}, {"title": "Fire behaviour and fire regime science: a discussion summary. In: Cary", "year": "2003", "source": "G.Lindenmayer, D., and Dovers, S. (ed.), Australia burning: fire ecology, policy and management issues, CSIRO Publishing, Melbourne, pp. 97-102", "authors": ["Geoff Cary"]}, {"title": "ustralia burning: a discussion summary. In: Cary", "year": "2003", "source": "G.Lindenmayer, D., and Dovers, S. (ed.), Australia burning: fire ecology, policy and management issues, CSIRO Publishing, Melbourne, pp. 248-251", "authors": ["Geoff Cary"]}, {"title": "Sensitivity of Fire Regimes to Climate Change. Climate Impacts on Australia", "year": "2003", "source": "s Natural Resources: Current and Future Challengesed. Qld Govt, Standing Committee on Natural Resource Management, QLD, pp. 33-35", "authors": ["Geoff Cary"]}, {"title": "Using simulation to map fire regimes: an evaluation of approaches", "year": "2003", "source": "strategiesand limitations. International Journal of Wildland Fire 12: 309-322", "authors": ["Geoff Cary"]}, {"title": "Sensitivity of fire regimes to management. In: Cary", "year": "2003", "source": "G.Lindenmayer, D., and Dovers, S. (ed.), Australia burning: fire ecology, policy and management issues, CSIRO Publishing, Melbourne, pp. 65-81", "authors": ["Geoff Cary"]}, {"title": "Importance of a changing climate for fire regimes in Australia. In: Bradstock", "year": "2002", "source": "R.A.Williams, Jann E., and Gill, Malcolm A. (ed.), Flammable Australia: The Fire Regimes and Biodiversity of a Continent, Cambridge University Press, Cambridge, pp. 26-46", "authors": ["Geoff Cary"]}, {"title": "Fire regimes in landscapes: models and realities. In: Bradstock", "year": "2002", "source": "R.A.Williams, Jann E., and Gill, Malcolm A. (ed.), Flammable Australia: The Fire Regimes and Biodiversity of a Continent, Cambridge University Press, Cambridge, pp. 77-93", "authors": ["Geoff Cary"]}, {"title": "The sensitivity of snow gum to fire scarring in relation to Aboriginal landscape burning. Australasian Bushfire Conference 2001", "year": "2001", "source": "ed. PearceG. and Lester, L., New Zealand Forest Research Institute Ltd, Rotorua, NZ, pp. 285-292", "authors": ["Geoff Cary"]}, {"title": "What governs fire regimes ?. Australasian Bushfire Conference 2001", "year": "2001", "source": "ed. PearceG. and Lester, L., New Zealand Forest Research Institute Ltd, Rotorua, NZ, pp. 182-189", "authors": ["Geoff Cary"]}, {"title": "What technology can do. Fire! The Australian Experience", "year": "2000", "source": "National Academies ForumAustralian Academy of Technological Sciences and Engineering, Carlton, Victoria, pp. 79-91", "authors": ["Geoff Cary"]}, {"title": "Simulating fire regimes with FIRESCAPE. Landscape Fire Modelling Workshop", "year": "1999", "source": "ed. HawkesB.C.; Flannigan, M.D., Canadian Forest Service, Canada, pp. 32-33", "authors": ["Geoff Cary"]}]}, "Microsoft-Academic": [{"title": "forests carbon fire and water security development of capability for landscape risk analysis the dynamic landscape simulator dls v 0 1", "year": 2010, "source": "", "authors": [{"name": "stephen h roxburgh"}, {"name": "andrew l sullivan"}, {"name": "jody bruce"}, {"name": "stuart matthews"}, {"name": "geoff cary"}, {"name": "lu zhang"}, {"name": "mick meyer"}, {"name": "dick williams"}]}, {"title": "skynet 5 operational overview", "year": 2008, "source": "", "authors": [{"name": "geoff cary"}]}, {"title": "the australian flammability monitoring system", "year": 2016, "source": "", "authors": [{"name": "marta yebra"}, {"name": "albert i j m van dijk"}, {"name": "xingwen quan"}, {"name": "geoff cary"}, {"name": "pablo rozas"}]}], "ANDS-Grants": []}