{"ANU": {"name": "Geoff Hinchcliffe", "link": "https://researchers.anu.edu.au/researchers/hinchcliffe-gb", "colleges": "College of Arts and Social Sciences", "email": "Geoff.Hinchcliffe@anu.edu.au", "phone": "61254307", "expertise": ["Digital And Interaction Design", "Visual Communication Design Incl. Graphic Design", "Interactive Media", "Design Innovation", "Electronic Media Art", "Design Management And Studio And Professional Practice"], "interest": ["My research focuses on enlivening data and digital collections through visualisation, interface and interaction design. My research results in both theoretical and creative outputs, from the highly practical, to the experimental, playful and occasionally provocative. Current research themes include:Representing Cultural CollectionsMass digitisation of cultural artefacts promises unprecedented access to valuable resources but only where those collections can be represented in meaningful ways. The challenge here is both technical and cultural: How can we engineer systems that effectively aggregate and synthesise vast tracts of exponentially increasing data? But equally, how can we produce representations that are aesthetically engaging and capable of revealing the complexity and richness of a collection? Through my practice-based research I aim to contribute on both fronts: developing novel methods and computational systems for cultural datasets; and designing innovative interfaces attuned to their specific cultural settings. My research in this area has provided me with opportunity to collaborate with institutions including the State Library of NSW, State Library of Queensland, National Gallery of Australia, and renowned design retailer Make Designed Objects.Dynamic DesignDesign processes developed for the production of stable physical artefacts must be redefined for our contemporary computational context. Perhaps most significantly, the products and services we design for the computer medium must be dynamic systems capable of responding to input and changing context. My research explores the creative, cultural and technical implications of designing for today’s computational setting. Rather than a discreet new field, my work seeks to connect new forms and approaches with pre-computational practices and products; to situate the contemporary within a continuum of technical and creative design and production.Poetics & MaterialityThe presence of data and computing in our everyday lives demands more than efficient engineering - it asks us to produce systems and artefacts that are aesthetically and emotionally enriching. To this end, my research investigates the poetics of data representation, both on and off screen. It seeks to develop novel forms and fresh understanding of data as a cultural material.Speculative & Undisciplined Design20th century design disciplines are today giving way to fluid hybrid forms that are emerging in response to new technologies, commercial opportunities, and as a way to deal with increasingly complex, wicked problems. These emergent practices are not only characterised by their resistance to convenient disciplinary definitions but by their speculative, experimental and critical methodologies. My research aims to reveal new understanding of the changing practice of design, and its implications for education."], "biography": "", "project": ["Funded Research Projects", "“My Climate Future”. Australian Conservation Foundation, 2018. Value $34,000. See https://myclimate.acf.org.au", "“Corley Collection Explorer”. State Library of Queensland, 2018. Value $60,000. See https://explorer.corley.slq.qld.gov.au", "“Visualising Raynal”. Digitising Raynal research consortium, 2016. Value $9,000. See http://cdhr-projects.anu.edu.au/raynal/", "“Visionaries Explorer”. State Library of NSW, DXlab Digital Fellowship, 2016. Value $10,000. https://dxlab.sl.nsw.gov.au/visionaries-explorer/", "", "“Tangible Data Representation for the Power of One Exhibition”. Contracted research for Museum of Australian Democracy, 2014. Value $10,000.", "“Developing the generous retail interface”. Contracted research for Make Designed Objects, 2014. Value $15,000. See www.makedesignedobjects.com", "“Discover the Queenslander”. Contracted research for State Library of Queensland, 2013. Value $20,000. See www.slq.qld.gov.au/showcase/discover-the-queenslander", "“Autonomous social media visualisation”. Contracted research for Crowd Convergence, 2013. Value $10,000.", "“Interactive Visualisation of Australian Prints and Printmaking”. Contracted research for National Gallery of Australia, 2012. Value $10,000. See printsandprintmaking.gov.au/explore", "“Digital Cultural Interfaces to Environmental Data”. Contracted research for Questacon, 2012. Value $18,000.", "“Data Aesthetics in Retail Space” with Robert Foster (f!nk). Contracted research for Make Design Objects, 2011. Value $27,000.", "", ""], "publication": [{"title": "Emergent Archives - Stories from the Corley Explorer", "year": "2020", "source": "Making Meaning - Collections as Data, State Library of Queensland, State Library of Queensland, Australia", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "Climate Visualisation for Impact and Affect", "year": "2019", "source": "Visualisation Matters conference 2019, University of New South Wales, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "The Streets of Your Town: Gathering Stories of Place and Home for the SLQ Corley Collection", "year": "2019", "source": "Digital + Place symposium, Australian National University, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "My Climate 2050", "year": "2019", "source": "", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "NU Climate Coaster - website", "year": "2018", "source": "", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "", "year": "2018", "source": "ANU Climate Coaster - dataform", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "The Corley Explorer", "year": "2018", "source": "", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "To be continued: Collections as collaborations", "year": "2018", "source": "Digital Humanities Australasia conference 2018, Digital Humanities Australasia, Australia", "authors": ["Geoff Hinchcliffe", "Bode K"]}, {"title": "Visualising Raynal: Design as digital humanities", "year": "2018", "source": "Digital Humanities Australasia conference 2018, Digital Humanities Australasia, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "", "year": "2018", "source": "Visionaries Explorer", "authors": ["Geoff Hinchcliffe"]}, {"title": "Ungodly cocktail - visualising three editions of Raynalï¿½s \"Histoire\"", "year": "2017", "source": "Joining the Dots - The Art and Science of Data Visualisation, Walter and Eliza Hall Institute of Medical Research, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "Three Hundred and Sixty Six", "year": "2017", "source": "", "authors": ["Geoff Hinchcliffe"]}, {"title": "Visualising Raynal", "year": "2016", "source": "", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "Speculative design: Aka throwing stuff at the wall to see what sticks", "year": "2016", "source": "National Digital Forum 2016, National Digital Forum, New Zealand", "authors": ["Geoff Hinchcliffe"]}, {"title": "", "year": "2016", "source": "Font Sort", "authors": ["Geoff Hinchcliffe"]}, {"title": "", "year": "2016", "source": "#fundtTrove Explorer", "authors": ["Geoff Hinchcliffe"]}, {"title": "", "year": "2016", "source": "Blob Brooch Craft ACT (2016)", "authors": ["Geoff Hinchcliffe"]}, {"title": "Digital, Material, Engaged & Undisciplined: Introducing a Bachelor of Design at the Australian National University", "year": "2016", "source": "ACUADS Conference 2016: Adaptation, ed. Charles Robb, Australian Council of University Art and Design Schools (ACUADS), Queensland University of Technology", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "", "year": "2014", "source": "Data Columns MoAD (2014)", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "", "year": "2013", "source": "Virga Make Retail Store Melbourne (2013)", "authors": ["Geoff Hinchcliffe"]}, {"title": "utonomous social media visualisations", "year": "2013", "source": "", "authors": ["Geoff Hinchcliffe"]}, {"title": "Twitter Modern Classics", "year": "2012", "source": "", "authors": ["Geoff Hinchcliffe"]}, {"title": "Colouring digital collections: Challenges and opportunities for the use of colour metadata in cultural collections", "year": "2015", "source": "4th Museums and the Web Asia, MWA2015, Museums and the Web Asia 2015, Melbourne, Australia. Available: http://mwa2015.museumsandtheweb.com/proposal/colouring-digital-collections-challenges-and-opportunities-for-the-use-of-colour-metadata-in-digital-collections", "authors": ["Geoff Hinchcliffe", "Whitelaw M"]}, {"title": "Data, Computation and Creative Collaboration - reflections on interdisciplinary digital design and research", "year": "2015", "source": "ACUADS Conference 2015, Australian Council of University Art and Design Schools (ACUADS), Adelaide, Australia, pp. 11pp", "authors": ["Geoff Hinchcliffe"]}, {"title": "DaDa Visualisation", "year": "2015", "source": "International Symposium of Electronic Art ISEA 2015, ISEA International, Vancouver, Canada", "authors": ["Geoff Hinchcliffe"]}, {"title": "Discover the Queenslander", "year": "2014", "source": "", "authors": ["Whitelaw M", "Geoff Hinchcliffe"]}, {"title": "Data As Script - A critical lens for interface production", "year": "2011", "source": "Australian Council of University Art and Design Schools Conference, ACUADS 2011, ed. Mr. Gordon Bull, Australian Council of University Art and Design Schools (ACUADS), Canberra, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "Pushing your button", "year": "2009", "source": "Cumulus 38 South: Hemispheric shifts across learning teaching and research, ed. L. Fennessy, R. Kerr, G. Melles, C. Thong, W. Wright, Cumulus 38Â° South: Hemispheric shifts across\r\nlearning teaching and research, Melbourne, Australia", "authors": ["Geoff Hinchcliffe"]}, {"title": "Losing Control: Looking beyond the surface of the aesthetic interface", "year": "2008", "source": "International Symposium of Electronic Art ISEA 2008, International Symposium of Electronic Art, Singapore", "authors": ["Geoff Hinchcliffe"]}, {"title": "Interface to Learning: Creating a Design-centric Learning System", "year": "2006", "source": "Thinking the Future: Art, Design and Creativity ACUADS 2006, ed. Su Baker and Susan Fereday, Australian Council of University Art and Design Schools (ACUADS), Melbourne", "authors": ["Geoff Hinchcliffe"]}, {"title": "Engagement, experience, meaning: critical concerns for eLearning technologies in design education", "year": "2005", "source": "Designs on eLearning Conference, Designs on eLearning: Teaching and Learning with\r\nTechnology in Art, Design and Communication, London, England", "authors": ["Geoff Hinchcliffe"]}]}, "Microsoft-Academic": [{"title": "the language of practice research work exhibit", "year": 2017, "source": "", "authors": [{"name": "david macarthur", "affiliation": "university of sydney"}, {"name": "jen webb"}, {"name": "geoff hinchcliffe", "affiliation": "australian national university"}, {"name": "ursa komac"}]}, {"title": "data computation and creative collaboration reflections on interdisciplinary digital design", "year": 2015, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}, {"title": "colouring digital collections challenges and opportunities for the use of colour metadata in digital collections", "year": 2015, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}, {"title": "visualising raynal design as digital humanities", "year": 2018, "source": "", "authors": [{"name": "geoff hinchcliffe"}]}, {"title": "my climate 2050", "year": 2019, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}, {"title": "three hundred and sixty six", "year": 2017, "source": "", "authors": [{"name": "geoff hinchcliffe"}]}, {"title": "losing control looking beyond the surface of the aesthetic interface", "year": 2008, "source": "", "authors": [{"name": "geoff hinchcliffe"}]}, {"title": "anu climate coaster", "year": 2018, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}, {"title": "anu climate coaster website", "year": 2017, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}, {"title": "the corley explorer", "year": 2018, "source": "", "authors": [{"name": "geoff hinchcliffe"}, {"name": "mitchell whitelaw"}]}], "ANDS-Grants": []}