{"ANU": {"name": "George Barker", "link": "https://researchers.anu.edu.au/researchers/barker-g", "colleges": "ANU College of Law", "email": "george.barker@anu.edu.au", "phone": "", "expertise": ["Economic Theory", "Law", "Microeconomic Theory", "Legal Theory Jurisprudence And Legal Interpretation", "Industry Economics And Industrial Organisation", "Commercial And Contract Law", "Intellectual Property Law", "Public Economics  Public Choice", "Corporations And Associations Law", "Legal Institutions Incl. Courts And Justice Systems", "Applied Economics", "Labour Economics", "Tort Law", "Civil Law And Procedure", "International Trade Law", "Broadband And Modem Technology", "Communications Technologies"], "interest": ["Law and Economics, China and the World Economy, Competition, Trade Practices law and economics, intellectual property (Patent, Trade Mark & Copyright), tax law, public law, Public Finance, Management and Economics, financial and insurance market reform, the economics and regulation of network industries and utilities (including communications, energy, transport, water and ), Price Regulation, and  Asset Valuation  law and economics of Corporate Finance, Property and Contract Law and Economics, International Trade law and economics, , Tort, Insurance, Health, Education, Welfare and Labour Law and Economics, Communication, Internet, Broadcasting and Media Markets regulation, pharmaceutical, film, music, media and cultural industries, the criminal justice system and social policy (including education, health, welfare)."], "biography": "George is Director of the Centre for Law and Economics at the Australian National University, and President of the Australian Law and Economics Association. He was awarded the Olin Fellowship in Law and Economics at Cornell University in 2000, was Visiting Fellow at Oxford University Law School 2008, and is currently a visiting Fellow at the British Institute of International and Comparative Law London and Centre for Law and Economics, University College London. He was elected a Fellow of the Law and Economics Association of NZ 2009. He gained a DPhil in Economics from Oxford University 1992, and holds both a Bachelor of Laws and Master of Economics He has authored books, articles and given expert testimony on a wide range of matters involving the economic analysis of law, from the Effects of China joining the WTO (Cambridge University Press 2003), through competition law, intellectual property (Patent, Trade Mark & Copyright), tax law, public law and finance, financial and insurance market reform, the economics and regulation of network industries (including energy, water and communications), pharmaceutical, film, music, media and cultural industries, the criminal justice system and social policy (including education, health, welfare). He is the editor of Asia Pacific Law and Economics Review (ANU Electronic Press), and on the Editorial Board of the European Journal of Law and Economics.   Dr Barker has testified in the Asia Pacific Region before Australian, US, Canadian, Hong Kong, Korean, Vietnamese, and New Zealand ministers, courts and regulatory agencies on market design, regulatory policy, competition policy and intellectual property.  Dr Barker was a member of the Governing Board of Wolfson College, Oxford University from 1990 – 1992,  and co-founder and board member of LECG Asia-Pacific Ltd, Celtic Pacific Ltd, and Upstart Investments Ltd, KEA Global and past Chairman of KEA Australia.", "project": ["Law and economics of Copyright, Law and Economics of Class actions and litigation funding, law and Economics of ICT and Productivity, Law and Economics of China and the World Economy"], "publication": [{"title": "The Economics of the European Commission", "year": "2015", "source": "s Recommendation on Collective Redress'in E Lein, D Fairgrieve, M O Crespo, V Smith (ed.), Collective Redress in Europe: Why and How?, British Institute of International and Comparative Law, London, England, pp. 5-30", "authors": ["George Barker", "Freyens B"]}, {"title": "The impact of internet file-sharing on the purchase of music CDs in Canada", "year": "2015", "source": "Journal of Evolutionary Economics, vol. 25, no. 4, pp. 821-848", "authors": ["George Barker", "Maloney T"]}, {"title": "Sharing sounds: Does file-sharing harm the music industry?", "year": "2013", "source": "in J. Greenberg and C. Elliott (ed.), Communication in Question: Competing Perspectives on Controversial Issues in Communication Studies (2nd ed), Nelson Education Ltd., Toronto, pp. 243-251", "authors": ["George Barker"]}, {"title": "Third-Party Litigation Funding in Australia and Europe", "year": "2012", "source": "Journal of Law, Economics and Policy, vol. 8, no. 3, pp. 451 -524", "authors": ["George Barker"]}, {"title": "ssessing the Economic Impact of Copyright Law: Evidence of the Effect of Free Music Downloads on the purchase of music CDs", "year": "2012", "source": "Review of Economic Research on Copyright Issues (RERCI), vol. 9, no. 1, pp. 3-46", "authors": ["George Barker"]}, {"title": "Estimating the Economic Effects of Fair Use and Other Copyright Exceptions: A Critique of Recent Researchin Australia", "year": "2012", "source": "USEurope and Singapore", "authors": ["George Barker"]}, {"title": "", "year": "2012", "source": "Copyright Law and Economics: The Impact of Free Music Downloads on the Purchase of Music CDs see SSRN listing http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2128054  Paper presented to the 2012 annual meeting of the Canadian Law and Economics Association in Toronto September 2012  http://www.canlecon.org/public/conferences/3/schedConfs/3/program-en_US.pdf", "authors": ["George Barker"]}, {"title": "Third Party Funding in Australia and Europe", "year": "2011", "source": "Third-Party Financing of Litigation: Civil Justice Friend or Foe, ed. George Barker, Online only, N/A, pp. 58pp", "authors": ["George Barker"]}, {"title": "n Economic Model of Collective Redress, Relevant to Joinder Proceedings, Group Litigation and Class Actions", "year": "2011", "source": "International Association of Law Schools Conference 2011, ed. George Barker, ANU College of Law, Canberra, Australia, p. 12", "authors": ["George Barker"]}, {"title": "", "year": "2012", "source": "Assessing the Economic Impact of Copyright Law:  Evidence of the Effect of Free Music Downloads on The purchase of music CDs Review of Economic Research in Copyright Issues (forthcoming ) also http://papers.ssrn.com/sol3/papers.cfm?abstract_id=199015", "authors": ["George Barker"]}, {"title": "Third Party Litigation Funding in Australia and Europe The Journal of Law", "year": "2012", "source": "Economics & Policy Forthcoming  Spring", "authors": ["George Barker"]}, {"title": "n Economic Model of Collective Redress", "year": "2011", "source": "Relevant to Joinder ProceedingsGroup Litigation and Class Actions http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1990141", "authors": ["George Barker"]}, {"title": "Introduction: China and the reshaping of the World Trade Organisation", "year": "2003", "source": "in Deborah Z. Cass, Brett G. Williams, George Barker (ed.), China and the World Trading System: Entering the New Millennium, Cambridge University Press, London, pp. 1-18", "authors": ["George Barker", "Cass D", "Williams B"]}, {"title": "Cultural Capital and Policy", "year": "2000", "source": "Centre for Law and EconomicsAustralian National University. ISBN 0958217807, 978095821780", "authors": ["George Barker"]}, {"title": "Socioeconomic Inequalities and Health", "year": "1997", "source": "chapter 6An Economic Analysis of Income Inequality, Health Outcomes and the Role of Social Policy,", "authors": ["George Barker"]}, {"title": "Comparative institutional analysis of law and legal institutions. (Vol. 26", "year": "1996", "source": "No.1) Victoria University law review.", "authors": ["George Barker"]}, {"title": "Income Distribution Institute of Policy Studies", "year": "1996", "source": "Vincoria Univesity Wellington New Zealan", "authors": ["George Barker"]}, {"title": "n Economic Analysis of Trade Unions and the Common Law", "year": "1996", "source": "Avebury Publications,", "authors": ["George Barker"]}, {"title": "Evaluating Labour Market Contracting and Regulation:  A Transaction Cost Perspective", "year": "1989", "source": "Journal of Institutional and Theoretical EconomicsVol. 145, No. 2, pp. 317-342,", "authors": ["George Barker"]}]}, "Microsoft-Academic": [{"title": "oral health status knowledge and behaviours of people with diabetes in sydney australia", "year": 2021, "source": "international journal of environmental research and public health", "authors": [{"name": "prakash poudel"}, {"name": "rhonda griffiths", "affiliation": "university of sydney"}, {"name": "amit arora", "affiliation": "rmit university"}, {"name": "vincent w wong", "affiliation": "liverpool hospital"}, {"name": "jeff r flack", "affiliation": "liverpool hospital"}, {"name": "george barker", "affiliation": "hornsby ku ring gai hospital"}, {"name": "ajesh george"}], "id": 15239247}, {"title": "a comparison of single session positive reappraisal cognitive restructuring and supportive counselling for older adults with type 2 diabetes", "year": 2016, "source": "cognitive therapy and research", "authors": [{"name": "jamie s nowlan", "affiliation": "macquarie university"}, {"name": "viviana m wuthrich", "affiliation": "macquarie university"}, {"name": "ronald m rapee", "affiliation": "macquarie university"}, {"name": "jen m kinsella"}, {"name": "george barker", "affiliation": "hornsby ku ring gai hospital"}], "id": 47649111}, {"title": "implementing point of care blood ketone testing in the emergency department", "year": 2012, "source": "australasian emergency nursing journal", "authors": [{"name": "jen m kinsella"}, {"name": "george barker", "affiliation": "hornsby ku ring gai hospital"}, {"name": "jennie king", "affiliation": "university of sydney"}, {"name": "mary webber"}, {"name": "michael boyd"}, {"name": "kenneth w k ho"}, {"name": "robyn gallagher", "affiliation": "university of technology sydney"}], "id": 24292410}, {"title": "income distribution in new zealand", "year": 1996, "source": "", "authors": [{"name": "george barker"}]}, {"title": "needs for continuing care of demented people a model for estimating needs", "year": 1992, "source": "the psychiatrist", "authors": [{"name": "john wattis"}, {"name": "janet hobson"}, {"name": "george barker"}], "id": 151378613}, {"title": "method of duplicating data on a magnetic disk with reduced duplication time", "year": 1994, "source": "", "authors": [{"name": "kevin mcdonnell"}, {"name": "george barker"}]}, {"title": "keynote a framework for regulatory decision making under uncertainty", "year": 2008, "source": "", "authors": [{"name": "george barker"}]}, {"title": "bringing people urban nature and planning together in england a review", "year": 1997, "source": "", "authors": [{"name": "george barker"}]}, {"title": "members of the special advisory commission on mandated health insurance benefits", "year": 2008, "source": "", "authors": [{"name": "delegate m kirkland cox"}, {"name": "charles j colgan"}, {"name": "delegate h morgan griffith"}, {"name": "phillip a hamilton"}, {"name": "delegate frank"}, {"name": "d hargrove"}, {"name": "senator r edward houck"}, {"name": "janet d howell"}, {"name": "delegate johnny"}, {"name": "s joannou"}, {"name": "delegate dwight"}, {"name": "c e jones"}, {"name": "delegate harvey"}, {"name": "b p morgan"}, {"name": "thomas k norment"}, {"name": "robert d orrock"}, {"name": "lacey e putney"}, {"name": "senator walter"}, {"name": "a stosch"}, {"name": "walter j kucharski"}, {"name": "philip a leone"}, {"name": "delegate clifford"}, {"name": "l athey"}, {"name": "george barker"}, {"name": "delegate timothy"}, {"name": "d hugo"}, {"name": "delegate terry"}, {"name": "donald a mceachin"}, {"name": "delegate donald merricks"}, {"name": "elnora h allen"}, {"name": "phyllis l cothran"}, {"name": "alfred w gross"}, {"name": "dorothye s brodersen"}, {"name": "joseph a kelliher"}, {"name": "peter j bernard"}, {"name": "karen remley"}, {"name": "renard a charity"}, {"name": "lee o viergever"}, {"name": "james f childress"}]}, {"title": "inspiration and expression how language revealed my music", "year": 2015, "source": "", "authors": [{"name": "george barker"}]}], "ANDS-Grants": []}