{"ANU": {"name": "Georgia Pike Rowney", "link": "https://researchers.anu.edu.au/researchers/pike-go", "colleges": "College of Health & Medicine", "email": "georgia.pike@anu.edu.au", "phone": "+61 410 274 178", "expertise": [], "interest": ["Intergenerational Music in CommunitiesMusic and AgeingMusic in Health and WellbeingMusic Pedagogy and Teacher TrainingHistory of Music EducationTransdisciplinary ResearchMusic in Human and Social Development"], "biography": "Georgia spent a year in New York training in voice with Susan Burghardt Diamond and Claire Alexander (former voice coach to Frank Sinatra) and studied at the Institute of Music and Health with founder Dr John Diamond (2002).  She completed a B.Arts majoring in Law and Classics at the ANU (2006), a Grad. Dip. Ed. through Monash University (2009), and graduated with a Ph.D in 2017, also at the ANU.  Her thesis developed a transdisciplinary framework encompassing history, ancient world studies, etymology, pedagogy, philosophy, and the origins of music in human society, for application to the everyday practice of music in classrooms and communities. Georgia convened the Music Engagement Program (MEP) at the ANU School of Music from 2011-2018, now privately run by Georgia and founder of the MEP, Dr Susan West. In 2016 Georgia was presented with a Children's Week Award by the Governor General of Australia for her work with children living with disabilities.", "project": [], "publication": [{"title": "The Music Engagement Program for people with Alzheimer", "year": "2021", "source": "s disease and dementia: Pilot feasibility trial outcomes'Evaluation and Program Planning, vol. 87, no. 101930", "authors": ["Gulliver A", "Georgia Pike Rowney", "Banfield M"]}, {"title": "Shared music, shared occupation: Embedding music as a socio-altruistic collective- and co-occupation in occupational therapy education", "year": "2020", "source": "Journal of Occupational Science, vol. Online, pp. 1-14", "authors": ["de Jong D", "Georgia Pike Rowney", "West S"]}, {"title": "Evaluation of the Music Engagement Program for people with Alzheimer", "year": "2019", "source": "s disease and dementia: Study protocol for a pilot trial'Contemporary Clinical Trials Communications, vol. 15, no. 100419, pp. 1-7", "authors": ["Gulliver A", "Georgia Pike Rowney", "Banfield M"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}