{"ANU": {"name": "George Olah", "link": "https://researchers.anu.edu.au/researchers/olah-g", "colleges": "College of Science", "email": "George.Olah@anu.edu.au", "phone": "", "expertise": ["Conservation And Biodiversity", "Population Ecological And Evolutionary Genetics", "Global Change Biology", "Ecology", "Genetics"], "interest": ["During my research career I have focused on tropical ecology, conservation genetics, and used cutting-edge next-generation sequencing technology to study modern and museum samples of birds for their conservation management. My research has allowed me to advance knowledge about conservation genetics in the context of the interacting environmental and anthropogenic threats. In order to transform this generated scientific knowledge into conservation action, I believe it is essential to communicate with a broader audience via publicly accessible sources and directly with decision makers. At the wider community level, I am a very passionate science communicator and wildlife documentary filmmaker."], "biography": "", "project": ["Forensic genomics to study the illegal wildlife trade", "Most recently, my research has been focusing on developing cutting-edge, field-based genomic techniques for solving wildlife trade issues. Such molecular genomic methods are widely applied to provide forensic evidence for litigation, including the illegal hunting and collection. We aim to achieve important, pro-active countermeasures with practical outcomes to the local and international wildlife trade, and applicability world-wide. Our multidisciplinary project draws on genomics and criminology to combat the illegal trade and restore threatened populations, while increasing local and international awareness of the impact.Currently, I am co-editing a Special Issue of the journal Animals with criminologist Dr Stephen Pires (Florida International University) entitled \"Wildlife Crime: Issues and Promising Solutions.\"", "Ancient DNA from feather samples in Peru", "In collaboration with Anthropologist Prof Izumi Shimada (Southern Illinois University, USA) we collected parrot feathers from a pre-Hispanic archaeological site in the Atacama Desert of Peru. As parrots do not occur naturally in that region, we were interested in their provenance. Colleagues at the Australian Centre for Ancient DNA (ACAD) successfully extracted and sequenced ancient DNA (aDNA) from the ancient feather tissues found in the burial sites. Currently, we are analysing the results with Dr Pere Bover (Universidad de Zaragoza, Spain) to identify the species and the possible geographic origin of the feathers.", "Remote sensing and landscape genetics", "In a collaboration with spatial ecologist Dr Greg Asner (Global Airborne Observatory) and Dr Annabel Smith (University of Queensland), we combined their remotely sensed data with my population genetic information on Red-and-green Macaws, revealing differences between the studied macaw populations and related their genetic structure to landscape features. Our results provided baseline landscape genetic information about natural dispersal barriers in macaws that can assist in understanding the influence of rapid anthropogenic change on their genetic population structure in the Amazon Basin (Landscape Ecology).In my ongoing collaboration with Dr Asner as the director of the Center for Global Discovery and Conservation Science, Arizona State University, we are investigating if forest functional diversity can explain threats to bird populations and communities by using the world’s first functional biodiversity map of the entire area of Peru.", "Global conservation status of parrots (Psittaciformes)", "My research has contributed to knowledge about the biological and socio-economic mechanisms underlying the different conservation status of parrots globally. In partnership with IUCN and BirdLife International, in 2016 I used comparative meta-analyses on large biological datasets to show how threats and other factors influence the global extinction risk in parrots (Biodiversity and Conservation). It was covering an important review about the status of parrots world-wide and demonstrated that they have higher aggregate extinction risk than any other comparable bird groups. In 2017, we focussed on the Australasian and Pacific regions, and showed that invasive species and poaching for wildlife trade are especially severe threats to parrots, and highlighted priority locations and species for conservation (Emu – Austral Ornithology). One of the main conservation hotspots was the Wallacea region of Indonesia, due to the high percentage of parrot species affected by the illegal pet trade. Between 2018 and 2020, I was the Australasian and Oceanian regional coordinator for the Working Group on Psittaciformes at the International Ornithologists' Union.In a collaboration with Dr Javier Nori and his team at the Centro de Zoología Aplicada (Universidad Nacional de Córdoba) and the Instituto de Diversidad y Ecología Animal (CONICET-UNC) in Argentina, we investigated the current and predicted effects of forest habitat destruction on the conservation status of parrots worldwide (Global Change Biology). We highlighted, that the current extent and locations of the protected areas are insufficient in safeguarding most of these threatened species.", "Applying next generation sequencing techniques to modern and museum DNA samples of the critically endangered regent honeyeaters", "In this project, we were interested in population genetic changes of a Critically Endangered honeyeater through space and time, and in estimating the population size over a 100-year time frame, using mainly museum samples. Museum collections are becoming increasingly important in conservation genomic studies as they are repositories of genetic materials from the past. We collected genetic samples from the remaining populations of this species, and also collaborated with many national and international museums to investigate the magnitude of the genetic diversity lost in these birds. In close collaboration with the Heinsohn and Banks labs at FSES and the Peakall and Moritz labs at RSB, I adjusted the existing genomics protocols to work with both ancient (aDNA) and modern DNA samples. I eventually applied next-generation sequencing (NGS) technology: a hybridization RAD technique that included ddRAD library preparation of the probes from contemporary samples, in order to hybridize with fragmented aDNA successfully extracted from museum specimens (PLOS One).", "Conservation genetics of the critically endangered swift parrots", "The long-term research project of the Heinsohn lab (Difficult Bird Research Group) has accumulated hundreds of genetic samples from the Critically Endangered Swift Parrot of Tasmania over the years. I processed these samples and analysed the genetics of this iconic Australian species. The results of these analyses have provided important management information for their conservation, implemented in the field. We have published three papers from this project: the first presented genetic evidence confirming the severe extinction risk of this species (Animal Conservation), the second showed how sex ratio bias and shared paternity reduce their population viability (Journal of Animal Ecology), and the third presented techniques to estimate the effective population size in endangered species (Animal Conservation).", "Ecology and population genetics of two large macaw species in the Peruvian amazon", "My PhD project was completed at the Fenner School of Environment and Society, ANU through an international scholarship (IPRS) from the ANU and an Endeavour Scholarship from the Department of Education of the Australian Government. My research focused on the ecology and conservation of wild macaw populations in the Peruvian Amazon. I developed and validated non-invasive DNA collection methods for the first time on wild birds in tropical settings to reconstruct their population genetic structure."], "publication": [{"title": "Sex ratio bias and shared paternity reduce individual fitness and population viability in a critically endangered parrot", "year": "2019", "source": "Journal of Animal Ecology, vol. 88, no. 4, pp. 502-510", "authors": ["Heinsohn R", "George Olah", "Webb M"]}, {"title": "Genomic impact of severe population decline in a nomadic songbird", "year": "2019", "source": "PLOS ONE (Public Library of Science), vol. 14, no. 10, pp. 1-19pp", "authors": ["Crates R", "George Olah", "Adamski M"]}, {"title": "Genetic evidence confirms severe extinction risk for\r\ncritically endangered swift parrots: implications for\r\nconservation management", "year": "2018", "source": "Animal Conservation, vol. 21, no. 4, pp. 313-323", "authors": ["Stojanovic D", "George Olah", "Peakall R"]}, {"title": "Parrots of Oceania - a comparative study of extinction risk", "year": "2018", "source": "Emu - Austral Ornithology, vol. 118, no. 1, pp. 94-112", "authors": ["George Olah", "Theuerkauf J", "Legault A"]}, {"title": "Exploring dispersal barriers using landscape genetic resistance modelling in scarlet macaws of the Peruvian Amazon", "year": "2017", "source": "Landscape Ecology, vol. 32, no. 2, pp. 445-456", "authors": ["George Olah", "Smith A", "Asner G"]}, {"title": "The application of non-invasive genetic tagging reveals new insights into the clay lick use by macaws in the Peruvian Amazon", "year": "2017", "source": "Conservation Genetics, vol. 18, no. 5, pp. 1037-1046pp", "authors": ["George Olah", "Heinsohn R", "Brightsmith D"]}, {"title": "Validation of non-invasive genetic tagging in two large macaw species (Ara macao and A-chloropterus) of the Peruvian Amazon", "year": "2016", "source": "Conservation Genetics Resources, vol. 8, no. 4, pp. 499-509pp", "authors": ["George Olah", "Heinsohn R", "Brightsmith D"]}, {"title": "Ecological and socio-economic factors affecting extinction risk in parrots", "year": "2016", "source": "Biodiversity and Conservation, vol. 25, no. 2, pp. 205-223", "authors": ["George Olah", "Butchart S", "Symes A"]}, {"title": "Nitrogen metabolic wastes do not influence drinking water preference in feral pigeons", "year": "2006", "source": "Acta Zoologica Academiae Scientiarum Hungaricae, vol. 52, no. 4, pp. 401-406", "authors": ["George Olah", "Rozsa L"]}]}, "Microsoft-Academic": [{"title": "ecological and socio economic factors affecting extinction risk in parrots", "year": 2016, "source": "biodiversity and conservation", "authors": [{"name": "george olah", "affiliation": "australian national university"}, {"name": "stuart h m butchart", "affiliation": "university of cambridge"}, {"name": "stuart h m butchart", "affiliation": "birdlife international"}, {"name": "andy symes", "affiliation": "birdlife international"}, {"name": "iliana medina guzman", "affiliation": "australian national university"}, {"name": "ross b cunningham", "affiliation": "australian national university"}, {"name": "donald j brightsmith", "affiliation": "texas a m university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}], "id": 5043789}, {"title": "portable security system using communicating cards", "year": 1993, "source": "", "authors": [{"name": "george olah"}]}, {"title": "nest site selection and efficacy of artificial nests for breeding success of scarlet macaws ara macao macao in lowland peru", "year": 2014, "source": "journal for nature conservation", "authors": [{"name": "george olah", "affiliation": "australian national university"}, {"name": "gabriela vigo", "affiliation": "texas a m university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}, {"name": "donald j brightsmith", "affiliation": "texas a m university"}], "id": 77407326}, {"title": "parrots of oceania a comparative study of extinction risk", "year": 2018, "source": "", "authors": [{"name": "george olah", "affiliation": "australian national university"}, {"name": "jorn theuerkauf", "affiliation": "museum and institute of zoology"}, {"name": "andrew legault"}, {"name": "roman gula", "affiliation": "museum and institute of zoology"}, {"name": "john stein", "affiliation": "australian national university"}, {"name": "stuart h m butchart", "affiliation": "university of cambridge"}, {"name": "mark obrien", "affiliation": "birdlife international"}, {"name": "robert heinsohn", "affiliation": "australian national university"}]}, {"title": "exploring dispersal barriers using landscape genetic resistance modelling in scarlet macaws of the peruvian amazon", "year": 2017, "source": "landscape ecology", "authors": [{"name": "george olah", "affiliation": "australian national university"}, {"name": "annabel l smith", "affiliation": "university college dublin"}, {"name": "annabel l smith", "affiliation": "australian national university"}, {"name": "gregory p asner", "affiliation": "carnegie institution for science"}, {"name": "donald j brightsmith", "affiliation": "texas a m university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}, {"name": "rod peakall", "affiliation": "australian national university"}], "id": 104292366}, {"title": "sex ratio bias and shared paternity reduce individual fitness and population viability in a critically endangered parrot", "year": 2019, "source": "journal of animal ecology", "authors": [{"name": "robert heinsohn", "affiliation": "australian national university"}, {"name": "george olah", "affiliation": "australian national university"}, {"name": "matthew webb", "affiliation": "australian national university"}, {"name": "rodney peakall", "affiliation": "australian national university"}, {"name": "dejan stojanovic", "affiliation": "australian national university"}], "id": 33456383}, {"title": "genetic evidence confirms severe extinction risk for critically endangered swift parrots implications for conservation management", "year": 2018, "source": "animal conservation", "authors": [{"name": "dejan stojanovic", "affiliation": "australian national university"}, {"name": "george olah", "affiliation": "australian national university"}, {"name": "matthew webb", "affiliation": "australian national university"}, {"name": "rod peakall", "affiliation": "australian national university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}], "id": 144146645}, {"title": "validation of non invasive genetic tagging in two large macaw species ara macao and a chloropterus of the peruvian amazon", "year": 2016, "source": "conservation genetics resources", "authors": [{"name": "george olah", "affiliation": "australian national university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}, {"name": "donald j brightsmith", "affiliation": "texas a m university"}, {"name": "jose r espinoza", "affiliation": "cayetano heredia university"}, {"name": "rod peakall", "affiliation": "australian national university"}], "id": 147353869}, {"title": "genomic impact of severe population decline in a nomadic songbird", "year": 2019, "source": "plos one", "authors": [{"name": "ross crates", "affiliation": "australian national university"}, {"name": "george olah", "affiliation": "australian national university"}, {"name": "marcin adamski", "affiliation": "australian national university"}, {"name": "nicola c aitken", "affiliation": "australian national university"}, {"name": "sam c banks", "affiliation": "australian national university"}, {"name": "dean ingwersen", "affiliation": "birdlife australia"}, {"name": "louis ranjard", "affiliation": "australian national university"}, {"name": "laura rayner", "affiliation": "australian national university"}, {"name": "dejan stojanovic", "affiliation": "australian national university"}, {"name": "tomasz suchan", "affiliation": "polish academy of sciences"}, {"name": "brenton von takach dukai", "affiliation": "australian national university"}, {"name": "robert heinsohn", "affiliation": "australian national university"}], "id": 202381698}, {"title": "global trends of habitat destruction and consequences for parrot conservation", "year": 2020, "source": "global change biology", "authors": [{"name": "david l vergaratabares", "affiliation": "national scientific and technical research council"}, {"name": "javier m cordier", "affiliation": "national scientific and technical research council"}, {"name": "marcos landi", "affiliation": "national scientific and technical research council"}, {"name": "george olah", "affiliation": "australian national university"}, {"name": "javier nori", "affiliation": "national scientific and technical research council"}], "id": 74970393}], "ANDS-Grants": []}