{"ANU": {"name": "Gerd Schroeder Turk", "link": "https://researchers.anu.edu.au/researchers/schroeder-turk-g", "colleges": "College of Science", "email": "gerd.schroeder-turk@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "Gerd Schröder-Turk studied physics in Cologne (Köln). After completing his Diploma thesis on statistical physics in 2000, he completed a PhD at the Australia National University in 2005 on geometric frustration in self assembled bicontinuous lipid systems, titled ’Skeletons in the Labyrinth’. From 2006-2015, he was employed as a lecturer (Akademischer Rat), senior lecturer (Akademischer Oberrat) and acting professor (Vertretungsprofessor) at the university of Erlangen-Nürnberg, conducting and directing research into the geometry and physics of spatially complex systems, with a focus on disordered systems, network-like geometries and biophotonic/nanoengineered applications. In 2015 he moved to a senior lecturer position within the  Maths&Stats Department of the School of Engineering and IT at  Murdoch University in Perth. He completed a habilitation degree in 2013. He was awarded the Prize for Excellence in teaching of the FAU in 2010, and the Emmy-Noether Prize in 2014. He is a founding member of the interdisciplinary research group 'Geometry and Physics of spatial random systems', and a visiting fellow of the Australian National University and the University of Erlangen-Nürnberg.", "project": ["I refer to my research area as 'materials geometry', that is, the  combination of geometry and the science of biological or synthetic  materials. Much of my research is focused on systems where a complex  spatial structure determines their physical or biological properties. In  such systems, the route to understanding physics or function is often  via modern geometry, including hyperbolic and stochastic geometry.", "Formation of complex structure in biology and chemistry:", "Applications of complex structures for advanced materials", "Characterisation and 3D imaging of complex material morphologies", "Geometric concepts and algorithmic solutions", "Statistical physics and materials properties", ""], "publication": [{"title": "Bloch Modes and Evanescent Modes of Photonic Crystals: Weak Form Solutions Based on Accurate Interface Triangulation", "year": "2015", "source": "Crystals, vol. 5, no. 1, pp. 14-44", "authors": ["Saba M", "Gerd Schroeder Turk"]}, {"title": "Non-universal Voronoi cell shapes in amorphous ellipsoid packs", "year": "2015", "source": "Europhysics Letters, vol. 111, no. 2", "authors": ["Schaller F", "Kapfer S", "Hilton J", "Gerd Schroeder Turk"]}, {"title": "bsence of circular polarisation in reflections of butterfly wing scales with chiral Gyroid structure", "year": "2014", "source": "Materials Today: Proceedings, vol. 1, pp. 193-208", "authors": ["Saba M", "Wilts B", "Hielscher J", "Gerd Schroeder Turk"]}, {"title": "The Tricontinuous 3ths(5) Phase: A New Morphology in Copolymer Melts", "year": "2014", "source": "Macromolecules, vol. 47, no. 21, pp. 7424-7430", "authors": ["Fischer M", "De Campo L", "Kirkensgaard J", "Gerd Schroeder Turk"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}