{"ANU": {"name": "Giles  Hirst", "link": "https://researchers.anu.edu.au/researchers/hirst-g", "colleges": "College of Business& Economics", "email": "giles.hirst@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "", "project": [], "publication": [{"title": "The effects of diversity climate on the work attitudes of refugee employees: The mediating role of psychological capital and moderating role of ethnic identity", "year": "2018", "source": "Journal of Vocational Behaviour, vol. 105, pp. 147-158", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "re authentic leaders always moral? The role of Machiavellianism in the relationship between authentic leadership and morality", "year": "2016", "source": "Journal of Business Ethics, vol. 133, no. 1, pp. 125-139", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "The influence of instructor support, family support and psychological capital on the well-being of postgraduate students: a moderated mediation model", "year": "2016", "source": "Studies in Higher Education, vol. Published online: 21 Jan 2016., pp. 1-17pp", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Multi-level investigation of authentic leadership as an antecedent of helping behavior", "year": "2016", "source": "Journal of Business Ethics, vol. 139, no. 3, pp. 485-499", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Heard It through the Grapevine: Indirect Networks and Employee Creativity", "year": "2015", "source": "Journal of Applied Psychology, vol. 100, no. 2, pp. 567-574", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "High and low performers", "year": "2015", "source": "intention to leave: examining the relationship with motivation and commitment'The International Journal of Human Resource Management, vol. 26, no. 5, pp. 574-588", "authors": ["Giles  Hirst", "Giles  Hirst"]}, {"title": "Outperforming Whom? A Multilevel Study of Performance-Prove Goal Orientation, Performance, and the Moderating Role of Shared Team Identification", "year": "2015", "source": "Journal of Applied Psychology, vol. 100, no. 6, pp. 1811-1824", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Psychological capital: A review and synthesis", "year": "2014", "source": "Journal of Organizational Behavior, vol. 35, pp. S120-S138", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Does servant leadership foster creativity and innovation? A multi-level mediation study of identification and prototypicality", "year": "2014", "source": "Journal of Business Research, vol. 67, no. 7, pp. 1395-1404", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Leadership and strategy: The vital but evasive role of cooperation and clarity of expectations during strategic change.", "year": "2014", "source": "Journal of Leadership and Management, vol. 1, no. 1, pp. 63-75", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "First-Tier Supplier as a Bridge for Innovation: Unpacking the Moderating Role of \"Trust Imbalance\"", "year": "2014", "source": "74th Annual Academy of Management Conference, Springer Netherlands, Netherlands, p. 0", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Developing ethical leaders: A servant leadership approach.", "year": "2014", "source": "Industrial and Organizational Psychology, vol. -, no. -, pp. 271-291", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Transformational leadership and R&D workers", "year": "2013", "source": "multiple commitments: Do justice and span of control matter?'Journal of Business Research, vol. 66, no. 11, pp. 2269-2278", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Creative Self-Efficacy and Individual Creativity in Team Contexts: Cross-Level Interactions With Team Informational Resources", "year": "2012", "source": "Journal of Applied Psychology, vol. 97, no. 6, pp. 1282-1290", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Promoting Creativity at Work: The Role of Problem-Solving Demand", "year": "2012", "source": "Applied Psychology, vol. 61, no. 1, pp. 56-80", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "Context matters: Combined influence of participation and intellectual stimulation on the promotion focus-employee creativity relationship", "year": "2012", "source": "Journal of Organizational Behavior, vol. 33, no. 7, pp. 894-909", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "How does bureaucracy impact individual creativity? A cross-level investigation of team contextual influences on goal orientation-creativity relationships", "year": "2011", "source": "The Academy of Management Journal, vol. 54, no. 3, pp. 624-641", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "cross-level perspective on employee creativity: Goal orientation, team learning behavior, and individual creativity", "year": "2009", "source": "The Academy of Management Journal, vol. 52, no. 2, pp. 280-293", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}, {"title": "social identity perspective on leadership and employee creativity", "year": "2009", "source": "Journal of Organizational Behavior, vol. 30, no. 7, pp. 963-982pp", "authors": ["Giles  Hirst", "Giles  Hirst", "Giles  Hirst"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}