{"ANU": {"name": "Hang Sio", "link": "https://researchers.anu.edu.au/researchers/sio-hc", "colleges": "College of Engineering & Computer Science", "email": "kelvin.sio@anu.edu.au", "phone": "+61 2 6125 5656", "expertise": ["Electrical And Electronic Engineering", "Photodetectors Optical Sensors And Solar Cells"], "interest": ["My research interest lies in the field of solar photovoltaic, particularly in multicrystalline silicon, with the objective to improve the material quality of multicrystalline silicon so that solar cells made from multicrystalline silicon can reach higher efficiency. My research focuses on characterising various carrier recombination mechanisms in multicrystalline silicon materials using advanced characterisation techniques, and developing methods to reduce their detrimental impacts to the final cell performance.Hydrogen is known to interact with defects and impurities in silicon (Si), passivate dangling bonds and reduce their recombination activities. It is particularly important for solar cell application. My research interest is to measure, characterise and understand the role of hydrogen in solar cells."], "biography": "", "project": ["1. Australian Renewable Energy Agency (ARENA) R&D Round 3 (03/2018-09/2021).", "2. ACAP Post-Doctoral Fellowship (01/2018-12/2020)."], "publication": [{"title": "Gettering of transition metals in high-performance multicrystalline silicon by silicon nitride films and phosphorus diffusion", "year": "2019", "source": "Journal of Applied Physics, vol. 125, no. 4, pp. -", "authors": ["Liu A", "Hang Sio"]}, {"title": "Light and elevated temperature induced degradation in p-type and n-type cast-grown multicrystalline and mono-like silicon", "year": "2018", "source": "Solar Energy Materials and Solar Cells, vol. 182, pp. 98-104", "authors": ["Hang Sio", "Wang H", "Wang Q"]}, {"title": "Imaging Surface Recombination Velocities of Grain Boundaries in Multicrystalline Silicon Wafers via Photoluminescence", "year": "2017", "source": "RRL Solar, vol. 1, no. 1, pp. 1-4pp", "authors": ["Hang Sio", "Phang S", "MacDonald D"]}, {"title": "N-type high-performance multicrystalline and mono-like silicon wafers with lifetimes above 2ms", "year": "2017", "source": "Japanese Journal of Applied Physics, vol. 56, no. 8, pp. 5pp", "authors": ["Phang S", "Hang Sio", "Yang C"]}, {"title": "Recombination sources in p-type high performance multicrystalline silicon", "year": "2017", "source": "Japanese Journal of Applied Physics, vol. 56, no. 8, pp. 6pp", "authors": ["Hang Sio", "Phang S", "Zheng P"]}, {"title": "Microscopic Distributions of Defect Luminescence from Subgrain Boundaries in Multicrystalline Silicon Wafers", "year": "2017", "source": "IEEE Journal of Photovoltaics, vol. 7, no. 3, pp. 772-780", "authors": ["Nguyen H", "Jensen M", "Li L", "Hang Sio"]}, {"title": "ctivation Kinetics of the Boron-oxygen Defect in Compensated n- and p-type Silicon Studied by High-Injection Micro-Photoluminescence", "year": "2017", "source": "IEEE Journal of Photovoltaics, vol. 7, no. 4, pp. 988-995", "authors": ["Sun C", "Nguyen H", "Hang Sio"]}, {"title": "Passivation of Phosphorus Diffused Black Multi-Crystalline Silicon by Hafnium Oxide", "year": "2017", "source": "Physica Status Solidi: Rapid Research Letters, vol. 11, no. 12, pp. 1-5pp", "authors": ["Cui J", "Phang S", "Hang Sio"]}, {"title": "pplications of carrier de-smearing of photoluminescence images on silicon wafers", "year": "2016", "source": "Progress in Photovoltaics: Research and Applications, vol. 24, no. 12, pp. 1547-1553", "authors": ["Phang S", "Hang Sio", "MacDonald D"]}, {"title": "Characterizing the Influence of Crystal Orientation on Surface Recombination in Silicon Wafers", "year": "2016", "source": "IEEE Journal of Photovoltaics, vol. 6, no. 2, pp. 412-418", "authors": ["Hang Sio", "Chong T", "Surve S"]}, {"title": "Formation mechanism and properties of twinned structures in (111) seeded directionally solidified solar grade silicon", "year": "2016", "source": "Acta Materialia, vol. 121, pp. 24-36", "authors": ["Oliveira V", "Marie B", "Cayron C", "Hang Sio"]}, {"title": "Superacid Passivation of Crystalline Silicon Surfaces", "year": "2016", "source": "ACS Applied Materials and Interfaces, vol. 8, no. 36, pp. 24205-24211", "authors": ["Bullock J", "Kiriya D", "Grant N", "Hang Sio"]}, {"title": "Recombination Activity of 2D Extended Defects in Monolike Silicon", "year": "2016", "source": "6th International Conference on Crystalline Silicon Photovoltaics, SiliconPV 2016, ed. A Weeber, J Poortmans, Elserier, TBC, pp. 755-763", "authors": ["Oliveira V", "Hang Sio", "Faujour A"]}, {"title": "Direct comparison of the electrical properties of multicrystalline silicon materials for solar cells: Conventional p-type, n-type and high performance p-type", "year": "2016", "source": "Solar Energy Materials and Solar Cells, vol. 144, pp. 339-346", "authors": ["Hang Sio", "MacDonald D"]}, {"title": "Impact of Phosphorous Gettering and Hydrogenation on the Surface Recombination Velocity of Grain Boundaries in p-Type Multicrystalline Silicon", "year": "2015", "source": "IEEE Journal of Photovoltaics, vol. 5, no. 5, pp. 1357-1365", "authors": ["Hang Sio", "Phang S", "Trupke T"]}, {"title": "COMPARISON OF RECOMBINATION ACTIVITY OF GRAIN BOUNDARIES IN VARIOUS MULTICRYSTALLINE SILICON MATERIALS", "year": "2015", "source": "European Photovoltaic Solar Energy Conference and Exhibition EU PVSEC 2015, Fraunhofer ISE, Germany, pp. 328-333", "authors": ["Hang Sio", "Phang S", "Nguyen H"]}, {"title": "Quantifying carrier recombination at grain boundaries in multicrystalline silicon wafers through photoluminescence imaging", "year": "2014", "source": "Journal of Applied Physics, vol. 116, no. 24, pp. 1-9", "authors": ["Hang Sio", "Trupke T", "MacDonald D"]}, {"title": "n accurate method for calibrating photoluminescence-based lifetime images on multi-crystalline silicon wafers", "year": "2014", "source": "Solar Energy Materials and Solar Cells, vol. 131, pp. 77-84", "authors": ["Hang Sio", "Phang S", "Trupke T"]}, {"title": "Carrier de-smearing of photoluminescence images on silicon wafers using the continuity equation", "year": "2013", "source": "Applied Physics Letters, vol. 103, no. 19, pp. 192112-1 - 192112-4", "authors": ["Phang S", "Hang Sio", "MacDonald D"]}, {"title": "The influence of crystal orientation on surface passivation in multi-crystalline silicon", "year": "2013", "source": "39th IEEE Photovoltaic Specialists Conference, PVSC 2013, IEEE, Tampa, FL, pp. 1770-1775", "authors": ["Hang Sio", "Phang S", "Wan Y"]}, {"title": "Imaging crystal orientations in multicrystalline silicon wafers via photoluminescence", "year": "2012", "source": "Applied Physics Letters, vol. 101, no. 8, p. 4", "authors": ["Hang Sio", "Xiong Z", "Trupke T"]}, {"title": "Electrical properties of different types of grain boundaries in multicrystalline silicon by photoluminescence imaging", "year": "2012", "source": "European Photovoltaic Solar Energy Conference EUPVSEC 2012, ed. S.Nowak, A.Jager-Waldau, P.Helm, WIP-Renewable Energies, Munich, Germany", "authors": ["Hang Sio", "Trupke T", "Phang S"]}]}, "Microsoft-Academic": [{"title": "ring like defect formation in n type czochralski grown silicon wafers during thermal donor formation", "year": 2021, "source": "physica status solidi (a)", "authors": [{"name": "rabin basnet", "affiliation": "australian national university"}, {"name": "hang sio", "affiliation": "australian national university"}, {"name": "manjula siriwardhana", "affiliation": "australian national university"}, {"name": "fiacre rougieux", "affiliation": "university of new south wales"}, {"name": "daniel macdonald", "affiliation": "australian national university"}], "id": 17777368}], "ANDS-Grants": []}