{"ANU": {"name": "Howard Morphy", "link": "https://researchers.anu.edu.au/researchers/morphy-h", "colleges": "College of Arts and Social Sciences", "email": "Howard.Morphy@anu.edu.au", "phone": "", "expertise": ["Multicultural Intercultural And Cross Cultural Studies", "Religion And Society", "Aboriginal And Torres Strait Islander Performing Arts", "Art History", "Museum Studies", "Aesthetics", "Studies Of Aboriginal And Torres Strait Islander Society", "Social And Cultural Anthropology", "Visual Cultures", "Biography", "Art Theory", "Information And Computing Sciences Not Elsewhere Classified"], "interest": ["In his career he has moved between Museums and Universities: researching and curating collections, and organising exhibitions. He has conducted extensive fieldwork with the Yolngu people of Northern Australia, and collaborated on many films with Ian Dunlop of Film. He has published widely in the anthropology of art, aesthetics, performance, museum anthropology, Aboriginal social organization, the history of anthropology, visual anthropology and religion. Howard's main fieldwork has been with the Yolngu people of northeast Arnhem Land (Yirrkala) beginning in 1974-76, with subsequent research visits continuing to the present. He has also worked among the Ngalakan people of the Roper Valley, in 1980-81 and again in 1998. In 1983 he spent 6 months in Darwin researching the public response to Aboriginal art. In 1988 he spent two months in the field in Central Arnhem Land (at Ramingining and Maningrida). From 2001-2005 directed a joint archaeological anthropological research project on resource use and social organisation in Blue Mud Bay, Northern Australia. The team comprised two archaeologists, two anthropologists a marine ecologist and a linguist. As a result of that he has worked with others to develop methodologies for the mapping of cultural data. In recent years the focus of his researched has moved to museum collections and the development of the concept of the relational museum. His current research projects include: 1) collaborative research with the British Museum, the National Museum of Australia and a number of Indigenous communites to develop mechanisms for linking source communities to distributed collections 2) researching (with Professor Aaron Corn) the local and global impact of the Aboriginal Artists Agency."], "biography": "", "project": ["Howard is completing the written version of his biography of the Yolngu artist Narritjin Maymuru, which has been produced in multimedia form. He continues to work in various areas of applied anthropology, in particular in relation to Indigenous rights in cultural property and land, and regional economic development through educational, cultural and environmental tourism. In theoretical terms Howard's current focus is on complexity theory and developing the concept of relative autonomy.", "Howard is currently working on a number of projects that involve close partnerships with museums and Yolngu community organisations in particular Buku Larrngay Mulka Art Centre, Yirrkala.  In collaboration with the South Australian Museum, the Melbourne Museum, the Northern Territory Library and the Kerry Stokes Collection we have completed the development of a virtual archive of Spencer and Gillen's Central Australian collections http://spencerandgillen.net/", "A project funded by an ARC linkage grant is underway with the National Museum of Australia and the British Museum as industry partners.  The project involves preparatory research for exhibitions in London and Canberra of objects from the British Museum's Aboriginal collections.  In addition to liaison with the respective communities we are working with a number of Indigenous curators artist on various aspects of the project. In collaboration with Diana James he is undertaking a research project in central Australia on the cultural dimensions of the Seven Sisters 'Songlines'.", "He continues to work with Louise Hamby and Pip Deveson on the development of a virtual archive of Yolngu collections in order to reconstruct the material record as a whole by bringing together film, photography, archival data and material culture objects.  Linked to these various projects we have developed a very innovative comprehensive data-base OCCAMS, and use film as an integral part of our research methods.", "A further project involves a collaboration with David Throsby of Macquarie University to look into ways in which Indigenous Australian's can be involved in cultural and environmental tourism on their own terms in the context of regional economies."], "publication": [{"title": "Museums", "year": "2020", "source": "Infinity and the Culture of ProtocolsRoutledge, Abingdon", "authors": ["Howard Morphy"]}, {"title": "Encounters at the National Museum of Australia: a moment in an ongoing process of engagement", "year": "2017", "source": "International Journal of Heritage Studies, vol. 23, no. 9, pp. 875-878", "authors": ["Howard Morphy"]}, {"title": "Trajectories and themes in the art of Arnhem Land", "year": "2017", "source": "in P Slauve (ed.), Territoire Du Reve - Art Aborigene Contemporain, ARTEOS, Paris, France, pp. 167-203", "authors": ["Howard Morphy"]}, {"title": "Relative Autonomy, Sociocultural Trajectories and the Emergence of Something New", "year": "2017", "source": "Insights, vol. 10, no. 9, pp. 1-11pp", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Thwarted aspirations: The political economy of a Yolngu outstation, 1972 to the present", "year": "2016", "source": "in Nicolas Peterson, Fred Myers (ed.), Experiments in Self-Determination : Histories of the outstation movement in Australia, ANU Press, Canberra, pp. 301-321", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Extended lives in global spaces: The anthropology of Yolngu pre-burial ceremonies", "year": "2016", "source": "Journal of the Royal Anthropological Institute, vol. 22, pp. 332-355", "authors": ["Howard Morphy"]}, {"title": "Indigenous Australia: Enduring Civilisation - A Personal Reflection", "year": "2015", "source": "Museum Worlds: Advances in Research, vol. 3, no. 1, pp. 7-17", "authors": ["Howard Morphy"]}, {"title": "Open Access Versus the Culture of Protocols", "year": "2015", "source": "in Raymond A Silverman (ed.), Museum as Process: Translating Local and Global Knowledges, Routledge, Abingdon and New York, pp. 90-104", "authors": ["Howard Morphy"]}, {"title": "The Displaced Local : Multiple Agency in the Building of Museums", "year": "2015", "source": "Ethnographic Collections'in Kylie Message and Andrea Witcomb (ed.), The International Handbooks of Museum Studies: Museum Theory, Wiley-Blackwell, Chichester, pp. 365-387", "authors": ["Howard Morphy"]}, {"title": "Meaningful Form: the changing boundaries between anthropology and art history", "year": "2013", "source": "in G. Ulrich Grossmann, Petra Krutisch (ed.), CIHA2012 Nuremberg: The Challenge of the Object / The challenge of the object., Germanischen Nationalmuseums, Germany, pp. 1500-1504", "authors": ["Howard Morphy"]}, {"title": "nthropological theory and government policy in Australia", "year": "2013", "source": "s Northern Territory: The hegemony of the \"mainstream\"'American Anthropologist, vol. 115, no. 2, pp. 174-187", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "rt as Action: The Yolngu", "year": "2013", "source": "in Shore, C. and Trnka, S. (ed.), Up close and personal: on peripheral perspectives and the production of anthropological knowledge, Berghahn Books, United States, pp. 125-139", "authors": ["Howard Morphy"]}, {"title": "Relative autonomy revisited: Reply to Francesca Merlan", "year": "2013", "source": "American Anthropologist, vol. 115, no. 4, pp. 639-641", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Spencer at Oenpelli", "year": "2013", "source": "in Michelle Hetherington (ed.), Glorious Days Australia 1913, National Museum of Australia Press, Canberra, pp. 159-168", "authors": ["Howard Morphy"]}, {"title": "Recursive and Iterative Processes in Australian Rock Art: An Anthropological Perspective", "year": "2012", "source": "in Jo McDonald and Peter Veth (ed.), A companion to rock art, Wiley-Blackwell, Chichester UK, pp. 294-305", "authors": ["Howard Morphy"]}, {"title": "The Anthropologist", "year": "2012", "source": "s Point of View: Eight Ethnographers Discuss Their Works and Lives", "authors": ["Howard Morphy"]}, {"title": "Reading Spencer and Gillen", "year": "2012", "source": "Sophia, vol. 51, no. 4, pp. 545-560", "authors": ["Howard Morphy"]}, {"title": "New cases, new technologies: applying anthropological research in changing times", "year": "2012", "source": "in Mark Finnane and Ian Donaldson (ed.), Taking Stock: The Humanities in Australian Life Since 1968, UWA Publishing, Perth Australia, pp. 288-300", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Becoming a Visual Anthropologist", "year": "2012", "source": "Humanities Research, vol. XVIII, no. 1, pp. 5-20", "authors": ["Howard Morphy"]}, {"title": "The Recognition of Aboriginal Art and the Building of Collections", "year": "2012", "source": "in Sandra Dudley (ed.), Narrating Objects, collectiong stories: Essays in honour of Professor Susan M. Pearce, Routledge, Taylor & Francis Group, New York, pp. 271-282", "authors": ["Howard Morphy"]}, {"title": "boriginal Australian Art in America", "year": "2012", "source": "in Stephen Gilchrist (ed.), Crossing Cultures: The Owen and Wagner Collection of Contemporary Australian Aboriginal Art at the Hood Museum of Art, University Press of New England, Hanover USA, pp. 19-30pp", "authors": ["Howard Morphy"]}, {"title": "Soon we will be spending all our time at funerals: Yolngu mortuary rituals in an epoch of constant change", "year": "2012", "source": "in S. Howell and A. Talle (ed.), Returns to the Field: Multitemporal Research and Contemporary Anthropology, Indiana University Press, Bloomington Indiana, pp. 49-72", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Not Just Pretty Pictures", "year": "2011", "source": ": Relative Autonomy and the Articulations of Yolngu Art in its Contexts'in V. Strang and M. Busse (ed.), Ownership and Appropriation, Berg Publishers, Oxford, pp. 261-286", "authors": ["Howard Morphy"]}, {"title": "Coming to Terms with Aboriginal Art in the 1960", "year": "2011", "source": "s'in Jaynie Anderson (ed.), The Cambridge Companion to Australian Art, Cambridge University Press, Australia, pp. 153-167", "authors": ["Howard Morphy"]}, {"title": "Moving the body painting into the art gallery - knowing about and appreciating works of Aboriginal art", "year": "2011", "source": "Journal of Art Historiography, vol. 4, pp. 2-20", "authors": ["Howard Morphy"]}, {"title": "Larrakitj - Death and the Celebration of Life", "year": "2011", "source": "in Anne Marie Brody (ed.), Kerry Stokes Collection, Australian Capital Equity, Australia, pp. 27-35", "authors": ["Howard Morphy"]}, {"title": "", "year": "2011", "source": "Ancestral Connections", "authors": ["Howard Morphy"]}, {"title": "", "year": "2010", "source": "We Stand on the Footprints of the Old People. DV", "authors": ["Howard Morphy", "Frederick U", "Eve P"]}, {"title": "The Recognition of Aboriginal Art and the Building of Collections", "year": "2010", "source": "in Roberta Colombo Dougoud & Barbara Muller (ed.), Dream Traces: Australian Aboriginal Bark Paintings, Infolio Editions, Gollion, pp. 155-167", "authors": ["Howard Morphy"]}, {"title": "rt as Action, Art as Evidence", "year": "2010", "source": "in Dan Hicks & Mary C. Beaudry (ed.), The Oxford Handbook of Material Culture, Oxford University Press, Oxford, pp. 265-290", "authors": ["Howard Morphy"]}, {"title": "fterword", "year": "2010", "source": "in Sandra H. Dudley (ed.), Museum Materialities: Objects, Engagements, Interpretations, Routledge, Taylor & Francis Group, Abingdon, pp. 275-285", "authors": ["Howard Morphy"]}, {"title": "Closing the Distance, Maintaining the Difference: The Art of Larrakitj", "year": "2010", "source": "in David Elliott (ed.), The Beauty of Distance: Songs of Survival in a Precarious Age, Thames and Hudson, Sydney, pp. 94-98", "authors": ["Howard Morphy"]}, {"title": "Material Culture", "year": "2010", "source": "in Alan Barnard and Jonathan Spencer (ed.), The Encyclopedia of Social and Cultural Anthropology (2nd ed), Routledge, Taylor & Francis Group, London, pp. 453-456pp", "authors": ["Howard Morphy"]}, {"title": "Museums", "year": "2010", "source": "in Alan Barnard and Jonathan Spencer (ed.), The Encyclopedia of Social and Cultural Anthropology (2nd ed), Routledge, Taylor & Francis Group, London, pp. 487-488pp", "authors": ["Howard Morphy"]}, {"title": "rt", "year": "2010", "source": "in Alan Barnard and Jonathan Spencer (ed.), The Encyclopedia of Social and Cultural Anthropology (2nd ed), Routledge, Taylor & Francis Group, London, pp. 65-67pp", "authors": ["Howard Morphy"]}, {"title": "The Blue Mud Bay Case: Refractions through saltwater country", "year": "2009", "source": "Dialogue (Academy of the Social Sciences in Australia), vol. 28, no. 1, pp. 15-25", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Re-reading Ronald Berndt: Exploring the Depths of his Yolngu Ethnography", "year": "2009", "source": "Anthropological Forum, vol. 19, no. 1, pp. 73-97", "authors": ["Howard Morphy"]}, {"title": "Not Just Images but Art", "year": "2009", "source": "in Jaynie Anderson (ed.), Crossing Cultures: Conflict, Migration and Convergence. Proceedings of the 32nd International Congress of the History of Art, The Miegunyah Press, Melbourne Australia, pp. 60-62", "authors": ["Howard Morphy"]}, {"title": "cting in a community: Art and social cohesion in Indigenous Australia", "year": "2009", "source": "Humanities Research, vol. XV, no. 2, pp. 115-131", "authors": ["Howard Morphy"]}, {"title": "rt as a Mode of Action: Some Problems with Gell", "year": "2009", "source": "s Art and Agency'Journal of Material Culture, vol. 12, no. 1, pp. 5-27", "authors": ["Howard Morphy"]}, {"title": "It", "year": "2009", "source": "s all got a meaning...its own story': Art from Yirrkala in the Australian National University Collection'in Claudette Chubb & Nancy Sever (ed.), Indigenous Art at the Australian National University, Palgrave Macmillan Ltd, Melbourne, pp. 105-124", "authors": ["Howard Morphy"]}, {"title": "rt theory and art discourse across cultures: the Yolngu and Kunwinjku compared", "year": "2009", "source": "in Claus Volkenandt & Christian Kaufmann (ed.), Between Indigenous Australia and Europe: John Mawurndjul: Art Histories in Context, Dietrich Reimer Verlag GmbH, Berlin, pp. 75-102", "authors": ["Howard Morphy"]}, {"title": "", "year": "2009", "source": "Yilpara Funeral: A Film in Four Parts", "authors": ["Howard Morphy", "Deveson P"]}, {"title": "Discovering Cook", "year": "2009", "source": "s CollectionsNational Museum of Australia Press, Canberra, Australia", "authors": ["Howard Morphy", "Hetherington M", "eds"]}, {"title": "Found in Translation", "year": "2009", "source": "in Jaynie Anderson (ed.), Crossing Cultures: Conflict, Migration and Convergence. Proceedings of the 32nd International Congress of the History of Art, The Miegunyah Press, Melbourne Australia, pp. 18-20", "authors": ["Howard Morphy"]}, {"title": "fterword: Demography and destiny", "year": "2008", "source": "in K. Glaskin, M. Tonkinson, Y. Musharbash and V. Burbank (ed.), Mortality, Mourning and Mortuary Practices in Indigenous Australia, Ashgate Publishing Ltd, Farnham UK, pp. 209-214", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "The Light of Wangarr", "year": "2008", "source": "in Elizabeth Edwards & Kaushik Bhaumik (ed.), Visual Sense: A Cultural Reader, Berg Publishers, New York, pp. 59-61", "authors": ["Howard Morphy"]}, {"title": "Joyous maggots", "year": "2008", "source": ": The symbolism of Yolngu mortuary rituals'in M. Hinkson and J. Beckett (ed.), An Appreciation of Difference: W.E.H. Stanner and Aboriginal Australia, Aboriginal Studies Press, Canberra, pp. 137-150", "authors": ["Howard Morphy"]}, {"title": "Yalangbara: the paintings", "year": "2008", "source": "in Margie West (ed.), Yalangbara: Art of the Djang'kawu, Charles Darwin University Press, Darwin, pp. 64-76", "authors": ["Howard Morphy"]}, {"title": "", "year": "2008", "source": "Living Knowledge", "authors": ["Deveson P", "Hayne K", "Howard Morphy"]}, {"title": "", "year": "2008", "source": "In Gentle Hands", "authors": ["Howard Morphy", "Deveson P"]}, {"title": "nthropological Theory and the Multiple Determinacy of the Present", "year": "2007", "source": "in David Parkin and Stanley Ulijaszek (ed.), Holistic Anthropology: Energence and Convergence, Berghahn Books, United States, pp. 148-181", "authors": ["Howard Morphy"]}, {"title": "Expressing Indentity: Creativity in Yolngu Art", "year": "2007", "source": "in Lynne Seear and Julie Ewington (ed.), Brought to Light II: Contemporary Australian art 1966-2006 from the Queensland Art Gallery collection, Queensland Art Gallery, Brisbane Australia, pp. 382-389", "authors": ["Howard Morphy"]}, {"title": "Making the Familiar Unfamiliar: The Aesthetics of Eastern Arnhem Land Art", "year": "2007", "source": "in H. Perkins and M. West (ed.), One Sun, One Moon: Aboriginal Art in Australia, Art Gallery of New South Wales, Sydney, pp. 73-77", "authors": ["Howard Morphy"]}, {"title": "Becoming Art: Exploring Cross-Cultural Categories", "year": "2007", "source": "Berg PublishersOxford UK", "authors": ["Howard Morphy"]}, {"title": "The Aesthetics of Communication and the Communication of Cultural Aesthetics: A Perspective of Ian Dunlop", "year": "2007", "source": "s Films of Aboriginal Australia'in Beate Engelbrecht (ed.), Memories of the Origins of Ethnographic Film, Peter Lang Publishing Group, Frankfurt, Germany, pp. 321-340", "authors": ["Howard Morphy"]}, {"title": "Tasting the waters: Discriminating identities in the waters of Blue Mud Bay", "year": "2006", "source": "Journal of Material Culture, vol. 11, no. 1/2, pp. 67-85", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "The Practice of an Expert: Anthropology in Native Title", "year": "2006", "source": "Anthropological Forum, vol. 16, no. 2, pp. 135-51", "authors": ["Howard Morphy"]}, {"title": "Sites of Persuasion: Yingapungapu at the National Museum of Australia", "year": "2006", "source": "in Ivan Karp et al (ed.), Museum frictions: public cultures/global transformations, Duke University Press, Durham, pp. 469-99", "authors": ["Howard Morphy"]}, {"title": "The Anthropology of Art: A Reflection on its History and Contemporary Practice", "year": "2006", "source": "in H. Morphy, M. Perkins (ed.), The Anthropology of Art: A Reader, Blackwell Publishing Ltd, Malden, USA, pp. 1-32", "authors": ["Howard Morphy", "Perkins M"]}, {"title": "Impossible to ignore: Imants Tillers", "year": "2006", "source": "response to Aboriginal art'in Deborah Hart (ed.), Imants Tillers: one world many visions, National Gallery of Australia, Canberra Australia, pp. 85-94", "authors": ["Howard Morphy"]}, {"title": "Forum: Malinowski: Odyssey of an Anthropologist: not a review in the struict sense of the term", "year": "2005", "source": "Journal of Pacific History, vol. XL, no. 2, pp. 237-254", "authors": ["Howard Morphy"]}, {"title": "The Diversity of Tradition", "year": "2005", "source": "in Therese Kenyon (ed.), Luminous: Contemporary Art from the Australian Desert, Manly Art Gallery and Museum, Sydney, pp. 4-6", "authors": ["Howard Morphy"]}, {"title": "boriginal Religions in Australia", "year": "2005", "source": "Ashgate Publishing LtdAldershot, UK", "authors": ["Howard Morphy", "Dussart F", "Charlesworth M", "eds"]}, {"title": "Style and Meaning: Abelam art through Yolgnu eyes", "year": "2005", "source": "Res: anthropology and aesthetics, vol. Res 47, no. Spring 2005, pp. 209-230", "authors": ["Howard Morphy"]}, {"title": "Spencer and Gillens Photography and the Evaluation of Anthropological Method", "year": "2005", "source": "in Philip Batty, Lindy Allen, John Morton (ed.), The Photographs of Baldwin Spencer (revised edition), Melbourne University Press (an imprint of Melbourne University Publishing), Melbourne, pp. 74-77", "authors": ["Howard Morphy"]}, {"title": "Yolgnu Art and the Creativity of the Inside", "year": "2005", "source": "in Max Charlesworth, Francoise Dussart & Howard Morphy (ed.), Aboriginal Religions in Australia: An Anthology of Recent Writings, Ashgate Publishing Ltd, Aldershot, UK, pp. 159-170", "authors": ["Howard Morphy"]}, {"title": "Seeing Indigenous Australian Art", "year": "2005", "source": "in Mariet Westermann (ed.), Anthropologies of Art, Sterling and Francine Clark Art Institute, Williamstown, pp. 124-142", "authors": ["Howard Morphy"]}, {"title": "The Aesthetics of Communication and the Communication of Cultural Aesthetics: A Perspective on Ian Dunlops Films of Aboriginal Australia", "year": "2005", "source": "Visual Anthropology Review, vol. 21, no. 1&2, pp. 63-79", "authors": ["Howard Morphy"]}, {"title": "Mutual Conversion? the Methodist Church and the Yolgnu, with particular reference to Yirrkala", "year": "2005", "source": "Humanities Research, vol. XII, no. 1, pp. 41-54", "authors": ["Howard Morphy"]}, {"title": "Indigenous Art as Economy", "year": "2005", "source": "in Diane Austin-Broos, Gaynor Macdonald (ed.), Culture, Economy and Governance in Aboriginal Australia, University of Sydney Press, Sydney, pp. 19-28", "authors": ["Howard Morphy"]}, {"title": "Yingapungapu - rzezba ziemna jako malowidto na korz", "year": "2004", "source": "in Monika Bakke (ed.), Estetyka Aborygenow, Universitas Aiictorium Editoriimoue societas, Krakow, pp. 151-164", "authors": ["Howard Morphy"]}, {"title": "O przedstawianiu przodkow", "year": "2004", "source": "in Monika Bakke (ed.), Estetyka Aborygenow, Universitas Aiictorium Editoriimoue societas, Krakow, pp. 21-32", "authors": ["Howard Morphy"]}, {"title": "Ogladajac sztuke aborygenska w galerii", "year": "2004", "source": "in Monika Bakke (ed.), Estetyka Aborygenow, Universitas Aiictorium Editoriimoue societas, Krakow, pp. 151-164", "authors": ["Howard Morphy"]}, {"title": "Synergies", "year": "2003", "source": "Australian National University Drill Hall GalleryCanberra", "authors": ["Howard Morphy", "Lendon N", "eds"]}, {"title": "boriginal Art (Japanese Translation)", "year": "2003", "source": "", "authors": ["Howard Morphy"]}, {"title": "Imants Tillers and the Dislocation of the Avant-Garde", "year": "2003", "source": "in Howard Morphy and Nigel Lendon (ed.), Synergies, Australian National University Drill Hall Gallery, Canberra, pp. 43-50pp", "authors": ["Howard Morphy"]}, {"title": "Some Concluding Anthropological Reflections", "year": "2003", "source": "in W.S.F. Pickering (ed.), On Prayer, Berghahn Books, Oxford, pp. 139-154", "authors": ["Howard Morphy"]}, {"title": "Synergies", "year": "2003", "source": "", "authors": ["Howard Morphy", "Lendon N", "Barme G"]}, {"title": "abstractions", "year": "2003", "source": "", "authors": ["Howard Morphy", "Lendon N", "Bull G"]}, {"title": "Thomson, Donald Finlay Fergusson (1901 - 1970)", "year": "2002", "source": "Australian Dictionary of Biography (Online), vol. 16, pp. 385-387", "authors": ["Howard Morphy"]}, {"title": "The Spirit of the Plains Kangaroo", "year": "2002", "source": "in Tim Bonyhady and Tom Griffiths (ed.), Words for Country: landscape and language in Australia, UNSW Press, Sydney, pp. 102-123", "authors": ["Howard Morphy", "Howard Morphy"]}, {"title": "Encountering Aborigines", "year": "2002", "source": "in Sarah Thomas (ed.), The Encounter, 1802: art of the Flinders and Baudin voyages, Art Gallery of South Australia, Adelaide, p. 228", "authors": ["Howard Morphy"]}, {"title": "Dundiwuy Wanambi", "year": "2002", "source": "in Anna Gray (ed.), Australian Art in the National Gallery of Australia, National Gallery of Australia, Canberra, p. 398", "authors": ["Howard Morphy"]}, {"title": "Narritjin Maymuru", "year": "2002", "source": "in Anna Gray (ed.), Australian Art in the National Gallery of Australia, National Gallery of Australia, Canberra, p. 319", "authors": ["Howard Morphy"]}, {"title": "Saltwater Country - Paintings from Yirrkala", "year": "2001", "source": "Art and Australia, vol. 38, no. 3, pp. 420-427", "authors": ["Howard Morphy"]}, {"title": "Seeing Aboriginal Art in the Gallery", "year": "2001", "source": "Humanities Research, vol. 8, no. 1, pp. 37-50", "authors": ["Howard Morphy"]}, {"title": "Collecting Knowledge, Finding Art", "year": "2001", "source": "in Frances Morphy (ed.), Outside In: Research Engagements with Arnhem Land Art, Australian National University Drill Hall Gallery, Canberra, pp. 22-30", "authors": ["Howard Morphy"]}, {"title": "Colonial Continuities and Discontinuities", "year": "2000", "source": "in Kleinert, S.; Neale, M. (ed.), The Oxford Companion to Aboriginal Art and Culture, Oxford University Press, Melbourne, pp. 81-102", "authors": ["Beckett J", "Healy C", "Mackinolty C", "Howard Morphy"]}, {"title": "Introduction", "year": "2000", "source": "in Morphy, H. ; Flint, K. (ed.), Culture, Landscape and the Environment: The Linacre Lectures, Oxford University Press, Oxford, pp. 1-14", "authors": ["Flint K", "Howard Morphy"]}, {"title": "rnhem Land", "year": "2000", "source": "in Kleinert, S.; Neale, M. (ed.), The Oxford Companion to Aboriginal Art and Culture, Oxford University Press, Melbourne, pp. 129-154", "authors": ["Howard Morphy", "Keen I", "Mundine D"]}, {"title": "Elite art for cultural elites: adding value to Indigenous arts", "year": "2000", "source": "in Ward, G.; Smith, C. (ed.), Indigenous Cultures in an Interconnected World, Allen & Unwin, St Leonards, N.S.W., pp. 129-143", "authors": ["Howard Morphy"]}, {"title": "Kinship and Gender", "year": "2000", "source": "in Kleinert, S.; Neale, M. (ed.), The Oxford Companion to Aboriginal Art and Culture, Oxford University Press, Melbourne, pp. 60-80", "authors": ["Howard Morphy", "Hamilton A", "Dussart F"]}, {"title": "Traditional and Modern Visual Art", "year": "1999", "source": "in <> (ed.), <>, pp. 441-448pp", "authors": ["Howard Morphy"]}, {"title": "ndree Rosenfeld; an Appreciation", "year": "1999", "source": "Archaeology in Oceania, vol. 34, no. 3, pp. 93-94", "authors": ["Howard Morphy", "Mulvaney J"]}, {"title": "Encoding the Dreaming: a theoretical framework for the analysis of representational processes in Australian Aboriginal Art", "year": "1999", "source": "Australian Archaeology, vol. 49, no. December, pp. 13-22", "authors": ["Howard Morphy"]}, {"title": "Life through art: Religion and society in eastern Arnhem Land", "year": "1999", "source": "in Morphy, H.S; Smith Boles, M. (ed.), Art from the Land: Dialogues with the Kluge-Ruhe Collection of Australian Aboriginal Art, University of Virginia Press, Charlottesville, pp. 57-84", "authors": ["Howard Morphy"]}, {"title": "Manggalili art and the Promised Land", "year": "1999", "source": "in Taylor, L. (ed.), Painting the Land Story, National Museum of Australia Press, Canberra, pp. 53-74", "authors": ["Howard Morphy"]}, {"title": "ustralian Aboriginal Concepts of Time", "year": "1999", "source": "in Lippincott, K. (ed.), The Story of Time, Merrell Holberton, London, pp. 264-268", "authors": ["Howard Morphy"]}, {"title": "rt from the Land: Dialogues with the Kluge-Ruhe Collection of Australian Aboriginal Art", "year": "1999", "source": "University of Virginia PressCharlottesville", "authors": ["Howard Morphy", "Smith-Boles M", "eds"]}, {"title": "From hunting to mining: The history of human-environmental relations in eastern Arnhem Land", "year": "1999", "source": "in Slack, P. (ed.), Environments and Historical Change, The Linacre Lectures 1998, British Academy and Oxford University Press, Oxford, pp. 168-189", "authors": ["Howard Morphy"]}, {"title": "Empiricism to Metaphysics:  In Defence of the Concept of the Dreamtime", "year": "1996", "source": "in T Bonyhady & T Griffiths (eds)Prehistory to Politics: John Mulvaney, the Humanities and the Public Intellectual, Melbourne University Press, pp 163 - 189", "authors": ["Howard Morphy"]}]}, "Microsoft-Academic": [{"title": "rethinking visual anthropology", "year": 1997, "source": "", "authors": [{"name": "marcus banks"}, {"name": "howard morphy"}]}, {"title": "anthropological theory and government policy in australia s northern territory the hegemony of the mainstream", "year": 2013, "source": "american anthropologist", "authors": [{"name": "frances morphy", "affiliation": "australian national university"}, {"name": "howard morphy", "affiliation": "australian national university"}], "id": 102499938}, {"title": "becoming art exploring cross cultural categories", "year": 2007, "source": "", "authors": [{"name": "howard morphy"}]}, {"title": "art as a mode of action some problems with gell s art and agency", "year": 2009, "source": "journal of material culture", "authors": [{"name": "howard morphy", "affiliation": "australian national university"}], "id": 179822231}, {"title": "ancestral connections art and an aboriginal system of knowledge", "year": 1991, "source": "", "authors": [{"name": "howard morphy"}]}, {"title": "tasting the waters discriminating identities in the waters of blue mud bay", "year": 2006, "source": "journal of material culture", "authors": [{"name": "howard morphy", "affiliation": "australian national university"}, {"name": "frances morphy", "affiliation": "australian national university"}], "id": 179822231}, {"title": "the anthropology of art", "year": 2002, "source": "", "authors": [{"name": "howard morphy"}]}, {"title": "from dull to brilliant the aesthetics of spiritual power among the yolngu", "year": 1989, "source": "", "authors": [{"name": "howard morphy"}]}, {"title": "the interpretation of ritual reflections from film on anthropological practice", "year": 1994, "source": "", "authors": [{"name": "howard morphy"}]}, {"title": "the practice of an expert anthropology in native title", "year": 2006, "source": "anthropological forum", "authors": [{"name": "howard morphy"}], "id": 92835259}], "ANDS-Grants": [{"description": "Led by the Yolngu Elder and researcher Joseph Gumbula, this project will develop a clouded database engine and networked applications for streaming digitised heritage resources in ways appropriate for Indigenous peoples, particularly those in remote communities. Trial content will be selected from records of Gumbula's own heritage dating from 1924.", "title": "Discovery Indigenous - Grant ID: IN130100017", "id": "534083", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/IN130100017", "researchers": ["Dr Joseph Gumbula", "Prof Howard Morphy"], "status": "closed", "fundingAmount": 360000, "fundingScheme": "Discovery Indigenous", "startDate": 2013, "endDate": 2015, "dateTimeModified": "2015-09-14T03:07:40Z", "dateTimeCreated": "2015-04-15T05:08:26Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/IN130100017", "identifiers": ["http://purl.org/au-research/grants/arc/IN130100017", "IN130100017"], "subjects": ["INFORMATION SYSTEMS", "INFORMATION AND COMPUTING SCIENCES", "cultural heritage", "digital repositories", "yolngu"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/534083"}]}, {"description": "The project will research the ways in which the unique and dynamic character of Aboriginal knowledge systems and cultural production can be utilized and maintained within regional systems of economic development. The project will focus on art and cultural tourism in two regions: Eastern Arnhem Land and the Western desert.", "title": "The value of Aboriginal cultural heritage: cultural production and regional economies in Eastern Arnhem Land and the Western Desert", "id": "536011", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP120101387", "researchers": ["Prof Howard Morphy", "Prof David Throsby"], "status": "closed", "fundingAmount": 500000, "fundingScheme": "Discovery Projects", "startDate": 2012, "endDate": 2014, "dateTimeModified": "2015-08-13T17:19:46Z", "dateTimeCreated": "2015-04-15T05:11:19Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP120101387", "identifiers": ["http://purl.org/au-research/grants/arc/DP120101387", "DP120101387"], "subjects": ["APPLIED ECONOMICS", "ECONOMICS", "aboriginal heritage", "cultural economics", "cultural production", "sustainable development"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/536011"}]}, {"description": "The Aboriginal Artists Agency (AAA) was a driving force for change in the Australian arts industry. Founded in 1976, it was the first national body to administer copyrights for indigenous artists, create international demand for Australian culture, and pioneer ways for Indigenous artists to reach audiences and markets worldwide. This project will investigate the seminal work of the AAA, secure and analyse its exclusive primary collection, and assess the vast corporate knowledge of its personnel through new interviews. New frameworks for assessing Indigenous arts initiatives will be generated through this unprecedented analysis of the AAA&rsquo;s role in reshaping attitudes towards Australian identities.", "title": "Discovery Projects - Grant ID: DP150104389", "id": "618221", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP150104389", "researchers": ["A/Prof Aaron Corn", "Prof Howard Morphy", "Prof Fred Myers"], "status": "closed", "fundingAmount": 481766, "fundingScheme": "Discovery Projects", "startDate": 2015, "endDate": 2017, "dateTimeModified": "2017-07-05T03:02:06Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP150104389", "identifiers": ["http://purl.org/au-research/grants/arc/DP150104389", "DP150104389"], "subjects": ["PERFORMING ARTS AND CREATIVE WRITING", "STUDIES IN CREATIVE ARTS AND WRITING", "ANTHROPOLOGY AND ETHNOMUSICOLOGY; ARCHIVES AND RECORDS; INDIGENOUS ARTS AND MUSIC"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/618221"}]}, {"description": "This project, being conducted in collaboration with Indigenous communities and regional museums in Australia and the United Kingdom, aims to develop and to pilot approaches that facilitate Indigenous people&rsquo;s access to and engagement with museum collections and objects. Reconnecting Indigenous Australian communities with ethnographic collections is central to contemporary museum practice. Yet, the historical dispersal of objects across museums, nationally and internationally, makes relationship and reconnection a challenge to communities and museums alike. The project seeks to address this and to contribute to new museum practice and museum development in Australia.", "title": "Linkage Projects - Grant ID: LP150100423", "id": "625869", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP150100423", "researchers": ["Prof Howard Morphy", "Dr Maria Nugent", "Dr Lissant Bolton", "Dr Gaye Sculthorpe", "Dr Ian Coates", "Dr Mathew Trinca"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 699310, "fundingScheme": "Linkage Projects", "startDate": 2015, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:54Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP150100423", "identifiers": ["http://purl.org/au-research/grants/arc/LP150100423", "LP150100423"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/625869"}]}]}