{"ANU": {"name": "Ignacio Ojea Quintana", "link": "https://researchers.anu.edu.au/researchers/ojea-quintana-i", "colleges": "College of Arts and Social Sciences", "email": "Ignacio.Ojea@anu.edu.au", "phone": "", "expertise": ["Decision Theory", "Logic", "Social Philosophy", "History And Philosophy Of Science Incl. Non Historical Philosophy Of Science", "History Of Ideas", "History Of Philosophy", "Communications Technologies", "Simulation And Modelling"], "interest": ["My interests are in social and formal epistemology. I use formal tools to understand and tackle some of the impact that digital technologies have and will have in the way we organize knowledge in scientific and non-scientific communities. My dissertation focused on how to best represent the consensus and (network) dynamic of a social group given the attitude of its individuals, be them opinions or judgments of sympathy. I am now working on network segregation and (mis)information diffusion, as well as how reinforcement learning techniques used in recommender algorithms shape opinions and preferences. I am also interested in data science and machine learning (my GitHub)."], "biography": "I am a Research Fellow at the Philosophy Department of the Australian National University working on issues about trust in social networks and the impact of artificial intelligence in online communities.I just finished my PhD at Columbia University where I spent the past two years teaching Columbia's core class Contemporary Civilization.Curriculum Vitae", "project": ["This project provides an explanation for online segregation and integration by extending some ideas originally developed by Schelling  [1969, 1971]. Agents in a social network aim to satisfy homophily and heterophily thresholds but, unlike other Schelling-like models, they do not change location within at topology but they cut and form new ties with neighbors. Hence the model is designed to represent the dynamics of friending/unfriending and following/unfollowing in social media. Although it is different from Schelling's, the model reveals that high degrees of macro segregation (integration) can emerge even with moderate homophily (heterophily) preferences at the micro level. We also show that heterophily has more effect than homophily in unequal populations. These results are demonstrated analytically and using simulations in Netlogo. The upshot, much like in Schelling's original models, is that large scale online segregation can emerge from otherwise innocuous individual behavior."], "publication": []}, "Microsoft-Academic": [{"title": "probabilistic opinion pooling with imprecise probabilities", "year": 2018, "source": "journal of philosophical logic", "authors": [{"name": "rush t stewart", "affiliation": "columbia university"}, {"name": "ignacio ojea quintana", "affiliation": "columbia university"}], "id": 161120620}, {"title": "learning and pooling pooling and learning", "year": 2018, "source": "erkenntnis", "authors": [{"name": "rush t stewart", "affiliation": "columbia university"}, {"name": "ignacio ojea quintana", "affiliation": "columbia university"}], "id": 63151042}, {"title": "on semantic gamification", "year": 2017, "source": "", "authors": [{"name": "ignacio ojea quintana", "affiliation": "columbia university"}]}], "ANDS-Grants": []}