{"ANU": {"name": "Igor Vladimirov", "link": "https://researchers.anu.edu.au/researchers/vladimirov-i", "colleges": "College of Engineering & Computer Science", "email": "Igor.Vladimirov@anu.edu.au", "phone": "", "expertise": ["Calculus Of Variations Systems Theory And Control Theory", "Stochastic Analysis And Modelling", "Statistical Mechanics Physical Combinatorics And Mathematical Aspects Of Condensed Matter"], "interest": ["My research interests are concerned mainly with the mathematical systems theory, particularly with stochastic dynamics and applications to stochastic robust control and quantum stochastic control. I also published on probability theoretic aspects of spatial discretization effects in dynamical systems, statistical mechanical lattice models of interacting particle systems and multiscale transport phenomena."], "biography": "I received M.Sc. degree in Control Systems in 1989 and  Ph.D. degree in Physics and Mathematics (with specialization in Mathematical Cybernetics) in 1992, from the  Department of Control and Applied Mathematics of the Moscow Institute (State  University) of Physics and Technology (MIPT), Russia. I was a Senior Research Associate at the State Research Institute of Aviation  Systems in 1993–1997 and the Institute for Information Transmission  Problems, the Russian Academy of Sciences, Moscow, in 1994–2007, working in the  areas of applied Kalman filtering,  stochastic robust control,  hysteresis systems  and spatial discretizations of dynamical systems.  From 1997 to 2008, I held research academic positions of  Research Officer, Research Fellow and Senior Research Fellow at the  Mathematics Department and School of Engineering at the University of  Queensland, Brisbane, Australia, working under support of the Australian  Research Council in the above areas and also in stochastic  modelling of econometric time series, lattice models of statistical  mechanics and transport phenomena in random media. In 2000, I was a visiting research fellow at the School of Mathematical Sciences, Queen Mary University of London, working on p-adic analysis of Hamiltonian roundoff. From 2009 to 2016, I was a  Senior Research Fellow at UNSW Canberra, doing research in the areas of quantum and stochastic  control. In 2013, I was awarded B.N.Petrov  prize of the Russian Academy of Sciences for my works on the  anisotropy-based theory of stochastic robust filtering and control.", "project": [], "publication": [{"title": "Dissipative linear stochastic Hamiltonian systems", "year": "2019", "source": "2018 Australian and New Zealand Control Conference, ANZCC 2018, IEEE, Piscataway, United States, pp. 227-232", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Multi-point Gaussian states, quadratic-exponential cost functionals, and large deviations estimates for linear quantum stochastic systems", "year": "2018", "source": "Applied Mathematics and Optimization, vol. 83, 2021, pp. 83–137", "authors": ["Igor Vladimirov", "Petersen I", "James M"]}, {"title": "phase-space formulation and Gaussian approximation of the filtering equations for nonlinear quantum stochastic systems", "year": "2017", "source": "Control Theory and Technology, vol. 15, no. 3, pp. 177-192", "authors": ["Igor Vladimirov"]}, {"title": "Directly coupled observers for quantum harmonic oscillators with discounted mean square cost functionals and penalized back-action", "year": "2016", "source": "2016 IEEE Conference on Norbert Wiener in the 21st Century, 21CW 2016, IEEE, pp. 78-83", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Phase-space formulation of the Belavkin-Kushner-Stratonovich filtering equation for nonlinear quantum stochastic systems", "year": "2016", "source": "IEEE Conference on Norbert Wiener in the 21st Century (21CW), IEEE, Piscataway, NJ, pp. 84-89", "authors": ["Igor Vladimirov"]}, {"title": "State distributions and minimum relative entropy noise sequences in uncertain stochastic systems: the discrete-time case", "year": "2015", "source": "SIAM Journal on Control and Optimization, vol. 53, no. 3, pp. 1107-1153", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "stochastic density matrix approach to approximation of probability distributions and its application to nonlinear systems", "year": "2015", "source": "IEEE Conference on Control and Applications, CCA 2015, IEEE, pp. 1090-1095", "authors": ["Igor Vladimirov"]}, {"title": "transverse Hamiltonian variational technique for open quantum stochastic systems and its application to coherent quantum control", "year": "2015", "source": "IEEE Conference on Control and Applications, CCA 2015, IEEE, pp. 29  -34", "authors": ["Igor Vladimirov"]}, {"title": "Weyl variations and local sufficiency of linear observers in the mean square optimal coherent quantum filtering problem", "year": "2015", "source": "Australian Control Conference (AUCC 2015), Engineers Australia, Australia, pp. 93-98", "authors": ["Igor Vladimirov"]}, {"title": "Physical realizability and mean square performance of translation invariant networks of interacting linear quantum stochastic systems", "year": "2014", "source": "21st International Symposium on Mathematical Theory of Networks and Systems, MTNS, The Netherlands, pp. 1881-1888", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "quantum mechanical version of Price", "year": "2014", "source": "s theorem for Gaussian states'4th Australian Control Conference, AUCC 2014, Engineers Australia, pp. 118-123", "authors": ["Igor Vladimirov"]}, {"title": "quasi-separation principle and Newton-like scheme for coherent quantum LQG control", "year": "2013", "source": "Systems and Control Letters, vol. 62, no. 7, pp. 550-559", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Coherent quantum filtering for physically realizable linear quantum plants", "year": "2013", "source": "European Control Conference, ECC 2013, IEEE, Zurich, pp. 2717-2723", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "The monomer-dimer problem and moment Lyapunov exponents of homogeneous Gaussian random fields", "year": "2013", "source": "Discrete and Continuous Dynamical Systems - Series B, vol. 18, no. 2, pp. 575-600", "authors": ["Igor Vladimirov"]}, {"title": "Robust filtering for continuous-time uncertain nonlinear systems with an integral quadratic constraint", "year": "2012", "source": "American Control Conference ACC 2012, Institute of Electrical and Electronics Engineers (IEEE Inc), Piscataway USA, pp. 4807-4812", "authors": ["Kallapur A", "Igor Vladimirov", "Petersen I"]}, {"title": "Characterization and moment stability analysis of quasilinear quantum stochastic systems with quadratic coupling to external fields", "year": "2012", "source": "IEEE Conference on Decision and Control (CDC 2012), Institute of Electrical and Electronics Engineers (IEEE Inc), Maui USA, pp. 1691-1696", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Gaussian stochastic linearization for open quantum systems using quadratic approximation of Hamiltonians", "year": "2012", "source": "International Symposium on Mathematical Theory of Networks and Systems (MTNS 2012), Springer, Online, pp. 1-8", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Risk-sensitive dissipativity of linear quantum stochastic systems under Lur", "year": "2012", "source": "e type perturbations of Hamiltonians'Australian Control Conference (AUCC 2012), Institute of Electrical and Electronics Engineers (IEEE Inc), Barton ACT, pp. 247-252", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Robust filtering for uncertain nonlinear systems satisfying a sum quadratic constraint", "year": "2011", "source": "18th IFAC World Congress, 2011, International Federation of Automatic Control (IFAC), Milano, pp. 1-7", "authors": ["Kallapur A", "Igor Vladimirov", "Petersen I"]}, {"title": "nisotropic norm bounded real lemma for linear discrete time varying systems", "year": "2011", "source": "IFAC World Congress 2011, International Federation of Automatic Control (IFAC), Milano, pp. 4701-4706", "authors": ["Maximov E", "Kurdyukov A", "Igor Vladimirov"]}, {"title": "dynamic programming approach to finite-horizon coherent quantum LQG control", "year": "2011", "source": "Australian Control Conference (AUCC 2011), Engineers Australia, Australia, pp. 357-362", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "quasi-separation principle and Newton-like scheme for coherent quantum LQG control", "year": "2011", "source": "18th IFAC World Congress, 2011, International Federation of Automatic Control (IFAC), Milano, pp. 4721-4727", "authors": ["Igor Vladimirov", "Petersen I"]}, {"title": "Minimum relative entropy state transitions in discrete time systems with statistically uncertain noise", "year": "2010", "source": "49th IEEE Conference on Decision and Control (CDC 2010), ed. M. W. Spong, Curran Associates, Inc., Red Hook, New York, United States, pp. 5314-5320", "authors": ["Igor Vladimirov", "Petersen I"]}]}, "Microsoft-Academic": [{"title": "legal problems of peasant farm enterprise activity in conditions of innovative development of the russia", "year": 2021, "source": "journal of the saudi society of agricultural sciences", "authors": [{"name": "evgeny balashov", "affiliation": "bashkir state agrarian university"}, {"name": "igor vladimirov", "affiliation": "bashkir state agrarian university"}, {"name": "ravil gizzatullin", "affiliation": "bashkir state university"}, {"name": "radmir iksanov", "affiliation": "bashkir state agrarian university"}, {"name": "milyausha lukyanova", "affiliation": "bashkir state agrarian university"}, {"name": "aigul selezneva", "affiliation": "bashkir state agrarian university"}], "id": 2765072490}, {"title": "the importance of state supervision in the field of forestry for the development of the regional economy", "year": 2020, "source": "", "authors": [{"name": "radmir iksanov"}, {"name": "igor vladimirov"}]}, {"title": "device for maximum current protection of three phase capacitor gangs", "year": 1990, "source": "", "authors": [{"name": "igor vladimirov"}, {"name": "anatolij a nikitin"}]}, {"title": "legal regulation of measures for the use and protection of forests", "year": 2021, "source": "", "authors": [{"name": "radmir iksanov"}, {"name": "igor vladimirov"}]}, {"title": "device for test check of current protections of ladder type higher harmonics filter", "year": 1990, "source": "", "authors": [{"name": "igor vladimirov"}, {"name": "anatolij a nikitin"}]}], "ANDS-Grants": []}