{"ANU": {"name": "James Piscatori", "link": "https://researchers.anu.edu.au/researchers/piscatori-jp", "colleges": "College of Arts and Social Sciences", "email": "James.Piscatori@anu.edu.au", "phone": "", "expertise": ["International Relations", "Political Theory And Political Philosophy", "Other Studies In Human Society"], "interest": ["Islam and international relations; and Islamic political thought, particularly as it relates to democratisation in Middle Eastern societies. His area of focus has been principally, but not exclusively, on the Arab states of the Gulf. Recently, he has been working on pan-Islamism and Islamic transnationalism, and specifically investigating the contemporary meaning of the 'ummah' (community of the faith)."], "biography": "Professor Piscatori is currently Deputy Director and Professor at the ANU Centre for Arab and Islamic Studies. Prior to holding this position he was Chair of the School of Government and International Affairs at Durham University, a Fellow of the Oxford Centre for Islamic Studies and Fellow of Wadham College, Oxford; and Professor of International Politics in the University of Aberystwyth. He has held professorial appointments in the Department of International Politics, the University of Wales, and the School of Advanced International Studies of the Johns Hopkins University. In addition, he has been a Research Fellow at the Royal Institute of International Affairs, London, and Senior Fellow at the Council on Foreign Relations, New York. He has also been Senior Fellow at two research institutions -- the Royal Institute of International Affairs in London and the Council on Foreign Relations in New York. He has served on several international collaborative committees such as the Committee for the Comparative Study of Muslim Societies of the Social Science Reseach Council, and was co-editor of a series on Muslim Politics for Princeton University Press.Prof. Piscatori is the author of Islam in a World of Nation-States and co-author (with Dale F. Eickelman) of Muslim Politics. He is the editor of Islam in the Political Process and co-editor of Muslim Travellers: Pilgrimage, Migration, and the Religious Imagination. Islam, Islamists, and The Electoral Principle appeared in a series of papers for the International Institute for the Study of the Modern Muslim World in Leiden. He has also co-edited Monarchies and Nations: Globalization and Identity in the Arab States of the Gulf.Prof. Piscatori is currently researching  the development of pan-Islamic thought and movements.", "project": [], "publication": [{"title": "Islamophobia in the Era of Islamic State", "year": "2015", "source": "East Asia Forum, April", "authors": ["James Piscatori"]}, {"title": "Winning Hearts and Minds: US Promotion of a Democratic Islam", "year": "2013", "source": "in Shahram Akbarzadeh, Benjamin MacQueen, James Piscatori, Amin Saikal (ed.), American Democracy Promotion in the Changing Middle East, Routledge, Abingdon and New York, pp. pp 58-81", "authors": ["James Piscatori"]}, {"title": "Secular Aspirations and Political Islam in the Arab Middle East: The 1950s Reconsidered", "year": "2012", "source": "The Maghreb Review, vol. 37, no. 1, pp. 3-32pp", "authors": ["James Piscatori"]}, {"title": "The Oxford Encyclopedia of the Islamic World", "year": "2009", "source": "Oxford University PressUK", "authors": ["James Piscatori", "ed"]}, {"title": "International Relations and Diplomacy", "year": "2009", "source": "in James Piscatori et al (ed.), The Oxford Encyclopedia of the Islamic World, Oxford University Press, UK, pp. 13-18pp", "authors": ["James Piscatori"]}, {"title": "Imagining Pan-Islam", "year": "2007", "source": "in Shahram Akbarzadeh and Fethi Mansouri (ed.), Islam and Political Violence: Muslim Diaspora and Radicalism in the West, I B Tauris & Co Ltd, London, pp. 27-38", "authors": ["James Piscatori"]}, {"title": "Imagining Pan-Islam: Religious Activism and Political Utopias", "year": "2005", "source": "Proceedings of the British Academy, vol. 131, no. 1, pp. 421-442", "authors": ["James Piscatori"]}, {"title": "Managing God", "year": "2005", "source": "s Guests'in Paul Dresch, James Piscatori (ed.), Monarchies and Nations, I B Tauris & Co Ltd, London, UK; New York, USA, pp. 222-245", "authors": ["James Piscatori"]}, {"title": "Muslim Politics", "year": "2004", "source": "Princeton University PressUK", "authors": ["James Piscatori", "Eickelman D"]}, {"title": "Order, Justice and Global Islam", "year": "2003", "source": "in Rosemary Foot, john Lewis Gaddis and Andrew Hurrell (ed.), Order and Justice in International Relations, Oxford University Press, UK, pp. 262-286", "authors": ["James Piscatori"]}]}, "Microsoft-Academic": [{"title": "monarchies and nations globalisation and identity in the arab states of the gulf", "year": 2013, "source": "", "authors": [{"name": "paul dresch"}, {"name": "james piscatori"}]}, {"title": "transnational religion and fading states", "year": 1996, "source": "", "authors": [{"name": "susanne hoeber rudolph"}, {"name": "james piscatori"}]}, {"title": "muslim travellers pilgrimage migration and the religious imagination", "year": 1990, "source": "", "authors": [{"name": "dale f eickelman"}, {"name": "james piscatori"}]}, {"title": "saudi guardianship of the umma", "year": 2019, "source": "", "authors": [{"name": "james piscatori", "affiliation": "australian national university"}, {"name": "amin saikal", "affiliation": "australian national university"}]}, {"title": "islam beyond borders the umma in world politics", "year": 2019, "source": "", "authors": [{"name": "james piscatori", "affiliation": "australian national university"}, {"name": "amin saikal", "affiliation": "australian national university"}]}, {"title": "islam in a world of nation states", "year": 1986, "source": "", "authors": [{"name": "james piscatori"}]}, {"title": "shi a islam and the umma", "year": 2019, "source": "", "authors": [{"name": "james piscatori", "affiliation": "australian national university"}, {"name": "amin saikal", "affiliation": "australian national university"}]}, {"title": "american democracy promotion in the changing middle east from bush to obama", "year": 2012, "source": "", "authors": [{"name": "shahram akbarzadeh", "affiliation": "university of melbourne"}, {"name": "benjamin jon macqueen"}, {"name": "james piscatori", "affiliation": "durham university"}, {"name": "amin saikal", "affiliation": "australian national university"}]}, {"title": "conceptualising the umma an introduction", "year": 2019, "source": "muslim world", "authors": [{"name": "james piscatori", "affiliation": "australian national university"}], "id": 142358059}, {"title": "muslim travelers pilgrimage migration and the religious imagination", "year": 1991, "source": "journal for the scientific study of religion", "authors": [{"name": "john p thorp"}, {"name": "dale f eickelman"}, {"name": "james piscatori"}], "id": 207420867}], "ANDS-Grants": []}