{"ANU": {"name": "James Prest", "link": "https://researchers.anu.edu.au/researchers/prest-jdm", "colleges": "ANU College of Law", "email": "james.prest@anu.edu.au", "phone": "", "expertise": ["Environmental And Natural Resources Law"], "interest": ["environmental law and litigation (particularly comparative research relating to climate change and the law, energy law, biodiversity law), regulatory theory, compliance and enforcement, clinical legal education."], "biography": "", "project": ["1. Australia’s Solar Shutdown: The Untimely Demise of Feed-in Tariff Laws in Australia, paper in preparation documenting amendments to FIT laws in Australia, analysing future of renewable energy support at State level in the context of a national carbon price and review of the RET under the Federal Renewable Energy (Electricity) Act 2000 (Cth).", "2. Against the Wind: Planning Law Barriers to Wind Farm Development in Australia (Expansion of submission (2011) Submission to Senate Community Affairs References Committee, Inquiry into the Social and Economic Impact of Rural Wind Farms).", "3. Reforming Planning Law for Wind Energy in Australia and the United States: A Comparative Review, (Based on paper given at Yale (2010) “Fast Tracking Versus Public Participation? Planning Law for Wind Energy Development: Weighing Global Benefits Against Local Impacts”  Yale 2nd UNITAR/Yale 2010 Conference on Environmental Governance and Democracy Strengthening Institutions to Address Climate Change and Advance a Green Economy, Law School, Yale University, New Haven, CT, 17-19 September. Article focusses on planning law in NSW, Victoria and compares these with Texas and South Dakota.", "4. Regulating Mercury Emissions from Conventional Electricity Generation in Australia, research project since February 2012 at ANU Centre for Climate Law and Policy. Principal Investigator.", "5. Comparing United States and Australian Approaches to Regulating Mercury Emissions from Conventional Electricity Generation. Project since February 2012 at ANU Centre for Climate Law and Policy. Principal Investigator.", ""], "publication": [{"title": "On-grid batteries for large-scale energy storage: Challenges and opportunities for policy and techonology", "year": "2018", "source": "MRS Energy & Sustainability, vol. 5, no. E11, pp. 12pp", "authors": ["Faunce T", "James Prest", "Su D"]}, {"title": "ustralian Renewable Energy Law: Carbon Lock-in or Clean Energy Transition?", "year": "2018", "source": "Renewable Energy Law and Policy Review, vol. 9, no. 1, pp. 45-67", "authors": ["James Prest"]}, {"title": "Sustainability", "year": "2015", "source": "in Camilla Taylor (ed.), ACT Environmental Law Handbook 3rd Edition, Environmental Defenders' Office, Canberra, ACT, pp. 221-249pp", "authors": ["James Prest"]}, {"title": "", "year": "2015", "source": "Submission to Senate Select Committee Inquiry into Wind Turbines", "authors": ["James Prest"]}, {"title": "The Future of Feed-in Tariffs: Capacity Caps, Scheme Closures and Looming Grid Parity", "year": "2012", "source": "Renewable Energy Law and Policy Review, vol. 1/2012, pp. 25-41", "authors": ["James Prest"]}, {"title": "Forests Law", "year": "2011", "source": "in David Farrier and Paul Stein (ed.), The Environmental Law Handbook: planning and land use in NSW (5th ed), Thomson Reuters, Sydney Australia, pp. 533-571pp", "authors": ["James Prest"]}, {"title": "Summary: Law and Policy to Advance Renewable Energy - A Comparative Colloquium", "year": "2011", "source": "Renewable Energy Law and Policy Review, vol. 2, pp. 171-177", "authors": ["James Prest"]}, {"title": "Editorial", "year": "2011", "source": "Renewable Energy Law and Policy Review, vol. 2, no. 2011, pp. 89-90", "authors": ["James Prest"]}, {"title": "Submission to Senate Legal and Constitutional Affairs Committee", "year": "2010", "source": "Inquiry into National Radioactive Waste Management Bill 2010", "authors": ["James Prest"]}, {"title": "", "year": "2008", "source": "Submission to Senate Inquiry into the Renewable Energy (Electricity) Amendment (Feed-In Tariff) Bill", "authors": ["James Prest"]}, {"title": "The Australian Capital Territory and the Gungahlin Drive Freeway", "year": "2010", "source": "in Tim Bonyhady and Andrew Macintosh (ed.), Mills, Mines and Other Controversies: The Environmental Assessment of Major Projects, The Federation Press, Sydney, pp. 207-223", "authors": ["James Prest"]}, {"title": "Sustainability and the Law: Climate Change, energy and urban issues", "year": "2009", "source": "in Kirsten Miller and Anne Rawson (ed.), ACT Environmental Law Handbook (2nd ed), Environment Defender's Office ACT Inc, Canberra, pp. 151-165", "authors": ["James Prest"]}, {"title": "Dangerous Obsession with Least Cost? Climate Change, Renewable Energy Law and Emissions Trading", "year": "2009", "source": "in Gumley, W. & Daya-Winterbottom, T. (ed.), Climate Change Law: Comparative, Contractual & Regulatory Considerations, Thomson Reuters, Pyrmont, Australia, pp. 179-205", "authors": ["James Prest"]}, {"title": "ustralia", "year": "2008", "source": "in Cyril F. Kormos (ed.), A Handbook on International Wilderness Law and Policy, Fulcrum Books, Golden, Colarado, pp. 56-89", "authors": ["James Prest"]}, {"title": "The Bald Hills Wind Farm Debacle", "year": "2007", "source": "in Tim Bonyhady and Peter Christoff (ed.), Climate Law in Australia, The Federation Press, Australia, pp. 230-261", "authors": ["James Prest"]}, {"title": "Council Officer Prosecuted for Biodiversity Offences (Casenotes)", "year": "2007", "source": "Local Government Law Journal, vol. 13, no. 1, pp. 1-11", "authors": ["James Prest"]}, {"title": "Forestry Law", "year": "2006", "source": "in David Farrier and Paul Steiin (ed.), Environmental Law Handbook (4th ed), Redfern Legal Centre Publishing, Sydney, pp. 440-443", "authors": ["James Prest"]}, {"title": "The Forgotten Forests: The Regulation of Forestry on Private Land in NSW 1997-2002", "year": "2004", "source": "in Daniel Lunney (ed.), Conservation of Australia's Forest Fauna (2nd ed), Royal Zoological Society of NSW, Sydney Australia, pp. 297-330", "authors": ["James Prest"]}, {"title": "The Forgotten Forests: The Regulation of Forestry on Private Land in New South Wales Between 1997 and 2002", "year": "2004", "source": "01/01/2004", "authors": ["James Prest"]}, {"title": "Land Clearing Approval Rates in NSW", "year": "2001", "source": "in Williams, J., C. Read, A. Norton, S. Dovers, M Burgman, W Proctor and H Anderson (ed.), Australia State of the Environment Report 2001, CSIRO Publishing, Canberra ACT, p. 42", "authors": ["James Prest"]}]}, "Microsoft-Academic": [{"title": "on grid batteries for large scale energy storage challenges and opportunities for policy and technology", "year": 2018, "source": "", "authors": [{"name": "thomas faunce", "affiliation": "australian national university"}, {"name": "james prest", "affiliation": "australian national university"}, {"name": "dawei su", "affiliation": "university of technology sydney"}, {"name": "sean j hearne", "affiliation": "sandia national laboratories"}, {"name": "francesca iacopi", "affiliation": "university of technology sydney"}]}, {"title": "the future of feed in tariffs capacity caps scheme closures and looming grid parity", "year": 2012, "source": "renewable energy law and policy review", "authors": [{"name": "james prest"}], "id": 2764947900}, {"title": "the future of feed in tariffs capacity caps scheme closures and looming grid parity", "year": 2012, "source": "social science research network", "authors": [{"name": "james prest", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "is community renewable energy always just examining energy injustices and inequalities in rural indonesia", "year": 2021, "source": "energy research and social science", "authors": [{"name": "hilman s fathoni", "affiliation": "australian national university"}, {"name": "abidah b setyowati", "affiliation": "australian national university"}, {"name": "james prest", "affiliation": "australian national university"}], "id": 2764593084}, {"title": "assessing the viability of the act natural gas distribution network for reuse as a hydrogen distribution network", "year": 2021, "source": "international journal of hydrogen energy", "authors": [{"name": "ed w gaykema"}, {"name": "igor skryabin"}, {"name": "james prest", "affiliation": "australian national university"}, {"name": "bruce hansen"}], "id": 48860480}, {"title": "biogas as an energy vector", "year": 2021, "source": "biomass & bioenergy", "authors": [{"name": "ahmad rafiee", "affiliation": "south ural state university"}, {"name": "kaveh rajab khalilpour", "affiliation": "university of technology sydney"}, {"name": "james prest", "affiliation": "australian national university"}, {"name": "igor skryabin", "affiliation": "australian national university"}], "id": 171918450}, {"title": "the future of australia s federal renewable energy law", "year": 2018, "source": "social science research network", "authors": [{"name": "james prest", "affiliation": "west virginia university college of law"}, {"name": "grace soutter", "affiliation": "west virginia university college of law"}], "id": 2751751161}, {"title": "the forgotten forests the regulation of forestry on private land in new south wales 1997 2002", "year": 2004, "source": "social science research network", "authors": [{"name": "james prest", "affiliation": "west virginia university college of law"}], "id": 2751751161}, {"title": "the forgotten forests the environmental regulation of forestry on private land in new south wales between 1997 and 2002", "year": 2003, "source": "", "authors": [{"name": "james prest", "affiliation": "university of wollongong"}]}, {"title": "the australian capital territory and the gungahlin drive freeway", "year": 2010, "source": "social science research network", "authors": [{"name": "james prest", "affiliation": "australian national university"}], "id": 2751751161}], "ANDS-Grants": []}