{"ANU": {"name": "Jason Potas", "link": "https://researchers.anu.edu.au/researchers/potas-jr", "colleges": "College of Health & Medicine", "email": "jason.potas@anu.edu.au", "phone": "", "expertise": [], "interest": ["Humans have a sophisticated somatosensory system (system of body  sensors) which performs a variety of tasks we take for granted. Not only  does it provide our motor system with feedback that enables fine motor  control, but it also connects our brains to the outside world by  providing us with the capacity to explore our environment as well as  enjoy a physical connection with others.While there have been recent outstanding advancements in motor  prosthetics which can read brain signals and translate these into  complex movement of a robotic arm, the loss of somatosensation limits  the success of these motor prostheses. We are yet to work out how to  close the loop with sensory feedback which is necessary to inform the  brain of the position and textural experiences which drive our motor  system to react appropriately. However, even with motor function, those  who lose somatosensation (for example due to spinal cord injury or nerve  damage) become disconnected from others including loved ones. Imagine  what it must be like to shake someone’s hand, or picking up a small  child, after your hand is replaced with a mechanical device; not only  would you have poor grip, but you would miss out on the experience of  the warmth and softness of human contact.The focus of our research is to “close the loop” on sensorimotor  control. We use a combination of electrophysiology, signal processing  and machine learning in small animal models to discover how sensory  information is coded in different parts of the central nervous system.  We are looking at certain brain regions for the potential to replaced  lost sensory information with electrical inputs from a prosthetic device  (neuroprosthesis).Our brain region of interest is the dorsal column nuclei (DCN),  where somatosensory information from the body is “summarised” before it  is sent to higher brain regions for further processing. By stimulating  the body and recording multiple electrical signatures in the DCN, we  have been able to extract information and use machine learning to inform  us of: i) the location, and ii) the quality of a sensory event  experienced on the body. By reading the DCN, we can already successfully  discriminate between various somatosensory modalities such as different  tactile stimuli as well as changes in limb position."], "biography": "Dr Potas commenced his scientific career at The University of Sydney,  examining how different sensory (somatic and visceral) information  affects blood pressure, by studying the spinal and brainstem functional  and anatomical connections to autonomic control centres, and how the  functional output pathways of these control centres affect blood  pressure. During his first post-doc (Charité, Berlin), Dr Potas studied  the cellular responses to cerebral ischemia. In his second post-doc  (UNSW, Sydney), he investigated the cellular responses and the role of  the immune system in reducing dysfunctional outcomes after spinal cord  injury. In his third post-doc (UFRJ, Brazil) Dr Potas examined the  electrophysiological properties of regenerating nervous tissues  following peripheral nerve and spinal cord injury, and devised new  injury models and evaluation techniques that allow the assessment of  nervous functional integrity. Whilst in Brazil, he also devised a  computational technique that allowed him to automatically evaluate  peripheral nerve function, as well as techniques for differentiating  nervous fibre types based on their electro-morphological  characteristics. After a three year career break working as an  applications scientist in industry, Dr Potas joined the Australian  National University Medical School in 2010 at the John Curtin School of  Medical Research where he contributed to teaching physiology and  neuroscience and leads a research team studying sensory processing and  pain.", "project": [], "publication": [{"title": "Characterisation and functional mapping of surface potentials in the rat dorsal column nuclei", "year": "2017", "source": "Journal of Physiology, vol. 595, no. 13, pp. 4507-4524", "authors": ["Loutit A", "Maddess T", "Redmond S", "Jason Potas"]}, {"title": "Red LED photobiomodulation reduces pain hypersensitivity and improves sensorimotor function following mild T10 hemicontusion spinal cord injury", "year": "2016", "source": "Journal of Neuroinflammation, vol. 13, no. 1, pp. 1-15", "authors": ["Hu D", "Zhu S", "Jason Potas"]}, {"title": "Interleukin-10 conjugated electrospun polycaprolactone (PCL) nanofibre scaffolds for promoting alternatively activated (M2) macrophages around the peripheral nerve in vivo", "year": "2015", "source": "Journal of Immunological Methods, vol. 420, pp. 38-49", "authors": ["Jason Potas", "Haque F", "Maclean F"]}, {"title": "Early loss of pericytes and perivascular stromal cell-induced scar formation after stroke", "year": "2013", "source": "Journal of Cerebral Blood Flow and Metabolism, vol. 33, no. 3, pp. 428-439", "authors": ["Fernandez-Klett F", "Jason Potas", "Hilpert D"]}, {"title": "ugmented Locomotor Recovery after Spinal Cord Injury in the Athymic Nude Rat", "year": "2006", "source": "Journal of Neurotrauma, vol. 23, no. 5, pp. 660-673", "authors": ["Jason Potas", "Zheng Y", "Moussa C"]}, {"title": "Molecular and cellular changes in stroke: an emphasis on glial and inflammatory mechanisms", "year": "2005", "source": "in Sean P Brown (ed.), Focus on Stroke Research, Nova Biomedical Books, New York, pp. 27-50", "authors": ["Jason Potas", "Dirnagl U", "Priller J"]}, {"title": "Renal sympathetic and cardiac changes associated with anaphylactic hypotension", "year": "2004", "source": "Autonomic Neuroscience-Basic & Clinical Volume: 112 Issue: 1-2 Pages: 25-3", "authors": ["Jason Potas"]}, {"title": "Evidence that venoconstriction reverses the phase II sympathoinhibitory and bradycardic response to haemorrhage", "year": "2004", "source": "Autonomic Neuroscience-Basic & Clinical Volume: 111 Issue: 1 Pages: 1-", "authors": ["Jason Potas"]}, {"title": "Sympathoinhibitory pathway from caudal midline medulla to RVLM is independent of baroreceptor reflex pathway", "year": "2003", "source": "American Journal of Physiology: Regulatory, Integrative and Comparative Physiology, vol. 284, pp. R1071-R1078", "authors": ["Jason Potas", "Dampney R"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}