{"ANU": {"name": "Jill Gready", "link": "https://researchers.anu.edu.au/researchers/gready-jee", "colleges": "College of Health & Medicine", "email": "Jill.Gready@anu.edu.au", "phone": "", "expertise": ["Bioinformatics", "Characterisation Of Biological Macromolecules", "Genome Structure And Regulation", "Conceptual Modelling", "Quantum Chemistry", "Genomics", "Molecular Evolution", "Enzymes", "Medicinal And Biomolecular Chemistry", "Theoretical And Computational Chemistry", "Biochemistry And Cell Biology", "Genetics", "Plant Biology", "Phylogeny And Comparative Analysis", "Proteins And Peptides", "Biologically Active Molecules", "Biomolecular Modelling And Design", "Agricultural Biotechnology", "Biological Adaptation"], "interest": ["Our research aims to understand how proteins carry out their functions  in molecular terms (structure, interactions, energetics/dynamics, reaction mechanisms) and how the proteins and their genes have evolved to enable their functions. Our findings provide the basic knowledge to understand the proteins’   normal functions as a basis for investigation or manipulation of their functions in other contexts such as the disease state or protein re-engineering. Our work is focussed on problems - both plant and animal - with a pathway to translating findings into treatments or products for social and economic good.Our research approaches use conceptual biology to solve complex problems by integrating  existing knowledge to develop novel models for test in silico, in  vitro and in planta. We also use our particular strengths in computational biology, both biomolecular simulation and modelling and bioinformatics, to forge innovative couplings of computation and experiment. These approaches allow us to take advantage of existing knowledge and the power of computational simulation and bioinformatics and, by using comparative genomics, exploit publicly available genome and proteome data to track how the proteins and genes are evolving."], "biography": "", "project": ["Mapping the functional evolution of the three prion protein (PrP) family genes (PrP; Doppel, Dpl; and Shadoo).", "Definition of the catalytic mechanism of the plant enzyme Rubisco which fixes carbon dioxide in photosynthesis, its evolution in the major plant branches and its adaptation to varying climatic conditiions geographically."], "publication": [{"title": "Estimating Relative Disulfide Energies: An Accurate Ab Initio Potential Energy Surface", "year": "2010", "source": "Australian Journal of Chemistry, vol. 63, no. 3, pp. 379-387", "authors": ["Haworth N", "Liu J", "Fan S", "Jill Gready"]}, {"title": "Putative Functional Role for the Invariant Aspartate 263 Residue of Rhodospirillum rubrum Rubisco", "year": "2009", "source": "Biochemistry, vol. 48, no. 10, pp. 2226-36", "authors": ["Liggins J", "Jill Gready"]}, {"title": "Routes in lectin evolution: case study of the C-type lectin-like domains", "year": "2009", "source": "in Hans-Joachim Gabius (ed.), The Sugar Code: fundamentals of Glycosciences, Wiley-Blackwell, Weinheim, pp. 329-346", "authors": ["Jill Gready", "Zelensky A"]}, {"title": "Methyltetrahydrofolate:corrinoid/iron-sulfur Protein Methyltransferase (MeTr): Protonation State of the Ligand and Active-Site Residues", "year": "2009", "source": "Journal of Physical Chemistry B, vol. 133, no. 44, pp. 14787-96", "authors": ["Alonso H", "Cummins P", "Jill Gready"]}, {"title": "Green evolution and dynamic adaptations revealed by genomes of the marine picoeukaryotes Micromonas", "year": "2009", "source": "Science, vol. 324, no. 5924, pp. 268-72", "authors": ["Worden A", "Lee J", "Mock T", "Jill Gready"]}, {"title": "nalysis of whole-genome and other data resources to characterize the molecular, structural, and evolutionary diversity of C-lectins, and discover new genes", "year": "2009", "source": "in Gerardo R. Vasta, Hafiz Ahmed. (ed.), Animal Lectins: a functional view, CRC Press LLC, United States, pp. 75-84", "authors": ["Zelensky A", "Jill Gready"]}, {"title": "Redefinition of rubisco carboxylase reaction reveals origin of water for hydration and new roles for active-site residues", "year": "2008", "source": "Journal of the American Chemical Society, vol. 130, pp. 15063-15080", "authors": ["Kannappan B", "Jill Gready"]}, {"title": "Identification of the RGG Box Motif in Shadoo: RNA-Binding and Signaling Roles?", "year": "2008", "source": "Bioinformatics and Biology insights, vol. 2, pp. 389-406", "authors": ["Corley S", "Jill Gready"]}, {"title": "Ensuring Mixing Efficiency of Replica-Exchange Molecular Dynamics Simulations", "year": "2008", "source": "Journal of Chemical Theory and Computation (JCTC), vol. 4, no. 7, pp. 1119-1128", "authors": ["Abraham M", "Jill Gready"]}, {"title": "Calculation of a complete enzymic reaction surface: Reaction and activation free energies for hydride-ion transfer in dihyrofolate reductase", "year": "2007", "source": "Journal of Chemical Theory and Computation (JCTC), vol. 3, no. 3, pp. 1203-1211", "authors": ["Cummins P", "Rostov I", "Jill Gready"]}, {"title": "Evaluating the stability of disulfide bridges in proteins: a torsinal potential energy surface for diethyl disulfide", "year": "2007", "source": "Molecular Simulation, vol. 33, no. 6, pp. 475-485", "authors": ["Haworth N", "Jill Gready", "George R"]}, {"title": "Relative Binding Affinities of Fructose-1,6-Bisphosphatase Inhibitors Calculated Using a Quantum Mechanics-Based Free Energy Perturbation Method", "year": "2007", "source": "Journal of the American Chemical Society, vol. 129, no. 30, pp. 9248-9532", "authors": ["Jill Gready", "Reddy R", "Erion M"]}, {"title": "Simulations of enzyme reaction mechanisms in active sites: Accounting for an environment which is much more than a solvent perturbation", "year": "2006", "source": "in Kevin J Naidoo, John Brady, Martin J Field, Jiali Gao & Michael Hann (ed.), Modelling Molecular Structure and Reactivity in Biological Systems, Royal Society of Chemistry, Cambridge, UK, pp. 101-118", "authors": ["Jill Gready", "Rostov I", "Cummins P"]}, {"title": "Pathway to functional studies: Pipeline linking phylogenetic footprinting and transcription-factor binding analysis", "year": "2006", "source": "Workshop on Intelligent Systems for Bioinformatics 2006, ed. Conference Program Committee, Australian Computer Society Inc., Australia, pp. 15-21", "authors": ["Chakka N", "Jill Gready"]}, {"title": "Cloning and analysis of transcripts and genes encoding fish-specific proteins related to PrP", "year": "2006", "source": "Fish Physiology and Biochemistry, vol. 32, pp. 339-353", "authors": ["Strumbo B", "Sangiorgio L", "Ronchi S", "Jill Gready"]}, {"title": "Integron-sequestered dihydrofolate reductase: a recently redeployed enzyme", "year": "2006", "source": "Trends in Microbiology, vol. 14, no. 5, pp. 236-242", "authors": ["Alonso H", "Jill Gready"]}, {"title": "Combining docking and molecular dynamic simulations in drug design", "year": "2006", "source": "Medical Research Reviews, vol. 1, no. 5, pp. 531-68", "authors": ["Alonso H", "Bliznyuk A", "Jill Gready"]}, {"title": "Defining the Inefficiencies in the Chemical Mechanisms of the Photosynthetic Enzyme Rubisco by Computational Simulation", "year": "2005", "source": "in A F Collings and C Critchley (ed.), Artificial Photosynthesis: From Basic Biology to Industrial Application, Wiley-VCH Verlag GMBH, Weinheim, pp. 263-282", "authors": ["Jill Gready"]}, {"title": "Multiple ligand-binding modes in bacterial R67 dihydrofolate reductase", "year": "2005", "source": "Journal of Computer-Aided Molecular Design, vol. 19, pp. 165-187", "authors": ["Alonso H", "Gillies M", "Cummins P", "Jill Gready"]}, {"title": "Computational methods for the study of enzymic reaction mechanisms III: a perturbation plus QM/MM approach for calculating relative free energies of protonation", "year": "2005", "source": "Journal of Computational Chemistry, vol. 26, pp. 561-568", "authors": ["Cummins P", "Jill Gready"]}, {"title": "The prion protein gene: Identifying regulatory signals using marsupial sequence", "year": "2005", "source": "Gene, vol. 349, pp. 121-134", "authors": ["Premzl M", "Delbridge M", "Jill Gready"]}, {"title": "The C-type lectin-like domain superfamily", "year": "2005", "source": "The FEBS Journal, vol. 272, pp. 6179-6217", "authors": ["Zelensky A", "Jill Gready"]}, {"title": "n efficient Z-score algorithm for assessing sequence alignments.", "year": "2004", "source": "Journal of Computational Biology, vol. 11, pp. 616/625", "authors": ["Booth H", "Maindonald J", "Wilson S", "Jill Gready"]}, {"title": "Solvent simulation", "year": "2004", "source": "in Patrick Bultinck, Hans De Winter, Wilfried Langenaeker & Jan P. Tollenaere (ed.), Computational Medicinal Chemistry for Drug Discovery, Marcel Dekker Inc., New York, pp. 259-294", "authors": ["Cummins P", "Bliznyuk A", "Jill Gready"]}, {"title": "Evolution of Vertebrate Genes Related to Prion and Shadoo Proteins - clues from Comparative Genomic Analysis", "year": "2004", "source": "Molecular Biology and Evolution, vol. 21, no. 12, pp. 2210-2231", "authors": ["Premzl M", "Jill Gready", "Jermiin L"]}, {"title": "C-type lectin-like domains in Fugu rubripes", "year": "2004", "source": "BMC Genomics, vol. 5, pp. 51-72", "authors": ["Zelensky A", "Jill Gready"]}, {"title": "Conformation of Prion Protein Repeat Peptides Probed by FRET Measurements and Molecular Dynamics Simulations", "year": "2004", "source": "Biophysical Journal, vol. 86, pp. 2467-2483", "authors": ["Gustiananda M", "Liggins J", "Cummins P", "Jill Gready"]}, {"title": "Comparison of electrostatic potential around proteins calculated from Amber and AM1 charges: application to mutants of prion protein", "year": "2003", "source": "Molecular Physics, vol. 101, no. 15, pp. 2437-2450", "authors": ["Zuegg J", "Bliznyuk A", "Jill Gready"]}, {"title": "Computational methods for the study of enzymic reaction mechanisms. II. An overlapping mechanically embedded method for hybrid semi-empirical-QM/MM calculations", "year": "2003", "source": "Journal of Molecular Structure: Theochem, vol. 632, pp. 247-257", "authors": ["Cummins P", "Jill Gready"]}, {"title": "Comparative Analysis of Structural Properties of the C-Type-Lectin-like Domain (CTLD)", "year": "2003", "source": "Proteins: Structure Function and Genetics, vol. 52, pp. 466-477", "authors": ["Zelensky A", "Jill Gready"]}, {"title": "Synthesis of quaternised 2-aminopyrimido[4,5-d]pyrimidin-4(3H)-ones and their biological activity with dihydrofolate reductase", "year": "2003", "source": "European Journal of Medicinal Chemistry, vol. 38, pp. 719-728", "authors": ["Gebauer M", "McKinlay C", "Jill Gready"]}, {"title": "Shadoo, a new protein highly conserved from fish to mammals and with similarity to prion protein", "year": "2003", "source": "Gene, vol. 314, pp. 89-102", "authors": ["Premzl M", "Sangiorgio L", "Strumbo B", "Jill Gready"]}, {"title": "Computational Methods for the Study of Enzymic Reaction Mechanisms. 1. Application to the Hydride Transfer Step in the Catalysis of Dihydrofolate Reductase", "year": "2002", "source": "Journal of Physical Chemistry B, vol. 106, pp. 9934-9944", "authors": ["Cummins P", "Greatbanks S", "Rendell A", "Jill Gready"]}, {"title": "Comparison of Linear-Scaling Semiempirical Methods and Combined Quantum Mechanical/Molecular Mechanical Methods for Enzymic Reactions. II. An Energy Decomposition Analysis.", "year": "2002", "source": "Journal of Computational Chemistry, vol. 23, pp. 1314-1322", "authors": ["Titmuss S", "Cummins P", "Rendell A", "Jill Gready"]}, {"title": "Copper-induced conformational change in a marsupial prion protein repeat peptide probed using FTIR spectroscopy", "year": "2002", "source": "FEBS Letters, vol. 512, no. Feb 13 (1-3), pp. 38-42", "authors": ["Gustiananda M", "Haris P", "Milburn P", "Jill Gready"]}, {"title": "Comparison of semiempirical and ab initio QM decomposition analyses for the interaction energy between molecules", "year": "2002", "source": "Chemical Physics Letters, vol. 352, pp. 245-251", "authors": ["Cummins P", "Titmuss S", "Jayatilaka D", "Jill Gready"]}, {"title": "CO2 Fixation by Rubisco: Computational Dissection of the Key Steps of Carboxylation, Hydration, and C-C Bond Cleavage", "year": "2001", "source": "Journal of the American Chemical Society, vol. 123, no. 44, pp. 10821-10829", "authors": ["Mauser H", "King W", "Jill Gready"]}, {"title": "Dihydrofolate Reductase: Free Energy Calculations for the Design of Mechanism-Based Inhibitors", "year": "2001", "source": "in M. Rami Reddy and Mark D. Erion (ed.), Free Energy Calculations in Rational Drug Design, Kluwer Academic Publishers, New York, N.Y. 10013, United States of America, pp. 343-364", "authors": ["Jill Gready", "Cummins P"]}, {"title": "Energetically Most Likely Substrate and Active-Site Protonation Sites and Pathways in the Catalytic Mechanism of Dihydrofolate Reductase", "year": "2001", "source": "Journal of the American Chemical Society, vol. 123, no. 15, pp. 3418-3428", "authors": ["Cummins P", "Jill Gready"]}, {"title": "Conformational preferences of the substrates of lactate dehydrogenase.", "year": "2000", "source": "Journal of Molecular Structure, vol. 498, pp. 101-112", "authors": ["Schmidt R", "Jill Gready"]}, {"title": "Molecular dynamics simulations of human prion protein including the N-linked oligosaccharides and GPI anchor.", "year": "2000", "source": "Glycobiology, vol. 10, pp. 959-974", "authors": ["Zuegg J", "Jill Gready"]}, {"title": "Identification of active site residues of the pro-metastatic endoglycosidase heparanase", "year": "2000", "source": "Biochemistry, vol. 39, no. 51, pp. 15659-15667", "authors": ["Hulett M", "Hornby J", "Ohms S", "Jill Gready"]}, {"title": "Comparison of enzyme polarization of ligands and charge-transfer effects for dihydrofolate reductase using point-charge embedded ab initio quantum mechanical and linear-scaling semiempirical quantum mechanical methods", "year": "2000", "source": "Journal of Computational Chemistry, vol. 21, no. 9, pp. 788-811", "authors": ["Greatbanks S", "Jill Gready", "Limaye A"]}, {"title": "Comparison of linear-scaling semiempirical methods and combined quantum mechanical / molecular mechanical methods applied to enzyme reactions", "year": "2000", "source": "Chemical Physics Letters, vol. 320, pp. 169-176", "authors": ["Titmuss S", "Cummins P", "Bliznyuk A", "Jill Gready"]}, {"title": "Combined quantum and molecular mechanics (QM/MM) study of the ionization state of 8-methylpterin substrate bound to dihydrofolate reductase", "year": "2000", "source": "Journal of Physical Chemistry B, vol. 104, pp. 4503-4510", "authors": ["Cummins P", "Jill Gready"]}, {"title": "QM/MM and SCRF studies of the ionization state of 8-methylopterin substrate bound to dihydrofolate reductase: Existence of a low-barrier hydrogen bond.", "year": "2000", "source": "Journal of Molecular Graphics and Modelling, vol. 18, pp. 42-49", "authors": ["Cummins P", "Jill Gready"]}, {"title": "Molecular Dynamics Simulations of Human Prion Protein: Importance of Correct Treatment of Electrostatic Interactions", "year": "1999", "source": "Biochemistry, vol. 38, no. 42, pp. 13862-13876", "authors": ["Zuegg J", "Jill Gready"]}, {"title": "Simple Method for Locating Possible Ligand Binding Sites on Protein Surfaces", "year": "1999", "source": "Journal of Computational Chemistry, vol. 20, no. 9, pp. 983-988", "authors": ["Bliznyuk A", "Jill Gready"]}, {"title": "Molecular Dynamics Simulations of L-Lactate Dehydrogenase: Conformation of a Mobile Loop and Influence of the Tetrameric Protein Environment", "year": "1999", "source": "Journal of Molecular Modeling, vol. 5, pp. 153-168", "authors": ["Schmidt R", "Jill Gready"]}, {"title": "Coupled Semiempirical Quantum Mechanics and Molecular Mechanics (QM/MM) Calculations on the Aqueous Solvation Free Energies of Ionised Molecules", "year": "1999", "source": "Journal of Computational Chemistry, vol. 20, no. 10, pp. 1028-1038", "authors": ["Cummins P", "Jill Gready"]}, {"title": "Enzyme Polarization of Substrates of Dihydrofolate Reductase by Different Theoretical Methods", "year": "1999", "source": "Proteins: Structure Function and Genetics, vol. 37, pp. 157-165", "authors": ["Greatbanks S", "Jill Gready", "Limaye A"]}]}, "Microsoft-Academic": [{"title": "best of the old and the new a way forward for the food security dilemma", "year": 2014, "source": "", "authors": [{"name": "jill gready"}]}, {"title": "god cosmos nature and creativity", "year": 1995, "source": "", "authors": [{"name": "paul davies"}, {"name": "jill gready"}]}], "ANDS-Grants": []}