{"ANU": {"name": "Joanna Poyago Theotoky", "link": "https://researchers.anu.edu.au/researchers/poyago-theotoky-j", "colleges": "College of Business& Economics", "email": "Joanna.Poyago-Theotoky@anu.edu.au", "phone": "", "expertise": [], "interest": ["Industrial organization (especially innovation, R&D cooperation and research joint ventures, technology and environmental policies); Mixed oligopoly; Envrionmental innovation and Green technology in imperfectly competitive environments."], "biography": "A multilingual native of Corfu (Greece), I am a graduate of the University of Bristol where I earned my PhD in 1994. I have previously held positions at the University of St Andrews, University of Nottingham, University of Bristol, Loughborough University and La Trobe University. My research interests lie in the areas of industrial organization (especially innovation, R&D cooperation and research jointventures, technology and environmental policies), applied microeconomic theory, the economics of science and knowledge transfer and the economics of higher education. I have received funding for my research from the British Academy, the ESRC, JISC, CNRS and the Spanish Government. I have published a range of papers including articles in the following journals: Energy Economics, European Journal of Operational Research, Journal of Economic Behavior and Organization, Journal of Industrial Economics, Journal of Public Economic Theory, International Journal of Industrial Organization, Review of Industrial Organization, Journal of Regulatory Economics, Journal of Comparative Economics, Regional Science and Urban Economics, Review of International Economics, Oxford Reviewof Economic Policy, Southern Economic Journal and The B.E. Journal of Theoretical Economics. I am an Associate Editor for Economic Modelling and a board member of Managerial and Decision Economics.", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "r d subsidies spillovers and privatization in mixed markets", "year": 2010, "source": "research papers in economics", "authors": [{"name": "maria jose gil molto"}, {"name": "joanna poyago theotoky"}, {"name": "vasileios zikos"}], "id": 3121261024}], "ANDS-Grants": []}