{"ANU": {"name": "Johanna Rendle Short", "link": "https://researchers.anu.edu.au/researchers/rendle-short-jh", "colleges": "College of Arts and Social Sciences", "email": "Johanna.Rendle-Short@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "", "project": [], "publication": [{"title": "It", "year": "2017", "source": "s Gonna Work': Spontaneous Activity and Knowledge Management by a Child with Asperger's Syndrome'in Amanda Bateman and Amelia Church (ed.), Children's Knowledge-in-Interaction: Studies in Conversation Analysis, Springer, Singapore, pp. 351-367", "authors": ["Johanna Rendle Short"]}, {"title": "Journalist questions: Comparing adversarialness in Chinese political press conferences", "year": "2016", "source": "Discourse, Context & Media, vol. 12, pp. 51-58", "authors": ["Du X", "Johanna Rendle Short"]}, {"title": "ccomplishing a continuing relationship in psychotherapy: Updates and the role of time references", "year": "2016", "source": "Australian Journal of Linguistics, vol. 36, no. 2, pp. 239-256", "authors": ["Clark S", "Johanna Rendle Short"]}, {"title": "Intersubjectivity or preference: Interpreting student pauses in supervisory meetings", "year": "2016", "source": "Australian Journal of Linguistics, vol. 36, no. 2, pp. 172-188", "authors": ["Etehadieh E", "Johanna Rendle Short"]}, {"title": "Speaking to Twin Children: Evidence Against the \"Impoverishment\" Thesis", "year": "2015", "source": "Research on Language and Social Interaction, vol. 48, no. 1, pp. 79-99", "authors": ["Johanna Rendle Short", "Skelt L", "Bramley N"]}, {"title": "Dispreferred responses when texting: Delaying that \"no", "year": "2015", "source": "response'Discourse & Communication, vol. 9, no. 6, pp. 643-661pp", "authors": ["Johanna Rendle Short"]}, {"title": "Name-Calling by a Child with Asperger", "year": "2015", "source": "s Syndrome'in Michelle O'Reilly and Jessica Nina Lester (ed.), The Palgrave Handbook of Child Mental Health: Discourse and Conversation Studies, Palgrave Macmillan, Basingstoke and New York, pp. 350-366", "authors": ["Johanna Rendle Short", "Wilkinson R", "Danby S"]}, {"title": "Parentification: Counselling Talk on a Helpline for Children and Young People", "year": "2015", "source": "in Michelle O'Reilly and Jessica Nina Lester (ed.), The Palgrave Handbook of Child Mental Health: Discourse and Conversation Studies, Palgrave Macmillan, Basingstoke and New York, pp. 578-596", "authors": ["Danby S", "Cromdal J", "Johanna Rendle Short"]}, {"title": "Using conversational structure as an interactional resource: Children with Asperger", "year": "2014", "source": "s syndrome and their conversational partners'in Joanne Arciuli and Jon Brock (ed.), Communication in Autism (Trends in Language Acquisition Research), John Benjamins Publishing Company, Amsterdam, The Netherlands and Philadelphia, PA, USA, pp. 217-244", "authors": ["Johanna Rendle Short"]}, {"title": "ligning in and through interaction: Children getting in and out of spontaneous activity", "year": "2014", "source": "Discourse Studies: an interdisciplinary journal for the study of text and talk, vol. 16, no. 6, pp. 792-815", "authors": ["Johanna Rendle Short", "Cobb-Moore C", "Danby S"]}, {"title": "Ser and estar: Corrective input to children", "year": "2013", "source": "s errors of the Spanish copula verbs'First Language, vol. 33, no. 2, pp. 155-167", "authors": ["Holtheuer C", "Johanna Rendle Short"]}, {"title": "Making the", "year": "2013", "source": "invisible' visible: A conversation analytic approach to intercultural teaching and learning in the Chinese Mandarin language classroom'in Fred Dervin and Anthony J Liddicoat (ed.), Linguistics for International Education, John Benjamins Publishing Company, United States, pp. 113-136", "authors": ["Wang Y", "Johanna Rendle Short"]}, {"title": "Cues to deception in context: Response latency/gaps in denials and blame shifting", "year": "2011", "source": "British Journal of Social Psychology, vol. 50, no. 3, pp. 431-449", "authors": ["Reynolds E", "Johanna Rendle Short"]}, {"title": "ddress terms in the Australian political news interview", "year": "2011", "source": "in Mats Ekstrom and Marianna Patrona (ed.), Talking politics in broadcast media: cross-cultural perspectives on political interviewing, journalism and accountability, John Benjamins Publishing Company, Amsterdam Netherlands, pp. 93-111", "authors": ["Johanna Rendle Short"]}, {"title": "Taking an Interactional Perspective: Examining Children", "year": "2010", "source": "s Talk in the Australian Aboriginal Community of Yakanarra'Australian Journal of Linguistics, vol. 30, no. 4, pp. 397-421", "authors": ["Johanna Rendle Short", "Moses K"]}, {"title": "Mate", "year": "2010", "source": "as a term of address in ordinary interaction'Journal of Pragmatics, vol. 42, no. 5, pp. 1201-1218", "authors": ["Johanna Rendle Short"]}, {"title": "The Address Term Mate in Australian English: Is it Still a Masculine Term?", "year": "2009", "source": "Australian Journal of Linguistics, vol. 29, no. 2, pp. 245-268", "authors": ["Johanna Rendle Short"]}, {"title": "conversation analysis view of communication as jointly accomplished social interaction: An unsuccessful proposal for a social visit", "year": "2009", "source": "Australian Journal of Linguistics, vol. 29, no. 1, pp. 75-89", "authors": ["Nevile M", "Johanna Rendle Short"]}, {"title": "Doing Public Policy", "year": "2009", "source": "in the Political News Interview'in Richard Fitzgerald and William Housley (ed.), Media, Policy and Interaction, Ashgate Publishing Ltd, United Kingdon, pp. 95-114", "authors": ["Johanna Rendle Short"]}, {"title": "Language as action", "year": "2007", "source": "Australian Review of Applied Linguistics (print edition), vol. 30, no. 3, pp. 30.1-13", "authors": ["Nevile M", "Johanna Rendle Short"]}, {"title": "Neutralism and adversarial challenges in the political news interview", "year": "2007", "source": "Discourse & Communication, vol. 1, no. 4, pp. 387-406", "authors": ["Johanna Rendle Short"]}, {"title": "Language as Action: Australian Studies in Conversation Analysis", "year": "2007", "source": "Australian Review of Applied Linguistics (online edition), vol. 30", "authors": ["Nevile M", "Johanna Rendle Short"]}, {"title": "That", "year": "2007", "source": "s So Gay': A Contemporary Use of Gay in Australian English'Australian Journal of Linguistics, vol. 27, no. 2, pp. 147-173", "authors": ["Johanna Rendle Short", "Lalor T"]}, {"title": "Language as Action", "year": "2007", "source": "Australian Review of Applied Linguistics (print edition), vol. 30, no. 3, pp. 30.1-30.13", "authors": ["Nevile M", "Johanna Rendle Short"]}, {"title": "Catherine, you", "year": "2007", "source": "re wasting your time\": Address terms within the Australian political interview'Journal of Pragmatics, vol. 39, no. 9, pp. 1503-1525", "authors": ["Johanna Rendle Short"]}, {"title": "Language as action: Australian studies in conversation analysis (Special thematic issue)", "year": "2007", "source": "30", "authors": ["Johanna Rendle Short", "Nevile M", "eds"]}, {"title": "The Academic Presentation: Situated Talk in Action", "year": "2006", "source": "Ashgate Publishing LtdAldershot UK", "authors": ["Johanna Rendle Short"]}, {"title": "Managing the transitions between Talk and Silence in the Academic monologue", "year": "2005", "source": "Research on Language and Social Interaction, vol. 38, no. 2, pp. 179-218", "authors": ["Johanna Rendle Short"]}, {"title": "I", "year": "2005", "source": "ve got a paper-shuffler for a husband: Indexing sexuality on talk-back radio'Discourse and Society, vol. 16, no. 4, pp. 561-578", "authors": ["Johanna Rendle Short"]}, {"title": "nalysing Other Person Reference Terms within the Political News Interview", "year": "2005", "source": "International Conference on Critical Discourse Analysis: Theory into Research 2005, ed. Thao Le, University of Tasmania, Launceston Tasmania, pp. 609-619", "authors": ["Johanna Rendle Short"]}, {"title": "Showing Structure: Using", "year": "2004", "source": "um' in the Academic seminar'Pragmatics, vol. 14, no. 4, pp. 479-498", "authors": ["Johanna Rendle Short"]}, {"title": "So what does this show us?\" Analysis of the Discourse Marker", "year": "2003", "source": "so' in Monologic Talk'Australian Review of Applied Linguistics (print edition), vol. 26, no. 2, pp. 46-62", "authors": ["Johanna Rendle Short"]}, {"title": "Managing Interaction: A Conversation Analytic Approach to the Management of Interaction by an 8 year old Girl with Asperger", "year": "2003", "source": "s Syndrome'Issues in Applied Linguistics, vol. 13, no. 2, pp. 161-186", "authors": ["Johanna Rendle Short"]}, {"title": "Not Just a Thesis: PhD Study as a First Step Towards an Academic Career", "year": "2001", "source": "in Bartlett, Alison.  Mercer, Gina (ed.), Postgraduate Research Supervision: Transforming (R)Elations, Peter Lang Publishing Group, New York, pp. 123-132", "authors": ["Collins B", "Johanna Rendle Short", "Curnow T"]}, {"title": "When", "year": "1999", "source": "okay' is okay in Computer Science Seminar Talk'Australian Review of Applied Linguistics (print edition), vol. 22, no. 2, pp. 19-33", "authors": ["Johanna Rendle Short"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}