{"ANU": {"name": "John Dargavel", "link": "https://researchers.anu.edu.au/researchers/dargavel-jb", "colleges": "College of Science", "email": "john.dargavel@anu.edu.au", "phone": "0490 121 068", "expertise": [], "interest": ["Forest historyHistory of forest scienceHistory of Australian wood collections (xylaria)History of forestry educationBiographies of forestersPolitical economy of forest sectorLabour history of forest sectorArboreal remembrance"], "biography": "His book on Australian forest history, Fashioning Australia's Forests (Oxford University Prss) was published in 1995 and his biography, The Zealous Conservator: a Life of Charles Lane Poole (University of Western Australia Press) was published in 2008. His most recent book on the history of forest science over the last three centuries was written with Elisabeth Johann, Science and Hope: a Forest History (White Horse Press) was published in 2013, followed by a German edition Die Geschichte der Forstwissenschaft – eine Geschichte der Hoffnung in 2018.", "project": ["Restoring Forests in Times of Contagion", "I am working with others to collect papers that reflect on the history and policy of tree planting to restore Australian and New Zealand forests and landscapes. They will be published on-line in October 2020 to mark John Evelyn’s birth in 1620. The coincidences of Evelyn’s time and ours extend beyond the need for trees. Just as the Royal Society published John Evelyn’s Sylva or a Discourse on Forest Trees in 1664, England was hit by the Plague. Just as we were planning a conference forest restoration, we have been hit by COVID19. Just as Evelyn was appalled by waste and deforestation, so are we in many of our landscapes. Evelyn wrote Sylva as a textbook on restoring the English forests. We need to restore our Southern Hemisphere forests and landscapes in ways that consider our own history, environment, changing climate and ravaging bushfires.", "Environment in everyday life", "I am currently investigating the paradoxes of how the environment appears in a variety of aspects of everyday life. Canberra as 'the Bush Capital' provides many examples, of which the fences at Mulligans Flat nature reserve are one. Dust from which the universe and us was created, and which appears annoyingly in our houses each week is another example.", "The lives of Australian foresters", "I investigated the lives of Australian foresters in a collaborative project in National Centre for Biography with the Australian Forest History Society and the Insitute of Foresters of Australia. An initial inventorywas prepared with 186 obituaries and 20 entries in the National Dictionary of Biography. It covers the period from 1900 to 2015.", "History of Australia's wood collections (xylaria)", "In collaboration with Gordon Dadswell (University of Melbourne) and Phil Evans (University of British Columbia) I am investigated the history of Australia's wood collections. These were created in the states from the 1880s and nationally from the 1920s and together constitute the scientific infrastructure for wood anatomy. Several of the collections are falling into disuse and their future conservation is problematic. A particular case is the collection held at ANU that was originally started in 1928 by the Commonwealth Forestry Bureau."], "publication": [{"title": "Science and hope: a forest history", "year": "2013", "source": "White Horse PressCambridge", "authors": ["John Dargavel"]}, {"title": "‘Contested forestries", "year": "2012", "source": "contested educations: a centenary reflection’Australian Forestry vol. 75, no. 1, pp. 16-21", "authors": ["John Dargavel"]}, {"title": "‘On dispossession’", "year": "2012", "source": "in Brett J. StubbsJane Lennon, Alison Specht and John Taylor (eds.) Australia’s Ever-changing Forests VI: Proceedings of the Eighth National Conference on Australian Forest History, Australian Forest History Society, Lismore.", "authors": ["John Dargavel"]}, {"title": "Lawrence, Alfred Oscar Platt (Alf) (1904–1986)", "year": "2012", "source": ". Australian Dictionary of Biography. vol.18. http://adb.anu.edu.au/biography/lawrence-alfred-oscar-platt-alf-14849/text26034", "authors": ["John Dargavel"]}, {"title": "‘Netting the global forest: attempts at influence’", "year": "2011", "source": "Global Environment no. 5, pp. 128-158", "authors": ["John Dargavel"]}, {"title": "‘Contested visions and the Australian Forestry School’", "year": "2009", "source": "Forest History Todayvol. 15, nos 1&2, pp. 15-21", "authors": ["John Dargavel"]}, {"title": "‘History of forestry: institutions and culture’", "year": "2009", "source": "Encyclopedia of Life Support Systems (EOLSS)Eolss Publishers, Oxford, U.K, .", "authors": ["John Dargavel"]}, {"title": "‘Iron", "year": "2008", "source": "steel and timber: a transient heritage’Australian Journal of Transdisciplinary Engineering, vol. 6, no. 1, pp. 67-76", "authors": ["John Dargavel"]}, {"title": "The Zealous Conservator", "year": "2008", "source": "a Life of Charles Lane PooleCrawley, WA, University of Western Australia Press", "authors": ["John Dargavel"]}, {"title": "‘Imperial ethos", "year": "2008", "source": "dominions reality: forestry education in New Zealand and AustraliaEnvironment and History, vol. 14, no. 4, pp. 523-43", "authors": ["John Dargavel"]}, {"title": "‘From exploration to science: Lane Poole’s forest surveys of Papua and New Guinea", "year": "2006", "source": "1922-1924’Historical Records of Australian Science, vol. 17, pp. 71-90", "authors": ["John Dargavel"]}, {"title": "‘History of forestry’", "year": "2005", "source": "Encyclopedia of Life Support Systems (EOLSS)Developed under the Auspices of the UNESCO, Eolss Publishers, Oxford ,UK, .", "authors": ["Agnoletti M", "John Dargavel", "Johann E"]}, {"title": "‘Charles Lane Poole in the transition from Empire’", "year": "2005", "source": "in Micheal CalverHeidi Bigler-Cole, Geofrey Bolton, John Dargavel, Andrea Gaynor, Pierre Horwitz, Jenny Mills & Grant Wardell-Johnson (eds), A forest conscienceness: Proceedings of 6th National Conference of the Australian Forest History Society, Rotterdam: Millpress, pp. 65-74", "authors": ["John Dargavel"]}, {"title": "‘Managing amidst conflict: the Huon District forests of Tasmania’", "year": "2005", "source": "in Patrick B. DurstChris Brown, Henrylito D. Tacio and Miyuki Ishikawa (eds), In search of excellence: exemplary forest management in Asia and the Pacific, Bangkok, Regional Community Forestry Training Centre for Asia and the Pacific, FAO, pp. 239-50", "authors": ["John Dargavel"]}, {"title": "‘The Fight for the Forests in retrospect and prospect’", "year": "2004", "source": "Australasian Journal of Environmental Managementvol. 11, no. 3, pp. 237-44", "authors": ["John Dargavel"]}, {"title": "‘Persistence and transition on the Wangites-Wagait Reserves", "year": "2004", "source": "1892-1976’Journal of Northern Territory History, vol. 15, pp. 5-19.", "authors": ["John Dargavel"]}, {"title": "‘“Not easy work to starve their employees”: the 1921-22 Tasmanian timber dispute’. Labour History", "year": "2003", "source": "vol. 24pp. 47-67", "authors": ["John Dargavel"]}, {"title": "‘Determining plantation prospects: parameters and purposes’", "year": "2003", "source": "Australian Forestryvol. 60, no. 1, pp. 9-11", "authors": ["John Dargavel"]}, {"title": "‘Avenues’", "year": "2002", "source": "‘Forestry’‘Lane Poole, Charles Edward’, ‘State Forest Nurseries’ in Richard Aitken and Michael Looker (eds), The Oxford Companion to Australian Gardens, Melbourne: Oxford University Press, pp. 62-4, 228-9, 358-9, 568", "authors": ["John Dargavel"]}, {"title": "‘Hard work to starve: a Tasmanian play’", "year": "2002", "source": "in John DargavelDenise Gaughwin & Brenda Libbis (eds), Australia’s ever-changing forests V: Proceedings of the Fifth National Conference on Australian Forest History, Canberra, Centre for Resource and Environmental Studies, The Australian National University, pp. 228-50", "authors": ["John Dargavel"]}, {"title": "‘Sources and silences in Australian forest history’", "year": "2002", "source": "in John DargavelDenise Gaughwin & Brenda Libbis (eds), Australia’s ever-changing forests V: Proceedings of the Fifth National Conference on Australian Forest History, Canberra, Centre for Resource and Environmental Studies, The Australian National University, pp. 39-48", "authors": ["John Dargavel"]}, {"title": "‘Management plans for cypress pine forests’", "year": "2001", "source": "in John DargavelDiane Hart & Brenda Libbis (eds) 2001, Perfumed pineries: environmental history of Australia’s Callitris forest, Canberra, Centre for Resource and Environmental Studies, The Australian National University, pp. 136-49", "authors": ["John Dargavel"]}, {"title": "‘In the wood of neglect’", "year": "2000", "source": "in M. Agnoletti and S. Anderson (eds)Forest history: International studies on socio-economic and forest ecosystem change, Wallingford, CABI Publishing, pp. 264-77", "authors": ["John Dargavel"]}, {"title": "‘More to grief than granite: arboreal remembrance in Australia’", "year": "2000", "source": "Journal of Australian Studiesno. 64, pp. 187-95", "authors": ["John Dargavel"]}]}, "Microsoft-Academic": [{"title": "book review inventory of the largest primeval beech forest in europe a swiss ukraine scientific adventure", "year": 2014, "source": "australian forestry", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}], "id": 161202776}, {"title": "politics policy and process in the forests", "year": 1998, "source": "australasian journal of environmental management", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}], "id": 76594230}, {"title": "imperial ethos dominions reality forestry education in new zealand and australia 1910 1965", "year": 2008, "source": "environment and history", "authors": [{"name": "michael roche", "affiliation": "massey university"}, {"name": "john dargavel", "affiliation": "australian national university"}], "id": 134321629}, {"title": "more to grief that granite arboreal remembrance in australia", "year": 2000, "source": "journal of australian studies", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}], "id": 39427579}, {"title": "flooded forest and desert creek ecology and history of the river red gum", "year": 2015, "source": "australian historical studies", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}], "id": 199561357}, {"title": "australia s ever changing forests iv proceedings of the fourth national conference on australian forest history", "year": 1999, "source": "", "authors": [{"name": "john dargavel"}, {"name": "sue feary"}]}, {"title": "from exploitation to science lane poole s forest surveys of papua and new guinea 1922 1924", "year": 2006, "source": "historical records of australian science", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}], "id": 174634489}, {"title": "prospects for australian forest plantations", "year": 1990, "source": "", "authors": [{"name": "john dargavel"}, {"name": "noel semple"}]}, {"title": "perfumed pineries environmental history of australia s callitris forests", "year": 2002, "source": "environmental history", "authors": [{"name": "john dargavel", "affiliation": "australian national university"}, {"name": "d hart"}, {"name": "b libbis"}], "id": 76796937}, {"title": "environmental events in the forests of northern new south wales a second order", "year": 1995, "source": "australasian journal of environmental management", "authors": [{"name": "john dargavel"}, {"name": "gloria jackson"}, {"name": "jacqueline tracey"}], "id": 76594230}], "ANDS-Grants": []}