{"ANU": {"name": "John ('Jack') Pezzey", "link": "https://researchers.anu.edu.au/researchers/pezzey-j-cv", "colleges": "College of Science", "email": "jack.pezzey@anu.edu.au", "phone": "", "expertise": ["Environment And Resource Economics", "Economic Development And Growth", "Environment Policy", "Ecological Economics", "Welfare Economics"], "interest": ["My main research interest is the sustainability of world civilisation in the face of environmental resource constraints over the next century or two, combining contrasting insights from mainstream (\"neoclassical\") and ecological economics.  More particularly it is on the economics of sustainability concepts at global and national levels, and applying these concepts to national income accounting and sustainability policies.  My secondary research interest is the political economy of pollution taxes, especially the comparison between a carbon (emissions) tax and a (carbon) emissions trading scheme for curbing global warming."], "biography": "I joined the ANU in 1999 after posts at the Universities of Colorado, Bristol, London and York, following a decade in the UK Civil Service as a meteorologist, energy analyst and environmental economist.  I have a BA in applied mathematics and theoretical physics from the University of Cambridge; and a PhD in economics from the University  of Bristol, focusing on the theory of sustainability and environmental policies.  I have received numerous research awards from prestigious institutions in the UK, USA and Australia, and have authored over 25 highly-cited journal articles and other papers on environmental and ecological economics, with a focus in the last decade on climate economics.  For full CV see http://people.anu.edu.au/jack.pezzey/PezzeyCVmed.pdf, downloadable from my personal website, http://people.anu.edu.au/jack.pezzey/", "project": ["\"Energy transitions: Past, present and future\".  Australian Research Council Discovery Project, 2012-2014, led by Professor David Stern, Crawford School of Public Policy.  Project summary: \"Uncertainty about the costs of transitioning to a low carbon economy in Australia and other countries will be reduced by improving our knowledge of the costs of reducing fossil fuel use and the role of energy in economic growth. Energy economics research capabilities in Australia will be enhanced.\""], "publication": [{"title": "Why the social cost of carbon will always be disputed", "year": "2019", "source": "WIREs Climate Change, vol. 10, no. 1, pp. e558", "authors": ["John ('Jack') Pezzey"]}, {"title": "We can", "year": "2018", "source": "t know the future cost of climate change. Let's focus on the cost of avoiding it instead", "authors": ["John ('Jack') Pezzey"]}, {"title": "Promoting behind-the-meter battery storage: options\r\nfor more effective government support and regulation", "year": "2018", "source": "International Journal of Technology Intelligence and Planning, vol. 12, no. 1, pp. 77-98", "authors": ["Tidemann C", "Engerer N", "Franklin E", "John ('Jack') Pezzey"]}, {"title": "Rethinking the role of occupant behavior in building energy performance: A review", "year": "2018", "source": "Energy and Buildings, vol. 172, pp. 279-294pp", "authors": ["Zhang Y", "Bai X", "Mills F", "John ('Jack') Pezzey"]}, {"title": "The influence of lobbying on climate policies; or, why the world might fail", "year": "2014", "source": "Environment and Development Economics, vol. 19, no. 3, pp. 329-332", "authors": ["John ('Jack') Pezzey"]}, {"title": "Why uncontrolled climate change may be an ultimate limit to growth", "year": "2014", "source": "The Conversation, 30 October", "authors": ["John ('Jack') Pezzey"]}, {"title": "Towards a more inclusive and precautionary indicator of global sustainability", "year": "2014", "source": "Ecological Economics 106141–154", "authors": ["John ('Jack') Pezzey"]}, {"title": "COMMENTARY: Carbon tax needs thresholds to reach its full potential", "year": "2013", "source": "Nature Climate Change, vol. 3, no. 12, pp. 1008-1011", "authors": ["John ('Jack') Pezzey", "Jotzo F"]}, {"title": "To cut more emissions, a carbon tax needs to raise less revenue", "year": "2013", "source": "The Conversation, 27 November", "authors": ["John ('Jack') Pezzey"]}, {"title": "Tax-versus-trading and efficient revenue recycling as issues for greenhouse gas abatement", "year": "2012", "source": "Journal of Environmental Economics and Management, vol. 64, pp. 230-236", "authors": ["John ('Jack') Pezzey", " Jotzo F"]}, {"title": "Where in the world is it cheapest to cut carbon emissions?", "year": "2012", "source": "Australian Journal of Agricultural and Resource Economics, vol. 56, pp. 315-331", "authors": ["Stern D", "John ('Jack') Pezzey", "Lambie R"]}, {"title": "The logic of collective action and Australia", "year": "2010", "source": "s climate policy'Australian Journal of Agricultural and Resource Economics, vol. 54, no. 2, pp. 185-202", "authors": ["John ('Jack') Pezzey", "Mazouz S", "Jotzo F"]}, {"title": "Fiddling while carbon burns: why climate policy needs pervasive emission pricing as well as technology promotion", "year": "2008", "source": "Australian Journal of Agricultural and Resource Economics, vol. 52, no. 1, pp. 97-110", "authors": ["John ('Jack') Pezzey", "Jotzo F", "Quiggin J"]}, {"title": "Expectations of linear functions with respect to truncated multinormal distributions - With applications for uncertainty analysis in environmental modelling", "year": "2007", "source": "Environmental Modelling and Software, vol. 22, no. 7, pp. 915-923", "authors": ["Sharples J", "John ('Jack') Pezzey"]}, {"title": "Optimal intensity targets for greenhouse gas emissions trading under uncertainty", "year": "2007", "source": "Environmental and Resource Economics, vol. 38, pp. 259-284", "authors": ["Jotzo F", "John ('Jack') Pezzey"]}, {"title": "Reconsidering reconsidered: why sustainable discounting need not be inconsistent over time", "year": "2006", "source": "in D.J. Pannell and S.G.M. Schilizzi (ed.), Economics and the Future: Time and Discounting in Private and Public Decision-Making, Edward Elgar Publishing, Cheltenham, UK, pp. 69-76", "authors": ["John ('Jack') Pezzey"]}, {"title": "Comparing augmented sustainability measures for Scotland: Is there a mismatch?", "year": "2006", "source": "Ecological Economics, vol. 57, no. 1, pp. 1-60", "authors": ["John ('Jack') Pezzey", "Hanley N", "Turner K"]}, {"title": "Emission Pricing: avoiding both the rock and the hard place", "year": "2006", "source": "Competition and Regulation TimesInstitute for the Study of Competition and Regulation, Wellington, New Zealand, July", "authors": ["John ('Jack') Pezzey"]}, {"title": "Sustainability and its economic interpretations", "year": "2005", "source": "in R. David Simpson, Michael A. Toman and Robert U. Ayres (ed.), Scarcity and Growth Revisited, Resources for the Future Press, Washington, DC, USA, pp. 121-141", "authors": ["John ('Jack') Pezzey", "Toman M"]}, {"title": "Economics of the environment", "year": "2005", "source": "in R.Q.Grafton, L.Robin & RJ Wasson (ed.), Understanding the environment: bridging the disciplinary divides, UNSW Press, Sydney, pp. 40-56", "authors": ["Grafton R", "John ('Jack') Pezzey"]}, {"title": "One-sided sustainability tests with amenities, and changes in technology, trade and population", "year": "2004", "source": "Journal of Environmental Economics and Management, vol. 48, pp. 613-631", "authors": ["John ('Jack') Pezzey"]}, {"title": "Sustainability policy and environmental policy", "year": "2004", "source": "Scandinavian Journal of Economics, vol. 106, no. 2, pp. 339-359", "authors": ["John ('Jack') Pezzey"]}, {"title": "Exact measures of income in a hyperbolic economy", "year": "2004", "source": "Environment and Development Economics, vol. 9, pp. 473-484", "authors": ["John ('Jack') Pezzey"]}, {"title": "Measuring technical progress in gross and net products", "year": "2003", "source": "Economics Letters, vol. 78, no. 2, pp. 247-252", "authors": ["John ('Jack') Pezzey"]}, {"title": "Emission taxes and tradable permits: a comparison of views on long run efficiency", "year": "2003", "source": "Environmental and Resource Economics, vol. 26, no. 2, pp. 329-342", "authors": ["John ('Jack') Pezzey"]}, {"title": "The effect of subsistence on collapse and institutional adaptation in population-resource societies", "year": "2003", "source": "Journal of Development Economics, vol. 72, pp. 299-320", "authors": ["John ('Jack') Pezzey", "Anderies J"]}, {"title": "Introduction", "year": "2002", "source": "in JCV Pezzey and MA Toman (ed.), The economics of sustainability, Ashgate Publishing Ltd, UK, pp. i-xxxii", "authors": ["John ('Jack') Pezzey", "Toman M"]}, {"title": "Progress and problems in the economics of sustainability", "year": "2002", "source": "in Tietenberg T & Folmer H (ed.), International Year Book of Environmental and Resource Economics 2002-03, Edward Elgar Publishing, UK, pp. 165-232", "authors": ["John ('Jack') Pezzey", "Toman M"]}, {"title": "CGE models for evaluating domestic greenhouse policies in Australia: a comparative analysis", "year": "2001", "source": "Productivity Commission", "authors": ["John ('Jack') Pezzey", "Lambie R"]}, {"title": "simple bioeconomic model of a marine reserve", "year": "2000", "source": "Ecological Economics, vol. 33, no. 1, pp. 77-91", "authors": ["John ('Jack') Pezzey", "Roberts C", "Urdal B"]}, {"title": "The rise, fall and sustainability of capital-resource economies", "year": "1998", "source": "Scandinavian Journal of Economics, vol. 100, no. 2, pp. 513-527", "authors": ["John ('Jack') Pezzey", "Withagen C"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}