{"ANU": {"name": "John Bekkers", "link": "https://researchers.anu.edu.au/researchers/bekkers-jm", "colleges": "College of Health & Medicine", "email": "John.Bekkers@anu.edu.au", "phone": "02 6125 2502", "expertise": ["Central Nervous System", "Cellular Nervous System"], "interest": ["My group works on the neurons and circuits in the brain that underlie the sense of smell.  In particular, we focus on the olfactory cortex, a brain region that is responsible for our ability to recognise and remember odours.  By studying this cortex, we hope to elucidate how the brain processes sensory information in order to form a coherent picture of the outside world.  This kind of fundamental research is important for an eventual understanding of how brain circuits become dysfunctional in certain mental disorders, like schizophrenia and autism.  The olfactory cortex is also highly susceptible to epilepsy, Alzheimer's Disease and Parkinson's Disease, and the study of this cortex may reveal new understanding and therapies for these devastating and surprisingly common neurological disorders."], "biography": "Interests: hiking/bushwalking French language & literature", "project": ["1. Excitability and hyperexcitability of neural circuits in the rodent      piriform cortex (NHMRC Project Grant): This project uses patch clamping, calcium imaging and molecular genetic approaches      to study the spread of electrical activity in the piriform cortex (PC) of      mice. The PC is a phylogenetically-ancient cortical region with a much simpler      structure than other sensory cortices. This comparative simplicity means that      it is an ideal system in which to study fundamental questions about normal      and abnormal brain function. Surprisingly, the PC has been little-studied.      Major aims of this project are: 1. To use functional calcium imaging to track      the spread of electrical excitability through identified microcircuits in      different layers of acute slices of the mouse PC following stimulation of      inputs from the olfactory bulb. This is done under both normal and epileptic      conditions. 2. To use a novel transgenic mouse to selectively manipulate electrical      activity in layer II semilunar cells using optogenetic techniques. This is    a collaboration with Sacha Nelson, Brandeis University, USA.", "2. Neural circuits for odour-processing in the rodent piriform cortex      'in vivo' (NHMRC Project Grant):", "This project uses 'blind' and two-photon targeted patch clamping in vivo to      measure the responses of identified neurons in the piriform cortex to odour      application. This work will allow us to examine the functional roles of the      different classes of glutamatergic and GABAergic neurons that we have identified      in slices of the piriform cortex. The project will also use a 'periscope'      method to image changes in intracellular calcium across the full thickness      of the piriform cortex when applying odours to the nose. This should allow      us to study the mechanisms giving rise to beta oscillations in electrical      activity during odour processing. This work is a collaboration with Matthew      Larkum, Charite Medical University, Germany.", "3. Persistent firing in cortical interneurons: Mechanisms and potential anticonvulsant role (NHMRC Project Grant): This project uses whole-cell patch clamping and voltage imaging to study the mechanisms and possible functions of a recently-discovered phenomenon called persistent firing, which is found in some classes of cortical interneurons.  Persistent firing is a state of heightened excitability, in which neurons slowly integrate excitatory inputs until eventually (after a few seconds) they start to fire action potentials at a high frequency, even after the initiating excitation is stopped.  We hypothesise that persistent firing is an adaptation to counter undesirable cortical hyperexcitability, such as occurs during epileptic seizures.  This idea will be tested.  The project also involves developing computational models to test our ideas about how persistent firing affects neuronal networks.  This work is a collaboration with Mark McDonnell, University of South Australia."], "publication": [{"title": "Sodium and potassium conductances in principal neurons of the mouse piriform cortex: a quantitative description", "year": "2018", "source": "Journal of Physiology, vol. 596, no. 22, pp. 5397-5414pp", "authors": ["Ikeda K", "Suzuki N", "John Bekkers"]}, {"title": "Pre- and postsynaptic activation of GABA-B receptors modulates principal cell excitation in the piriform cortex", "year": "2018", "source": "Frontiers in Cellular Neuroscience, vol. 12, no. 28, pp. 1-11pp", "authors": ["Gerrard L", "Tantirigama M", "John Bekkers"]}, {"title": "Spontaneous activity in the piriform cortex extends the dynamic range of cortical odor coding", "year": "2017", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 114, no. 9, pp. 2407-2412", "authors": ["Tantirigama M", "Huang H", "John Bekkers"]}, {"title": "Optogenetic Mapping of Intracortical Circuits Originating from Semilunar Cells in the Piriform Cortex", "year": "2015", "source": "Cerebral Cortex, eprint, pp. 1-13.  Print: vol. 27, no. 1, pp 589-901 (2017)", "authors": ["Choy J", "Suzuki N", "Shima Y", "John Bekkers"]}, {"title": "xial resistivity", "year": "2015", "source": "in Dieter Jaeger, Ranu Jung (ed.), Encyclopedia of Computational Neuroscience, Springer New York, New York, NY, pp. 2617-2619pp", "authors": ["John Bekkers"]}, {"title": "Persistent barrage firing in cortical interneurons can be induced in vivo and may be important for the suppression of epileptiform activity", "year": "2014", "source": "Frontiers in Cellular Neuroscience, vol. 8, no. 76, pp. 1-11", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Neurons and circuits for odor processing in the piriform cortex", "year": "2013", "source": "Trends in Neurosciences, vol. 36, no. 7, pp. 429-438", "authors": ["John Bekkers", "Suzuki N"]}, {"title": "Microcircuits mediating feedforward and feedback synaptic inhibition in the piriform cortex", "year": "2012", "source": "Journal of Neuroscience, vol. 32, no. 3, pp. 919-931", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Two layers of synaptic processing by principal neurons in piriform cortex", "year": "2011", "source": "Journal of Neuroscience, vol. 31, no. 6, pp. 2156-2166", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Changes in dendritic axial resistance alter synaptic integration in cerebellar Purkinje cells", "year": "2011", "source": "Biophysical Journal, vol. 100, no. 5, pp. 1198-1206", "authors": ["John Bekkers"]}, {"title": "Pyramidal Neurons", "year": "2011", "source": "Current Biology, vol. 21, no. 24, pp. R975-R975", "authors": ["John Bekkers"]}, {"title": "Dynamic complex optical fields for optical manipulation, 3D microscopy and photostimulation of neurotransmitters", "year": "2010", "source": "Optical Trapping and Optical Micromanipulation VII, SPIE - The International Society for Optical Engineering, San Diego, CA", "authors": ["Daria V", "Stricker C", "John Bekkers"]}, {"title": "Distinctive Classes of GABAergic Interneurons Provide Layer-Specific Phasic Inhibition in the Anterior Piriform Cortex", "year": "2010", "source": "Cerebral Cortex, vol. 20, no. 12, pp. 2971-2984", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Inhibitory Neurons in the Anterior Piriform Cortex of the Mouse: Classification Using Molecular Markers", "year": "2010", "source": "Journal of Comparative Neurology, vol. 518, no. 10, pp. 1670-1687", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Synaptc transmission: excitatory autapses find a function?", "year": "2009", "source": "Current Biology, vol. 19, no. 7, pp. 296-298", "authors": ["John Bekkers"]}, {"title": "Counting the number of releasable synaptic vesicles in a presynaptic terminal", "year": "2009", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 106, no. 8, pp. 2945-2950", "authors": ["Ikeda K", "John Bekkers"]}, {"title": "Two strategies for the efficient use of synaptic vesicles", "year": "2009", "source": "Communicative & Integrative Biology, vol. 2, no. 6, pp. 1-4", "authors": ["Ikeda K", "John Bekkers"]}, {"title": "Distinctive Quantal Properties of Neurotransmission at Excitatory and Inhibitory Autapses Revealed Using Variance-Mean Analysis.", "year": "2008", "source": "Journal of Neuroscience, vol. 28, no. 50, pp. 13563-13573", "authors": ["Ikeda K", "Yanagawa Y", "John Bekkers"]}, {"title": "Targeted dendrotomy reveals active and passive contributions of the dendritic tree to synaptic integration and neuronal output.", "year": "2007", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 104, no. 27, pp. 11447-11452", "authors": ["John Bekkers"]}, {"title": "Inhibitory Interneurons in the Piriform Cortex", "year": "2007", "source": "Clinical and Experimental Pharmacology and Physiology, vol. 34, pp. 1064-1069", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "utapses", "year": "2006", "source": "Current Biology, vol. 16, no. 9, pp. R308", "authors": ["Ikeda K", "John Bekkers"]}, {"title": "Neural coding by two classes of principal cells in the mouse piriform cortex", "year": "2006", "source": "Journal of Neuroscience, vol. 26, no. 46, pp. 11938-11947", "authors": ["Suzuki N", "John Bekkers"]}, {"title": "Presynaptically Silent GABA Synapses in Hippocampus", "year": "2005", "source": "Journal of Neuroscience, vol. 25, no. 16, pp. 4031-4039", "authors": ["John Bekkers"]}, {"title": "Learning to take a deep breath - with BDNF", "year": "2004", "source": "Nature Medicine, vol. 10, no. 1, pp. 25-26", "authors": ["John Bekkers"]}, {"title": "Convolution of mini distributions for fitting evoked synaptic amplitude histograms", "year": "2003", "source": "Journal of Neuroscience Methods, vol. 130, no. 2, pp. 105-114", "authors": ["John Bekkers"]}, {"title": "Synaptic transmission: Functional autapses in the cortex", "year": "2003", "source": "Current Biology, vol. 13, no. 11, pp. R433-R435", "authors": ["John Bekkers"]}, {"title": "Presynaptic Ca2+ channels: a functional patchwork", "year": "2003", "source": "Trends in Neurosciences, vol. 26, no. 12, pp. 683-687", "authors": ["John Bekkers"]}, {"title": "Synaptic transmission: a new kind of inhibition", "year": "2002", "source": "Current Biology, vol. 12, pp. R648-650", "authors": ["John Bekkers"]}, {"title": "Modulation of excitability by Î±-dendrotoxin-sensitive potassium channels in neocortical pyramidal neurons", "year": "2001", "source": "Journal of Neuroscience, vol. 21, no. 17, pp. 6553-6560", "authors": ["John Bekkers"]}, {"title": "Inhibition of calcium channels by opioid- and adenosine-receptor agonists in neurons of the nucleus accumbens", "year": "2001", "source": "British Journal of Pharmacology, vol. 133, pp. 337-344", "authors": ["Chieng B", "John Bekkers"]}, {"title": "Distribution and activation of voltage-gated potassium channels in cell- attached and outside-out patches from large layer 5 cortical pyramidal neurons of the rat", "year": "2000", "source": "Journal of Physiology, vol. 525, pp. 611-620", "authors": ["John Bekkers"]}, {"title": "Distribution of slow AHP channels on hippocampal CA1 pyramidal neurons", "year": "2000", "source": "Journal of Neurophysiology, vol. 83, pp. 1756-1759", "authors": ["John Bekkers"]}, {"title": "Properties of voltage-gated potassium currents in nucleated patches from large layer 5 cortical pyramidal neurons of the rat", "year": "2000", "source": "Journal of Physiology, vol. 525, pp. 593-609", "authors": ["John Bekkers"]}, {"title": "Quantal amplitude and quantal variance of strontium-induced asynchronous EPSCs in rat dentate granule neurons", "year": "1999", "source": "Journal of Physiology, vol. 516, no. 1, pp. 227-248", "authors": ["John Bekkers"]}, {"title": "GABA(B), opioid and alpha2 receptor inhibition of calcium channels in acutely-dissociated locus coeruleus neurones", "year": "1999", "source": "British Journal of Pharmacology, vol. 127, pp. 1533-1538", "authors": ["Chieng B", "John Bekkers"]}]}, "Microsoft-Academic": [], "ANDS-Grants": [{"description": "We are studying the properties of neurons (nerve cells) and brain circuits that enable mammals to recognise and remember odours. Our experiments will focus on neurons in the odour-processing region of the cerebral cortex of mice. This work will answer fundamental questions about how the brain interprets sensory inputs in order to build a coherent picture of the external world. Our findings will also provide a deeper understanding of the causes of epilepsy, leading to improved treatments.", "title": "Synaptic inhibition and the control of excitability in the rodent piriform cortex", "id": "95893", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/471413", "researchers": ["Prof John Bekkers"], "status": "closed", "fundingAmount": 459738.53, "fundingScheme": "NHMRC Project Grants", "startDate": 2008, "endDate": 2011, "dateTimeModified": "2017-07-17T04:48:38Z", "dateTimeCreated": "2013-05-15T05:57:06Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/471413", "identifiers": ["http://purl.org/au-research/grants/nhmrc/471413", "471413"], "subjects": ["320704", "cerebral cortex", "electrophysiology", "neuronal excitability", "synaptic transmission", "epilepsy", "neurotransmission", "sensory function"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/95893"}]}, {"description": "The human cerebral cortex is the pinnacle of evolution. It is the most complex structure known, responsible for all of those skills - like language and reasoning - that make our species so remarkable. It is also a major site of many brain diseases, like schizophrenia and epilepsy. An understanding of how the cerebral cortex works would be a remarkable achievement, of immeasurable benefit to human health. How can one go about studying such a complex structure? The strategy taken in this project is to begin by studying one of the simplest regions of the cerebral cortex, the olfactory (or piriform) cortex. The olfactory cortex is an evolutionarily ancient region of cortex, with a simpler architecture than other cortical regions. Its task is to process the sense of smell, a primitive sense that is more elaborated in lower animals than in humans. The broad goal of our research is to understand, by studying the olfactory cortex of rats, how olfactory processing occurs at the level of nerve cells (neurons). We will use a number of powerful techniques - including microelectrode recording and laser microscopy - to measure the electrical properties of individual neurons. We will also study the synaptic connections between neurons, and how these connections change following memory-inducing stimuli. It is hoped that this work will shed light on how the healthy cortex is able to process and store information, and how brain diseases cause these functions to deteriorate.", "title": "Synaptic integration and plasticity in the rat piriform cortex", "id": "97852", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/224240", "researchers": ["Prof John Bekkers"], "status": "closed", "fundingAmount": 250500, "fundingScheme": "NHMRC Project Grants", "startDate": 2003, "endDate": 2005, "dateTimeModified": "2017-07-10T03:55:53Z", "dateTimeCreated": "2013-05-15T06:45:32Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/224240", "identifiers": ["http://purl.org/au-research/grants/nhmrc/224240", "224240"], "subjects": ["320702", "cerebral cortex", "sensory cortex", "synaptic plasticity", "synaptic transmission", "basic science", "cortical plasticity", "neurotransmission"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/97852"}]}, {"description": "This project aims to understand how electrical activity in the primary olfactory (piriform) cortex enables mice to recognise and remember odours. By using optical recording techniques together with genetic tools, the project expects to generate new knowledge about how the mammalian brain builds internal representations of the external world. Specific outcomes of the project include new insights into the functional architecture of the piriform cortex and fresh understanding of how olfactory information is encoded and stored in neural circuits. More broadly, the project aims to advance our understanding of how the brain works, with benefits for future improvements in artificial intelligence and brain-machine interfaces.", "title": "Discovery Projects - Grant ID: DP180101034", "id": "1315978", "key": "http://purl.org/au-research/grants/arc/DP180101034", "researchers": ["Prof John Bekkers"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 726285, "fundingScheme": "Discovery Projects", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:41Z", "dateTimeCreated": "2018-03-06T23:37:31Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP180101034", "identifiers": ["http://purl.org/au-research/grants/arc/DP180101034", "DP180101034"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1315978"}]}, {"description": "We are studying the properties of neurons (nerve cells) and brain circuits that enable mammals to recognise and remember odours. Our experiments will focus on neurons in the odour-processing region of the cerebral cortex of mice. This work will answer fundamental questions about how the brain interprets sensory inputs in order to build a coherent picture of the external world. Our findings will also provide a deeper understanding of the causes of epilepsy, leading to improved treatments.", "title": "Excitability and hyperexcitability of neural circuits in the rodent piriform cortex", "id": "81463", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/585462", "researchers": ["Prof John Bekkers", "Prof Sacha Nelson"], "status": "closed", "fundingAmount": 371807.12, "fundingScheme": "NHMRC Project Grants", "startDate": 2010, "endDate": 2014, "dateTimeModified": "2017-07-17T04:49:48Z", "dateTimeCreated": "2013-05-15T04:47:03Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/585462", "identifiers": ["http://purl.org/au-research/grants/nhmrc/585462", "585462"], "subjects": ["Cellular Nervous System", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "cerebral cortex", "electrophysiology", "neuronal excitability", "synaptic transmission", "epilepsy", "neurotransmission", "sensory function"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/81463"}]}, {"description": "We are studying the brain circuits that enable mammals to recognise odours. We will apply puffs of odorants to the nose of an anaesthetised mouse while measuring electrical signals in the odour-processing region of its cerebral cortex. Our work will answer fundamental questions about how the brain interprets sensory inputs in order to build a coherent picture of the world. This is basic research that will, in the longer term, shed light on the disturbances that occur during mental illness.", "title": "Neural circuits for odour-processing in the rodent piriform cortex 'in vivo'", "id": "109406", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1009382", "researchers": ["Prof John Bekkers", "Prof Matthew Larkum"], "status": "closed", "fundingAmount": 488817.8, "fundingScheme": "Project Grants", "startDate": 2011, "endDate": 2016, "dateTimeModified": "2016-05-16T09:55:23Z", "dateTimeCreated": "2013-05-15T07:19:57Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/1009382", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1009382", "1009382"], "subjects": ["Cellular Nervous System", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "cerebral cortex", "olfaction", "synaptic transmission", "electrophysiology", "sensory systems", "neurotransmission", "sensory cortex"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/109406"}]}, {"description": "The normal brain treads a fine line between too much electrical activity (epilepsy) and too little (sedation). We have discovered a class of brain cell that seems to behave like a sentinel, monitoring brain activity for signs of epilepsy. If a seizure occurs, this cell switches on an electrical brake that dampens excess activity. In this project we will study how this brake works and whether it really can inhibit seizures. Our research may lead to better treatments for epilepsy.", "title": "Persistent firing in cortical interneurons: mechanisms and potential anticonvulsant role", "id": "112181", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1050832", "researchers": ["Dr Mark Mcdonnell", "Prof John Bekkers"], "status": "closed", "fundingAmount": 520552.25, "fundingScheme": "Project Grants", "startDate": 2013, "endDate": 2016, "dateTimeModified": "2017-07-05T07:46:05Z", "dateTimeCreated": "2013-05-15T07:22:54Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/1050832", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1050832", "1050832"], "subjects": ["Cellular Nervous System", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "cerebral cortex", "synaptic transmission", "action potential", "axonal excitability", "epilepsy"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/112181"}]}, {"description": "Our brain is a uniquely powerful supercomputer, in part because it is &lsquo;plastic&rsquo; -- that is, it can change itself when we adapt or learn something new. An understanding of the causes of brain plasticity is an essential part of any quest to understand the brain in sickness and in health. This research uses a laser microscope to &lsquo;read the minds&rsquo; of mice as they learn about odours. By observing plasticity in action, we will gain deeper insights into normal brain function.", "title": "Learning and network plasticity in a primitive sensory cortex", "id": "1347682", "key": "http://purl.org/au-research/grants/nhmrc/GNT1128320", "researchers": ["Prof John Bekkers", "A/Pr Ehsan Arabzadeh"], "institutions": null, "status": "active", "fundingAmount": 461557, "fundingScheme": "Project Grants", "startDate": 2017, "endDate": null, "dateTimeModified": "2019-06-03T04:23:36Z", "dateTimeCreated": "2018-10-03T01:49:57Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Prof John Bekkers"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1128320", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1128320", "GNT1128320"], "subjects": ["Basic Science", "cerebral cortex | synaptic plasticity | patch clamp | calcium imaging | behaviour"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1347682"}]}]}