{"ANU": {"name": "John Noel Viana", "link": "https://researchers.anu.edu.au/researchers/viana-jn", "colleges": "College of Science", "email": "john.viana@anu.edu.au", "phone": "", "expertise": ["Bioethics Human And Animal", "Ethical Use Of New Technology E.G. Nanotechnology Biotechnology", "Medical Ethics", "Neurosciences"], "interest": ["For my postdoc, I am investigating ways to promote responsible innovation and facilitate greater diversity, inclusivity, and equity in Australian precision health research and technology development. I am also interested in determining ethical, legal, regulatory, and societal issues in personalised and population health research involving culturally and linguistically diverse populations, including Aboriginal and Torres Strait Islander peoples and individuals from various Asian backgrounds. My work will eventually involve engagement with laboratories and centres conducting health research and/or clinical trials to investigate the perspectives of researchers on equity and diversity questions, and to facilitate reflexive discussions among scientists on how to make their current and future projects more inclusive and culturally sensitive. I also have a great interest in the societal aspects of neuroscience and biotechnology development. My PhD thesis investigated ethical, legal, and societal issues associated with clinical trials of of invasive neurosurgical procedures for people with Alzheimer's disease. Furthermore, I have worked on other bioethical issues such as media portrayal of novel technologies, application of new neuroimaging modalities, and patient experience and perception of neurotherapeutic interventions."], "biography": "", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "reorienting science communication towards communities", "year": 2021, "source": "", "authors": [{"name": "lindy a orthia"}, {"name": "merryn mckinnon"}, {"name": "john noel viana"}, {"name": "graham walker"}]}], "ANDS-Grants": []}