{"ANU": {"name": "Joseph Altin", "link": "https://researchers.anu.edu.au/researchers/altin-jg", "colleges": "College of Science", "email": "joseph.altin@anu.edu.au", "phone": "", "expertise": ["Cancer Therapy Excl. Chemotherapy And Radiation Therapy", "Gene And Molecular Therapy", "Tumour Immunology", "Cellular Immunology", "Immunology"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Phase I trial of Lipovaxin-MM, a novel dendritic cell-targeted liposomal vaccine for malignant melanoma", "year": "2018", "source": "Cancer Immunology, Immunotherapy, vol. 67, pp. 1461-1472pp", "authors": ["Gargett T", "Abbas M", "Rolan P", "Joseph Altin"]}, {"title": "Repeated fine-needle aspiration of solid tumours in mice allows the identification of multiple infiltrating immune cell types", "year": "2015", "source": "Journal of Immunological Methods, vol. 425, pp. 102-107", "authors": ["Carroll C", "Joseph Altin", "Neeman T"]}, {"title": "g-bearing liposomes engrafted with peptides that interact with CD11c/CD18 induce potent Ag-specific and antitumor immunity", "year": "2011", "source": "International Journal of Cancer, vol. 129, no. 6, pp. 1391-1403", "authors": ["Abdus Salam Abul F", "Joseph Altin"]}, {"title": "Effective tumor targeting and enhanced anti-tumor effect of liposomes engrafted with peptides specific for tumor lymphatics and vasculature", "year": "2011", "source": "International Journal of Pharmaceutics, vol. 411, no. 1-2, pp. 206-214", "authors": ["Herringson T", "Joseph Altin"]}, {"title": "Increasing the antitumor efficacy of doxorubicin-loaded liposomes with peptides anchored via a chelator lipid", "year": "2011", "source": "Journal of Drug Targeting, vol. 19, no. 8, pp. 681-689", "authors": ["Herringson T", "Joseph Altin"]}, {"title": "ntigen-containing liposomes engrafted with flagellin-related peptides are effective vaccines that can induce potent antitumor immunity and immunotherapeutic effect", "year": "2010", "source": "Journal of Immunology, vol. 185, no. 3, pp. 1744-1754", "authors": ["Abdus Salam Abul F", "Joseph Altin"]}, {"title": "Convenient targeting of stealth siRNA-lipoplexes to cells with chelator lipid-anchored molecules", "year": "2009", "source": "Journal of Controlled Release, vol. 139, pp. 229-238", "authors": ["Herringson T", "Joseph Altin"]}, {"title": "Liposomal Ag engrafted with peptides of sequence derived from HMGB1 induce potent Ag-specific and anti-tumour immunity", "year": "2009", "source": "Vaccine, vol. 27, pp. 5846-5854", "authors": ["Abdus Salam Abul F", "Bennett D", "Joseph Altin"]}, {"title": "Targeted Liposomal Delivery of TLR9 Ligands Activates Spontaneous Antitumor Immunity in an Autochthonous Cancer Model", "year": "2009", "source": "Journal of Immunology, vol. 183, no. 2, pp. 1091-1098", "authors": ["Hamzah J", "Joseph Altin", "Herringson T"]}, {"title": "Targeting of plasmid DNA-lipoplexes to cells with molecules anchored via a metal chelator-lipid", "year": "2009", "source": "Journal of Gene Medicine, vol. 11, no. 11, pp. 1048-1063", "authors": ["Herringson T", "Patlolla R", "Joseph Altin"]}, {"title": "Liposomal vaccines - targeting the delivery of antigen", "year": "2006", "source": "Methods, vol. 40, pp. 39-52", "authors": ["Joseph Altin", "Parish C"]}, {"title": "Synthesis of NTA3-DTDA - A Chelator-Lipid that Promotes Stable Binding of His-Tagged Proteins to Membranes", "year": "2006", "source": "Australian Journal of Chemistry, vol. 59, no. 5, pp. 302-306", "authors": ["Joseph Altin", "Banwell M", "Coghlan P"]}, {"title": "The Human NK cell activation receptor NKp30: Analysis of the expression and cell binding properties of different NKp30 Isoforms", "year": "2005", "source": "Tissue Antigens, vol. 66, no. 5, p. 584", "authors": ["Joseph Altin"]}, {"title": "The Novel Chelator lipid 3(nitrilotriacetic acid)-ditetradecylamine (NTA3-DTDA) promotes stable binding of His-tagged proteins to liposomal membranes: Potent anti-tumor responses induced by simultaneously targeting antigen, cytokine and costimulatory signa", "year": "2005", "source": "Biochimica et Biophysica Acta: Biomembranes, vol. 1716, pp. 104-116", "authors": ["Van Broekhoven C", "Joseph Altin"]}, {"title": "Improved Targeting of Liposomal membranes with novel chelator lipids: Simultaneous targeting of antigen, cytokine and costimulatory signals to T cells induce potent anti-tumor responses.", "year": "2005", "source": "Tissue Antigens, vol. 66, no. 5, p. 346", "authors": ["Joseph Altin", "Van Broekhoven C"]}, {"title": "Plasminogen is tethered with high affinity to the cell surface by the plasma protein, histidine-rich glycoprotein", "year": "2004", "source": "Journal of Biological Chemistry, vol. 279, no. 37, pp. 38267-38276", "authors": ["Jones A", "Hulett M", "Joseph Altin"]}, {"title": "Targeting dendritic cells with antigen-containing liposomes: A highly effective procedure for induction of antitumor immunity and for tumor immunotherapy", "year": "2004", "source": "Cancer Research, vol. 64, pp. 4357-4365", "authors": ["Van Broekhoven C", "Parish C", "Demangel C", "Joseph Altin"]}, {"title": "Targeting dendritic cells with antigen-containing liposomes: antitumour immunity", "year": "2004", "source": "Expert Opinion on Biological Therapy, vol. 4, no. 11, pp. 1735-1747", "authors": ["Joseph Altin", "Van Broekhoven C", "Parish C"]}, {"title": "In vivo targeting of dendritic cells", "year": "2003", "source": "AU2004266034Australia", "authors": ["Parish C", "Joseph Altin"]}, {"title": "Novel Approach for Modifying Tumor Cell - Derived Plasma Membrane Vesicles to Contain Encapsulated IL-2 and Engrafted Cosmimulatory Molecules for Use Tumor Immunotherapy", "year": "2002", "source": "International Journal of Cancer, vol. 98, no. 1, pp. 63-72", "authors": ["Van Broekhoven C", "Joseph Altin"]}, {"title": "novel system for convenient detection of low-affinity receptor-ligand interactions: Chelator-lipid lipsomes engrafted with recombinant CD4 bind to cells expressing MHC class II", "year": "2001", "source": "Immunology and Cell Biology, vol. 79, pp. 274-284", "authors": ["Van Broekhoven C", "Joseph Altin"]}, {"title": "Synthesis of the chelator lipid nitrilotriacetic acid ditetradecylamine (NTA-DTDA) and its use with the IAsys biosensor to study receptor-ligand interactions on model membranes", "year": "2001", "source": "Biochimica et Biophysica Acta: Biomembranes, vol. 1513, no. 2, pp. 131-148", "authors": ["Joseph Altin", "White F", "Easton C"]}, {"title": "Histidine-rich glycoprotein regulates the binding of monomeric IgG and immune complexes by moncytes", "year": "1999", "source": "International Immunology, vol. 11, no. 8, pp. 1275-1282", "authors": ["Gorgani N", "Joseph Altin", "Parish C"]}, {"title": "Histidine-rich glycoprotein prevents the formation of insoluble immune complexes by rheumatoid factor", "year": "1999", "source": "Immunology, vol. 98, pp. 456-463", "authors": ["Gorgani N", "Joseph Altin", "Parish C"]}, {"title": "Differential binding of histidine-rich glycoprotein (HRG) to human IgG subclasses and IgG molecules containing kappa and lambda light chains", "year": "1999", "source": "Journal of Biological Chemistry, vol. 274, pp. 29633-29640", "authors": ["Gorgani N", "Parish C", "Joseph Altin"]}]}, "Microsoft-Academic": [], "ANDS-Grants": [{"description": "The use of genetic material, known as DNA, as a vaccine, has been a relatively new advance in vaccination technology with potential for combating many infectious diseases and cancers. The use of DNA has the advantage that it can be easily manipulated to develop new vaccines that have the desired preventative and-or immunotherapeutic effect. For optimal effect, however, the DNA to be used as a vaccine needs to be targeted to specific cell types in the body. Evidence suggests that a minor population of cells known as dendritic cells, which are present in blood and other tissues, play an important role in eliciting the effects of DNA vaccines. However, current methods for delivering DNA to these cells often lack selectivity in delivery, and-or use viruses to deliver the DNA. This can pose the risk of allergic type reactions and-or possibly cause tumours. The use of small membranous vesicles known as liposomes, made of phospholipids, has recently attracted considerable interest as DNA delivery vehicles, since these are considered safe, and have the potential to deliver large quantities of DNA. Although DNA can easily be packaged inside liposomes, it is has not been easy to target the liposomes and their contents (eg. encapsulated DNA) to specific cells (such as dendritic cells) within the body. We have recently produced a novel chelator lipid molecule which can be used to conveniently attach onto the liposome surface specific targeting molecules, such as engineered forms of antibody fragments, that can target or steer the liposomes together with their payload (eg. the DNA), directly to dendritic cells. This project will test the potential for using such targeted liposomes as DNA vaccines by examining whether liposomes containing DNA for a model antigen can be used in vaccinations to inhibit the growth and metastasis of a highly metastatic tumour (melanoma) in mice.", "title": "A NOVEL APPROACH FOR TARGETING DNA TO DENDRITIC CELLS IN VIVO FOR VACCINE DEVELOPMENT AND CANCER IMMUNOTHERAPY", "id": "76206", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/316949", "researchers": ["Dr Joseph Altin"], "status": "closed", "fundingAmount": 430250, "fundingScheme": "NHMRC Project Grants", "startDate": 2005, "endDate": 2007, "dateTimeModified": "2015-04-12T07:50:01Z", "dateTimeCreated": "2013-05-15T03:42:14Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Joseph Altin"], "purl": "http://purl.org/au-research/grants/nhmrc/316949", "identifiers": ["http://purl.org/au-research/grants/nhmrc/316949", "316949"], "subjects": ["Tumour Immunology", "MEDICAL AND HEALTH SCIENCES", "IMMUNOLOGY", "Cancer immunotherapy", "DNA vaccine", "Dendritic cells", "Liposomes", "Targeting delivery of DNA", "Cancer", "Gene therapy", "Infectious disease", "Vaccine"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/76206"}]}, {"description": "CD4 is a particular type of receptor on the surface of immune cells that participates in our response to infection. CD4 is also the primary receptor for the HIV virus which causes AIDS. We have discovered that a particular type of chemistry is occurring in CD4. This chemistry, which is known as redox chemistry, changes the shape of CD4. The shape change appears to be controlled by the immune cell. We have suggested that the redox chemistry in CD4 is important for controlling how immune cells respond to infection and how the HIV virus infects immune cells. Moreover, we have designed a small synthetic compound that blocks the redox chemistry in CD4 and prevents HIV infection in the test tube. We propose to investigate how the redox chemistry in CD4 controls the function of immune cells and infection by HIV.", "title": "Consequences of Disulfide Exchange in CD4 for Function", "id": "82725", "institutions": ["University of New South Wales"], "key": "http://purl.org/au-research/grants/nhmrc/209653", "researchers": ["Prof Philip Hogg", "Dr Joseph Altin"], "status": "closed", "fundingAmount": 332580, "fundingScheme": "NHMRC Project Grants", "startDate": 2002, "endDate": 2004, "dateTimeModified": "2017-07-10T03:55:35Z", "dateTimeCreated": "2013-05-15T04:47:47Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["University of New South Wales"], "principalInvestigator": ["Prof Philip Hogg"], "purl": "http://purl.org/au-research/grants/nhmrc/209653", "identifiers": ["http://purl.org/au-research/grants/nhmrc/209653", "209653"], "subjects": ["270199", "HIV/AIDS", "immune regulation", "receptors", "redox regulation", "AIDS and immunodeficiency", "immune development"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/82725"}]}]}