{"ANU": {"name": "Jothy Selvaraj", "link": "https://researchers.anu.edu.au/researchers/selvaraj-j", "colleges": "College of Health & Medicine", "email": "Jothy.Selvaraj@act.gov.au", "phone": "0251245617", "expertise": [], "interest": ["Geometric uncertainties in radiotherapy, image processing and registration, TCP and NTCP modelling, second malignancy risk estimation, maximum likelihood estimation, organ motion management, dose calculation, radiomics, data mining, adaptive radiotherapy, proton therapy and stereotactic treatments."], "biography": "Jothy Selvaraj worked as a Medical Physicist at the All India Institute of Medical Sciences (AIIMS), New Delhi, India. He later moved to the UK to obtain his PhD from the University of Liverpool, UK working at the Clatterbridge Cancer Centre. His doctoral thesis investigated the impact of geometric uncertainties, organ motion and clonogen distribution on tumour control probability (TCP). He later spent a brief stint at the NKI-AvL, Amsterdam as a postdoctoral scientist working on TCP and normal tissue complication probability (NTCP) modelling of stereotactic lung radiotherapy treatments. He now works 0.5 FTE as a Senior Medical Physics Specialist implementing new treatment techniques and developing in-house solutions for QA procedures besides working 0.5 FTE as a lead medical physicist, R&D in the Medical Physics and Radiation Engineering department, Canberra Hospital,Australian Capital Territory. He is also an HCPC (UK) and ACPSEM (Australia) Registered Clinical Scientist. His research interests include the effect of geometric uncertainties in radiotherapy, radiobiological/mathematical modelling and image processing applied to radiotherapy. He is also a passionate computer programmer.", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "custom designed small animal focal irradiation jig sarj design manufacture and dosimetric evaluation", "year": 2020, "source": "", "authors": [{"name": "jothy selvaraj", "affiliation": "australian national university"}, {"name": "graham rhall", "affiliation": "australian national university"}, {"name": "mounir ibrahim"}, {"name": "talat mahmood"}, {"name": "nigel freeman"}, {"name": "zennon gromek"}, {"name": "grant buchanan", "affiliation": "australian national university"}, {"name": "grant buchanan", "affiliation": "canberra hospital"}, {"name": "farhan syed", "affiliation": "australian national university"}, {"name": "farhan syed", "affiliation": "canberra hospital"}, {"name": "hany elsaleh", "affiliation": "australian national university"}, {"name": "hany elsaleh", "affiliation": "canberra hospital"}, {"name": "ben quah", "affiliation": "australian national university"}, {"name": "ben quah", "affiliation": "canberra hospital"}]}, {"title": "design manufacturing and dosimetric analysis of a small animal irradiation platform jig for preclinical experiments allowing tangential irradiation of subcutaneous tumours established in mice employing parallel opposed kilovoltage photon beams in a standard cabinet irradiator", "year": 2018, "source": "", "authors": [{"name": "ben quah"}, {"name": "mounir ibrahim"}, {"name": "talat mahmood"}, {"name": "zenon gromek"}, {"name": "graham rhall"}, {"name": "jothy selvaraj"}, {"name": "grant buchanan"}, {"name": "farhan syed"}, {"name": "hany elsaleh"}]}], "ANDS-Grants": []}