{"ANU": {"name": "Judy  Harrison", "link": "https://researchers.anu.edu.au/researchers/harrison-jf", "colleges": "ANU College of Law", "email": "Judith.Harrison@anu.edu.au", "phone": "041 7212306", "expertise": ["Legal Practice Lawyering And The Legal Profession", "Law And Society", "Access To Justice", "Family Law", "Litigation Adjudication And Dispute Resolution", "Legal Institutions Incl. Courts And Justice Systems", "Social Program Evaluation", "Humanities And Social Sciences Curriculum And Pedagogy Excl. Economics Business And Management"], "interest": ["Domestic and family violence law and policy, legal empowerment, cause lawyering, access to justice, law reform, law and development, lawyering and development, legal practice, clinical legal education, law and justice monitoring and evaluation."], "biography": "", "project": ["Judy is currently researching around lawyering, pro-poor development and social justice outcomes, particularly regarding models for grassroots lawyering and legal services. In 2014 Judy is based in Kununurra, Western Australia.", ""], "publication": [{"title": "feasibility study for law graduate legal practice experience with Community Legal Centres in Regional", "year": "2010", "source": "Rural and Remote Australiapresented 20 November 2010, National Rural / Regional Law and Justice Conference Warrnambool, Victoria", "authors": ["Judy  Harrison", "Judy  Harrison", "Judy  Harrison", "Judy  Harrison"]}, {"title": "Year 2 Formative Evaluation for the NSW Women", "year": "2010", "source": "s Refuge Movement: Orana Far West Women's Safe Houses Project. SydneyNSW Women's Refuge Movement.", "authors": ["Judy  Harrison", "Judy  Harrison"]}, {"title": "Year 1 Formative Evaluation for the NSW Women", "year": "2009", "source": "s Refuge Movement: Orana Far West Women's Safe Houses Project. SydneyNSW Women's Refuge Movement.", "authors": ["Judy  Harrison", "Judy  Harrison"]}, {"title": "Orana Far West Women", "year": "2006", "source": "s Safe Houses Project: Stage One Report'. SydneyNSW Women's Refuge Movement", "authors": ["Judy  Harrison", "Judy  Harrison", "Judy  Harrison"]}, {"title": "Final Report of the Fiji Law Reform Commission on the Domestic Violence Reference", "year": "2005", "source": "Volume 1: Principles and Coordinated ResponseVolume 2: Civil and Criminal Justice Response: Volume 3: Draft Domestic Violence Bill plus draft bills to amend: Criminal Code; Penal Code; Marriage Act. Fiji Law Reform Commission, Suva, Fiji", "authors": ["Judy  Harrison"]}, {"title": "Capacity of a Clinical Program to provide", "year": "2005", "source": "Minor Assistance' within the Structure of a Legal aid Commission'International Journal of Clinical Legal Education Conference 2005, Monash University, Melbourne, pp. 1-20", "authors": ["Judy  Harrison", "Judy  Harrison", "Judy  Harrison"]}, {"title": "Discussion Papers: Domestic Violence Reference. Fiji Law Reform Commission", "year": "2004", "source": "SuvaFiji", "authors": ["Judy  Harrison"]}, {"title": "Review of Domestic Violence Legislation: Australia and New Zealand, in Improving Women", "year": "2003", "source": "s SafetyOffice of the Status of Women, Department of the Prime Minister and Cabinet, Canberra", "authors": ["Judy  Harrison"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}