{"ANU": {"name": "Julie Lahn", "link": "https://researchers.anu.edu.au/researchers/lahn-j", "colleges": "College of Arts and Social Sciences", "email": "julie.lahn@anu.edu.au", "phone": "+61 2 6125 3166", "expertise": ["Policy And Administration", "Social And Cultural Anthropology", "Studies Of Aboriginal And Torres Strait Islander Society"], "interest": ["Julie Lahn is a Fellow at the Centre for Aboriginal Economic Policy Research whose research interests feature:Work and EmploymentAboriginal and Torres Strait Islander Experiences of Work in Government BureaucraciesProfessional forms of WorkAnthropology of BureaucracyGovernment Sector - Indigenous Sector interactionHer current research engages a range of issues and insights raised by First Nations peoples in encountering professional forms of employment, particularly state bureaucracies but also the professions more generally.She combines qualitative insights, statistical data and policy analysis to understand the effects of workplace cultures in retention, early exit, and obstacles to career progression whilst also engaging questions of value and contribution of First Nations peoples to contemporary workplaces."], "biography": "", "project": ["Aboriginal and Torres Strait Islander Health Workforce: Options for Future Policy Planning (2020)", "Co-Researchers: Julie Lahn (CAEPR), Stefanie Puszka (CAEPR, Menzies School of Health  Research, CDU), Paul Lawton (Menzies, CDU), Yonatan Dinku (CAEPR), Nina Nichols  (CAEPR), Francis Markham (CAEPR)", "Project Linkage and Funding: National Health Leadership Forum (NHLF)", "Obstacles to Career Progression for Aboriginal and Torres Strait Islander Peoples in the Australian Public Service (2018)", "Co-Researchers: Julie Lahn (CAEPR) and Samantha Faulkner (APS Secondee to CAEPR)", "Project Linkages: Australian Public Service Commission; Aboriginal and Torres Strait Islander Senior Executive Service Steering Committee", "Project Funding: Australian Public Service Commission, ANU College of Arts and Social Sciences", "Reciprocal Accountability and Public Value in Aboriginal Organisations (2016-2020)", "Co-Researchers: Patrick Sullivan (Nulungu Institute, University of Notre Dame), Janet Hunt (CAEPR, ANU), Julie Lahn (CAEPR, ANU), Kathryn Thorburn (Nulungu Institute, UNDA)", "Project Linkages: Kimberley Aboriginal Law and Culture Centre; Nyamba Buru Yawuru; Marra Worra Worra", "Project Funding: Australian Research Council Discovery Project (DP160102250)", "Understanding the Decisions of Aboriginal and Torres Strait Islander Public Servants to Exit the Australian Public Service (2016)", "Co-Researchers: Nic Biddle (CAEPR), Julie Lahn (CAEPR)", "Project Linkage and Funding: Australian Public Service Commission"], "publication": [{"title": "", "year": "2020", "source": "Beyond Parity in Aboriginal and Torres Strait Islander Health Workforce Planning: Achieving Equity through Needs-Based and Strengths-Based Approaches", "authors": ["Julie Lahn", "Puszka S", "Lawton P"]}, {"title": "ssessing the support of health leadership for increased Indigenous participation in the health workforce", "year": "2020", "source": "Australian Health Review, vol. 44, no. 4, pp. 505-511", "authors": ["Bourke C", "Julie Lahn", "Gibbs C"]}, {"title": "COVID-19 and the Aboriginal and Torres Strait Islander health workforce", "year": "2020", "source": "in F Markham, D Smith & F Morphy (ed.), Indigenous Australians and the Covid-19 Crisis: Perspectives on Public Policy, Centre for Aboriginal Economic Policy Research, ANU, Canberra, p. 1", "authors": ["Julie Lahn"]}, {"title": "", "year": "2019", "source": "Navigating to senior leadership in the Australian Public Service: Identifying employment barriers and enablers for Aboriginal and Torres Strait Islander peoples", "authors": ["Faulkner S", "Julie Lahn"]}, {"title": "boriginal and Torres Strait Islander People in Public Service Roles: Representation, recognition and relationships in Australian government bureaucracies", "year": "2018", "source": "Journal of Australian Political Economy, vol. 82, pp. 133-48", "authors": ["Julie Lahn", "Ganter E"]}, {"title": "Good policy needs good relationships: an expanded role for Indigenous public servants and regional offices in the future of Closing the Gap", "year": "2018", "source": "in F Markham, K Jordan & D Howard-Wagner (ed.), Closing the Gap Refresh: papering over the gaps or structural reform?, Centre for Aboriginal Economic Policy Research, ANU, Canberra, pp. 12-13", "authors": ["Julie Lahn"]}, {"title": "Being Indigenous in the Bureaucracy: Narratives of Work and Exit", "year": "2018", "source": "International Indigenous Policy Journal, vol. 9, no. 1, pp. 1-17", "authors": ["Julie Lahn"]}, {"title": "Book Review: Reluctant Representatives: Blackfella Bureaucrats Speak in Australia", "year": "2018", "source": "s North'Australian Journal of Social Issues, vol. 53, no. 1, pp. 83-84", "authors": ["Julie Lahn"]}, {"title": "Insulaires du detroit de Torres", "year": "2018", "source": "in Peter Brown and Jean-Yves Faberon (ed.), L'Australie: 101 mots pour comprendre, Centre de documentation pedagogique de la Nouvelle-Caledonie, Noumea, pp. 26-27", "authors": ["Julie Lahn"]}, {"title": "Towards Epistemological Humility in Critical Area Studies: Insights from the Torres Strait (Australia) - A Locality at the Margins of Areas", "year": "2018", "source": "in Takahiro Nakajima, Paul Pickering, Xudong Zhang (ed.), Papers from the 2018  PKU-ANU-UTokyo Winter Institute, The University of Tokyo Centre for Philosophy, Tokyo, pp. 105-120", "authors": ["Julie Lahn"]}, {"title": "Good policy needs good relationships: an expanded role for Indigenous public servants and regional offices in the future of Closing the Gap", "year": "2018", "source": ". In MarkhamF, Jordan, K, Howard-Wagner, D et al (eds), Closing the Gap Refresh: papering over the gaps or structural reform, CAEPR Topical Issue No.2/2018", "authors": ["Julie Lahn"]}, {"title": "Invited Submission to the SENATE Finance and Public Administration References Committee: Appropriateness and effectiveness of the Community Development Program", "year": "2017", "source": "", "authors": ["Julie Lahn"]}, {"title": "Indigenous Studies and Engaged Anthropology: The Collaborative Moment - [Book Review]", "year": "2016", "source": "The Asia Pacific Journal of Anthropology, vol. 17, no. 3-4, pp. 363-365pp", "authors": ["Julie Lahn"]}, {"title": "Understanding Aboriginal and Torres Strait Islander employee decisions to exit the Australian Public Service", "year": "2016", "source": ". CAEPR Working Paper  110. Canberra: Centre for Aboriginal Economic Policy ResearchAustralian National University", "authors": ["Biddle N", "Julie Lahn"]}, {"title": "Editorial:", "year": "2015", "source": "Looking back to look forward: The future of public debate of social policy in Australia'Australian Journal of Social Issues, vol. 50, no. 1, pp. 5-11", "authors": ["Hunter B", "Julie Lahn"]}, {"title": "Non-Indigenous Visions", "year": "2014", "source": "Arena Magazine, no. 132 Oct/Nov, pp. 10-11", "authors": ["Julie Lahn"]}, {"title": "", "year": "2014", "source": "Academic perspectives on The Forrest review: creating parity Topical Issue 2/2014", "authors": ["Hunt J in Klein E", "Julie Lahn", "Altman J"]}, {"title": "Kow Swamp", "year": "2014", "source": "in Claire Smith (ed.), Encyclopedia of Global Archaeology, Springer-Verlag Berlin Heidelberg, Berlin, pp. 4323-4328pp", "authors": ["Julie Lahn"]}, {"title": "boriginal Professionals: Work, Class and Culture", "year": "2013", "source": ". CAEPR Working Paper 89. Canberra: Centre for Aboriginal Economic Policy ResearchAustralian National University", "authors": ["Julie Lahn"]}, {"title": "The 1836 Lewis Collection and the Torres Strait Turtle-Shell Mask of Kulka From Loss to Re-engagement", "year": "2013", "source": "Journal of Pacific History, vol. 48, no. 4, pp. 386-408", "authors": ["Julie Lahn"]}, {"title": "Poverty, Work and Social Networks: The Role of Social Capital for Aboriginal People in Urban Australian Locales", "year": "2012", "source": "Urban Policy and Research, vol. 30, no. 3, pp. 293-308", "authors": ["Julie Lahn"]}, {"title": "boriginal professionals: Work, class and culture", "year": "2012", "source": "Theorising Indigenous Sociology: Developing Australian and International Approaches, ed. D. Howard-Wagner, D. Habibis and T. Petray, University of Sydney, Sydney Australia, pp. 1-11", "authors": ["Julie Lahn"]}, {"title": "Native title and the Torres Strait: Encompassment and recognition in the Central Islands", "year": "2007", "source": "in BR Smith and F Morphy (ed.), The Social Effects of Native Title: Recognition, Translation, Coexistence, ANU ePress, Canberra Australia, pp. 135-149", "authors": ["Julie Lahn"]}, {"title": "Finders Keepers", "year": "2007", "source": "Losers Weepers: a social history of the Kow Swamp remains. InSmith, L. (ed), Cultural Heritage: Critical Concepts in Media and Cultural Studies, Volume 1, History and Concepts, pp.361-410. London: Routledge", "authors": ["Julie Lahn"]}, {"title": "Women", "year": "2006", "source": "s gift-fish and sociality in the Torres StraitAustralia', Oceania, vol. 76, no. 3, pp. 297-309", "authors": ["Julie Lahn"]}, {"title": "Psychosocial correlates of problem gambling in Australian students", "year": "2006", "source": "Australian and New Zealand Journal of Psychiatry, vol. 40, no. 6/7, pp. 587-595", "authors": ["Delfabbro P", "Julie Lahn", "Grabosky P"]}, {"title": "It", "year": "2006", "source": "s Not What You Knowbut How You Use It: Statistical Knowledge and Adolescent Problem Gambling', Journal of Gambling Studies, vol. 22, no. 2006, pp. 179-193", "authors": ["Delfabbro P", "Julie Lahn", "Grabosky P"]}, {"title": "Classroom or cyberspace? Ethical and methodological challenges on on-line gambling surveys for adolescents", "year": "2006", "source": "Journal of Gambling Issues, vol. 16, pp. 1-15", "authors": ["Julie Lahn", "Delfabbro P", "Grabosky P"]}, {"title": "Further Evidence Concerning the Prevalence of Adolescent Gambling and Problem Gambling in Australia: A Study of the ACT", "year": "2005", "source": "International Gambling Studies, vol. 5, no. 2, pp. 209-228", "authors": ["Grabosky P", "Delfabbro P", "Julie Lahn"]}, {"title": "Gambling Among Offenders: Results From an Australian Survey", "year": "2005", "source": "International Journal of Offender Therapy and Criminology, vol. 49, no. 3, pp. 343-355", "authors": ["Julie Lahn"]}, {"title": "Living in the light", "year": "2004", "source": "and island dance: morality and temporality in Warraber Christianities'in Richard Davis (ed.), Woven Histories Dancing Lives Torres Strait Islander Identity, Culture and History, Aboriginal Studies Press, Canberra, pp. 73-89", "authors": ["Julie Lahn"]}]}, "Microsoft-Academic": [{"title": "it s not what you know but how you use it statistical knowledge and adolescent problem gambling", "year": 2006, "source": "journal of gambling studies", "authors": [{"name": "paul delfabbro", "affiliation": "university of adelaide"}, {"name": "julie lahn", "affiliation": "australian national university"}, {"name": "peter grabosky", "affiliation": "australian national university"}], "id": 15335648}, {"title": "poverty work and social networks the role of social capital for aboriginal people in urban australian locales", "year": 2012, "source": "urban policy and research", "authors": [{"name": "julie lahn", "affiliation": "australian national university"}], "id": 111677466}, {"title": "further evidence concerning the prevalence of adolescent gambling and problem gambling in australia a study of the act", "year": 2005, "source": "international gambling studies", "authors": [{"name": "paul delfabbro", "affiliation": "university of adelaide"}, {"name": "julie lahn", "affiliation": "australian national university"}, {"name": "peter grabosky", "affiliation": "australian national university"}], "id": 97556332}, {"title": "psychosocial correlates of problem gambling in australian students", "year": 2006, "source": "australian and new zealand journal of psychiatry", "authors": [{"name": "paul delfabbro", "affiliation": "university of adelaide"}, {"name": "julie lahn", "affiliation": "australian national university"}, {"name": "peter grabosky", "affiliation": "australian national university"}], "id": 179943861}, {"title": "gambling among offenders results from an australian survey", "year": 2005, "source": "international journal of offender therapy and comparative criminology", "authors": [{"name": "julie lahn", "affiliation": "australian national university"}], "id": 140831787}, {"title": "being indigenous in the bureaucracy narratives of work and exit", "year": 2018, "source": "international indigenous policy journal", "authors": [{"name": "julie lahn"}], "id": 2739297695}, {"title": "women s gift fish and sociality in the torres strait australia", "year": 2006, "source": "oceania", "authors": [{"name": "julie lahn", "affiliation": "australian national university"}], "id": 58557618}, {"title": "assessing the support of health leadership for increased indigenous participation in the health workforce", "year": 2020, "source": "australian health review", "authors": [{"name": "christopher bourke"}, {"name": "julie lahn", "affiliation": "australian national university"}, {"name": "colleen gibbs"}, {"name": "natasha lennard", "affiliation": "australian national university"}], "id": 176070599}, {"title": "understanding aboriginal and torres strait islander employee decisions to exit the australian public service", "year": 2016, "source": "", "authors": [{"name": "nicholas biddle"}, {"name": "julie lahn"}]}, {"title": "adolescent gambling in the act", "year": 2005, "source": "", "authors": [{"name": "paul delfabbro"}, {"name": "julie lahn"}, {"name": "peter grabosky"}]}], "ANDS-Grants": [{"description": "This project aims to examine the different meanings of &lsquo;public value&rsquo; and accountability in the work of Aboriginal organisations. Aboriginal organisations in the Kimberley region are funded by governments to deliver services that are of value to the public. They also reflect Aboriginal culture and identity, and represent Aboriginal interests. This also creates value for their own publics. This project investigates the tension between these two ways of understanding public value. It investigates accountability for public value creation, whether it reflects the real value of Aboriginal organisations, and whether it can be done better. The project plans to draw on anthropology and public administration theory.", "title": "Discovery Projects - Grant ID: DP160102250", "id": "664022", "key": "http://purl.org/au-research/grants/arc/DP160102250", "researchers": ["A/Prof Patrick Sullivan", "Dr Janet Hunt", "Dr Julie Lahn"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 439000, "fundingScheme": "Discovery Projects", "startDate": 2016, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:34Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP160102250", "identifiers": ["http://purl.org/au-research/grants/arc/DP160102250", "DP160102250"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/664022"}]}]}