{"ANU": {"name": "Julie Robarts", "link": "https://researchers.anu.edu.au/researchers/robarts-j", "colleges": "College of Arts and Social Sciences", "email": "Julie.Robarts@anu.edu.au", "phone": "", "expertise": ["Literary Studies", "Literature In Italian", "Language Studies", "Italian Language", "Historical Studies", "European History Excl. British Classical Greek And Roman", "Cultural Studies", "Culture Gender Sexuality"], "interest": ["I am a literary and cultural historian of early modern Italy, particularly interested in gender and authorship."], "biography": "Her current projects include a monograph on Margherita Costa, “Challenging Male Authored Poetry: Margherita Costa’s Marinist Lyrics 1639-39,” for the University of Delaware Press, Early Modern Feminisms series, and an English translation of Galileo Galilei’s Mecaniche, for the first complete English critical edition of that work. In 2017 she received an ACIS Cassamarca Foundation Scholarship to fund two months research in Florence and Rome. In 2019/20 she received a Gladys Kriebel Delmas Foundation Commonwealth grant for research in Venice, on a new project “Barbara Stozzi in the debates over the Unisoni, a philological and textual analysis,” where she identified previously unknown manuscript examples of the texts.", "project": [], "publication": [{"title": "Challenging male authored poetry: Margherita Costa’s Marinist lyrics (1638–1639). PhD Thesis. [Link to Minerva Repository", "year": "2019", "source": "University of Melbourne: https://minerva-access.unimelb.edu.au/handle/11343/225146", "authors": ["Julie Robarts"]}, {"title": "n example of ambivalent seventeenth-century Dante reception: Arcangela Tarabotti", "year": "2016", "source": "s uses of the Commedia in her Semplicita ingannata.'Renaissance Studies, vol. 31, no. 4, pp. 519-531", "authors": ["Julie Robarts"]}, {"title": "Dante", "year": "2013", "source": "s Commedia in a Venetian convent: Arcangela Tarabotti's Inferno Monacale.'Italica, vol. 90, no. 3, pp. 378-397", "authors": ["Julie Robarts"]}, {"title": "Margherita Costa: \"The Buffoons, A Ridiculous Comedy\": A Bilingual Edition. Sara E. Dïaz and Jessica Goethals, eds. and trans. The Other Voice in Early Modern Europe: The Toronto Series 63; Medieval and Renaissance Texts and Studies 535. Toronto: Iter", "year": "2019", "source": "Renaissance quarterly, vol. 72, no. 4", "authors": ["Julie Robarts"]}, {"title": "Rethinking Gaspara Stampa in the Canon of Renaissance Poetry ed. by Unn Falkeid, and Aileen A. Feng (review)", "year": "2019", "source": "Parergon, vol. 36, no. 2, pp. 209-210", "authors": ["Julie Robarts"]}, {"title": "Gender and Song in Early Modern England ed. by Leslie C. Dunn, and Katherine R. Larson (review)", "year": "2019", "source": "Parergon, vol. 36, no. 2, p. 255", "authors": ["Julie Robarts"]}, {"title": "Divas in the Convent: Nuns, Music, and Defiance in Seventeenth Century Italy", "year": "2017", "source": "Journal of Religious History, vol. 41, no. 1, pp. 130-131", "authors": ["Julie Robarts"]}, {"title": "The Ashgate Research Companion to Women and Gender in Early Modern Europe ed. by Allyson M. Poska, Jane Couchman, and Katherine A. McIver (review)", "year": "2015", "source": "Parergon, vol. 32, no. 2, pp. 346-348", "authors": ["Julie Robarts"]}, {"title": "Women, Imagination and the Search for Truth in Early Modern France (review)", "year": "2009", "source": "Parergon, vol. 26, no. 2, pp. 203-205", "authors": ["Julie Robarts"]}]}, "Microsoft-Academic": [{"title": "an example of ambivalent seventeenth century dante reception arcangela tarabotti s uses of the commedia in her semplicita ingannata", "year": 2017, "source": "renaissance studies", "authors": [{"name": "julie robarts", "affiliation": "university of melbourne"}], "id": 37879103}, {"title": "major changes ahead for dietetics education", "year": 2014, "source": "", "authors": [{"name": "julie robarts"}]}, {"title": "margherita costa the buffoons a ridiculous comedy a bilingual edition sara e diaz and jessica goethals eds and trans the other voice in early modern europe the toronto series 63 medieval and renaissance texts and studies 535 toronto iter press tempe arizona center for medieval and renaissance studies 2018 xvi 368 pp 54 95", "year": 2019, "source": "renaissance quarterly", "authors": [{"name": "julie robarts"}], "id": 193779622}, {"title": "rethinking gaspara stampa in the canon of renaissance poetry ed by unn falkeid and aileen a feng review", "year": 2019, "source": "parergon", "authors": [{"name": "julie robarts"}], "id": 118892369}, {"title": "challenging male authored poetry margherita costa s marinist lyrics 1638 1639", "year": 2019, "source": "", "authors": [{"name": "julie robarts"}]}, {"title": "craig a monson divas in the convent nuns music and defiance in seventeenth century italy chicago university of chicago press 2012 pp xxlv 272 book reviews", "year": 2017, "source": "journal of religious history", "authors": [{"name": "julie robarts"}], "id": 98651283}, {"title": "the ashgate research companion to women and gender in early modern europe ed by allyson m poska jane couchman and katherine a mciver review", "year": 2015, "source": "parergon", "authors": [{"name": "julie robarts"}], "id": 118892369}, {"title": "dante s commedia theology as poetry ed by vittorio montemaggi and matthew treherne review", "year": 2012, "source": "parergon", "authors": [{"name": "julie robarts"}], "id": 118892369}, {"title": "early modern women and transnational communities of letters review", "year": 2011, "source": "parergon", "authors": [{"name": "julie robarts"}], "id": 118892369}, {"title": "gender and song in early modern england ed by leslie c dunn and katherine r larson review", "year": 2019, "source": "parergon", "authors": [{"name": "julie robarts"}], "id": 118892369}], "ANDS-Grants": []}