{"ANU": {"name": "Jyoti Nandan", "link": "https://researchers.anu.edu.au/researchers/nandan-j", "colleges": "College of Arts and Social Sciences", "email": "jyoti.nandan@anu.edu.au", "phone": "61 2 62622189", "expertise": [], "interest": ["Literary StudiesNew Literatures in English (Indian, African, CaribbeanWomen's Writing (Victorian period; Contemporary diasporic)Cultural Studies (gender studies, post-colonial/diasporic studies, the intersection of post-colonial and gender studies)The teaching of English (in academic contexts)"], "biography": "Jyoti Nandan is an Honorary Associate Professor in the School of Literature, Languages, and Linguistics, The Australian National University.  She completed her MA in English at the University of New South Wales and her PhD in Literature at the ANU.  Her PhD thesis is an analysis of the fiction of Anita Desai using a postcolonial feminist framework.  She taught at the University of Fiji from 2006-2012 and the University of the South Pacific from 2012-2013.  From 2009 onwards, she was Associate Professor and Head of the Department of Language and Literature, School of Humanities & Arts (UniFiji).  Her current research focus is women writers of the South Asian diaspora.  She has given scholarly presentations and published widely in the area of women's writing.  She is a member of the Advisory Board and reviewer for the academic journal Indialogs - Spanish Journal of India Studies - and of the Advisory Board for the Centre for the International Study of Literatures in English.", "project": [], "publication": [{"title": "Patrick White", "year": "2020", "source": "s The Twyborn Affair: A Recognition of the Overlapping Space between Oppositions\r\n'in Igor Maver, Wolfgang Zach and Astrid Floegel (ed.), Transcending Boundaries: Migrations, Dislocations, and Literary Transformations, Stauffenburg Verlag, Germany, pp. 263-269", "authors": ["Jyoti Nandan"]}, {"title": "Identity - A Dynamic Construction in Bharati Mukherjee", "year": "2018", "source": "s Fiction'in Brigitte Johanna Glaser and Wolfgang Zach (ed.), Transgressions/Transformations: Literature and Beyond, Stauffenburg Verlag, Germany, pp. 103-110", "authors": ["Jyoti Nandan"]}, {"title": "The Woman Writer of the South Asian Diaspora: Bharati Mukherjee", "year": "2015", "source": "s Jasmine'in Michael Kenneally and Wolfgang Zach (ed.), Literatures in English: New Frontiers in Research, Stauffenburg Verlag, Germany, pp. 313-321", "authors": ["Jyoti Nandan"]}, {"title": "Difference", "year": "2014", "source": "and Beyond Difference''in Michael Kenneally, Rhona Richman-Kenneally, Wolfgang Zach (ed.), Literatures in English: New Ethical, Cultural and Transnational Perspectives, Stauffenburg Verlag, Germany, pp. 257-264", "authors": ["Jyoti Nandan"]}, {"title": "Madness as protest: Charlotte Gilman", "year": "2013", "source": "s The Yellow Wallpaper' as a subversive text'The 18th Conference Of The Australasian Association Of Writing Programs, ed. Shane Strange and Kay Rozynski, Australasian Association of Writing Programs (AAWP), Canberra Australia, pp. 1-8", "authors": ["Jyoti Nandan"]}, {"title": "Indian Nationalism", "year": "2011", "source": "s Legacy for Women'in Jacqueline Hurtley, Michael Kenneally and Wolfgang Zach (ed.), Literatures in English: Ethnic, Colonial and Cultural Encounters, Stauffenburg Verlag, Germany, pp. 139-145", "authors": ["Jyoti Nandan"]}, {"title": "Neurosis as Protest in Anita Desais Cry, the Peacock", "year": "2003", "source": "in Cynthia vanden Driesen and Satendra Nandan (ed.), Austral-Asian Encounters: From Literature and Women's Studies to Politics and Tourism, Prestige Books, New Delhi, India, pp. 282-295", "authors": ["Jyoti Nandan"]}, {"title": "The Complicity of Colonised Women in Anita Desai", "year": "2003", "source": "s Fire on the Mountain'in B Bennett et al (ed.), Resistance and reconciliation: writing in the Commonwealth, Association for Commonwealth Literature and Language Studies, Canberra, Australia, pp. 201-213", "authors": ["Jyoti Nandan"]}, {"title": "Challenge to Third World Womens Status as Other in Fasting, Feasting", "year": "2002", "source": "in Suman Bala & D.K.Pabby (ed.), The Fiction of Anita Desai, Khosla Publishing House, New Delhi, India, pp. 182-195", "authors": ["Jyoti Nandan"]}]}, "Microsoft-Academic": [{"title": "literature as equipment for living difference and beyond difference", "year": 2007, "source": "literature for our times", "authors": [{"name": "jyoti nandan"}], "id": 2764408304}, {"title": "the fiction of anita desai challenging the cultural construction of femininity", "year": 2003, "source": "", "authors": [{"name": "jyoti nandan"}]}], "ANDS-Grants": []}