{"ANU": {"name": "Karima  Laachir", "link": "https://researchers.anu.edu.au/researchers/laachir-k", "colleges": "College of Arts and Social Sciences", "email": "Karima.Laachir@anu.edu.au", "phone": "61 2 612 54982", "expertise": [], "interest": ["The Politics of Culture in the Middle East and North AfricaPopular Culture and social and political movements of mobilisationLiterature, cinema, arts and popular music of MENAArab and Muslim Diasporas in the West and anti-racist cultural politicsComparative Literature of the Global South (Arabophone, Francophone, Anglophone)Arab Intellectual Thoughts from Declonisation period to contemporary timesArabic Feminist thoughts and traditions"], "biography": "Dr Laachir has maintained a passion for literature and literary productions multilingually and comparatively (Arabophone, Francophone and Anglophone) exploring how literature can mediate through particular aesthetics/poetics alternative imaginings of social and political realities in the Middle East and North Africa and allow for other forms of theorising of the political. She is the Maghreb lead of a large European Research Council-funded project ‘Multilingual Locals and Significant Geographies: For a New Approach to World Literature’, which offers a grounded, decolonial and comparative approach to the study of multilingual literatures from the perspectives of the Global South.", "project": ["ERC funded (2.5 million euros) project on \"Multilingual Locals and Significant Geographies: For a New Approach to World Literature\"", "", "Bushfire Smoke Children's Book with Arabic/Persian/Turkish Translations"], "publication": [{"title": "Introduction: Political Society and Popular Politics in Africa", "year": "2019", "source": "Comparative Studies of South Asia, Africa and the Middle East, vol. 39, no. 1, pp. 63-67", "authors": ["Karima  Laachir", "Karima  Laachir", "Karima  Laachir"]}, {"title": "The Literary World of the North African taghriba: Novelization, Locatedness and World Literature", "year": "2019", "source": "'Journal of World Literature, Vol. 4, No. 2019, pp. 188-214", "authors": ["Karima  Laachir"]}, {"title": "Significant Geographies: In lieu of World Literature", "year": "2018", "source": "Journal of World Literature, vol. 3, no. 3, pp. 290-310", "authors": ["Karima  Laachir", "Karima  Laachir", "Karima  Laachir"]}, {"title": "Multilingual Locals and Significant Geographies: For a Ground-up and Located Approach to World Literature", "year": "2018", "source": "Modern Languages Open, vol. 1, no. 19, pp. 1-8", "authors": ["Karima  Laachir", "Karima  Laachir", "Karima  Laachir"]}, {"title": "", "year": "2016", "source": "Journal of North African Studies - Special Issue: The Aesthetics and Politics of Contemporary Cultural Production in Morocco", "authors": ["Karima  Laachir", "Karima  Laachir"]}, {"title": "State-Civil Society Dynamics in Morocco and Algeria: A Case of Divide and Rule?", "year": "2016", "source": "in Amin Saikal (ed.), Weak States, Strong Societies: Power and Authority in the New World Order, I B Tauris & Co Ltd, London and New York, pp. 114-143", "authors": ["Karima  Laachir"]}, {"title": "The aesthetics and politics of", "year": "2016", "source": "reading together' Moroccan novels in Arabic and French'Journal of North African Studies, vol. 21, no. 1, pp. 22-36", "authors": ["Karima  Laachir"]}, {"title": "Editorial [Special Issue: The Aesthetics and Politics of Contemporary Cultural Production in Morocco]", "year": "2016", "source": "Journal of North African Studies, vol. 21, no. 1, pp. 7-11", "authors": ["Karima  Laachir"]}, {"title": "Beyond Language Determinism: Multilingual Literary Traditions in Morocco", "year": "2015", "source": "5th Annual Symposium of the Consortium for Asian and African Studies (CAAS 2014), Office for International Academic Strategy, Tokyo, Japan, pp. 25-32", "authors": ["Karima  Laachir"]}, {"title": "ctivism and", "year": "2015", "source": "Liberal' Authoritarianism in Morocco and Algeria. The Middle East in London; Special Issue on North Africa11 (3)", "authors": ["Karima  Laachir"]}, {"title": "Reflection on Co-optation and Defeat in the Contemporary Moroccan Novel in Arabic: Mohammed Achaari", "year": "2013", "source": "s The Arch and The Butterfly (2011)'Journal of African Cultural Studies, vol. 25, no. 3, pp. 292-304", "authors": ["Karima  Laachir"]}, {"title": "Saudi Women Novelists and the Quest for Freedom: Raja Alem", "year": "2013", "source": "s The Doves' Necklace'in Karima Laachir & Saeed Talajooy (ed.), Resistance in Contemporary Middle Eastern Cultures: Literature, Cinema and Music, Routledge, UK, pp. 32-48", "authors": ["Karima  Laachir"]}, {"title": "Managed Reforms and Deferred Democratic Rule in Morocco and Algeria", "year": "2013", "source": "in Amin Saikal, Amitav Acharya (ed.), Democracy and Reform in the Middle East and Asia: Social Protest and Authoritarian Rule After the Arab Spring, I B Tauris & Co Ltd, London, UK and New York, USA, pp. 43-64", "authors": ["Karima  Laachir"]}, {"title": "Resistance in Contemporary Middle Eastern Cultures: Literature", "year": "2013", "source": "Cinema and MusicRoutledge, UK", "authors": ["Karima  Laachir", "Karima  Laachir", "Karima  Laachir"]}, {"title": "Journal of African Cultural Studies. Special issue: Contemporary Moroccan Cultural Production: Between Dissent and Co-optation", "year": "2013", "source": "Vol 25(3).", "authors": ["Karima  Laachir", "Karima  Laachir"]}, {"title": "Sectarian Strife and \"National Unity\" in Egyptian Films: A Case Study of Hassan and Morqos", "year": "2011", "source": "Comparative Studies of South Asia, Africa and the Middle East, vol. 31, no. 1, pp. 217-226", "authors": ["Karima  Laachir"]}, {"title": "Social Class", "year": "2009", "source": "in Daniele Albertazzi & Paul Cobley (ed.), The Media: An Introduction (Third Edition), Pearson Education, London, pp. 427-443", "authors": ["Karima  Laachir"]}, {"title": "Hospitality and the Limitations of the National", "year": "2008", "source": "in Sarah Gibson and Jennie Germann Molz (ed.), Mobilizing Hospitality: The Ethics of Social Relations in a Mobile World, Ashgate Publishing Ltd, UK, pp. 177-190", "authors": ["Karima  Laachir"]}, {"title": "French Muslims and the Politics of Laicite", "year": "2008", "source": "The Maghreb Review, vol. 33, no. 1, pp. 21-35", "authors": ["Karima  Laachir"]}, {"title": "North African Diaspora in France and Colonial Legacies", "year": "2007", "source": "in Nicholas Hewitt & Dick Geary (ed.), Diaspora(s): Movements and Cultures, Critical, Cultural and Communication Press, Nottingham, United Kingdom, pp. 85-96", "authors": ["Karima  Laachir"]}, {"title": "France", "year": "2007", "source": "s Ethnic' Minorities and the Question of Exclusion'Mediterranean Politics, vol. 12, no. 1, pp. 99-105", "authors": ["Karima  Laachir"]}, {"title": "Tassadit Imache", "year": "2007", "source": "s Une Fille sans Histoire: \"une Fille de l'histoire\"'Forum for Modern Language Studies, vol. 43, no. 3, pp. 277-289", "authors": ["Karima  Laachir"]}, {"title": "The Interplay Between History/Memory/Space in Tassadit Imache", "year": "2005", "source": "s: Presque un Frere and Le Dromadaire de Bonaparte'Modern and Contemporary France, vol. 13, no. 4, pp. 449-464", "authors": ["Karima  Laachir"]}, {"title": "Crossing the", "year": "2002", "source": "Thresholds of Intolerance': Contemporary French Society'in Stefan Herbrechter (ed.), Cultural Studies: Interdisciplinarity and Translation, Brill, Netherlands, pp. 279-295", "authors": ["Karima  Laachir"]}, {"title": "Review article", "year": "2002", "source": "Paul Gilroy: Between Camps: NationsCultures and the Allure of Race', Parallax, vol. 8, no. 3, pp. 104-108", "authors": ["Karima  Laachir"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}