{"ANU": {"name": "Katharine Balolia", "link": "https://researchers.anu.edu.au/researchers/balolia-kl", "colleges": "College of Arts and Social Sciences", "email": "Katharine.Balolia@anu.edu.au", "phone": "+61 (0) 2 6125 9298", "expertise": ["Evolutionary Biology", "Biological Adaptation", "Phylogeny And Comparative Analysis", "Life Histories"], "interest": ["Sexual dimorphism; evolution of hominin social behaviour; growth and development; cranial anatomy; 3D surface scanning; geometric morphometrics"], "biography": "", "project": ["The primary aim of my research is to understand the relationship between sexual dimorphism in the facial skeleton and socioecological variables among extant primates, and how sex-specific patterns of adulthood growth and development relate to within-group social interactions and dominance relationships and the timing of life history events observed in primate groups. A secondary focus of my research is to understand whether quantifying specific regions of the cranium and mandible using geometric morphometric techniques from data derived from 3D surface models can assist in making reliable taxonomic assessments at the genus and species level among extant primates and extinct hominins, specifically within South African Plio-Pleistocene hominin assemblages (representing Australopithecus, Paranthropus, Homo). Much of my research to date has also focused on developing new techniques, using 3D surface data, to quantify size and shape of facial traits hypothesised to vary in response to sexual selection, and to quantitatively assess sex differences in the skull for sex-identification.", ""], "publication": [{"title": "Mandibular corpus shape is a taxonomic indicator in extant hominids", "year": "2020", "source": "American Journal of Physical Anthropology, vol. 172, no. 1, pp. 25-40", "authors": ["Katharine Balolia", "Jakeman E", "Massey J"]}, {"title": "Sagittal crest formation in great apes and gibbons", "year": "2017", "source": "Journal of Anatomy, vol. 230, no. 6, pp. 820-832pp", "authors": ["Katharine Balolia", "Soligo C", "Wood B"]}, {"title": "Brief Communication: The timing of spheno-occipital fusion in hominoids", "year": "2015", "source": "American Journal of Physical Anthropology, vol. 156, no. 1, pp. 135-140", "authors": ["Katharine Balolia"]}, {"title": "Sexual dimorphism and facial growth beyond dental maturity in great apes and gibbons", "year": "2013", "source": "International Journal of Primatology, vol. 34, no. 2, pp. 361-387", "authors": ["Katharine Balolia", "Soligo C", "Lockwood C"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}