{"ANU": {"name": "Kathryn Kate Flaherty", "link": "https://researchers.anu.edu.au/researchers/flaherty-k-j", "colleges": "College of Arts and Social Sciences", "email": "kate.flaherty@anu.edu.au", "phone": "+612 6125 7024", "expertise": ["Literary Studies", "Drama Theatre And Performance Studies"], "interest": ["What in the world do plays do? What happens when imaginative plots touch our present concerns through the embodied experience of performers and audiences? With Shakespeare as an expansive test case, I investigate how plays play on the stage of public culture.  My book, Ours as we play it: Australia plays Shakespeare, examines contemporary Australian performance. Other research treats educational applications of Shakespeare since the advent of English curricula at school and university. Recent publications analyse theatrical rivalry, the agency of the touring actress, civic disorder, sectarian tension, and military commemoration through their involvement with Shakespeare in late nineteenth- and early twentieth-century Australia. One of my current projects is an international and interdisciplinary collaboration called 'Reading Riot through Shakespeare'. In it we aim for an improved understanding of riot by learning more about the affective and performative dynamics it shares with theatre in the long and colourful history of Shakespeare-associated public disturbances. The monograph on which I am currently working is Moving Women: The Touring Actress and the Politics of Modernity."], "biography": "", "project": ["Moving Women: The Touring Actress and the Politics of Modernity", "Actresses were the first class of female workers to travel on a global scale. In the nineteenth century, the scale of their experience of public life put pressure on emerging definitions of the female 'role'. However actresses are rarley regarded as major players in the political scene. This book will reveal the  ways in which touring actresses engaged through their repertoires and their writing with the politics of labour, suffrage, gender and abolition.", "", "Reading Riot through Shakespeare", "How is a riot begun? Structured? Spread? The Reading Riot through Shakespeare Project will contribute new answers to these urgent question. Its international, inter-disciplinary team of researchers are using Shakespeare-associated riots to better understand the imaginative and performative dynamics of public disorder."], "publication": [{"title": "Introduction: Shakespeare and Riot", "year": "2018", "source": "Shakespeare, vol 14, no. 3, pp. 199-204", "authors": ["Kathryn Kate Flaherty", "Lamb E"]}, {"title": "Lest we remember: Henry V and the play of commemorative rhetoric on the Australian stage", "year": "2018", "source": "in G McMullan, P Mead, A G Ferguson, K Flaherty and M Houlahan (ed.), Antipodal Shakespeare: Remembering and Forgetting in Britain, Australia and New Zealand, 1916-2016, Bloomsbury, United Kingdom, pp. 145-171", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Cathcart vs Brooke: a Touring Actress and a Trial of Public Private Identity in the Australian Colonies", "year": "2017", "source": "New Theatre Quarterly, vol. 33, no. 1, pp. 47-58", "authors": ["Kathryn Kate Flaherty"]}, {"title": "", "year": "2017", "source": "Shakespeare plays and civic strife: the Julius Caesar fiasco is nothing new", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Shakespeare and Education: the Making of an Unlikely Marriage", "year": "2017", "source": "in Jill L Levenson, Robert Ormsby (ed.), The Shakespearean World, Routledge Taylor & Francis Group, Abingdon, UK and New York, USA, pp. 361-376pp", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Damn him and the spikes\": Richard III, riot, and the formation of an Australian colonial theatre public", "year": "2016", "source": "Cogent Arts & Humanities, vol. 3, pp. 9pp", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Ours As We Play It: Australia Plays Shakespeare", "year": "2011", "source": "UWA PublishingCrawley Australia", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Hold your Fire: Utility, Play, and the Western Canon - A Response to Adam Kotsko", "year": "2016", "source": "Australian Humanities Review, no. 60, pp. 182-185", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Dead as Earth", "year": "2015", "source": ": Contemporary Topicality and Myths of Origin in King Lear and The Shadow King'in Peter Holland (ed.), Shakespeare Survey: 68 Shakespeare, Origins and Originality, Cambridge University Press, Cambridge, UK, pp. 221-233", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Habitation and Naming: Teaching local Shakespeares", "year": "2013", "source": "in Kate Flaherty, Penny Gay and L E Semler (ed.), Teaching Shakespeare Beyond the Centre: Australasian Perspectives, Palgrave Macmillan Ltd., United Kingdom, pp. 75-85", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Introduction: Learning locally", "year": "2013", "source": "in Kate Flaherty, Penny Gay and L E Semler (ed.), Teaching Shakespeare Beyond the Centre: Australasian Perspectives, Palgrave Macmillan Ltd., United Kingdom, pp. 1-6", "authors": ["Kathryn Kate Flaherty", "Gay P", "Semler L"]}, {"title": "Teaching Shakespeare Beyond the Centre: Australasian Perspectives", "year": "2013", "source": "Palgrave Macmillan Ltd.United Kingdom", "authors": ["Kathryn Kate Flaherty", "Gay P", "Semler L", "eds"]}, {"title": "Monument Shakespeare and the World Stage: Reading Australian Shakespeare after 2000", "year": "2013", "source": "in Richard Fotheringham and James Smith (ed.), Catching Australian Theatre in the 2000s, Editions Rodopi B.V., Amsterdam The Netherlands, pp. 171-192pp.", "authors": ["Kathryn Kate Flaherty"]}, {"title": "The 1863 Melbourne Shakespeare War: Barry Sullivan, Charles and Ellen Kean, and the Play of Cultural Usurpation on the Australian Stage", "year": "2012", "source": "Australian Studies, vol. 4, p. 17", "authors": ["Kathryn Kate Flaherty", "Lamb E"]}, {"title": "Review: Veronica Kelly, The Empire Actors: Stars of Australian Costume Drama 1890s-1920s. Sydney: Currency Press, 2011", "year": "2011", "source": "Association for the Study of Australian Literature Journal, vol. 11, no. 2, p. 4", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Finding local habitation: Shakespeare", "year": "2010", "source": "s Dream at play on the stage of contemporary Australia'in Christine Dymkowski and Christie Carson (ed.), Shakespeare in Stages: New Theatre Histories, Cambridge University Press, Cambridge, UK and New York, USA, pp. 229-247", "authors": ["Kathryn Kate Flaherty", "Gay P"]}, {"title": "Review: Robert Henke and Eric Nicholson, ed. Transnational Exchange in Early Modern Theatre Aldershot, Hampshire: Ashgate, 2008", "year": "2010", "source": "New Theatre Quarterly, vol. 26, no. 1, pp. 95-96", "authors": ["Kathryn Kate Flaherty"]}, {"title": "s You Like It: Re-imagining Arden in Australian Space", "year": "2009", "source": "Contemporary Theatre Review, vol. 19, no. 3, pp. 317-330", "authors": ["Kathryn Kate Flaherty"]}, {"title": "More than Common Tall: Measuring Up to the Real Rosalind in Australia", "year": "2008", "source": "2006 Annual Conference of Australasian Association for Drama, Theatre and Performance Studies, ed. Ian Maxwell, Conference Organising Committee, Sydney, p. 14", "authors": ["Kathryn Kate Flaherty"]}, {"title": "Theatre and Metatheatre in Hamlet", "year": "2005", "source": "Sydney Studies in English, vol. 31, pp. 3-20", "authors": ["Kathryn Kate Flaherty"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}