{"ANU": {"name": "Katherine Daniell", "link": "https://researchers.anu.edu.au/researchers/daniell-ka", "colleges": "College of Engineering & Computer Science", "email": "katherine.daniell@anu.edu.au", "phone": "+61 2 612 51464", "expertise": [], "interest": ["Politics and cultures of innovationMulti-level governance and inter-organisational cooperationWater and environmental policy, engineering and managementSustainability theory and practice: strategic planning, risk assessment, evaluation programsDesign and coordination of participatory processes for decision-aiding and conflict managementLeadership, futures-thinking, capacity building, education and knowledge management"], "biography": "Katherine is a Professor in the 3A Institute - the ANU's first innovation institute with the mission of building a new branch of engineering to take AI-enabled cyber-physical systems safely, responsibly and sustainably to scale - based in the School of Cybernetics, and Professor of Environmental Policy in the Fenner School of Environment and Society. Katherine's current research work focusses on collaborative approaches to policy, action and education for sustainable development. In this field, she has recently worked in Europe and the Asia-Pacific on projects related to international science and technology cooperation, water governance, risk management, sustainable urban development, politics and cultures of innovation and new technologies, and climate change adaptation. Katherine has produced over 100 academic publications including 4 books and a diverse range of book chapters, papers, reports and edited collections.In management and cooperation building roles, Katherine is President of the Australian-French Association for Research and Innovation (AFRAN) Inc. Katherine has previously worked as the Associate Dean (Education) in the ANU College of Engineering and Computer Science, and in the ANU's Centre for European Studies, Centre for Policy Innovation and the H.C. Coombs Policy Forum at the Crawford School of Public Policy on a range of Australian Public Service - ANU and international cooperation projects, including the PACE-Net and PACE-Net+ EU projects on developing Pacific-European bi-regional dialogue on science, technology and innovation. She has previously taught executive development courses for the Australian National Institute for Public Policy (ANIPP) on multi-level governance and convened Masters and undergraduate courses in the Fenner School on Environmental Policy and Participatory Resource Management. Katherine has received many awards and honours for her work including a John Monash Scholarship and being elected as a Fellow of the Peter Cullen Water and Environment Trust. She has served on the ACT (2009-2011, 2015-2016) and National (2013-2014) Selection Panels for the John Monash Scholarships. Katherine currently serves as a member of the National Committee on Water Engineering (Engineers Australia), director and board member of the Peter Cullen Water and Environment Trust, a member of the Initiatives of the Future of Great Rivers and is the Editor of the Australasian Journal of Water Resources.", "project": [], "publication": [{"title": "Water systems and disruptions: the ‘old abnormal’? Australasian Journal of Water Resources", "year": "2020", "source": "Vol. 24No. 1, pp.1-8. https://doi.org/10.1080/13241583.2020.1780732", "authors": ["Katherine Daniell"]}, {"title": "Begin with the human: Designing for safety and trustworthiness in cyber-physical systems", "year": "2020", "source": "in W F Lawless, R Mittue & D A Sofge (ed.), Human-Machine Shared Contexts, Academic Press - Elsevier, London, pp. 341-357", "authors": ["Williams E", "Tavakoli Nabavi E", "Bell G", "Katherine Daniell"]}, {"title": "Transaqua: power, political change and the transnational politics of a water megaproject", "year": "2020", "source": "International Journal of Water Resources Development. https://doi.org/10.1080/07900627.2020.174740", "authors": ["Adeniran A", "Katherine Daniell"]}, {"title": "How can agricultural extension and rural advisory services support agricultural innovation to adapt to climate change in the agriculture sector?", "year": "2020", "source": "Journal of Advancements in Agricultural Development, vol. 1, no. 1, pp. 48-62pp", "authors": ["Kamruzzaman M", "Katherine Daniell"]}, {"title": "What’s next for Australia’s water management?", "year": "2019", "source": "Australasian Journal of Water Resources, vol. 23, no. 2, pp. 69-77pp", "authors": ["Katherine Daniell"]}, {"title": "Decision Support in Participatory Contexts: The Organisational Design Dimension", "year": "2019", "source": "International Journal of Decision Support System Technology\r\n, vol. 11, no. 3, pp. 47-80", "authors": ["Mazri C Tsoukias A", "Katherine Daniell"]}, {"title": "Expertise, humility and trust: assets of water professionals under threat in uncertain, complex and ambiguous environments?", "year": "2018", "source": "Australasian Journal of Water Resources, vol. 22, no. 2, pp. 97-100", "authors": ["Katherine Daniell"]}, {"title": "When does a road become a river? Why hydrologists and water planners need to move beyond averages", "year": "2018", "source": "Australian Journal of Water Resources, vol. 22, no. 1, pp. 1-4", "authors": ["Katherine Daniell"]}, {"title": "Learning from collaborative research on sustainably managing fresh water: implications for ethical research-practice engagement", "year": "2018", "source": "Ecology and Society, vol. 23, no. 1", "authors": ["Katherine Daniell"]}, {"title": "Decision-Making for Systemic Water Risks: Insights From a Participatory Risk Assessment Process in Vietnam", "year": "2018", "source": "Earth's Future, vol. 6, no. 3, pp. 543-564", "authors": ["Wyrwoll P", "Katherine Daniell"]}, {"title": "Boundary matters: The potential of system dynamics to support sustainability?", "year": "2017", "source": "Journal of Cleaner Production, 140(1) pp. 312–323", "authors": ["Nabavi E", "Katherine Daniell"]}, {"title": "Multi-Level Governance: Conceptual Challenges and Case Studies from Australia", "year": "2017", "source": "ANU PressCanberra, Australia", "authors": ["Katherine Daniell", "Kay A", "eds"]}, {"title": "Diffusion", "year": "2017", "source": "adaptation and translation of water policy models. In: ConcaK., Weinthal, E. (eds) The Oxford Handbook of Water Politics and Policy, Oxford University Press, Oxford, pp. 594-616.", "authors": ["Katherine Daniell"]}, {"title": "What remains unwritten? Developing a critical evaluation of multi-level governance and its futures in Australian public policy and politics", "year": "2017", "source": "in Katherine A Daniell & Adrian Kay (ed.), Multi-level Governance: Conceptual Challenges and Case Studies from Australia**, ANU Press, Canberra, Australia, pp. 429-449", "authors": ["Katherine Daniell"]}, {"title": "ustralian water governance in the global context: understanding the benefits of localism", "year": "2017", "source": "Policy Studies, vol. 38, no. 5, pp. 462-481", "authors": ["Dare M", "Katherine Daniell"]}, {"title": "Politics of innovation and the spirit of justice", "year": "2017", "source": "in Lukasiewicz, A, Dovers, S, Robin, L, McKay, JM, Schilizzi, S, Graham, S (ed.), Natural Resources and Environmental Justice: Australian Perspectives, CSIRO Publishing, Clayton South, Victoria, Australia, pp. 185-203", "authors": ["Katherine Daniell", "Benham C"]}, {"title": "Improving the understanding and practice of hydrological modelling: recent insights and discussion", "year": "2017", "source": "Australian Journal of Water Resources, vol. 21, no. 1, pp. 1-2pp", "authors": ["Katherine Daniell"]}, {"title": "Rediscovering social-ecological systems: taking inspiration from actor-networks", "year": "2017", "source": "Sustainability Science, pp. 1-Sep", "authors": ["Nabavi E", "Katherine Daniell"]}, {"title": "Planning and management of water resource systems for livable cities: current issues and options", "year": "2017", "source": "Australian Journal of Water Resources, vol. 21, no. 2, pp. 51-52pp", "authors": ["Katherine Daniell"]}, {"title": "Putting transdisciplinary research into practice: A participatory approach to understanding change in coastal social-ecological systems", "year": "2016", "source": "Ocean and Coastal Management, vol. 128, pp. 29-39", "authors": ["Katherine Daniell"]}, {"title": "ustralasian water and the meaning of", "year": "2016", "source": "resources': the dawn of a new era'Australasian Journal of Water Resources, vol. 20, no. 2, pp. 89-92", "authors": ["Katherine Daniell", "Katherine Daniell"]}, {"title": "Developing and improving bi-regional dialogue between Europe and the Pacific in Science", "year": "2016", "source": "Technology and Innovation. Deliverable 3.4 for the PACE-NET Plus projectEurope", "authors": ["Katherine Daniell"]}, {"title": "brave new world - expanding the remit of the Australian Journal of Water Resources", "year": "2016", "source": "Australian Journal of Water Resources, vol. 20, no. 1, pp. 1-3", "authors": ["Katherine Daniell"]}, {"title": "Environmental information sharing: a means to support the legitimization of oyster farmers", "year": "2016", "source": "stewardship over water quality management in NSWAustralia', Natural Resources Forum, vol. 40, no. 1-2, pp. 21-36", "authors": ["Paget N", "Katherine Daniell", "Rubio Zuazo A"]}, {"title": "Bibliometric analyses on Pacific-EU scientific cooperation. Deliverable 3.1", "year": "2015", "source": "PACE-Net Plus FP7 EC projectThe Australian National University, Canberra, https://plus.pacenet.eu/system/files/documents/D3.1.%20Bibliometrics_0.pd", "authors": ["Katherine Daniell"]}, {"title": "Designing stakeholder engagement processes for river basin management: Using culture as an analytical tool", "year": "2015", "source": "Hydrology and Water Resources Symposium: The Art and Science of Water, HWRS 2015, Engineers Australia, Australia", "authors": ["Katherine Daniell"]}, {"title": "Understanding and Managing Urban Water in Transition", "year": "2015", "source": "in Grafton, R., Daniell, KA, Nauges, C, Rinaudo, J-D, Chan, NWW (ed.), Understanding and Managing Urban Water in Transition, Springer Science + Business Media, Dordrecht, Germany, pp. 1-32", "authors": ["Katherine Daniell"]}, {"title": "Policy analysis and policy analytics", "year": "2015", "source": "Annals of Operations Research, http://link.springer.com/article/10.1007%2Fs10479-015-1902-", "authors": ["Katherine Daniell", "Insua D"]}, {"title": "Understanding and Managing Urban Water in Transition", "year": "2015", "source": "Springer Science + Business MediaDordrecht, Germany", "authors": ["Katherine Daniell"]}, {"title": "River Basin Management in the Twenty-First century", "year": "2014", "source": "Understanding People and PlaceCRC Press, Taylor & Francis Group, Boca Raton, FL, USA", "authors": ["Squires V", "Milner H", "Katherine Daniell", "eds"]}, {"title": "Water governance across competing scales: coupling land and water management", "year": "2014", "source": "Journal of Hydrology, vol. 519, no. C, pp. 2367 - 2380", "authors": ["Katherine Daniell"]}, {"title": "The Role of National Culture in Shaping Public Policy: A Review of the Literature. HC Coombs Policy Forum Discussion Paper", "year": "2014", "source": "The Australian National UniversityCanberra", "authors": ["Katherine Daniell"]}, {"title": "Politics of innovation in multi-level water governance systems", "year": "2014", "source": "Journal of Hydrology, vol. 519, pp. 2415-2435", "authors": ["Katherine Daniell"]}, {"title": "Uniting Perspectives: People and Place in River Basin Management", "year": "2014", "source": "in Squires, V.R., Milner, H.M., Daniell, K.A. (ed.), River Basin Management in the Twenty-First century, Understanding People and Place, CRC Press, Taylor & Francis Group, USA, pp. 467-483", "authors": ["Katherine Daniell", "Squires V"]}, {"title": "Practical responses to water and climate policy implementation challenges", "year": "2013", "source": "Australian Journal of Water Resources, vol. 17, no. 2, pp. 111-125", "authors": ["Katherine Daniell"]}, {"title": "Improving participatory processes through collective simulation: Use of a community of practice", "year": "2013", "source": "Ecology and Society, vol. 18, no. 1, art . 36", "authors": ["Dionnet M", "Katherine Daniell"]}, {"title": "Towards process-based sustainability indicators", "year": "2013", "source": "Sustainable Engineering Society (SENG) 2013 conference: Looking back...looking forward, Engineers Australia, Barton, ACT", "authors": ["Katherine Daniell"]}, {"title": "Co-engineering and Participatory Water Management: Organisational Challenges for Water Governance", "year": "2012", "source": "Cambridge University PressCambridge, UK, 346p. http://www.cambridge.org/aus/catalogue/catalogue.asp?isbn=978110701231", "authors": ["Katherine Daniell"]}, {"title": "Proceedings of the 2nd Practical Responses to Climate Change Conference", "year": "2012", "source": "\"Water and Climate: Policy Implementation Challenges\"Engineers Australia, Barton, ACT, Australia, 672p. ISBN: 978085825911", "authors": ["Katherine Daniell"]}, {"title": "Climate Change and Freshwater in the Pacific: Adapting to global change in the freshwater and sanitation sector. Policy Brief", "year": "2012", "source": "PACE-Net FP7 EC projectEurope, http://brussels-conference-2012.pacenet.eu/sites/default/files/PACE-NET_Policy_Briefno1_Water.pd", "authors": ["White I", "Katherine Daniell", "Robinson R"]}, {"title": "Enhancing collaborative management in the Basin", "year": "2011", "source": "Chapter 26. In: ConnellD, Grafton, RQ (eds) Basin Futures: Water reform in the Murray-Darling Basin, ANU E-Press, Canberra, pp. 413-438. http://epress.anu.edu.au/wp-content/uploads/2011/08/ch26.pd", "authors": ["Katherine Daniell"]}, {"title": "Multi-level governance and the politics of innovation in the water sector", "year": "2011", "source": "Proceedings of the 34th IAHR World Congress (including the 33rd Hydrology and Water Resources Symposium): \"Balance and Uncertainty - Water in a Changing World\"27 June- 1 July 2011, Brisbane, Australia. ISBN 978-0-85825-868-", "authors": ["Katherine Daniell"]}, {"title": "Collaborative flood and drought risk management in the Upper Iskar Basin", "year": "2011", "source": "BulgariaChapter 19. In:  Grafton, RQ & Hussey, K (eds) Water Resources Planning and Management, Cambridge University Press, pp.395-420", "authors": ["Katherine Daniell"]}, {"title": "Real world decision-aiding: a case of participatory water management. In: Rios Insua", "year": "2010", "source": "D & FrenchS (eds) e-Democracy: A Group Decision and Negotiation Perspective, (Advances in Group Decision and Negotiation Series, Vol. 5, Part 2) Springer, Dordrecht. pp. 125-150", "authors": ["Katherine Daniell", "Tsoukias A"]}, {"title": "Framework for Clarifying \"Participation\" in Participatory Research to Prevent its Rejection for the Wrong Reasons", "year": "2010", "source": "Ecology and Society, vol. 15, no. 2, art. 1. http://www.ecologyandsociety.org/vol15/iss2/art1", "authors": ["Barreteau O", "Katherine Daniell"]}, {"title": "Breaking down the \"one-size-fits-all\" approach to rural and regional policy in the face of climate change: enhancing policy initiatives through multi-level governance", "year": "2010", "source": "Climate Change Adaptation and Governance WorkshopNCCARF Social, Economic and Institutional Dimensions Network, 16-19 November, UNSW Sydney,10p", "authors": ["Katherine Daniell", "Cleary J"]}, {"title": "Ethics and Participatory Water Planning", "year": "2009", "source": "Hydrology and Water Resources Symposium 2009, ed. Willgoose, Garry ; Kuczera, George, Engineers Australia, Modbury, pp. 1476-1487", "authors": ["Katherine Daniell", "Rollin D"]}, {"title": "Co-engineering participatory modelling processes for water planning and management / Co-ingénierie des processus de modélisation participative pour la planification et la gestion de l", "year": "2008", "source": "eau (2 Volumes) PhD ThesisAustralian National University, Canberra, Australia and AgroParisTech, Montpellier, France, 735p.", "authors": ["Katherine Daniell"]}, {"title": "Integration of Environmental Risk Assessment Within Estuary Management Planning for the Lower Hawkesbury-Nepean River, New South Wales", "year": "2007", "source": "NSW Coastal Conference 2007, Conference Organising Committee, Yamba, NSW, pp. 1-14", "authors": ["Coad P", "Haines P", "Katherine Daniell"]}, {"title": "Mind the sustainability gap", "year": "2007", "source": "Trends in Ecology and Evolution, vol. 22, no. 12, pp. 621-624", "authors": ["Fischer J", "Manning A", "Steffen W", "Katherine Daniell"]}, {"title": "The AUSTIME Methodology: Quantifiable Sustainability Assessment Coupled with Multi-agent Simulation", "year": "2007", "source": "in Mark Deakin, Gordon Mitchell, Peter Nijkamp, Ron Vreeker (ed.), Sustainable Urban Development: Volume 2: The Environmental Assessment Methods, Routledge, Taylor & Francis Group, London, pp. 375-411", "authors": ["Katherine Daniell", "Kingsborough A"]}, {"title": "Understanding the diversity of sustainability viewpoints. A brief sustainability literature summary for COMMOD-ADD", "year": "2007", "source": "Report prepared for COMMOD-ADD (ANR Project)Montpellier, France, 7p", "authors": ["Katherine Daniell"]}, {"title": "Summary Report: Stakeholder Workshops 2 & 3 for the Lower Hawkesbury Estuary Management Plan", "year": "2007", "source": "June 2007. Report prepared for the Hornsby Shire Council and BMT WBMNSW, Australia, 92p", "authors": ["Katherine Daniell"]}, {"title": "Investigating participatory modelling process for group decision aiding in water planning and management", "year": "2006", "source": "Group Decision and Negotiation (GDN 2006), ed. Stefan Seifert and Christof Weinhardt, Conference Organising Committee, Karlsruhe", "authors": ["Katherine Daniell", "Tsoukias A"]}, {"title": "Comment évaluer la contribution de la modélisation participative au développement durable ? Seminaire interdisciplinaire sur le développement durable", "year": "2006", "source": "30 November 2006Lille, France, 20p", "authors": ["Ferrand N", "Katherine Daniell"]}, {"title": "Participatory Modelling for Water Resources Management and Planning", "year": "2006", "source": "D3.8.2AquaStress IP, FP6, Europe, 58p", "authors": ["Katherine Daniell"]}, {"title": "Human impacts, complexity, variability and non-homogeneity: four dilemmas for the water resources modeller", "year": "2006", "source": "FRIEND (flow regimes from international experimental and network data), ed. Demuth, S, Gustard, A,  Planos, E, Scatena, F & Servat E, IAHS Press, UK, pp.10-1", "authors": ["Katherine Daniell"]}]}, "Microsoft-Academic": [{"title": "supplementary information on the lhemp process australia", "year": 2012, "source": "", "authors": [{"name": "katherine daniell"}]}], "ANDS-Grants": []}