{"ANU": {"name": "Katrina Sluis", "link": "https://researchers.anu.edu.au/researchers/sluis-k", "colleges": "College of Arts and Social Sciences", "email": "Katrina.Sluis@anu.edu.au", "phone": "", "expertise": ["Visual Cultures", "Lens Based Practice", "Electronic Media Art", "Museum Studies", "Curatorial And Related Studies", "Cultural Studies"], "interest": ["Katrina Sluis’ research is broadly concerned with the politics and aesthetics of art and photography in computational culture, its social circulation, automation and cultural value. As a curator and educator, for the past decade she has worked with museums and galleries to support digital strategy, digital programming and pedagogy. Her present work addresses the emerging paradigms of human - machine curation, as a contemporary response to the massive intensification of global image production and circulation. Funded by the SNSF, the project \"Curating Photography in the Networked Image Economy\", explores the transit of data analytics and AI imaginaries into the museum on the one hand, and discourses of aesthetic modernism and curating into the computer sciences on the other. A second strand of AHRC funded research explores the role of computational reproduction on the art object - connecting practices of art documentation to emerging discourses of adtech, digital marketing and big data."], "biography": "She serves on the Editorial Advisory Board of Photographies (Routledge) and Media:Art:Write:Now (Open Humanities Press) and the Board of Photoaccess, the ACT's centre for photography. She has served on international juries including the P3 Post-Photography Prototyping Prize in Switzerland (2019), 11th Organ Vida Festival Croatia (2020) and Brighton Photo Fringe's OPEN20 SOLO award (2020), UK.", "project": ["Funded Research Projects", "Documenting Digital Art: re-thinking histories and practices of the museum and beyond, Arts and Humanities Research Council (UK) 2019 - 2021 £371,154 Partners: University of Exeter (UK), The Photographers’ Gallery (UK), LIMA (NL), Institute Bevilacqua LaMasa Foundation (IT).", "Curating Photography in the Networked Image Economy, Swiss National Science Foundation, Dec 2018- Dec 2020, CHF 217,000. Partners: Lucerne University of Applied Art & Design (CH), The Photographers’ Gallery (UK), Fotomuseum Winterthur (CH), Foto Colectania (ES).", "Selected Publications", "K.Sluis (forthcoming) Desperately Seeking Audience: Analytics in the 21st Century Museum In: B Crone & B El Baroni Companion to Curatorial Futures Edinburgh: Edinburgh University Press", "K Sluis, M De Mutiis & J Uriate (2021) You Must Not Call It Photography If This Expression Hurts You In: A. Dekker (ed) Curating Digital Art: From Presenting and Collecting Digital Art to Networked Co-curation Amsterdam: Valiz", "K Sluis & N Wietlisbach (2021) The Flight of the Networked Image: From Screen to Museum and Back Again. In: D. Gassert et al (ed.) Eva & Franco Mattes: Dear Imaginary Audience. Switzerland: Fotomuseum Winterthur", "K.Sluis & A Sauer (2020) Unboxing Photography. In: Getrude Wagenfeld-Pleister (ed.) Adrian Sauer: Photo Works. Berlin: Kerber.", "K Sluis (2020) As We May <blink>. In: V. Perrin (ed.) Olia Lialina: Net Artist. Paris: Les Presses du Réel.", "K Sluis (2020) Read me, Write Me: On Becoming Machine Readable YET Issue 12 Switzerland", "K Sluis (2020) Photography Must Be Curated!, Still Searching: A Platform for Contemporary Photographic Discourse. Switzerland: Fotomuseum Winterthur", "K Sluis (2020) Beyond Representation? The database-driven image and the non-human spectator. In: S. Bull (ed.) A Companion to Photography. London: Wiley-Blackwell pp. 113-129 ISBN: 9781405195843", "K Sluis (2018) Andy Kassier: The Brand Called You, Foam Magazine, Issue 51", "K.Sluis (2017) Accumulate, Aggregate, Destroy: Database fever and the archival web. In: A Dekker (ed.) Lost and Living (in) Archives, Amsterdam: Valiz pp. 24-71 ISBN: 9789492095268", "K. Sluis and Z. Blas. (2017) Artist Profile: Zach Blas. Rhizome. Available at: http://rhizome.org/editorial/2017/mar/01/artist-profile-zach-blas/", "K Sluis, L Manovich et. al. (2016) The Digital Non-Visitor, Art in America, Oct 2016", "K.Sluis (2016) ‘Authorship, Collaboration, Computation? Into the Realm of Similar Images’ In: K Kuc & J Zylinska (eds) Photomediations: A ReaderLondon: Open Humanities Press. ISBN: 9781785420023", "K.Sluis, C.Paul & J. Stallabrass (2013), The (Photographic) Canon After the Internet: Katrina Sluis in conversation with Christiane Paul and Julian Stallabrass in: Aperture No. 213, Winter 2013", "K. Sluis, Photography Curation Today (and Tomorrow), Source: The Photographic Review. Winter pp. 43- 44", "D. Rubinstein & K. Sluis (2013) The Digital Image in Photographic Culture: Algorithmic Photography and the Crisis of Representation.In: M. Lister (ed.) The Photographic Image in Digital Culture, 2nd Ed. London: Routledge ISBN: 0415535298", "D. Rubinstein and K.Sluis (2013) Notes on the Margins of Metadata; concerning the undecidability of the digital image, Photographies 6 (1) pp. 151–158. ISSN 17540763", "D. Rubinstein and K.Sluis (2008) A Life More Photographic? Mapping the Networked Image, Photographies 1 (1) pp.9-28. ISSN 17540763"], "publication": []}, "Microsoft-Academic": [{"title": "a life more photographic mapping the networked image", "year": 2008, "source": "photographies", "authors": [{"name": "daniel rubinstein", "affiliation": "london south bank university"}, {"name": "katrina sluis", "affiliation": "london south bank university"}], "id": 174994954}, {"title": "concerning the undecidability of the digital image", "year": 2013, "source": "photographies", "authors": [{"name": "daniel rubinstein"}, {"name": "katrina sluis"}], "id": 174994954}, {"title": "the digital image in photographic culture algorithmic photography and the crisis of representation", "year": 2013, "source": "", "authors": [{"name": "daniel rubinstein"}, {"name": "katrina sluis"}]}, {"title": "beyond representation the database driven image and the non human spectator", "year": 2019, "source": "", "authors": [{"name": "katrina sluis"}]}, {"title": "accumulate aggregate destory database fever and the archival web", "year": 2017, "source": "", "authors": [{"name": "katrina sluis"}]}, {"title": "authorship collaboration computation into the realm of similar images", "year": 2016, "source": "", "authors": [{"name": "katrina sluis"}]}, {"title": "preparing to install the exhibition", "year": 2008, "source": "", "authors": [{"name": "katrina sluis"}]}], "ANDS-Grants": []}