{"ANU": {"name": "Katrina Grant", "link": "https://researchers.anu.edu.au/researchers/grant-k", "colleges": "College of Arts and Social Sciences", "email": "Katrina.Grant@anu.edu.au", "phone": "", "expertise": [], "interest": ["Digital art historyDigital mappingDigitisation and cultural collectionsTheatre and Festival Culture in Early Modern EuropeSet Design and Visual Culture of TheatreHistory of Gardens and Designed LandscapesHistory of Maps and CartographyBaroque ArtItalian Art and Architectural History (16th-18th centuries)Art WritingGrand Tour and artistic relations between Britain and ItalyCourt cultureStudies in place and spaceArcadias and Utopias"], "biography": "Katrina Grant is an art historian with a background in the study of Early Modern Italy. Her research focuses on gardens and the history of landscapes, as well as the visual culture of theatre and festivals, and the connections between these two areas. Her research focuses on the visual culture of landscape, the way it is shaped, represented and epxeirneced in the pre-Enlightenment era. Her current research focuses on GIS and visualisation technologies and  their potential for extending art historical research into new areas.  Her main project is Digital Cartographies of the Roman Campagna,  which is operating in collaboration with the British School at Rome.  This project brings together historical maps with modern mapping  technologies to recreate the lost landscape of the Roman Campagna, and  draw together data and research from a variety of disciplines, including  art and architectural history, social history, cultural geography and  the history of climate and ecological change. She has published on the gardens of Lucca, history of emotions and set design, and artistic relationships between Britain and Italy in the eighteenth century. She has run the popular Melbourne Art Network website as editor and webmaster since 2010 and she is a founding editor of the online open-access art history journal emaj (emajartjournal.com). She is currently in charge of Marketing and Communications for the Art Association of Australia and New Zealand (AAANZ). She also has a background in educational research, including the use of new technologies for learning and assessment and worked as a Research Fellow at the Australian Council for Educational Research for several years.", "project": ["Digital Cartographies of the Roman Campagna: art, climate change, ecology and the landscape in crisis 1600-1900.", "With Mitchell Whitelaw and Lisa Beaven", "This project examines the relationship between artistic depictions and imagery of the Roman Campagna (the flat plains of the countryside around Rome more or less coinciding with the modern region of Lazio today) and the place itself, in the context of ecology, climate change, disease and social history from 1600 to 1900. Two historic maps will be amalgamated to form the basis of this digital platform: Giacomo Filippo Ameti’s Il Lazio con le sue conspicue strade antiche (made in 1693) and Battista Cingolani della Pergola’s Topografia Geometria dell’Agro Romano (made in 1704), specifically the editions in the British School at Rome library. The digital map will allow a juxtaposition of the long artistic tradition of painting the Campagna, with the lived experience of that environment. This platform will show how artists represented and responded to the rich historical past of the Campagna on the one hand, and its shifting reality on the other.", "Skullbook", "With Sofia Samper Carro, Catherine Frieman and Terhi Nurmikko-Fuller", "Skullbook is a collaborative project between the School of Archaeology and  Anthropology and the Centre for Digital Humanities Research. at ANU. We  will produce digital and 3D-printed ‘bone libraries’ to support  students’ research. This project blends traditional analyses with new  technologies. Skullbook will produce the first digital bone library in  Australia. This project will improve access to teaching resources for  key skills-based teaching in archaeology, and offer important hands-on  training in digital humanities. The digital bone library will become a  resource for students, educators, museums, and researchers in both  Australia, and worldwide."], "publication": [{"title": "Digital cartographies of the Roman Campagna", "year": "2018", "source": "in Jennifer E. Boyle and Helen J. Burgess (ed.), The Routledge Research Companion to Digital Medieval Literature, Routledge, Oxford, UK, pp. 212-226", "authors": ["Beaven L", "Katrina Grant", "Whitelaw M"]}, {"title": "To Make Them Gaze in Wonder\": Emotional Responses to Stage Scenery in Seventeenth-Century Opera", "year": "2018", "source": "in Lisa Beaven and Angela Ndalianis (ed.), Emotion and the Seduction of the Senses, Baroque to Neo-Baroque, Medieval Institute publications, Western Michigan University, USA, pp. 79-98", "authors": ["Katrina Grant"]}, {"title": "Planting", "year": "2011", "source": "Italian Gusto' in a Gothick Country': The Influence of Filippo Juvarra on William Kent'in David R Marshall, Susan Russell and Karin Wolfe (ed.), Roma Britannica: Art Patronage and cultural exchange in Eighteenth Century Rome, The British School at Rome, London, pp. 225-240", "authors": ["Katrina Grant"]}, {"title": "Planting", "year": "2011", "source": "Italian Gusto' in a Gothick country': The influence of Filippo Juvarra on William Kent''in David R. Marshall, Susan Russell, Karin Wolfe (ed.), Roma Britannica: Art Patronage and Cultural Exchange in Eighteenth-Century Rome, British School at Rome, London, pp. 225-239", "authors": ["Katrina Grant"]}, {"title": "Teatri di Verzura : Hedge Theatres in Baroque Lucca", "year": "2007", "source": "Electronic Melbourne Art Journal, vol. 9 and 10, pp. 162-175", "authors": ["Katrina Grant"]}, {"title": "Gardens in Lucca", "year": "2007", "source": "Place - on line Ejournal, vol. 1, pp. 1-18", "authors": ["Katrina Grant"]}]}, "Microsoft-Academic": [{"title": "how does the use of role play affect the learning of year 4 children in a predominately eal class", "year": 2010, "source": "education 3 13", "authors": [{"name": "katrina grant"}, {"name": "malini mistry", "affiliation": "university of bedfordshire"}], "id": 117777504}, {"title": "the bosco parrasio as a site of pleasure and of sadness", "year": 2019, "source": "", "authors": [{"name": "katrina grant"}]}, {"title": "supporting the development of core skills for work", "year": 2014, "source": "", "authors": [{"name": "kate perkins"}, {"name": "dara ramalingam"}, {"name": "katrina grant"}]}, {"title": "skullbook vombatus ursinus wombat", "year": 2018, "source": "", "authors": [{"name": "katrina grant"}, {"name": "sofia samper carro"}, {"name": "catherine frieman"}, {"name": "terhi nurmikkofuller"}]}, {"title": "skullbook felis catus cat", "year": 2018, "source": "", "authors": [{"name": "katrina grant"}, {"name": "sofia samper carro"}, {"name": "catherine frieman"}, {"name": "terhi nurmikkofuller"}]}, {"title": "vombatus ursinus wombat skull", "year": 2018, "source": "", "authors": [{"name": "sofia samper carro"}, {"name": "katrina grant"}, {"name": "terhi nurmikkofuller"}, {"name": "catherine frieman"}, {"name": "renee dixson"}]}, {"title": "skullbook ovis aries domestic sheep", "year": 2018, "source": "", "authors": [{"name": "katrina grant"}, {"name": "sofia samper carro"}, {"name": "catherine frieman"}, {"name": "terhi nurmikkofuller"}]}, {"title": "digital cartographies of the roman campagna", "year": 2017, "source": "", "authors": [{"name": "lisa beaven"}, {"name": "katrina grant"}, {"name": "mitchell whitelaw"}]}, {"title": "to make them gaze in wonder emotional responses to stage scenery in seventeenth century opera", "year": 2018, "source": "", "authors": [{"name": "katrina grant"}]}, {"title": "the gardens of lucca", "year": 2007, "source": "", "authors": [{"name": "katrina grant"}]}], "ANDS-Grants": []}