{"ANU": {"name": "Kelly Hine", "link": "https://researchers.anu.edu.au/researchers/hine-k", "colleges": "College of Arts and Social Sciences", "email": "kelly.hine@anu.edu.au", "phone": "", "expertise": [], "interest": ["Police-Citizen InteractionsPolice Use of ForcePolice Officer Injuries and FatalitiesPolice Use of TechnologyPolicing Major CrisesPolice Misconduct and IntegrityDecision-Making ProcessesNaturalistic Decision Making"], "biography": "Kelly Hine is a Lecturer at the Australian National University.  She attained a double degree in Psychological Science, and Criminology and Criminal Justice, and holds a PhD in Criminology.  Dr Hine specialises in police-citizen interactions including the use of force by police and officer injuries.  Her research examines the decision-making process, and impediments to this process, during situations that are typically dynamic and volatile.  In addition to her research interest in frontline policing, Dr Hine's areas of expertise include police misconduct and police integrity.  Her research has implications for the way researchers examine police use of force, the way officers are educated and trained about force scenarios, and the policies and procedures that guide officers in use of force decisions.", "project": [], "publication": [{"title": "When suspects resist arrest: Prevalence, correlates, and implications for front-line policing.", "year": "2020", "source": "Police Quarterly (online)", "authors": ["Kelly Hine", "Payne J", "Piquero A"]}, {"title": "n environmental approach to police misconduct: Exploring situational prevention possibilities to understanding and preventing police misconduct.", "year": "2020", "source": "Policing: An International Journal of Police Strategies and Management", "authors": ["Kelly Hine", "Porter L", "Ransley J"]}, {"title": "Effective communication during major crises: A systematic literature review to identify best practices for police.", "year": "2020", "source": "Police Practice and Research", "authors": ["Kelly Hine", "Bragias A"]}, {"title": "The current nature of police officer fatalities in Australia and opportunities for prevention.", "year": "2020", "source": "Current Issues in Criminal Justice", "authors": ["Kelly Hine", "Carey S"]}, {"title": "Submission to the Legislative Assembly Committee on Law and Safety: Inquiry into Assaults on Members of the NSW Police Force", "year": "2020", "source": "", "authors": ["Kelly Hine"]}, {"title": "Road crashes", "year": "2020", "source": "assaults and being spat on: the dangers facing Australian police in the line of dutypp. online", "authors": ["Kelly Hine"]}, {"title": "What were they thinking? Factors influencing police recruits", "year": "2019", "source": "decisions about force'Policy and Society, 29(6), pp. 1-19pp", "authors": ["Kelly Hine", "Porter L", "Westera N"]}, {"title": "Exploring police use of force decision-making processes and impairments using a naturalistic decision-making approach", "year": "2018", "source": "Criminal Justice and Behavior, vol. 45, no. 11, pp. 1782-1801pp", "authors": ["Kelly Hine", "Porter L", "Westera N"]}, {"title": "The understated ugly side of police-citizen encounters: situation, suspect, officer, decision-making, and force predictors of officer injuries", "year": "2018", "source": "Policing and Society: an international journal of research & policy, 29(6), 587-604", "authors": ["Kelly Hine", "Porter L", "Westera N"]}, {"title": "Too much or too little? Individual and situational predictors of police force relative to suspect resistance", "year": "2018", "source": "Policing and Society: an international journal of research & policy, 28(3), 587-604", "authors": ["Kelly Hine"]}, {"title": "Police integrity in Australia", "year": "2015", "source": "in S K Ivkovic & M R Haberfeld (ed.), Measuring Police Integrity Across the World: Studies from Established Democracies and Countries in Transition, Springer Science & Business Media, New York, pp. 67-96pp", "authors": ["Porter L", "Prenzler T", "Kelly Hine"]}, {"title": "Understanding police use of force encounters in context: What encounters look like", "year": "2018", "source": "circumstances when officers get injuredand the decision factors and processes involved", "authors": ["Kelly Hine"]}, {"title": "Responding to Cybercrime: Current Trends. From the Editor-in-Chief", "year": "2018", "source": "Police Practice and Research, vol. 19, no. 6, pp. 511-514pp", "authors": ["Dilip D", "Kelly Hine", "Bussu A"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}