{"ANU": {"name": "Keren Hammerschlag", "link": "https://researchers.anu.edu.au/researchers/hammerschlag-k", "colleges": "College of Arts and Social Sciences", "email": "Keren.Hammerschlag@anu.edu.au", "phone": "", "expertise": [], "interest": ["Victorian and Edwardian Art and Visual CultureMedical HumanitiesGender and the BodyRepresentations of Race 1850-1914"], "biography": "Keren grew up in Sydney, but has lived and worked in the UK and the USA for the past 15 years. Her areas of research specialisation include Victorian and Edwardian art and visual culture, and the many intersections  and frictions among art, visual culture, medicine and science during the modern period.  She received her MA and PhD in Art History from the  Courtauld Institute of Art, University of London, before undertaking a  three-year Wellcome Postdoctoral Fellowship at  the Centre for Humanities and Health at King's College London. From  2013-2018 she taught in Art History and Women's and Gender Studies at  Georgetown University in Washington, D.C. In 2015 she published her  first monograph, 'Frederic Leighton: Death, Mortality,  Resurrection,' (Ashgate / Routlegde) which offers a macabre  counter-biography of the President of the Victorian Royal Academy,  Frederic Lord Leighton. She has also published numerous peer-review  articles on Victorian neoclassicism, medical portraiture, and  medical and artistic looking.  At Georgetown she was one of the founders of the Disability Studies  Minor and she served as the Assistant Director of the Center for Jewish  Civilization. From 2019 - 2021 she will be President of the Historians of  British Art (CAA affiliated association). Her current book project,  entitled 'The Colour of Empire: Representing Race in Victorian  Painting,' considers the ways in which Victorian painters both  reaffirmed and challenged racial boundaries through the creative use of  pigment. As part of this book she will be examining the depiction of  racial difference and racial hybridity in Victorian anatomical atlases.", "project": ["The Colour of Empire: Representing Race in Victorian Painting (book)", "The Modern Jewess: Image and Text (journal special issue)", "Victorian Anatomical Atlases & Their Many Lives (& Deaths) ('One Object' special feature, British Art Studies)"], "publication": [{"title": "Eliza Macgloghlin and Alfred Gilbert", "year": "2017", "source": "s Mors janua vitae.''Burlington Magazine, pp. 900-905", "authors": ["Keren Hammerschlag"]}, {"title": "William Orpen: Looking at Bodies in Medicine and Art", "year": "2016", "source": "British Art Journal, pp.78-9", "authors": ["Keren Hammerschlag"]}, {"title": "Frederic Leighton: Death", "year": "2015", "source": "MortalityResurrection, Ashgate Publishing Limited, Surrey, United Kingdom", "authors": ["Keren Hammerschlag"]}, {"title": "Excavating Evidence from Frederic Leighton", "year": "2014", "source": "s Paintings of the Female Nude'Victorian Studies: a journal of the humanities, arts and sciences", "authors": ["Keren Hammerschlag"]}, {"title": "Identifying the Patient in George W. Lambert", "year": "2013", "source": "s \"Chesham Street\",' Medical Humanitiespp. 20-2", "authors": ["Keren Hammerschlag"]}, {"title": "The Gentleman Artist-Surgeon in Late Victorian Group Portraiture", "year": "2013", "source": "Visual Culture in Britain, pp. 154-17", "authors": ["Keren Hammerschlag"]}, {"title": "The Deathly Sleep of Frederic Leighton", "year": "2012", "source": "s Painted Women'Women: A Cultural Review, pp. 201-21", "authors": ["Keren Hammerschlag"]}, {"title": "Nature straight from God\"? or \"galvanised mummy\"?: Resurrecting Classicism in Frederic Leighton", "year": "2010", "source": "s And the Sea Gave Up the Dead Which Were In It'Nineteenth-Century Art Worldwide", "authors": ["Keren Hammerschlag"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}