{"ANU": {"name": "Kiara Bruggeman", "link": "https://researchers.anu.edu.au/researchers/bruggeman-kaf", "colleges": "College of Engineering & Computer Science", "email": "kiara.bruggeman@anu.edu.au", "phone": "", "expertise": ["Biomaterials"], "interest": ["Biomaterials and drug delivery systems for tissue engineering/regenreative medicine, with a focus on brain tissue"], "biography": "", "project": ["Multilayer Nanofibre Delivery Vehicles", "This project aims to combine several tissue engineering materials and strategies for best effect. Hydrogels, including the nanofibrous self-assembling peptide (SAP) hydrogels used in the Laboratory of Advanced Biomaterials, and electrospun polymers are two well explored and promising tissue engineering materials that support and promote cell growth. Meanwhile, multilayered design is a promising approach to achieve controlled drug delivery in nanoparticles. This project intends to use multi-layered electrospun nanofibres, cut into short fibres and mixed into SAP hydrogels to act as nanoparticle-like drug delivery vehicles. Compared to nanoparticles, these fibres provide more structural support and locational resilience (i.e.: they stay in place, which is ideal for implanted tissue engineering material applications, unlike the systemic delivery application for which nanoparticles are often designed).", "The initial work on this project has been published in Nanoscale 9 (36), 13661-13669", "", "Reverse UV Controlled Drug Delivery", "Stimuli responsive drug delivery systems usually follow the pattern of releasing drugs in response to the stimulus (light, heat, biological signal, etc.). This project aims to do the reverse, to use UV stimulus as a trigger to stop or reduce the delivery. When nanoparticles diffuse out of our self-assembling peptide (SAP) hydrogels, the release rate increases over time, so the ability to partially halt delivery could allow us to keep the delivered dose within the therapeutic window (high enough to be effective right away, but not increasing to the point of causing toxic side effects). Achieving this relies on the demonstrated ability of our SAP hydrogels to retain the drugs we’re using within their nanofibrous structure. Drugs bound to nanoparticles diffuse out with the nanoparticles, and the UV stimulus is used to break the bond between drug and nanoparticle, allowing the drugs to attach instead to the SAP hydrogel and thereby reducing the amount of drugs leaving on the nanoparticles.", "The initial work on this project has been presented at the Australasian Society for Biomaterials and Tissue Engineering (ASBTE) 2017 Conference"], "publication": [{"title": "Peptide-Based Scaffolds Support Human Cortical Progenitor Graft Integration to Reduce Atrophy and Promote Functional Repair in a Model of Stroke", "year": "2017", "source": "Cell Reports, vol. 20, no. 8, pp. 1964-1977pp", "authors": ["Somma F", "Ting-Yi W", "Niclis J", "Kiara Bruggeman"]}, {"title": "", "year": "2017", "source": ". \"Temporally controlled growth factor delivery from a self-assembling peptide hydrogel and electrospun nanofibre composite scaffold.\" Nanoscale 9(36): 13661-13669", "authors": ["Kiara Bruggeman"]}, {"title": "Tailoring minimalist self-assembling peptides for localized viral vector gene delivery", "year": "2016", "source": "Nano Research, vol. 9, no. 3, pp. 674-684", "authors": ["Rodriguez A", "Wang T", "Kiara Bruggeman"]}, {"title": "Coassembled nanostructured bioscaffold reduces the expression of proinflammatory cytokines to induce apoptosis in epithelial cancer cells", "year": "2016", "source": "Nanomedicine: Nanotechnology, Biology, and Medicine, vol. 12, no. 5, pp. 1397-1407", "authors": ["Li R", "Pavuluri S", "Kiara Bruggeman"]}, {"title": "Characterisation of minimalist co-assembled fluorenylmethyloxycarbonyl self-assembling peptide systems for presentation of multiple bioactive peptides", "year": "2016", "source": "Acta Biomaterialia, vol. 38, pp. 11-22", "authors": ["Horgan C", "Rodriguez A", "Li R", "Kiara Bruggeman"]}, {"title": "Functionalized composite scaffolds improve the engraftment of transplanted dopaminergic progenitors in a mouse model of Parkinson", "year": "2016", "source": "s disease'Biomaterials, vol. 74, pp. 89-98", "authors": ["Wang T", "Kiara Bruggeman", "Kauhausen J"]}, {"title": "Temporally controlled release of multiple growth factors from a self-assembling peptide hydrogel", "year": "2016", "source": "Nanotechnology, vol. 27, no. 38, pp. 7pp", "authors": ["Kiara Bruggeman", "Rodriguez A", "Parish C"]}, {"title": "In vivo assessment of grafted cortical neural progenitor cells and host response to functionalized self-assembling peptide hydrogels and the implications for tissue repair", "year": "2014", "source": "Journal of Materials Chemistry B, vol. 2, no. 44, pp. 7771-7778", "authors": ["Rodriguez A", "Wang T", "Kiara Bruggeman"]}, {"title": "Characterization of the Stability and Bio-functionality of Tethered Proteins on Bioengineered Scaffolds IMPLICATIONS FOR STEM CELL BIOLOGY AND TISSUE REPAIR", "year": "2014", "source": "Journal of Biological Chemistry, vol. 289, no. 21, pp. 15044-15051", "authors": ["Wang T", "Kiara Bruggeman", "Sheean R"]}, {"title": "Extraction of DNA staining dyes from DNA using hydrophobic ionic liquids", "year": "2013", "source": "Chemical Communications, vol. 49, no. 40, pp. 4537-4539", "authors": ["Kiara Bruggeman", "Khimji I", "Doan K"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}