{"ANU": {"name": "Kim Rubenstein", "link": "https://researchers.anu.edu.au/researchers/rubenstein-k", "colleges": "ANU College of Law", "email": "Kim.Rubenstein@canberra.edu.au", "phone": "", "expertise": ["Access To Justice", "Administrative Law", "Citizenship", "International Law Excl. International Trade Law", "Comparative Law", "Constitutional Law", "Law And Legal Studies Not Elsewhere Classified"], "interest": ["In addition to her areas of expertise, Professor Rubenstein was the Inaugural Convenor of the ANU Gender institute 2011-2012 and returned to that position for the first semester of 2016. She was also appointed an ANU Public Policy Fellow in 2012."], "biography": "Kim’s research projects revolve around citizenship law and ideas about active citizenship. She is the co-series editor of Cambridge University Press series Connecting International with Public Law. http://www.cambridge.org/tr/academic/subjects/law/constitutional-and-administrative-law/series/connecting-international-law-public-law.  Her book, Australian Citizenship Law (Lawbook, 2017) is a revised second edition of her 2002 book, representing much of the spread of her interest in her research on citizenship issues, looking at the disjuncture between the exclusive legal notion and the more inclusive normative understanding of citizenship. In 2002-2003 she was based at Georgetown University Law Center, as a Fulbright Senior Scholar to work on the status of nationality in an international law context.   Kim is a graduate of the University of Melbourne and Harvard Law School. Her graduate work at Harvard was supported by the Sir Robert Menzies Scholarship to Harvard, a Fulbright postgraduate award, and a Queen Elizabeth Jubilee Trust award. Kim’s interests also encompass teaching (where she has co-authored a book on Feedback) and the broader field of education, particularly women’s education. She is currently completing a biography of Joan Montgomery OBE, former Principal of Presbyterian Ladies' College Melbourne, and an influential educator. In the practical legal sphere, Kim has made significant contributions to the jurisprudence in citizenship. She was a member of the Independent Committee appointed by the Minister for Immigration and Citizenship to review the Australian Citizenship Test in 2008 and she has appeared three times in the High Court of Australia on citizenship matters, with her work cited in Singh v Commonwealth (2004).For a fuller biography see http://www.womenaustralia.info/leaders/biogs/WLE0613b.htm", "project": ["Professor Rubenstein was a CI on an ARC Linkage Grant run by Professor Mary Crock through Sydney University called Small Mercies, Big Futures: Enhancing Law, Policy and Practice in the selection, protection and settlement of refugee children and youth. Professor Rubenstein's work in that project concentrated on the the relationship between citizenship and children.", "Professor Rubenstein was the Principal CI on the ARC Linkage Grant oral history project Trailblazing Women and the Law (see further below). Her co-CIs are based at the University of Melbourne with a partner investigator at the National Library of Australia. The linkage partners on the project were the National Library of Australia, the National Foundation of Australian Women, Australian Women Lawyers, the Federal Court and the Family Court.", "Professor Rubenstein was a series editor for the six volume CUP series Connecting International law and Public law which published the books from the workshop series run through the Centre for International and Public law. Each workshop brought together public law and international law scholars around a different theme. See further http://www.cambridge.org/gb/knowledge/series/series_display/item3937526/?site_locale=en_GB", ""], "publication": [{"title": "Submission to the PJCIS: Inquiry into the Australian Citizenship Amendment (Strengthening the Citizenship Loss Provisions) Bill 2018", "year": "2019", "source": "", "authors": ["Kim Rubenstein", "Zagor M", "Dalla-Pozza D"]}, {"title": "Democracy Sausage with Mark Kenny: Disendorsement", "year": "2019", "source": "diversityand distrust", "authors": ["Kenny M", "Grafton R", "Kim Rubenstein"]}, {"title": "The trailblazing women and the law project", "year": "2016", "source": "Alternative Law Journal, vol. 41, no. 1, pp. 13-16", "authors": ["Kim Rubenstein"]}, {"title": "live in the Telling", "year": "2016", "source": ": Trailblazing Women Lawyers' LivesLived with Law', Law Text Culture, vol. 20, no. -, pp. 66-92", "authors": ["Kim Rubenstein"]}, {"title": "In Her Own Voice: Oral (Legal) History", "year": "2016", "source": "s Insights on Gender and the Spheres of Public Law'in Kim Rubenstein, Katharine G. Young (ed.), The Public Law of Gender: From the Local to the Global, Cambridge University Press, Cambridge, United Kingdom, pp. 246-269", "authors": ["Kim Rubenstein"]}, {"title": "The Public Law of Gender: From the Local to the Global", "year": "2016", "source": "Cambridge University PressCambridge, United Kingdom", "authors": ["Kim Rubenstein", "Young K", "eds"]}, {"title": "Legal Perspectives on Security Institutions", "year": "2015", "source": "Cambridge University PressCambridge, United Kingdom", "authors": ["Nasu H", "Kim Rubenstein", "eds"]}, {"title": "Introduction: the expanded conception of security and institutions", "year": "2015", "source": "in H Nasu, K Rubenstein (ed.), Legal Perspectives on Security Institutions, Cambridge University Press, Cambridge, United Kingdom, pp. 1-24", "authors": ["Nasu H", "Kim Rubenstein"]}, {"title": "Citizens in Their in Own Right: Achieving Adequate Recognition of Children in Australia", "year": "2015", "source": "s Immigration and Citizenship Framework'in Mary Crock (ed.), Creating New Futures: Settling Children and Youth From Refugee Backgrounds, The Federation Press, Sydney, pp. 241-256", "authors": ["Kim Rubenstein", "Field J"]}, {"title": "funny course for a woman (review)", "year": "2015", "source": "Victorian Historical Journal, vol. 86, no. 2, pp. 390-393", "authors": ["Kim Rubenstein"]}, {"title": "More or less secure? Nationality questions, deportation and dual nationality", "year": "2014", "source": "in Alice Edwards, Laura van Waas (ed.), Nationality and Statelessness under International Law, Cambridge University Press, Cambridge, United Kingdom, pp. 264-291", "authors": ["Kim Rubenstein", "Lenagh-Maguire N"]}, {"title": "llegiance and Identity in a Globalised World", "year": "2014", "source": "Cambridge University PressCambridge, United Kingdom", "authors": ["Jenkins F", "Nolan M", "Kim Rubenstein", "eds"]}, {"title": "Introduction: allegiance and identity in a globalised world", "year": "2014", "source": "in Fiona Jenkins, Mark Nolan, Kim Rubenstein (ed.), Allegiance and Identity in a Globalised World, Cambridge University Press, Cambridge, United Kingdom, pp. 1-27", "authors": ["Jenkins F", "Nolan M", "Kim Rubenstein"]}, {"title": "The complicated case of Stern Hu: allegiance, identity and nationality in a globalised world", "year": "2014", "source": "in Fiona Jenkins, Mark Nolan, Kim Rubenstein (ed.), Allegiance and Identity in a Globalised World, Cambridge University Press, Cambridge, United Kingdom, pp. 453-477", "authors": ["Neoh Weng Fei J", "Rothwell D", "Kim Rubenstein"]}, {"title": "Book Review - Ronli Sifris,Reproductive Freedom, Torture and International Human Rights: Challenging the Masculinisation of Torture (Routledge 2014)", "year": "2014", "source": "Monash University Law Review, vol. 40, no. 1, pp. 236-242", "authors": ["Kim Rubenstein"]}, {"title": "Thick and Thin Citizenship as Measures of Australian Democracy", "year": "2014", "source": "in G Patmore, K Rubenstein (ed.), Law and Democracy: Contemporary Questions, ANU Press, Canberra, ACT, pp. 27-43", "authors": ["Kim Rubenstein", "Lenagh-Maguire N"]}, {"title": "Epilogue: Reflections on women and leadership through the prism of citizenship", "year": "2014", "source": "in Joy Damousi, Kim Rubenstein and Mary Tomsic (ed.), Diversity in Leadership : Australian women, past and present, ANU Press, Canberra, pp. 335-339", "authors": ["Kim Rubenstein"]}, {"title": "Law and Democracy: Contemporary Questions", "year": "2014", "source": "in G Patmore, K Rubenstein (ed.), Law and Democracy: Contemporary Questions, ANU Press, Canberra, ACT, pp. 1-7", "authors": ["Patmore G", "Kim Rubenstein"]}, {"title": "Diversity in Leadership: Australian women", "year": "2014", "source": "past and presentANU Press, Canberra", "authors": ["Damousi J", "Kim Rubenstein", "Tomsic M", "eds"]}, {"title": "Law and Democracy. Contemporary Questions", "year": "2014", "source": "ANU PressCanberra, ACT", "authors": ["Kim Rubenstein", "Patmore G", "eds"]}, {"title": "ustralia", "year": "2014", "source": "s Gendered Constitutional History and Future'in Susan H. Williams (ed.), Social Difference and Constitutionalism in Pan-Asia, Cambridge University Press, New York, USA, pp. 261-291", "authors": ["Kim Rubenstein", "Richards-Neville C"]}, {"title": "R v Pearson; Ex parte Sipka: Feminism and the Franchise", "year": "2014", "source": "in Heather Douglas, Francesca Bartlett, Trish Luker and Rosemary Hunter (ed.), Australian Feminist Judgments, Hart Publishing, Oxford and Portland, Oregon, pp. 55-68", "authors": ["Arcioni E", "Kim Rubenstein"]}, {"title": "Who We Are Not Is Not Who We Are: Australia", "year": "2013", "source": "s Exclusionary Approach to Citizenship'in Bob Douglas and Jo Wodak (ed.), Refugees and asylum seekers: Finding a better way, Australia21 Limited, Australia, pp. 88-91pp", "authors": ["Kim Rubenstein", "Field J"]}, {"title": "MICUS APPLICATIONS IN THE HIGH COURT - OBSERVATIONS ON CONTEMPORARY PRACTICE", "year": "2013", "source": "Gilbert + Tobin Constitutional Law Conference 2013, Not published, Sydney", "authors": ["Kim Rubenstein", "Moshinsky M"]}, {"title": "Conceptualising Australian Citizenship for Children: A Human Rights Perspective", "year": "2013", "source": "Australian International Law Journal, vol. 20, pp. 77-93", "authors": ["Kim Rubenstein", "Field J"]}, {"title": "Introduction: using discourse theory to untangle public and international environmental law", "year": "2012", "source": "in Brad Jessup and Kim Rubenstein (ed.), Environmental Discourses in Public and International Law, Cambridge University Press, Cambridge, UK, pp. 1-20", "authors": ["Jessup B", "Kim Rubenstein"]}, {"title": "Gender and Change Perspective on Intergovernmental Relations", "year": "2012", "source": "in Paul Kildea, Andrew Lynch and George Williams (ed.), Tomorrow's Federation: Reforming Australian Government, The Federation Press, Sydney, Australia, pp. 228-245", "authors": ["Chappell L", "Brennan D", "Kim Rubenstein"]}, {"title": "From Suffrage to Citizenship: A Republic of Equals", "year": "2011", "source": "LegalDate, vol. 23, no. 3, pp. 13-14", "authors": ["Kim Rubenstein"]}, {"title": "Book Review: Michael Kirby: Paradoxes and Principles by AJ Brown", "year": "2011", "source": "Alternative Law Journal, vol. 36, no. 3, pp. 215-217", "authors": ["Kim Rubenstein"]}, {"title": "Reading the Life Narrative of Valerie French, the First Woman to Sign the Western Australian Bar Roll", "year": "2011", "source": "in Fiona Davis, Nell Musgrove and Judith Smart (ed.), Founders, Firsts and Feminists, University of Melbourne, Melbourne, Victoria, pp. 172-187", "authors": ["Kerwin H", "Kim Rubenstein"]}, {"title": "Joint Submission by the Centre for International and Public Law and the Centre for Applied Philosophy and Public Ethics on IP Australia", "year": "2010", "source": "s Consultation PaperImplementing the TRIPS Protocol", "authors": ["Pogge T", "Rimmer M", "Kim Rubenstein"]}, {"title": "Citizenship and the boundaries of the constitution", "year": "2011", "source": "in Tom Ginsburg and Rosalind Dixon (ed.), Comparative Constitutional Law, Edward Elgar Publishing, Cheltenham, UK and Northampton, MA, USA, pp. 143-169", "authors": ["Kim Rubenstein", "Lenagh-Maguire N"]}, {"title": "Introduction: Access to essential medicines: public health and international law", "year": "2010", "source": "in Thomas Pogge, Matthew Rimmer, Kim Rubenstein (ed.), Incentives for Global Public Health: Patent law and access to essential medicines, Cambridge University Press, Cambridge, UK, pp. 1-32", "authors": ["Pogge T", "Rimmer M", "Kim Rubenstein"]}, {"title": "Incentives for Global Public Health: Patent law and access to essential medicines", "year": "2010", "source": "Cambridge University PressCambridge, UK", "authors": ["Pogge T", "Rimmer D", "Kim Rubenstein", "eds"]}, {"title": "Sanctions", "year": "2009", "source": "Accountability and Governance in a Globalised WorldCambridge University Press, Cambridge, UK", "authors": ["Farrall J", "Kim Rubenstein", "eds"]}, {"title": "Filling or falling between the cracks? Law", "year": "2009", "source": "s potential'in Jeremy Farrall and Kim Rubenstein (ed.), Sanctions, Accountability and Governance in a Globalised World, Cambridge University Press, Cambridge, UK, pp. 1-23", "authors": ["Kim Rubenstein", "Farrall J"]}, {"title": "Citizenship and identity in diverse societies", "year": "2009", "source": "Humanities Research, vol. XV, no. 1, pp. 29-44", "authors": ["Nolan M", "Kim Rubenstein"]}, {"title": "Citizenship Law", "year": "2009", "source": "in Ian Freckelton and Hugh Selby (ed.), Appealing to the Future: Michael Kirby and His Legacy, Thomson Reuters, Pyrmont, Australia, pp. 105-130", "authors": ["Kim Rubenstein", "Lenagh-Maguire N"]}, {"title": "Introduction: Australia and International Law during the Howard Years", "year": "2008", "source": "Australian Year Book of International Law, vol. 27, pp. 1-10", "authors": ["Rothwell D", "Kim Rubenstein"]}, {"title": "Nationality", "year": "2008", "source": "in Peter Cane and Joanne Conaghan (ed.), The New Oxford Companion to Law, Oxford University Press, New York, USA, pp. 819-820pp", "authors": ["Kim Rubenstein"]}, {"title": "Naturalization", "year": "2008", "source": "in Peter Cane and Joanne Conaghan (ed.), The New Oxford Companion to Law, Oxford University Press, New York, USA, pp. 824-825pp", "authors": ["Kim Rubenstein"]}, {"title": "From Supranational to Dual to Alien Citizen: Australia", "year": "2008", "source": "s Ambivalent Journey'in Simon Bronitt, Kim Rubenstein (ed.), Citizenship in a Post-National World Australia and Europe Compared, The Federation Press, Annandale, NSW, pp. 1-15", "authors": ["Kim Rubenstein"]}, {"title": "Citizenship in a Post-National World Australia and Europe Compared", "year": "2008", "source": "The Federation PressAnnandale, NSW", "authors": ["Bronitt S", "Kim Rubenstein", "eds"]}, {"title": "Loyalty and Membership: Globalization and Its Impact on Citizenship, Multiculturalism, and the Australian Community", "year": "2008", "source": "in Geoffrey Brahm Levey (ed.), Political Theory and Australian Multiculturalism, Berghahn Books, New York, pp. 171-187", "authors": ["Kim Rubenstein"]}, {"title": "From this time forward... I pledge my loyalty to Australia", "year": "2007", "source": ": loyaltycitizenship and constitutional law in Australia', in Victoria Mason (ed.), Loyalties, API Network, Perth, Western Australia, pp. 23-36", "authors": ["Kim Rubenstein"]}, {"title": "dvancing Citizenship: The Legal Armory and Its Limits", "year": "2007", "source": "The Journals of Legal Scholarships. Theoretical Inquiries in Law, vol. 8, no. 2, p. 9999", "authors": ["Kim Rubenstein"]}, {"title": "Rethinking Nationality in International Law", "year": "2007", "source": "in William J. Aceves, Charles A Hunnicutt and Chantal Thomas (ed.), Proceedings of the 101st Annual Meeting The American Society of International Law, American Society of International Law, Washington, pp. 99-102", "authors": ["Kim Rubenstein"]}, {"title": "Citizenship in an Age of Globalisation: The Cosmopolitan Citizen?", "year": "2007", "source": "in Jianfu Chen, Gonzalo Villalta Puig & Gordon Walker (ed.), Rights Protection in the Age of Global Anti-Terrorism, The Federation Press, Sydney, pp. 88-111", "authors": ["Kim Rubenstein"]}, {"title": "Chair of the Citizenship Council", "year": "2007", "source": "in Tim McCormack and Cheryl Saunders (ed.), Sir Ninian Stephen: A Tribute, Melbourne University Press (an imprint of Melbourne University Publishing), Carlton, pp. 80-97", "authors": ["Kim Rubenstein"]}, {"title": "Rethinking Nationality in International Humanitarian Law", "year": "2006", "source": "in Ustinia Dolgopol and Judith Gardam (ed.), The Challenge of Conflict: International Law Responds, Koninklijke Brill, The Netherlands, pp. 89-104", "authors": ["Kim Rubenstein"]}, {"title": "Shifting Membership: Rethinking Nationality in International Humanitarian Law", "year": "2006", "source": "in Ustinia Dolgopol and Judith Gardam (ed.), The Challenge of Conflict: International Law Responds, Koninklijke Brill, The Netherlands, p. 999", "authors": ["Kim Rubenstein"]}, {"title": "ustralian Year Book of International Law", "year": "2007", "source": "Vol 26 (issued annually)", "authors": ["Greig D", "Mathew P", "Kim Rubenstein", "eds"]}, {"title": "The Lottery of Citizenship: The Changing Significance of Birthplace, Territory and Residence to the Australian Membership Prize", "year": "2005", "source": "Law in Context, vol. 22, no. 2, p. 999", "authors": ["Kim Rubenstein"]}, {"title": "Meanings of membership: Mary Gaudron", "year": "2004", "source": "s contributions to Australian citizenship'Public Law Review, vol. 15, no. 4, pp. 305-327", "authors": ["Kim Rubenstein"]}, {"title": "The influence of Chinese immigration on citizenship", "year": "2004", "source": "in Sophie Couchman, John Fitzgerald and Paul Macgregor (ed.), After the Rush: Regulation, Participation and Chinese Communities in Australia 1860-1940, Otherland Literary Journal, Melbourne, pp. 21-34", "authors": ["Kim Rubenstein"]}, {"title": "n Unequal Membership: The Constitution", "year": "2003", "source": "s Score on Citizenship'in Laksiri Jayasuriya, David Walker and Jan Gothard (ed.), Legacies of White Australia: Race Culture and Nation, University of Western Australia Press, Crawley, Western Australia, p. 999", "authors": ["Kim Rubenstein"]}, {"title": "Globalisation and Citizenship and Nationality", "year": "2003", "source": "in Catherine Dauvergne (ed.), Jurisprudence for an Interconnected Globe, Ashgate Publishing Ltd, United Kingdom, pp. 159-186", "authors": ["Kim Rubenstein"]}, {"title": "Review Essay, The Centrality of Migration to Citizenship", "year": "2003", "source": "Citizenship Studies, vol. 7, no. 2, pp. 255-265", "authors": ["Kim Rubenstein"]}, {"title": "Can the Right to Vote be Taken Away? The Constitution, Citizenship and Voting Rights in 1902 and 2002", "year": "2003", "source": "in John Chesterman and David Phillips (ed.), Selective Democracy: Race, Gender and the Australian Vote, circa (an imprint of Melbourne Publishing Group), Armadale, pp. 100-111", "authors": ["Kim Rubenstein"]}, {"title": "ustralian Citizenship Law in Context", "year": "2002", "source": "Lawbook Co.Sydney, Australia", "authors": ["Kim Rubenstein"]}, {"title": "Citizenship, Sovereignty and Migration: Australia", "year": "2002", "source": "s Exclusive Approach to Membership of the Community'Public Law Review, vol. 13, p. 102", "authors": ["Kim Rubenstein"]}, {"title": "Citizenship", "year": "2001", "source": "in Blackshield (ed.), Oxford Companion to the High Court of Australia, Oxford University Press, Melbourne, Australia, pp. 99-101", "authors": ["Kim Rubenstein"]}, {"title": "Citizenship and the Republic Debate", "year": "2001", "source": "in Glenn Patmore and Gary Jungwirth (ed.), The Big Makeover: A New Australian Constitution: Labor Essays 2002, Pluto Press, Annandale, NSW, pp. 187-195", "authors": ["Kim Rubenstein"]}]}, "Microsoft-Academic": [{"title": "incentives for global public health patent law and access to essential medicines", "year": 2010, "source": "", "authors": [{"name": "thomas pogge", "affiliation": "yale university"}, {"name": "matthew rimmer", "affiliation": "australian national university"}, {"name": "kim rubenstein", "affiliation": "australian national university"}]}, {"title": "incentives for global public health patent law and access to essential medicines", "year": 2009, "source": "social science research network", "authors": [{"name": "thomas pogge", "affiliation": "yale university"}, {"name": "matthew rimmer", "affiliation": "queensland university of technology"}, {"name": "kim rubenstein", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "the imperative of constitutional enshrinement submission in response to interim voice co design report", "year": 2021, "source": "", "authors": [{"name": "rebecca ananianwelsh", "affiliation": "university of queensland"}, {"name": "gabrielle appleby", "affiliation": "university of new south wales"}, {"name": "elisa arcioni", "affiliation": "university of sydney"}, {"name": "narelle bedford"}, {"name": "kevin bell", "affiliation": "monash university"}, {"name": "sean brennan", "affiliation": "university of new south wales"}, {"name": "brown a j", "affiliation": "griffith university"}, {"name": "peter burdon", "affiliation": "university of adelaide"}, {"name": "anne carter", "affiliation": "deakin university"}, {"name": "melissa castan", "affiliation": "monash university"}, {"name": "jonathan crowe"}, {"name": "fergal davis", "affiliation": "king s college london"}, {"name": "megan davis", "affiliation": "university of new south wales"}, {"name": "jacob deem", "affiliation": "central queensland university"}, {"name": "rosalind dixon", "affiliation": "university of new south wales"}, {"name": "heather douglas", "affiliation": "university of melbourne"}, {"name": "andrea durbach", "affiliation": "university of new south wales"}, {"name": "kate galloway", "affiliation": "griffith university"}, {"name": "caitlin goss", "affiliation": "university of queensland"}, {"name": "ryan goss", "affiliation": "australian national university"}, {"name": "susan harris rimmer", "affiliation": "griffith university"}, {"name": "paul kildea", "affiliation": "university of new south wales"}, {"name": "danielle irelandpiper"}, {"name": "dani larkin", "affiliation": "university of new south wales"}, {"name": "ron levy", "affiliation": "australian national university"}, {"name": "dylan lino", "affiliation": "university of queensland"}, {"name": "lucas lixinski", "affiliation": "university of new south wales"}, {"name": "andrew lynch", "affiliation": "university of new south wales"}, {"name": "dan meagher", "affiliation": "deakin university"}, {"name": "justine nolan", "affiliation": "university of new south wales"}, {"name": "sarah murray", "affiliation": "university of western australia"}, {"name": "katie obryan", "affiliation": "monash university"}, {"name": "anna olijnyk", "affiliation": "university of adelaide"}, {"name": "graeme orr", "affiliation": "university of queensland"}, {"name": "alexander reilly", "affiliation": "university of adelaide"}, {"name": "sophie rigney", "affiliation": "university of new south wales"}, {"name": "kim rubenstein", "affiliation": "university of canberra"}, {"name": "kristen rundle", "affiliation": "university of melbourne"}, {"name": "ed synot", "affiliation": "university of new south wales"}, {"name": "rayner thwaites", "affiliation": "university of sydney"}, {"name": "tamara tulich", "affiliation": "university of western australia"}, {"name": "adam webster", "affiliation": "university of oxford"}, {"name": "murray wesson", "affiliation": "university of western australia"}, {"name": "george williams", "affiliation": "university of new south wales"}, {"name": "matthew zagor", "affiliation": "australian national university"}]}, {"title": "in her own voice oral legal history s insights on gender and the spheres of public law", "year": 2016, "source": "", "authors": [{"name": "kim rubenstein", "affiliation": "australian national university"}]}, {"title": "record and recollection women s active citizenship and national archives", "year": 2019, "source": "social science research network", "authors": [{"name": "kim rubenstein", "affiliation": "west virginia university college of law"}, {"name": "andrew henderson", "affiliation": "australian national university"}, {"name": "andrew henderson", "affiliation": "university of canberra"}], "id": 2751751161}, {"title": "record and recollection women s active citizenship and national archives", "year": 2019, "source": "", "authors": [{"name": "kim rubenstein", "affiliation": "australian national university"}, {"name": "andrew henderson"}]}, {"title": "citizenship and the boundaries of the constitution", "year": 2011, "source": "social science research network", "authors": [{"name": "kim rubenstein", "affiliation": "australian national university"}, {"name": "niamh lenaghmaguire", "affiliation": "australian government"}], "id": 2751751161}, {"title": "australian citizenship law in context", "year": 2002, "source": "", "authors": [{"name": "kim rubenstein", "affiliation": "australian national university"}]}, {"title": "access to essential medicines public health and international law", "year": 2010, "source": "", "authors": [{"name": "thomas pogge"}, {"name": "matthew rimmer"}, {"name": "kim rubenstein"}]}, {"title": "access to essential medicines public health and international law", "year": 2009, "source": "social science research network", "authors": [{"name": "thomas pogge", "affiliation": "yale university"}, {"name": "matthew rimmer", "affiliation": "queensland university of technology"}, {"name": "kim rubenstein", "affiliation": "west virginia university college of law"}], "id": 2751751161}], "ANDS-Grants": [{"description": "This project examines the institutional role of federal superior courts of record to ground an analysis of their responsibilities as curators of a significant national archive. It will provide principles for the administration of court records that respond to the competing legal and civic demands of contemporary Australian society.", "title": "Discovery Projects - Grant ID: DP130101954", "id": "535181", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP130101954", "researchers": ["Prof Kim Rubenstein", "Dr Ann Genovese", "Dr Trish Luker"], "status": "closed", "fundingAmount": 170500, "fundingScheme": "Discovery Projects", "startDate": 2013, "endDate": 2015, "dateTimeModified": "2015-09-14T03:01:08Z", "dateTimeCreated": "2015-04-15T05:10:20Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP130101954", "identifiers": ["http://purl.org/au-research/grants/arc/DP130101954", "DP130101954"], "subjects": ["LAW", "LAW AND LEGAL STUDIES", "archives", "citizenship", "courts"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/535181"}]}, {"description": "The trailblazing women and the law project will create, showcase and analyse the first publicly accessible, national, oral history of seven decades of Australia�s pioneer women lawyers contributing to the fields of gender, oral history, biography, law, citizenship, social networks, cultural informatics, ePublication and women�s history archiving.", "title": "Linkage Projects - Grant ID: LP120200367", "id": "533618", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP120200367", "researchers": ["Prof Kim Rubenstein", "Asst Prof Gavan McCarthy", "Ms Helen Morgan", "Mr Kevin Bradley"], "status": "closed", "fundingAmount": 206000, "fundingScheme": "Linkage Projects", "startDate": 2012, "endDate": 2015, "dateTimeModified": "2015-09-14T03:08:10Z", "dateTimeCreated": "2015-04-15T05:07:38Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP120200367", "identifiers": ["http://purl.org/au-research/grants/arc/LP120200367", "LP120200367"], "subjects": ["LAW", "LAW AND LEGAL STUDIES", "citizenship", "cultural informatics", "epublication", "gender", "oral history", "social networks", "women's history archiving"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/533618"}]}, {"description": "This project will assist refugee youth and children who ultimately become Australian citizens or permanent residents. In so doing, it will help to maximise the social benefits that flow from immigration. The project will also help to reduce the risk of social dysfunction that flows from damage sustained in childhood. By raising awareness of issues involving refugee children, the project will encourage Australians to become more responsive to children generally. Finally, the international exposure generated by the project will assist in restoring Australia's international reputation, which has been damaged by poor practices in relation to refugee youth and children in the past.", "title": "Small mercies, big futures: enhancing law, policy and practice in the selection, protection and settlement of refugee children and youth", "id": "551881", "institutions": ["University of Sydney"], "key": "http://purl.org/au-research/grants/arc/LP100200596", "researchers": ["Crock Prof Mary E", "Prof Kim Rubenstein", "Prof Louise K Newman", "Prof Sandra M Gifford", "Dr Ben Saul", "Ms Mary A Kenny"], "status": "closed", "fundingAmount": 413000, "fundingScheme": "Linkage Projects", "startDate": 2010, "endDate": 2013, "dateTimeModified": "2015-08-13T17:19:00Z", "dateTimeCreated": "2015-04-29T07:03:36Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Sydney"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP100200596", "identifiers": ["http://purl.org/au-research/grants/arc/LP100200596", "LP100200596"], "subjects": ["LAW", "LAW AND LEGAL STUDIES", "child protection", "citizenship", "human rights", "immigration", "refugee law"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/551881"}]}]}