{"ANU": {"name": "Kristen S. Barratt", "link": "https://researchers.anu.edu.au/researchers/barratt-ks", "colleges": "College of Health & Medicine", "email": "kristen.barratt@anu.edu.au", "phone": "", "expertise": ["Developmental Genetics Incl. Sex Determination", "Genetics"], "interest": [], "biography": "Since 2018, Dr Barratt has continued her research as a Postdoctoral Fellow at the John Curtin School of Medical Research (ANU), investigating the underlying molecular mechanisms of HPE and Heterotaxy. Concurrently, Dr Barratt participates in extensive teaching, educating students from a high school level all the way through to post-graduate students, and advocates for Women and Girls in STEMM fields.", "project": ["Understanding the embryological causes of congenital heart defects: a novel link between definitive endoderm formation and congenital heart disease", "An Australian baby is born with a congenital heart defect (CHD) every 3 hours, making it the most common birth defect in new-borns and a leading cause of death in infants, with an average of 4 affected babies dying each week. Despite this high rate, known genetic changes only explain 20% of CHDs, leaving 80% with an unknown cause. It is difficult to make decisions about current and future treatments for the affected child and impossible to advise parents about the risk for future children without knowing the precise genetic changes that can lead to CHDs.", "To understand how CHDs arise we need to study the very early stages of pregnancy, but this is difficult to do in humans. Instead, we can study the way that genetic changes in mouse embryos alter heart formation. The heart is one of the first organs to form as the embryo develops, and correct heart formation requires many precise cellular steps that need to occur at specific times. Via this project we will explain for the first time how errors in the embryo, before heart development has even begun, can lead to CHDs. Because each step of embryo development is connected to the next, incorrect formation of a cell layer (called the definitive endoderm) early in embryo development has severe downstream consequences for the cells that later form the heart. Data from this study will lead to a deeper understanding of the events and genetic changes that lead to CHDs early in embryo development, and will in turn lead to improved prediction, diagnosis and treatment.", "", "Investigating new aspects of ZIC2-associated Holoprosencephaly", "Holoprosencephaly (HPE) occurs due to incomplete division of the developing forebrain along the embryonic midline, resulting in a failure to form two distinct cerebral hemispheres. Affecting 1/250 human conceptuses, HPE is a leading cause of pre- and post-natal morbidity and mortality. Currently, pathogenic mutations in the coding region of fifteen genes have been implicated in both classic and middle interhemispheric variants of HPE. Mutation of ZIC2 accounts for 9% of solved cases, making it the second most common causative HPE gene after SHH. Nevertheless, multiple aspects of ZIC2-associated HPE remain unexplored, including the mechanisms that underlie HPE-associated co-morbidities, and how Zic2 expression is regulated in the gastrulating embryo.", "Numerous Zic2-associated HPE probands exhibit cardiac anomalies, yet these defects are often viewed as secondary to the HPE phenotype and their relationship to ZIC2 function has not been investigated. Characterisation of the cardiac defects (that occur alongside HPE in a mouse model harbouring the Zic2 severe loss-of-function kumba allele) shows they arise due to a loss of asymmetric gene expression at the early-somite node and in the left lateral plate mesoderm. Furthermore, ZIC2 acts upstream of, and is required for, the correct formation and function of cilia in the mid-gastrula node. This is the same region of the murine embryo in which ZIC2 is required during normal development to prevent HPE, suggesting a common tissue of origin for the observed brain and cardiac defects, and that ZIC2 mutation is a risk factor for the development of left-right defects.", "Analysis by human geneticists identified single nucleotide variants within the ZIC2 3’UTR of otherwise unsolved HPE probands, potentially pinpointing a genomic region essential for the control of ZIC2 expression during gastrulation. Characterisation of the ZIC2 3’UTR in a signalling environment reminiscent of the gastrula node indicates it contains a regulatory element that functions as a transcriptional repressor, as well as multiple transcript stability elements that regulate ZIC2 half-life. This element warrants further in vivo assessment of the mechanism by which it controls ZIC2 expression and evaluation of the pathogenicity of the known SNVs."], "publication": [{"title": "Identification of reference genes suitable for RT-qPCR studies of murine gastrulation and patterning", "year": "2018", "source": "Mammalian Genome, vol. 29, no. 9, pp. 656-662pp", "authors": ["Kristen S. Barratt", "Diamand K", "Arkell R"]}, {"title": "Overview of Rodent Zic Genes", "year": "2018", "source": "in J Aruga (ed.), Zic family, Springer, Singapore, pp. 179-207", "authors": ["Diamand K", "Kristen S. Barratt", "Arkell R"]}, {"title": "ZIC2 in Holoprosencephaly", "year": "2018", "source": "Advances in Experimental Medicine and Biology, vol. 1046, pp. 269-299pp", "authors": ["Kristen S. Barratt", "Arkell R"]}, {"title": "Elevated canonical Wnt signalling disrupts development of the embryonic midline and may underlie cases of ZIC3-associated Heterotaxy", "year": "2017", "source": "18th International Congress of Developmental Biology, ISDB 2017, ed. David Wilkinson, Elsevier Science, Netherlands, pp. S28-S29", "authors": ["Diamand K", "Alzahrani A", "Ahmed J", "Kristen S. Barratt"]}, {"title": "The Zic2 Gene Directs the Formation and Function of Node Cilia to Control Cardiac Situs", "year": "2014", "source": "Genesis, vol. 52, no. 6, pp. 626-635", "authors": ["Kristen S. Barratt", "Glanville-Jones H", "Arkell R"]}, {"title": "murine Zic3 transcript with a premature termination codon evades nonsense-mediated decay during axis formation", "year": "2013", "source": "Disease Models and Mechanisms, vol. 6, no. 3, pp. 755-767", "authors": ["Ahmed J", "Ali R", "Kristen S. Barratt"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}