{"ANU": {"name": "Kylie Message", "link": "https://researchers.anu.edu.au/researchers/message-kr", "colleges": "College of Arts and Social Sciences", "email": "kylie.message@anu.edu.au", "phone": "", "expertise": [], "interest": ["Kylie Message is Professor of Public Humanities. Her work focuses specifically on the relationships between cultural organizations, citizenship, government, and political reform movements. Working with interdisciplinary methodologies drawn from History, Anthropology, Sociology and Cultural and Museum Studies, her research investigates the role that museums and other forms of public culture play as sites of political exchange. She has written extensively about the ways that museums across the world have conducted contemporary collecting and been involved in and identified as sites of activism and controversy. Her focus on institutional ethnographies and organizational histories has led to new ways of addressing relationships between racism and contested histories in organizational and public/community settings, and her documentation of curatorial and social activism within multicultural policy climates since the 1970s has made significant contributions to the way various participants and stakeholders understand the political history and impact of culture.PublicationsKylie's books include Collecting Activism, Archiving Occupy Wall Street (Routledge 2019), The Disobedient Museum: Writing at the Edge (Routledge 2018), Museums and Racism (Routledge 2018), Museums and Social Activism: Engaged Protest (Routledge 2014), New Museums and the Making of Culture (Berg 2006), and Museum Theory: An Expanded Field (edited, with Andrea Witcomb, Wiley Blackwell 2015, reprinted 2020). Professor Message is founding general series editor of the Routledge book series, 'Museums in Focus', which challenges authors and readers to radically rethink the relationships between cultural and intellectual dissent and crisis and debates about museums, politics and the broader public sphere. Previously, she was founding joint chief co-editor of Museum Worlds: Advances in Research (Berghahn), Museum and Society managing editor, Humanities Research co-editor, editorial board member for the International Journal of Heritage Studies, and exhibition reviews editor for Australian Historial Studies.Areas of expertiseMuseum StudiesCultural Studies - Multicultural, Intercultural and Cross-cultural Studies; Globalisation and Culture; Cultural Theory; Postcolonial Studies.Historical Studies  - North American History; European History (excl. British, Classical Greek and Roman);  Australian History (excl. Aboriginal and Torres Strait Islander History).Studies in Human Society - Race and Ethnic Relations; Social Change; Anthropology of Development; Citizenship; Comparative Government and Politics; International Relations; Arts and Cultural Policy.  Smithsonian Institution      Fellowship, National Museum of the American Indian and the National Museum      of American History (Division of Political History), Washington DC, USA,      2010Australian Research Council      Special Research Centre Fellowship at the Centre for Cross-Cultural      Research, ANU, 2005-6Postdoctoral Research      Fellowship on Four South Pacific Museums Australian Research      Council Discovery Project, Department of English with Cultural Studies,      University of Melbourne, 2004-6."], "biography": "Professor Message is Associate Dean Research for the ANU College of Arts and Social Sciences, Deputy Chair of the University Research Committee, and Senior Fellow in the Humanities Research Centre. Previously, she was Interim Director of the Research School of Humanities and the Arts 2015-16, and Head of the ANU School of Archaeology and Anthropology 2013-15. From 2014-16, she was an elected member of the Australian Research Council College of Experts Humanities and Creative Arts Panel. Kylie was CASS Associate Dean Research Training from 2010-12, and Museums and Collections program convenor from 2006-10. Prior to being appointed to ANU in 2005 as ARC Postdoctoral Fellow in the Centre for Cross-Cultural Research, Kylie was Postdoctoral Fellow at the University of Melbourne (2004-05), and lecturer in the School of English, Film and Theatre, Victoria University of Wellington, New Zealand (2000-03). Kylie’s PhD was awarded by the University of Melbourne (School of Fine Arts, Classical Studies and Archaeology) in 2003.", "project": [], "publication": [{"title": "Museum Theory", "year": "2020", "source": "John Wiley & Sons Ltd.United Kingdom", "authors": ["Witcomb A", "Kylie Message", "eds"]}, {"title": "Contentious Politics and Museums as Contact Zones", "year": "2020", "source": "in Andrea Witcomb & Kylie Message (ed.), Museum Theory (2020), John Wiley & Sons Ltd., United Kingdom, pp. 253-281", "authors": ["Kylie Message"]}, {"title": "Introduction: Museum Theory: An Expanded Field", "year": "2020", "source": "in Andrea Witcomb & Kylie Message (ed.), Museum Theory (2020), John Wiley & Sons Ltd., United Kingdom, pp. xxvii-lv", "authors": ["Kylie Message", "Witcomb A"]}, {"title": "Collecting Activism", "year": "2019", "source": "Archiving Occupy Wall StreetRoutledge, Oxford and New York", "authors": ["Kylie Message"]}, {"title": "rchiving activism and/as activist PR: Occupy Wall Street and the politics of influence", "year": "2019", "source": "in Ana Adi (ed.), Protest Public Relations: Communicating Dissent and Activism, Routledge, New York, pp. 170-184", "authors": ["Kylie Message"]}, {"title": "Contested Sites of Identity and the Cult of the New", "year": "2019", "source": "in Rhiannon Mason (ed.), Museum Studies, Routledge, United Kingdom, pp. 46-81", "authors": ["Kylie Message"]}, {"title": "We the People", "year": "2019", "source": "in Rhiannon Mason (ed.), Museum Studies, Routledge, United Kingdom, pp. 326-367", "authors": ["Kylie Message"]}, {"title": "Museums and the Dilemma of Engaging with the Activist Spectrum", "year": "2019", "source": "Museum Worlds: Advances in Research, vol. 7, pp. 292-300", "authors": ["Kylie Message", "Foster E"]}, {"title": "What the Museum Does Not Say: Museums and Contested Histories", "year": "2019", "source": "Roots and Routes, vol. 4, no. 30", "authors": ["Foster E", "Kylie Message"]}, {"title": "Museums and Racism", "year": "2018", "source": "RoutledgeOxon", "authors": ["Kylie Message"]}, {"title": "The Disobedient Museum: Writing at the Edge", "year": "2018", "source": "Routledge Taylor & Francis GroupOxford and New York", "authors": ["Kylie Message"]}, {"title": "Making History in Contested Times", "year": "2018", "source": "Museum International, vol. 70, no. 3-4, pp. 136-145", "authors": ["Kylie Message"]}, {"title": "Book review: Object Stories: Artifacts and Archaeologists", "year": "2017", "source": "Museum Worlds: Advances in Research, vol. 5, pp. 250-255", "authors": ["Kylie Message"]}, {"title": "", "year": "2016", "source": "Museum Worlds: Advances in Research", "authors": ["Dudley S", "Kylie Message", "Mccarthy C", "eds"]}, {"title": "Contentious Politics and Museums as Contact Zones", "year": "2015", "source": "in Andrea Witcomb & Kylie Message (ed.), Museum Theory, John Wiley & Sons Ltd., Chichester, United Kingdom, pp. 253-282", "authors": ["Kylie Message"]}, {"title": "", "year": "2015", "source": "Museum Worlds: Advances in Research", "authors": ["Dudley S", "Kylie Message", "eds"]}, {"title": "Introduction: Museum Theory An Expanded Field", "year": "2015", "source": "in Andrea Witcomb & Kylie Message (ed.), Museum Theory, John Wiley & Sons Ltd., Chichester, United Kingdom, pp. xxxv-xiii", "authors": ["Kylie Message", "Witcomb A"]}, {"title": "Museum Theory", "year": "2015", "source": "John Wiley & Sons Ltd.United Kingdom", "authors": ["Kylie Message", "Witcomb A", "eds"]}, {"title": "Museums and social activism: engaged protest", "year": "2014", "source": "RoutledgeOxon UK", "authors": ["Kylie Message"]}, {"title": "Returning to Racism : new challenges for museums and citizenship", "year": "2014", "source": "in Laurence Gourievidis (ed.), Museums and Migration : History, Memory and Politics, Routledge Taylor & Francis Group, Abingdon and New York, pp. 44-66", "authors": ["Kylie Message"]}, {"title": "the museum and the culture of citizenship - The case of the national museum of Australia", "year": "2014", "source": "in George D Bikos, Asimina Caniaris (ed.), Museology Cultural Management and Education, Grigoris Books, Athens, pp. 231-250", "authors": ["Kylie Message"]}, {"title": "", "year": "2014", "source": "Museum Worlds: Advances in Research", "authors": ["Dudley S", "Kylie Message", "eds"]}, {"title": "Review of William S. Walker", "year": "2014", "source": "A Living Exhibition: The Smithsonian and the Transformation of the Universal MuseumMuseum Anthropology.vol. 37, no. 2, pp. 160-171", "authors": ["Kylie Message"]}, {"title": "Slipping through the cracks: museums and social inclusion in Australian cultural policy development 2007-2010", "year": "2013", "source": "International Journal of Cultural Policy,  vol. 19, no. 2, pp. 201-221", "authors": ["Kylie Message"]}, {"title": "Museum Worlds: Advances in Research", "year": "2013", "source": "vol. 1. OxfordUK: Berghahn Books", "authors": ["Kylie Message", "Dudley S", "eds"]}, {"title": "", "year": "2013", "source": "Museum Worlds: Advances in Research", "authors": ["Dudley S", "Kylie Message", "eds"]}, {"title": "Exceeding the limits of representation? Petitioning for constitutional change at the Museum of Australian Democracy", "year": "2012", "source": "in R. Sandell and E. Nightingale (ed.), Museums, Equality, and Social Justice, Routledge, Taylor & Francis Group, Oxon, United Kingdom, pp. 227-242", "authors": ["Kylie Message"]}, {"title": "Contemporary cause-based collecting, controversy and curatorial activism: At the National Museum of American History from the 1960s", "year": "2012", "source": "in Johan Hegardt (ed.), The Museum Beyond the Nation, Historiska, Stockholm Sweden, pp. 139-157", "authors": ["Kylie Message"]}, {"title": "Commemorating Civil Rights and Reform Movements at the National Museum of American History", "year": "2011", "source": "in Laurajane Smith, Geoffrey Cubitt, Ross Wilson and Kalliopi Fouseki (ed.), Representing Enslavement and Abolition in Museums: Ambiguous Engagements, Routledge, New York, pp. 304-323", "authors": ["Kylie Message"]}, {"title": "People, places and attachments at the National Museum of Australia", "year": "2011", "source": "History Australia, vol. 8, no. 3, pp. 195-199", "authors": ["Kylie Message"]}, {"title": "Journal of Australian Studies special issue: Media and Materiality", "year": "2011", "source": "vol. 35no. 4", "authors": ["Kylie Message", "Frederick U", "eds"]}, {"title": "Media and materiality: extending the boundaries of object research", "year": "2011", "source": "Journal of Australian Studies, vol. 35, no. 4, pp. 423-432", "authors": ["Kylie Message", "Frederick U"]}, {"title": "Museums and the Political World: Civil Rights and Reform Movements at the National Museum of American History", "year": "2011", "source": "2011 INTERCOM (ICOM International Committee of Management) conference, Copenhagen, Denmark: http://www.kulturarv.dk/fileadmin/user_upload/kulturarv/museer/\r\ndokumenter/intercom_2011/K._Message_Intercom_presentation_2011.pdf", "authors": ["Kylie Message"]}, {"title": "The Museum of Australian Democracy: A house for the people?", "year": "2010", "source": "Australian Historical Studies, vol. 41, no. 3, pp. 385-395", "authors": ["Kylie Message"]}, {"title": "Black Hole", "year": "2010", "source": "Body Without Organs', Stratification', Territory', in Adrian Parr (ed.),  The Deleuze Dictionary Revised Edition,  Edinburgh University Press, Edinburgh, pp. 33-35, 37-39, 272-74, 280-82", "authors": ["Kylie Message", ""]}, {"title": "Heritage and the politics of administrative culture", "year": "2010", "source": "(Review article of The Heritage-scape: UNESCOWorld Heritage, and Tourism, Michael A. Di Giovine, Lanham, MD: Lexington Books, 2009, and Valuing Historic Environments, Lisanne Gibson and John Pendlebury, eds., Surrey, England: Ashgate, 2009), Curator: The Museum Journal,  vol. 53, no. 3, pp. 379-83.", "authors": ["Kylie Message", ""]}, {"title": "The evolution of the museum: Interview with Kylie Message", "year": "2010", "source": "UK Courier, 11 Oct, p.12", "authors": ["McKeown J", "", "Kylie Message"]}, {"title": "Dr Kylie Message", "year": "2010", "source": "s Dundee waterfront V&A project advice'15 Oct, also at http://www.thecourier.co.uk/News/Dundee/article/6338/dr-kylie-message-s-dundee-waterfront-v-and-a-project-advice.htm", "authors": ["UK Courier", "Kylie Message"]}, {"title": "Come and enjoy a billy of tea and damper, have a yarn with a Wedjela or Nyungar", "year": "2010", "source": "The practice of listening and the emergence of active citizenship at Kodja PlaceWestern Australia', refereed conference paper presented at 2010 ASC (Association for Cultural Studies) Crossroads in Cultural Studies Conference. Lingnan University and Kwan Fong Cultural Research and Development Programme, Lingnan University", "authors": ["Kylie Message", "Witcomb A", ""]}, {"title": "Internships: students and collections", "year": "2010", "source": "Museums Australian National Conference 2010, Museums Australia, web, pp. 136-141", "authors": ["Peoples S", "Beckmann E", "Kylie Message"]}, {"title": "Museums in the twenty-first century: Still looking for signs of difference", "year": "2010", "source": "Konsthistorisk tidskrift - Journal of Art History,  vol. 78, pp. 204-221", "authors": ["Kylie Message"]}, {"title": "New directions for civil renewal in Britain: Social capital and culture for all?", "year": "2009", "source": "International Journal of Cultural Studies,   vol. 12, no. 3, pp. 257-278", "authors": ["Kylie Message"]}, {"title": "Multiplying sites of sovereignty through Community and Constituent Services at the National Museum of the National Museum of the American Indian?", "year": "2009", "source": "Museum and Society, vol. 7, no. 1, pp. 50-67", "authors": ["Kylie Message"]}, {"title": "Museum studies: borderwork, genealogy, revolution", "year": "2009", "source": "Museum and Society, vol. 7, no. 2, pp. 125-132", "authors": ["Kylie Message"]}, {"title": "Humanities Research,  vol XV(2) special issue:", "year": "2009", "source": "Compelling cultures: representing cultural diversity and cohesion in multicultural Australia'XV. 2", "authors": ["Kylie Message", "Edmundson A", "Frederick U", "eds"]}, {"title": "Culture, citizenship and Australian multiculturalism: the contest over identity formation at the National Museum of Australia", "year": "2009", "source": "Humanities Research,  vol. XV, no. 2, pp. 23-48", "authors": ["Kylie Message"]}, {"title": "Creating Cultural Citizenship out of Contemporary Art at the National Museum of the American Indian?", "year": "2009", "source": "in Jaynie Anderson (ed.), Crossing Cultures: Conflict, Migration and Convergence. Proceedings of the 32nd International Congress of the History of Art, The Miegunyah Press, Melbourne Australia, pp. 1061-1066", "authors": ["Kylie Message"]}, {"title": "Editorial: Compelling cultures: representing cultural diversity and cohesion in multicultural Australia", "year": "2009", "source": "Humanities Research, vol. XV, no. 2, pp. 9-16", "authors": ["Kylie Message", "Frederick U", "Edmundson A"]}, {"title": "Reflecting on the New Museum Through an Antipodean Lens: The Museum of Sydney and", "year": "2008", "source": "The Imaginary Museum'' Third Text,  vol. 22, no. 6, pp. 755-68", "authors": ["Kylie Message"]}, {"title": "The World within the City: The Great Exhibition, Race, Class and Social Reform", "year": "2008", "source": "in Jeffrey A Auerbach and Peter H Hoffenberg (ed.), Britain, the Empire, and the World at the Great Exhibition of 1851, Ashgate Publishing Ltd, Aldershot and Burlington, pp. 27-46", "authors": ["Kylie Message", "Johnston E"]}, {"title": "Comparing cultures of citizenship and changing concepts of nation and community in the EU and USA", "year": "2008", "source": "Comparing: National Museums, Territories, Nation-Building and Change, ed. Peter Aronsson & Andreas Nyblom, Linkoping University Press, Sweden, pp. 21-40.", "authors": ["Kylie Message"]}, {"title": "Creating cultural citizenship out of contemporary art at the National Museum of the American Indian?", "year": "2008", "source": "refereed conference paper presented at  Cultural Citizenship: The Fourth Annual ESRC Centre for Research on Socio-Cultural Change,  (The University of Manchester), St Hugh's College, Oxford University (Sept 2008)", "authors": ["Kylie Message", ""]}, {"title": "Museums and the Utility of Culture: The Politics of Liberal Democracy and Cultural Well-Being", "year": "2007", "source": "Social Identities,  vol. 13, no. 2, pp. 235-256", "authors": ["Kylie Message"]}, {"title": "Performing History: The Circa Theatre at the National Museum of Austrlia", "year": "2007", "source": "Metro, vol. 153, pp. 148-151", "authors": ["Kylie Message"]}, {"title": "Meeting the challenges of the future? Museums and the public good", "year": "2007", "source": "reCollections,  vol. 2, no. 1, pp. 71-93", "authors": ["Kylie Message"]}, {"title": "The New Museum", "year": "2006", "source": "Theory, Culture and Society, vol. 23, no. 2-3, March-May 2006, pp. 603-606", "authors": ["Kylie Message"]}, {"title": "Contested sites of identity and the cult of the new: The Centre Cultural Tjibaou and the constitution of culture in New Caledonia", "year": "2006", "source": "reCollections, vol. 1, no. 1, pp. 7-28", "authors": ["Kylie Message"]}, {"title": "Introduction: The cultural politics of Antipodean museums", "year": "2006", "source": "New Zealand Sociology,  vol. 21, no. 1, pp. 4-8", "authors": ["Kylie Message", "Dibley B"]}, {"title": "Ongoing dialogues and reinventions of Heide", "year": "2006", "source": "in Dena Kahan, Michele Burder and Amanda Johnson (ed.), In Modern Memory, Blindside editions, Melbourne, pp. np", "authors": ["Kylie Message"]}, {"title": "Contested sites of identity and the cult of the new: The Centre Cultural Tjibaou and the constitution of culture in New Caledonia", "year": "2006", "source": "in Chris Healy and Andrea Witcomb (ed.), South Pacific Museums, Monash University ePress, Canberra ACT, pp. 04.1-04.20", "authors": ["Kylie Message"]}, {"title": "New Museums and the Making of Culture", "year": "2006", "source": "Berg PublishersOxford, U.K. and New York, USA", "authors": ["Kylie Message"]}, {"title": "The shock of the re-newed modern: MoMA 2004", "year": "2006", "source": "Museum and Society, vol. 4, no. 1, pp. 27-50", "authors": ["Kylie Message"]}, {"title": "New Zealand Sociology,  vol 21(1) special issue:", "year": "2006", "source": "The Cultural Politics of Antipodean Museums'21.1", "authors": ["Kylie Message", "Dibley B", "eds"]}, {"title": "re we there yet? Natalie Robertson", "year": "2005", "source": "s Road Signs and Redirection of Cultural Memory'Space and Culture: International Journal of Social Spaces, vol. 8, no. 4, pp. 449-458", "authors": ["Kylie Message"]}, {"title": "Representing Cultural Diversity in a Global Context: The Museum of New Zealand Te Papa Tongarewa and The National Museum of Australia", "year": "2005", "source": "International Journal of Cultural Studies, vol. 4, no. 4, pp. 465-485", "authors": ["Kylie Message"]}, {"title": "Cosmopolitan New Museums and Cultural Policy: the Museum of New Zealand Te Papa Tongarewa and the National Museum of Australia", "year": "2005", "source": "in Ian Woodward and David Ellison (ed.), Sites of Cosmopolitanism, Griffith University, Brisbane Australia, pp. 1-6", "authors": ["Kylie Message"]}, {"title": "Contemporary Identity, Culture and the Art of Redress: Tokyo Street and Shigeyuki Kihara in Aotearoa New Zealand", "year": "2005", "source": "International Journal of Cultural Studies, vol. 9, no. 1, pp. 5-17", "authors": ["Kylie Message"]}, {"title": "Clara Law", "year": "2005", "source": "s Floating Life'in Charles Ferrall, Paul Millar and Keren Smith (ed.), East by South: China in the Australasian Imagination, Victoria University Press, Wellington, pp. 311-323", "authors": ["Kylie Message"]}, {"title": "Black Hole, Body Without Organs, Segmentarity, Stratification, Territory", "year": "2005", "source": "in Adrian Parr (ed.), Deleuze Dictionary, Edinburgh University Press, Edinburg, pp. 28-30, 32-34, 240-42, 266-68, 274-76", "authors": ["Kylie Message"]}, {"title": "Watching Over the Wounded Eye of Georges Bataille and the Multiple Dead Eyes of Andres Serrano", "year": "2004", "source": "in E Klaver (ed.), Images of the Corpse: From the Renaissance to Cyberspace, University of Wisconsin Press, Wisconsin, pp. 113-32", "authors": ["Kylie Message"]}, {"title": "Symptomatic Museum: The New, the NMA and the Culture Wars", "year": "2004", "source": "Borderlands,  vol. 3, no. 3, p. 9", "authors": ["Kylie Message", "Healy C"]}, {"title": "Whale Rider and the Politics of Location", "year": "2003", "source": "Metro,  vol. 136, pp. 86-90", "authors": ["Kylie Message"]}, {"title": "Beyond proper comprehension: Housewife implosions in Rain", "year": "2003", "source": "Metro, vol. 136, pp. 78-80", "authors": ["Kylie Message"]}, {"title": "Cruising The Imaginary Museum", "year": "2003", "source": "Catalogue essay for   The Imaginary Museum David Clegg, Wellington, NZ, pp. 1-6", "authors": ["Kylie Message"]}, {"title": "Exhibiting Visual Culture: Narrative", "year": "2003", "source": "Perceptionand the New Museum, 01/12/2002. PhD dissertation. The University of Melbourn", "authors": ["Kylie Message"]}, {"title": "It", "year": "2002", "source": "s All Done With Mirrors: About Television' Illusions,   vol. 33, no. Autumn, pp. 46-48", "authors": ["Kylie Message"]}, {"title": "Theorizing the New Museum: A Process of Discovery", "year": "2002", "source": "in   (ed.), Cultural Sites, Cultural Theory, Cultural Policy; The Second International Conference on Cultural Policy Research, Te Papa and Victoria University of Wellington, Wellington, pp. 339-46", "authors": ["Kylie Message"]}, {"title": "Being Within Story, Screen, and Museum Space... just like Alice", "year": "2001", "source": "in Patrick Lichty (ed.), Through the Looking Glass: Technology and Creativity at the Beginning of the Next Millennium: International Exhibition, Beachwood Center for the Arts, Ohio, pp. np - http://www.voyd.com/ttlg/textual/messagessay", "authors": ["Kylie Message"]}, {"title": "Crystal Palace to Media Museum: A Conceptual Framework for Experience and Sight", "year": "2000", "source": "in Roy Ascott and Michael Punt (ed.), Consciousness Reframed: Conference Proceedings 3, University of Wales College, Newport, Wales, pp. 134-38", "authors": ["Kylie Message"]}, {"title": "Crystal Palace to Media Museum: A Conceptual Framework for Experience and Sight", "year": "2000", "source": "in Roy Ascott (ed.), Art Technology Consciousness: mind@large, Intellect Ltd, Bristol, UK, pp. 134-38", "authors": ["Kylie Message"]}, {"title": "Watching Witt: Alongside and Beyond The Thin Red Line", "year": "2000", "source": "The UTS Review,   vol. 6, no. 2, pp. 167-80", "authors": ["Kylie Message"]}, {"title": "onSITE: Australian Jewish History Gallery Review", "year": "1999", "source": "inSITE pp. 8-9", "authors": ["Kylie Message"]}, {"title": "Stories of the now-here", "year": "1998", "source": "in James Verdon (ed.), Self remembering - home, James Verdon, Fitzroy, Melbourne, pp. 10-16", "authors": ["Kylie Message"]}, {"title": "bject Bodies and the Regulation of Maternity", "year": "1998", "source": "Journal of Australian Studies,  vol. 59, pp. 147-53", "authors": ["Kylie Message"]}, {"title": "Mapping Movement and Meaning in Everyday Urban Space", "year": "1997", "source": "in L. Finch and C. McConville (ed.), Images of the Urban (refereed conference proceedings), Sunshine Coast University College, QLD, pp. 52-60", "authors": ["Kylie Message"]}]}, "Microsoft-Academic": [{"title": "new museums and the making of culture", "year": 2006, "source": "", "authors": [{"name": "kylie message"}]}, {"title": "museums and social activism engaged protest", "year": 2013, "source": "", "authors": [{"name": "kylie message"}]}, {"title": "the new museum", "year": 2006, "source": "theory culture & society", "authors": [{"name": "kylie message", "affiliation": "australian national university"}], "id": 77333486}, {"title": "book review essays and reviews", "year": 2019, "source": "", "authors": [{"name": "kylie message", "affiliation": "australian national university"}, {"name": "eleanor foster", "affiliation": "australian national university"}, {"name": "joanna cobley", "affiliation": "university of canterbury"}, {"name": "shih chang", "affiliation": "national university of singapore"}, {"name": "john reeve", "affiliation": "university college london"}, {"name": "grace gassin", "affiliation": "museum of new zealand te papa tongarewa"}, {"name": "nadia gush"}, {"name": "esther mcnaughton"}, {"name": "ira jacknis", "affiliation": "university of california berkeley"}, {"name": "siobhan campbell", "affiliation": "university of sydney"}]}, {"title": "collecting activism archiving occupy wall street", "year": 2019, "source": "", "authors": [{"name": "kylie message"}]}, {"title": "the disobedient museum writing at the edge", "year": 2017, "source": "", "authors": [{"name": "kylie message"}]}, {"title": "slipping through the cracks museums and social inclusion in australian cultural policy development 2007 2010", "year": 2013, "source": "international journal of cultural policy", "authors": [{"name": "kylie message", "affiliation": "australian national university"}], "id": 13629841}, {"title": "museums and racism", "year": 2018, "source": "", "authors": [{"name": "kylie message"}]}, {"title": "introduction museum theory an expanded field", "year": 2015, "source": "", "authors": [{"name": "kylie message"}, {"name": "andrea witcomb"}]}, {"title": "museum theory an expanded field", "year": 2015, "source": "", "authors": [{"name": "kylie message"}, {"name": "andrea witcomb"}]}], "ANDS-Grants": []}