{"ANU": {"name": "Lachlan Black", "link": "https://researchers.anu.edu.au/researchers/black-l", "colleges": "College of Engineering & Computer Science", "email": "Lachlan.Black@anu.edu.au", "phone": "", "expertise": ["Photodetectors Optical Sensors And Solar Cells", "Elemental Semiconductors", "Nanomaterials"], "interest": ["My interests are predominantly in the field of crystalline silicon (c-Si) solar cells, especiallyDevelopment of novel processes and materials for surface passivation and passivating contactsDeposition and characterisation of thin film (nanolayer) materialsElectrical characterisation of semiconductor interfacesCharacterisation of bulk and surface recombination processesI am also interested in surface and bulk recombination in non-Si semiconductor materials."], "biography": "Dr. Lachlan Black received his Ph.D. in Engineering from the ANU in 2015. His Ph.D. research focused on the surface passivation of crystalline Si by Al2O3 prepared by atmospheric pressure chemical vapour deposition and the electrical characterisation of the Si–Al2O3 interface.  From 2015 to 2018 he was a postdoctoral researcher with the Department of Applied Physics at the Eindhoven University of Technology in the Netherlands, where he worked on the application of novel thin film materials prepared by atomic layer deposition for surface passivation of III/V semiconductor nanowires and crystalline Si solar cells. He has also spent time as an intern at the Energy Research Centre of the Netherlands (ECN) and as a visiting researcher at the Interuniversity Microelectronics Centre (imec) in Leuven, Belgium. Dr. Black has authored or co-authored more than 30 peer-reviewed articles and conference proceedings, and one patent. His current research interests focus on the investigation and characterisation of novel passivation layers and passivating contact structures, as well as the physics, characterisation, and modelling of recombination processes in semiconductors more broadly.", "project": [], "publication": [{"title": "Dependence of coil sensitivity on sample thickness in inductively coupled photoconductance measurements", "year": "2019", "source": "9th International Conference on Crystalline Silicon Photovoltaics, SiliconPV 2019, ed. S Dubois, S Glunz, P Verlinden, B Rolf, A Weeber, G Hahn, M Poortmans, C Ballif, American Institute of Physics, United States, pp. -", "authors": ["Lachlan Black", "Kessels E"]}, {"title": "ccounting for the Dependence of Coil Sensitivity on Sample Thickness and Lift-Off in Inductively Coupled Photoconductance Measurements", "year": "2019", "source": "IEEE Journal of Photovoltaics, vol. 9, no. 6, pp. 1563-1574", "authors": ["Lachlan Black", "MacDonald D"]}, {"title": "l2O3 by atmospheric pressure chemical vapour deposition", "year": "2018", "source": "in Joachim John (ed.), Surface Passivation of Industrial Crystalline Silicon Solar Cells, The Institution of Engineering and Technology, London, pp. 81-94", "authors": ["Lachlan Black"]}, {"title": "Effective passivation of silicon surfaces by ultrathin atomic-layer deposited niobium oxide", "year": "2018", "source": "Applied Physics Letters, vol. 112, pp. 1-5", "authors": ["Macco B", "Bivour M", "Deijkers J", "Lachlan Black"]}, {"title": "POx/Al2O3 stacks: Highly effective surface passivation of crystalline silicon with a large positive fixed charge", "year": "2018", "source": "Applied Physics Letters, vol. 112, pp. 1-5", "authors": ["Lachlan Black", "Kessels E"]}, {"title": "Surface Fluorination of ALD TiO2 Electron Transport Layer for Efficient Planar Perovskite Solar Cells", "year": "2018", "source": "Advanced Materials Interfaces, vol. 5, no. 9, pp. 1-6", "authors": ["Zardetto V", "di Giacomo F", "Lifka H", "Lachlan Black"]}, {"title": "Passivating Contacts for Crystalline Silicon Solar Cells: From Concepts and Materials to Prospects", "year": "2018", "source": "IEEE Journal of Photovoltaics, vol. 8, no. 2, pp. 373-388", "authors": ["Melskens J", "van de Loo B", "Macco B", "Lachlan Black"]}, {"title": "Explorative studies of novel silicon surface passivation materials: Considerations and lessons learned", "year": "2018", "source": "Solar Energy Materials and Solar Cells, vol. 188, pp. 182-189", "authors": ["Lachlan Black", "van de Loo B", "Macco B"]}, {"title": "Investigation of crystalline silicon surface passivation by positively charged POx/Al2O3 stacks", "year": "2018", "source": "Solar Energy Materials and Solar Cells, vol. 185, pp. 385-391", "authors": ["Lachlan Black", "Kessels E"]}, {"title": "tomic-layer deposited Nb2O5 as transparent passivating electron contact for c-Si solar cells", "year": "2018", "source": "Solar Energy Materials and Solar Cells, vol. 184, pp. 98-104", "authors": ["Macco B", "Lachlan Black", "Melskens J"]}, {"title": "Low-Temperature Plasma-Assisted Atomic-Layer-Deposited SnO2 as an Electron Transport Layer in Planar Perovskite Solar Cells", "year": "2018", "source": "ACS Applied Materials and Interfaces, vol. 10, no. 36, pp. 30367-30378", "authors": ["Kuang Y", "Zardetto V", "van Gils R", "Lachlan Black"]}, {"title": "Effective Surface Passivation of InP Nanowires by Atomic-Layer-Deposited Al2O3 with POx Interlayer", "year": "2017", "source": "Nano Letters, vol. 17, no. 10, pp. 6287-6294", "authors": ["Lachlan Black", "Cavalli A", "Verheijen M"]}, {"title": "Degeneracy and bandgap narrowing in the semiconductor electron-hole product", "year": "2017", "source": "Journal of Applied Physics, vol. 121, no. 10, pp. 4pp", "authors": ["Lachlan Black"]}, {"title": "On the solid phase crystallization of In2O3:H transparent conductive oxide films prepared by atomic layer deposition", "year": "2016", "source": "Journal of Applied Physics, vol. 120, no. 8, pp. 1-8", "authors": ["Macco B", "Verheijen M", "Lachlan Black"]}, {"title": "New Perspectives on Surface Passivation: Understanding the Si–Al2O3 Interface", "year": "2016", "source": "Springer International Publishing AGSwitzerland", "authors": ["Lachlan Black"]}, {"title": "Large-Area n-Type PERT Solar Cells Featuring Rear p(+) Emitter Passivated by ALD Al2O3", "year": "2015", "source": "IEEE Journal of Photovoltaics, vol. 5, no. 5, pp. 1366-1372", "authors": ["Cornagliotti E", "Uruena A", "Aleman M", "Lachlan Black"]}, {"title": "Towards industrial advanced front-junction n-type silicon solar cells", "year": "2014", "source": "40th IEEE Photovoltaic Specialist Conference, PVSC 2014, IEEE, USA, pp. 862-865", "authors": ["Wan Y", "Samundsett C", "Kho T", "Lachlan Black"]}, {"title": "On effective surface recombination parameters", "year": "2014", "source": "Journal of Applied Physics, vol. 116, no. 1, pp. 014503/1-10", "authors": ["McIntosh K", "Lachlan Black"]}, {"title": "Effect of boron concentration on recombination at the p-Si-Al2O3 interface", "year": "2014", "source": "Journal of Applied Physics, vol. 115, no. 9, pp. 1-9", "authors": ["Lachlan Black", "Allen T", "McIntosh K"]}, {"title": "The influence of orientation and morphology on the passivation of crystalline silicon surfaces by Al2O3", "year": "2014", "source": "Energy Procedia, vol. 55, pp. 750-756", "authors": ["Lachlan Black", "Kho T", "McIntosh K"]}, {"title": "Thermal stability of silicon surface passivation by APCVD Al2O3", "year": "2014", "source": "Solar Energy Materials and Solar Cells, vol. 120, pp. 339-345", "authors": ["Lachlan Black", "Allen T", "Cuevas A"]}, {"title": "Modeling recombination at the Si-Al2O3 interface", "year": "2013", "source": "IEEE Journal of Photovoltaics, vol. 3, no. 3, pp. 936-943", "authors": ["Lachlan Black", "McIntosh K"]}, {"title": "n Examination of Three Common Assumptions Used to Simulate Recombination in Heavily Doped Silicon", "year": "2013", "source": "28th European Photovoltaic Solar Energy Conference and Exhibition 2013, WIP-Renewable Energies, Munich Germany, pp. 1672-1679", "authors": ["McIntosh K", "Altermatt P", "Ratcliff T", "Lachlan Black"]}, {"title": "Modelling silicon solar cells with up-to-date material parameters", "year": "2013", "source": "Energy Procedia, vol. 38, pp. 66-71", "authors": ["Hargreaves S", "Lachlan Black", "Yang D"]}, {"title": "Determination of the magnitude and centroid of the charge in a thin-film insulator by CV and Kelvin probe measurements", "year": "2012", "source": "Energy Procedia, vol. 15, pp. 162-170", "authors": ["McIntosh K", "Lachlan Black", "Baker-Finch S"]}, {"title": "Surface passivation of c-Si by atmospheric pressure chemical vapor deposition of Al2O3", "year": "2012", "source": "Applied Physics Letters, vol. 100, no. 20, pp. 202107/1-5", "authors": ["Lachlan Black", "McIntosh K"]}, {"title": "Defect Generation at Charge-Passivated Si-SiO2 Interfaces by Ultraviolet Light", "year": "2010", "source": "IEEE Transactions on Electron Devices, vol. 57, no. 8, pp. 1996-2004", "authors": ["Lachlan Black", "McIntosh K"]}, {"title": "Degradation of SI-SIO2 interfaces during rapid thermal annealing", "year": "2009", "source": "European Photovoltaic Solar Energy Conference EUPVSEC 2009, ed. W. Sinke, H.Ossenbrink, P.Helm, WIP-Renewable Energies, Germany, pp. 1586-1590", "authors": ["Kho T", "Lachlan Black", "McIntosh K"]}]}, "Microsoft-Academic": [{"title": "an experimental investigation into the behaviour of antifoaming agents", "year": 2017, "source": "chemical engineering science", "authors": [{"name": "dale d mcclure", "affiliation": "university of sydney"}, {"name": "marine lamy", "affiliation": "institut national des sciences appliquees de lyon"}, {"name": "lachlan black", "affiliation": "university of oxford"}, {"name": "john m kavanagh", "affiliation": "university of sydney"}, {"name": "g w barton", "affiliation": "university of sydney"}], "id": 33892871}], "ANDS-Grants": []}