{"ANU": {"name": "Lars S. Jermiin", "link": "https://researchers.anu.edu.au/researchers/jermiin-l", "colleges": "College of Science", "email": "lars.jermiin@anu.edu.au", "phone": "", "expertise": ["Phylogeny And Comparative Analysis", "Bioinformatics", "Genomics", "Molecular Evolution", "Population Ecological And Evolutionary Genetics"], "interest": ["LSJ is an expert in genome bioinformatics, devoting much of his attention to developing better strategies, protocols, methods and tools for research in molecular phylogenetics."], "biography": "Lars Jermiin is a Visiting Professor at the School of Biology and Environmental Science, University College Dublin, and an Honorary Professor at the Research School of Biology, Australian National University.He holds an MSc (population genetics) from the University of Aarhus, Denmark (1989) and a PhD (molecular evolution) from La Trobe University, Australia (1994). He did postdoctoral research at La Trobe Univerity (1994-1995), Université d'Ottawa (1995), the Australian National University (1995-1998), and the University of Sydney (1998-2001).In 2001 he was appointed to the position of Lecturer at the University of Sydney, then promoted to Senior Lecturer in 2004, and Associate Professor in 2008. In 2002 he co-founded the Sydney University Bioinformatics & Technology Center (SUBIT), and in 2003 was appointed its Director (2003-7). In 2009 he was appointed by the Commonwealth Scientific Industrial and Research Organisation's (CSIRO) of Australia to establish and lead a research team in genome bioinformatics at its Division of Entomology. In 2016 he was appointed Honorary Professor at the Australian National University, and in 2018 he was appointed Visiting Professor at the University College Dublin.", "project": [], "publication": [{"title": "Genome-wide analysis of MIKC-type MADS-box genes in wheat: pervasive duplications, functional conservation and putative neofunctionalization", "year": "2020", "source": "New Phytologist, vol. 225, no. 1, pp. 511-529", "authors": ["Schilling S", "Kennedy A", "Pan S", "Lars S. Jermiin"]}, {"title": "GHOST: Recovering Historical Signal from Heterotachously Evolved Sequence Alignments", "year": "2020", "source": "Systematic Biology, vol. 69, no. 2, pp. 249-264", "authors": ["Crotty S", "Bui M", "Bean N", "Lars S. Jermiin"]}, {"title": "new phylogenetic protocol: dealing with model misspecification and confirmation bias in molecular phylogenetics", "year": "2020", "source": "NAR Genomics and Bioinformatics, vol. 2, no. 2, pp. 14pp", "authors": ["Lars S. Jermiin", "Catullo R", "Holland B"]}, {"title": "Sensitivity and specificity of information criteria", "year": "2020", "source": "Briefings in Bioinformatics, vol. 21, no. 2, pp. 553-565", "authors": ["Dziak J", "Coffman D", "Lanza S", "Lars S. Jermiin"]}, {"title": "Six reference-quality genomes reveal evolution of bat adaptations", "year": "2020", "source": "Nature, vol. 583, pp. 578-584", "authors": ["Jebb D", "Huang Z", "Pippel M", "Lars S. Jermiin"]}, {"title": "Serpins: Genome-wide characterisation and expression analysis of the serine protease inhibitor family in Triticum aestivum", "year": "2019", "source": "G3: Genes, Genomes, Genetics, vol. 9, no. 8, pp. 2709-2722", "authors": ["Benbow H", "Lars S. Jermiin", "Doohan F"]}, {"title": "Molecular phylogeny reveals food plasticity in the evolution of true ladybird beetles (Coleoptera: Coccinellidae: Coccinellini)", "year": "2018", "source": "BMC Evolutionary Biology, vol. 17, no. 151, pp. 1-11pp", "authors": ["Escalona H", "Zwick A", "Li H", "Lars S. Jermiin"]}, {"title": "Mitochondrial DNA and trade data support multiple origins of Helicoverpa armigera (Lepidoptera, Noctuidae) in Brazil", "year": "2018", "source": "Nature, vol. 7, no. 45302, pp. 1-10", "authors": ["Tay W", "Walsh T", "Downes S", "Lars S. Jermiin"]}, {"title": "ModelFinder: fast model selection for accurate phylogenetic estimates", "year": "2017", "source": "Nature Methods: techniques for life scientists and chemists, vol. 14, no. 6, pp. 587-589pp", "authors": ["Kalyaanamoorthy S", "Minh B", "Wong T", "Lars S. Jermiin"]}, {"title": "Reverse engineering: transaminase biocatalyst\r\ndevelopment using ancestral sequence\r\nreconstruction", "year": "2017", "source": "Green Chemistry, vol. 19, no. 22, pp. 5375-5380", "authors": ["Wilding M", "Peat T", "Kalyaanamoorthy S", "Lars S. Jermiin"]}, {"title": "Mitochondrial DNA sequences in ancient Australians: Implications for modern human origins", "year": "2001", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 98, no. 2, pp. 537-542", "authors": ["Adcock G", "Dennis E", "Easteal S", "Lars S. Jermiin"]}, {"title": "mylase and 16S rRNA genes from a hyperthermophilic archaebacterium", "year": "1999", "source": "Journal of Applied Microbiology, vol. 86, no. 1, pp. 93-107", "authors": ["Jones R", "Lars S. Jermiin", "Easteal S"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}