{"ANU": {"name": "Liana Leach", "link": "https://researchers.anu.edu.au/researchers/leach-ls", "colleges": "College of Health & Medicine", "email": "liana.leach@anu.edu.au", "phone": "", "expertise": ["Mental Health", "Epidemiology", "Family And Household Studies"], "interest": ["Dr Leach is a research fellow in the Society, Culture and Health research stream at The National Centre for Epidemiology and Population Health (NCEPH). Her research interests include examining the impact of family and  work circumstances on mental health. Her work involves the translation of mental  health research for public policy and practice."], "biography": "Dr Leach completed an undergraduate Honours degree in Applied Psychology at The University of Canberra in 2003. Since this time, she has undertaken research projects with the Australian Demographic Social Research Institute (ADSRI) and the Centre for Mental Health Research (CMHR) at The Australian National University.  Dr Leach completed her PhD at the CMHR titled 'Gender differences in depression and anxiety across the adult lifespan' in 2009. She has published her work in several high quality academic journals as well as national and international conferences.", "project": ["Dr Leach uses a number of longitudinal, population-based surveys in her work to examine associations between changes in social factors (e.g. work and family life transitions) and changes in mental health. For example, Dr Leach's research has examined how changes in job characteristics impact on mental health, and how becoming a parent impacts on mental health.", "Her work has utilised:", "- Personality and Total Health Through Life survey (PATH)", "- Household Income Labour and Dynamics in Australia survey (HILDA)", "- National Survey of Mental Health and Wellbeing in Australian (NSMHWB)", "- Growing up in Australia: Longitudinal Survey of Australian Children (LSAC)", ""], "publication": [{"title": "Workplace bullying and suicidal ideation: Findings from an australian longitudinal cohort study of mid-aged workers", "year": "2020", "source": "International Journal of Environmental Research and Public Health, vol. 17, no. 1448, pp. 1-12", "authors": ["Liana Leach", "Too L", "Batterham P"]}, {"title": "Cost of poor health to the labour market returns to education in Australia: another pathway for socio-economic inequality", "year": "2020", "source": "European Journal of Health Economics, vol. 21, pp. 635-648", "authors": ["Doan T", "Strazdins L", "Liana Leach"]}, {"title": "Does flexible work", "year": "2020", "source": "work' in Australia? A survey of employed mothers' and fathers' workfamily and health [IN PRESS]', Community, Work and Family, vol. online", "authors": ["Hokke S", "Bennetts S", "Crawford S", "Liana Leach"]}, {"title": "Mental Health Problems and Internet Access: Results From an Australian National Household Survey", "year": "2020", "source": "JMIR Mental Health, vol. 7, no. 5, pp. 1-11", "authors": ["Too L", "Liana Leach", "Butterworth P"]}, {"title": "Does flexible work ï¿½workï¿½ in Australia? A survey of employed mothersï¿½ and fathersï¿½ work, family and health", "year": "2020", "source": "Community, Work and Family, vol. Online", "authors": ["Hokke S", "Bennetts  S", "Crawford S", "Liana Leach"]}, {"title": "Cost of poor health to the labour market returns to education in Australia ï¿½ another pathway for socio-economic inequality", "year": "2020", "source": "European Journal of Health Economics, vol. 21, pp. 635-648", "authors": ["Doan T", "Strazdins L", "Liana Leach"]}, {"title": "Parents", "year": "2020", "source": "Shift Work in Connection with Work-Family Conflict and Mental Health: Examining the Pathways for Mothers and Fathers [IN PRESS]'Journal of Family Issues, vol. Online", "authors": ["Zhao Y", "Cooklin A", "Richardson A", "Liana Leach"]}, {"title": "Depression and anxiety in early adulthood: consequences for finding a partner, and relationship support and conflict", "year": "2020", "source": "Epidemiology and Psychiatric Sciences, vol. 29, no. e141, pp. 1-9", "authors": ["Liana Leach", "Butterworth P"]}, {"title": "Is Self-Employment a Good Option? Gender, Parents and the Work-Family Interface [IN PRESS]", "year": "2020", "source": "Sex Roles, vol. Online", "authors": ["Dinh H", "Martin A", "Liana Leach"]}, {"title": "ustralian parents", "year": "2020", "source": "work-family conflict: accumulated effects on children's family environment and mental health'Social Psychiatry and Psychiatric Epidemiology, vol. Online", "authors": ["Liana Leach", "Dinh H", "Cooklin A"]}, {"title": "Is the association between poor job control and common mental disorder explained by general perceptions of control? Findings from an Australian longitudinal cohort", "year": "2020", "source": "Scandinavian Journal of Work, Environment and Health, vol. 46, no. 3, pp. 311-320", "authors": ["Too L", "Liana Leach", "Butterworth P"]}, {"title": "Comorbid anxiety and depression: a community-based study examining symptomology and correlates during the postpartum period", "year": "2019", "source": "Journal of Reproductive and Infant Psychology, vol. 37, no. 5, pp. 468-479", "authors": ["Ramakrishna S", "Cooklin A", "Liana Leach"]}, {"title": "Shift work and mental health: a systematic review and meta-analysis", "year": "2019", "source": "International Archives of Occupational and Environmental Health, vol. 92, no. 6, pp. 763-793", "authors": ["Zhao Y", "Richardson A", "Poyser C", "Liana Leach"]}, {"title": "Recruiting fathers for parenting research using online advertising campaigns: Evidence from an Australian study.", "year": "2019", "source": "Child: Care, Health and Development, vol. Online", "authors": ["Liana Leach", "Bennetts S", "Giallo R"]}, {"title": "longitudinal test of the predictions of the interpersonal-psychological theory of suicidal behaviour for passive and active suicidal ideation in a large community-based cohort", "year": "2018", "source": "Journal of Affective Disorders, vol. 227, pp. 97-102", "authors": ["Batterham P", "Walker J", "Liana Leach"]}, {"title": "There remains a need for greater awareness and further research on fathers", "year": "2018", "source": "stress in the perinatal period'Evidence-based nursing, vol. 21, no. 3, p. 1", "authors": ["Liana Leach"]}, {"title": "Early Onset of Distress Disorders and High-School Dropout: Prospective Evidence From a National Cohort of Australian Adolescents", "year": "2018", "source": "American Journal of Epidemiology, vol. 187, no. 6, pp. 1192-1198pp", "authors": ["Butterworth P", "Liana Leach"]}, {"title": "Using paid and free Facebook methods to recruit Australian parents to an online work-family survey: An evaluation.", "year": "2018", "source": "Journal of Medical Internet Research, vol. 21, no. 3, pp. e11206", "authors": ["Bennetts S", "Hokke S", "Crawford S", "Liana Leach"]}, {"title": "Workplace bullying and the association with suicidal ideation/thoughts and behaviour: a systematic review", "year": "2017", "source": "Occupational and Environmental Medicine, vol. 74, no. 1, pp. 72-79pp", "authors": ["Liana Leach", "Poyser C", "Butterworth P"]}, {"title": "Online Recruitment: Feasibility, Cost, and Representativeness in a Study of Postpartum Women", "year": "2017", "source": "Journal of Medical Internet Research, vol. 19, no. 3, pp. 5pps", "authors": ["Liana Leach", "Butterworth P", "Poyser C"]}, {"title": "Parents", "year": "2017", "source": "transitions into and out of work-family conflict and children's mental health: Longitudinal influence via family functioning'Social Science and Medicine, vol. 194, pp. 42-50", "authors": ["Dinh H", "Cooklin A", "Liana Leach"]}, {"title": "Workplace bullying and the association with suicidal ideation/thoughts and behaviour: a systematic review", "year": "2017", "source": "Occupational and Environmental Medicine, vol. 74, no. 1, pp. 72-79pp", "authors": ["Liana Leach", "Poyser C", "Butterworth P"]}, {"title": "Maternal perinatal anxiety: A review of prevalence and correlates", "year": "2017", "source": "Clinical Psychologist, vol. Article first published online: 21: p.4-19", "authors": ["Liana Leach", "Poyser C", "Fairweather-Schmidt A"]}, {"title": "Prevalence and course of anxiety disorders (and symptom levels) in men across the perinatal period: A systematic review", "year": "2016", "source": "Journal of Affective Disorders, vol. 190, pp. 675-686", "authors": ["Liana Leach", "Poyser C", "Cooklin A"]}, {"title": "Change and stability in work-family conflict and mothers", "year": "2016", "source": "and fathers' mental health: Longitudinal evidence from an Australian cohort'Social Science and Medicine, vol. 155, pp. 24-34", "authors": ["Cooklin A", "Dinh H", "Strazdins L", "Liana Leach"]}, {"title": "Correlates of transient versus persistent psychotic symptoms among dependent methamphetamine users", "year": "2016", "source": "Psychiatry Research, vol. 238, pp. 166-171", "authors": ["McKetin R", "Gardner J", "Baker A", "Liana Leach"]}, {"title": "Financial hardship, mastery and social support: Explaining poor mental health amongst the inadequately employed using data from the HILDA survey", "year": "2016", "source": "SSM - Population Health, vol. 2, pp. 407-415", "authors": ["Crowe L", "Butterworth P", "Liana Leach"]}, {"title": "Why it", "year": "2015", "source": "s important for it to stop:Examining the mental health correlates of bullying and ill-treatment at work in a cohort study'Australian and New Zealand Journal of Psychiatry, pp. 1-11", "authors": ["Butterworth P", "Liana Leach", "Kiely K"]}, {"title": "Blogs from 11 expectant first-time fathers reveal both excitement and fears in their new role", "year": "2015", "source": "Evidence-based nursing, vol. 18, no. 3, pp. 69-", "authors": ["Liana Leach"]}, {"title": "What matters for working fathers? Job characteristics, work-family conflict and enrichment, and fathers", "year": "2015", "source": "postpartum mental health in an Australian cohort'Social Science and Medicine, vol. 146, no. 2015, pp. 214-222", "authors": ["Cooklin A", "Giallo R", "Strazdins L", "Liana Leach"]}, {"title": "How financial hardship is associated with the onset of mental health problems over time", "year": "2015", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 50, no. 6, pp. 909-918", "authors": ["Kiely K", "Liana Leach", "Olesen S"]}, {"title": "Depression and anxiety in expectant and new fathers: Longitudinal findings in Australian men", "year": "2015", "source": "British Journal of Psychiatry, vol. 206, no. 6, pp. 471-478", "authors": ["Liana Leach", "Mackinnon A", "Poyser C"]}, {"title": "New Fatherhood and Psychological Distress: A Longitudinal Study of Australian Men", "year": "2014", "source": "American Journal of Epidemiology, vol. 180, no. 6, pp. 582-589", "authors": ["Liana Leach", "Olesen S", "Butterworth P"]}, {"title": "Pregnancy and levels of depression and anxiety: A prospective cohort study of Australian women", "year": "2014", "source": "Australian and New Zealand Journal of Psychiatry, vol. 48, no. 10, pp. 944-951", "authors": ["Liana Leach", "Christensen H", "Mackinnon A"]}, {"title": "The relationship between work characteristics", "year": "2013", "source": "wellbeingdepression and workplace bullying: Summary Report", "authors": ["Butterworth P", "Liana Leach", "Kiely K"]}, {"title": "The relationship between work characteristics", "year": "2013", "source": "wellbeingdepression and workplace bullying: Technical findings from a survey of 32-36 year old workers in Canberra and Queanbeyan", "authors": ["Butterworth P", "Liana Leach", "Kiely K"]}, {"title": "Socioeconomic differences in antidepressant use in the PATH through life study: Evidence of health inequalities, prescribing bias, or an effective social safety net?", "year": "2013", "source": "Journal of Affective Disorders, vol. 149, no. 1-3, pp. 75-83", "authors": ["Butterworth P", "Olesen S", "Liana Leach"]}, {"title": "Mental health affects future employment as job loss affects mental health: Findings from a longitudinal population study", "year": "2013", "source": "BMC Psychiatry, vol. 13", "authors": ["Olesen S", "Butterworth P", "Liana Leach"]}, {"title": "Relationship quality and levels of depression and anxiety in a large population-based survey", "year": "2013", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 48, no. 3, pp. 417-425", "authors": ["Liana Leach", "Butterworth P", "Olesen S"]}, {"title": "Common mental disorders, unemployment and psychosocial job quality: is a poor job better than no job at all?", "year": "2013", "source": "Psychological Medicine, vol. 43, no. 8, pp. 1763-1772", "authors": ["Butterworth P", "Liana Leach", "McManus S"]}, {"title": "REVIEW MAJOR DEPRESSION AFFECTS ABOUT 7 OF ADULTS AGED 75 AND ABOVE", "year": "2012", "source": "Evidence-Based Mental Health, vol. 15, no. 3, pp. 64-", "authors": ["Liana Leach"]}, {"title": "The way families work: jobs, hours, income and children", "year": "2012", "source": "s well-being'in A. Kalil, R. Haskins and J. Chesters (ed.), Investing in Children: Work, Education, and Social Policy in Two Rich Countries, Brookings Institution Press, Washington D.C., pp. 79-99", "authors": ["Strazdins L", "Shipley M", "Liana Leach"]}, {"title": "The effect of early onset common mental disorders on educational attainment in Australia", "year": "2012", "source": "Psychiatry Research, vol. 199, no. 1, pp. 51-57", "authors": ["Liana Leach", "Butterworth P"]}, {"title": "Private health insurance, mental health and service use in Australia", "year": "2012", "source": "Australian and New Zealand Journal of Psychiatry, vol. 46, no. 5, pp. 468-475", "authors": ["Liana Leach", "Butterworth P", "Whiteford H"]}, {"title": "The role of hardship in the association between socio-economic position and depression", "year": "2012", "source": "Australian and New Zealand Journal of Psychiatry, vol. 46, no. 4, pp. 364-373", "authors": ["Butterworth P", "Olesen S", "Liana Leach"]}, {"title": "Psychosocial adversities at work are associated with poorer quality marriage-like relationships", "year": "2012", "source": "Journal of Population Research, vol. 29, no. 4, pp. 351-372", "authors": ["Liana Leach", "Butterworth P"]}, {"title": "Feeling safe", "year": "2012", "source": "stable and secure. Having a home", "authors": ["Butterworth P", "Liana Leach", "Olesen S"]}, {"title": "Poor mental health influences risk and duration of unemployment: a prospective study", "year": "2012", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 47, no. 6, pp. 1013-1021", "authors": ["Butterworth P", "Liana Leach", "Pirkis J"]}, {"title": "mental health in the suburbs: an investigation of differences in the prevalence of depression across Canberra suburbs using data from the PATH through Life Study", "year": "2012", "source": "Journal of Public Health, pp. 1-7", "authors": ["Butterworth P", "Liana Leach", "Olesen S"]}, {"title": "Psychosocial job adversity and health in Australia: analysis of data from the HILDA Survey", "year": "2011", "source": "Australian and New Zealand Journal of Public Health, vol. 35, no. 6, pp. 564-571", "authors": ["Butterworth P", "Liana Leach", "Rodgers B"]}, {"title": "The psychosocial quality of work determines whether employment has benefits for mental health: Results from a longitudinal national household panel survey", "year": "2011", "source": "Occupational and Environmental Medicine, vol. 68, no. 11, pp. 806-812", "authors": ["Butterworth P", "Liana Leach", "Strazdins L"]}, {"title": "Deriving an evidence-based measure of job quality from the HILDA survey", "year": "2010", "source": "Australian Social Policy, vol. 9, pp. 67-86", "authors": ["Liana Leach", "Butterworth P", "Rodgers B"]}, {"title": "Prevalence of self-management versus formal service use for common mental disorders in Australia: Findings from the 2007 National Survey of Mental Health and Wellbeing", "year": "2010", "source": "Australian and New Zealand Journal of Psychiatry, vol. 44, no. 9, pp. 823-830", "authors": ["Olesen S", "Butterworth P", "Liana Leach"]}, {"title": "Cognition in pregnancy and motherhood: Prospective cohort study", "year": "2010", "source": "British Journal of Psychiatry, vol. 196, no. 2, pp. 126-132", "authors": ["Christensen H", "Liana Leach", "Mackinnon A"]}, {"title": "The limitations of employment as a tool for social inclusion", "year": "2010", "source": "BMC Public Health, vol. 10, no. 621, pp. 1-13", "authors": ["Liana Leach", "Butterworth P", "Strazdins L"]}, {"title": "Pathways to social inclusion: considering the relationship between unemployment", "year": "2010", "source": "job quality and personal disadvantage", "authors": ["Liana Leach", "Butterworth P", "Rodgers B"]}, {"title": "Mental Health research in The Lancet: A case study", "year": "2010", "source": "Journal of Mental Health, vol. 19, no. 1, pp. 17-25", "authors": ["Griffiths K", "Banfield M", "Liana Leach"]}, {"title": "The Impact of School Bullying on Adolescents", "year": "2009", "source": "Psychosocial Resources and Help-Seeking Intentions'Advances in School Mental Health Promotion, vol. 2, no. 2, p. 10", "authors": ["Liana Leach", "Rickwood D"]}, {"title": "Mental health profile of callers to a generalist telephone counselling service", "year": "2008", "source": "Journal of Telemedicine & Telecare, vol. 14, no. 1, pp. 42-47", "authors": ["Burgess N", "Christensen H", "Liana Leach"]}, {"title": "Gender differences in the endorsement of symptoms for depression and anxiety: Are gender biased items responsible?", "year": "2008", "source": "Journal of Nervous and Mental Disease, vol. 196, no. 2, pp. 128-135", "authors": ["Liana Leach", "Christensen H", "Mackinnon A"]}, {"title": "Gender differences in depression and anxiety across the adult lifespan: the role of psychosocial mediators", "year": "2008", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 43, pp. 983-998", "authors": ["Liana Leach", "Christensen H", "Mackinnon A"]}, {"title": "ge differences in mental health literacy", "year": "2008", "source": "BMC Public Health, vol. 8, no. 125, p. 8", "authors": ["Farrer L", "Liana Leach", "Griffiths K"]}, {"title": "Intelligence, Education, and the Brain Reserve Hypothesis", "year": "2008", "source": "in Fergus Craik, Timothy Salthouse (ed.), The Handbook of Aging and Cognition (3rd ed), Psychology Press, Taylor & Francis, United Kingdom, pp. 133-189", "authors": ["Christensen H", "Anstey K", "Liana Leach"]}, {"title": "Websites as a mode of delivering mental health information: perceptions from the Australian public", "year": "2007", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 42, no. 2, pp. 167-172", "authors": ["Liana Leach", "Christensen H", "Griffiths K"]}, {"title": "Neuroimaging and APOE Genotype: A systemic qualitative review.", "year": "2007", "source": "Dementia and Geriatric Cognitive Disorders, vol. 24, no. 5, pp. 348-362", "authors": ["Cherbuin N", "Liana Leach", "Christensen H"]}, {"title": "systemic review of telephone-based interventions for mental disorders", "year": "2006", "source": "Journal of Telemedicine & Telecare, vol. 12, no. 3, pp. 122-129", "authors": ["Liana Leach", "Christensen H"]}, {"title": "The effect of web-based depression interventions on self reported help seeking: randomised control trial", "year": "2006", "source": "BMC Psychiatry, vol. 6, no. 13, pp. 1-11", "authors": ["Christensen H", "Liana Leach", "Barney L"]}]}, "Microsoft-Academic": [{"title": "fathers work and family conflicts and the outcomes for children s mental health", "year": 2019, "source": "", "authors": [{"name": "liana leach"}]}], "ANDS-Grants": [{"description": "Reducing the number of Australians with mental health problems is now a major priority for policy makers. This project targets young adults struggling with stressors in their work and family lives. The study will enhance our understanding of the work and family life experiences of 2000 young adults over a period 12 years (1999-2011) to find out how major life events such as relationship breakdown, having a baby, and losing your job, impact on the mental health of young Australians.", "title": "Evaluating the impact of work and family stressors on the development of Common Mental Disorders in Australia", "id": "110983", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1035803", "researchers": ["Dr Liana Leach"], "status": "closed", "fundingAmount": 329042.8, "fundingScheme": "Early Career Fellowships", "startDate": 2012, "endDate": 2017, "dateTimeModified": "2018-03-07T07:52:35Z", "dateTimeCreated": "2013-05-15T07:21:39Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Liana Leach"], "purl": "http://purl.org/au-research/grants/nhmrc/1035803", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1035803", "1035803"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "mental health", "psychiatric epidemiology", "population-based", "work-related", "family functioning", "longitudinal study", "statistics"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/110983"}]}, {"title": "Investigating the relationship between key life-course transitions and depression", "id": "114872", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/410212", "researchers": ["Dr Liana Leach"], "description": null, "status": "closed", "fundingAmount": 65354, "fundingScheme": "NHMRC Postgraduate Scholarships", "startDate": 2006, "endDate": 2008, "dateTimeModified": "2015-04-12T07:53:34Z", "dateTimeCreated": "2013-05-15T07:28:30Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Liana Leach"], "purl": "http://purl.org/au-research/grants/nhmrc/410212", "identifiers": ["http://purl.org/au-research/grants/nhmrc/410212", "410212"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "depression", "gender differences", "life-course changes", "longitudinal analysis", "population data"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/114872"}]}, {"description": "This project aims to provide new evidence on the twin wealth and health costs and benefits of greater gender equality in work hours, and new data resources for policy modelling and testing. It also aims to provide insights into progress on gender parity which appears to have stalled despite concerted policy action. Expected benefits of this evidence include improving the health and economic security of women, and the identification of options for new policy actions to solve the problem of gender inequality in employment and earnings.", "title": "Discovery Projects - Grant ID: DP190100975", "id": "1378315", "key": "http://purl.org/au-research/grants/arc/DP190100975", "researchers": ["Prof Lyndall Strazdins", "Prof Matthew Gray", "Dr Liana Leach"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 405092, "fundingScheme": "Discovery Projects", "startDate": 2019, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:45Z", "dateTimeCreated": "2019-06-03T03:28:45Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP190100975", "identifiers": ["http://purl.org/au-research/grants/arc/DP190100975", "DP190100975"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1378315"}]}, {"description": "Anxiety and depression are common during early- to mid-adulthood and a major cause of disability. Few studies track individuals over this age range or assess how their experience of anxiety/depression affects them at midlife when many of life&rsquo;s work, family and personal achievements coalesce. The PATH to Midlife project extends an existing community survey to understand the patterns of anxiety and depression from early to mid-adulthood and identify the personal, social and economic consequences.", "title": "Mental health and the PATH to Midlife", "id": "662931", "institutions": ["University of Melbourne"], "key": "http://purl.org/au-research/grants/nhmrc/1106723", "researchers": ["Prof Peter Butterworth", "Dr Richard Burns", "A/Pr Rebecca Mcketin", "Prof Kaarin Anstey", "A/Pr Timothy Slade", "A/Pr Nicolas Cherbuin", "Dr Liana Leach", "Prof Paul Mcnamee"], "status": "active", "fundingAmount": 725013.94, "fundingScheme": "Project Grants", "startDate": 2016, "endDate": 2018, "dateTimeModified": "2018-03-07T07:53:14Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["University of Melbourne"], "principalInvestigator": ["Prof Peter Butterworth"], "purl": "http://purl.org/au-research/grants/nhmrc/1106723", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1106723", "1106723"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "depression", "anxiety", "population health", "epidemiology", "social epidemiology"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/662931"}]}, {"description": "Anxiety and depression are common during early- to mid-adulthood and a major cause of disability. Few studies track individuals over this age range or assess how their experience of anxiety/depression affects them at midlife when many of life&rsquo;s work, family and personal achievements coalesce. The PATH to Midlife project extends an existing community survey to understand the patterns of anxiety and depression from early to mid-adulthood and identify the personal, social and economic consequences.", "title": "Mental health and the PATH to Midlife", "id": "1346533", "key": "http://purl.org/au-research/grants/nhmrc/GNT1106723", "researchers": ["Prof Kaarin Anstey", "Prof Peter Butterworth", "A/Pr Nicolas Cherbuin", "A/Pr Timothy Slade", "A/Pr Rebecca McKetin", "Dr Richard Burns", "Dr Liana Leach", "Prof Paul McNamee"], "institutions": null, "status": "active", "fundingAmount": 707823, "fundingScheme": "Project Grants", "startDate": 2016, "endDate": null, "dateTimeModified": "2019-06-03T04:23:26Z", "dateTimeCreated": "2018-10-03T01:49:46Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Prof Peter Butterworth"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1106723", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1106723", "GNT1106723"], "subjects": ["Public Health", "depression | anxiety | population health | epidemiology | social epidemiology"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1346533"}]}]}