{"ANU": {"name": "Linda Neaves", "link": "https://researchers.anu.edu.au/researchers/neaves-l", "colleges": "College of Science", "email": "Linda.Neaves@anu.edu.au", "phone": "", "expertise": ["Evolutionary Biology", "Animal Systematics And Taxonomy", "Plant Systematics And Taxonomy", "Evolutionary Impacts Of Climate Change", "Biogeography And Phylogeography", "Biological Adaptation", "Environmental Science And Management", "Conservation And Biodiversity", "Environmental Management", "Wildlife And Habitat Management", "Genetics", "Genomics", "Molecular Evolution", "Population Ecological And Evolutionary Genetics", "Zoology"], "interest": ["My research uses genomic tools to address a range of species management and conservation based problems for plants and animals, including species identification and discrimination, population structure and history as well as phylogenetics. I am also interested in the development of methods to obtain information from degraded samples, such as environmental DNA, herbarium and museum samples and detection of trace DNA to provide new insights into species ecology and interactionsMonitoring genetic and evolutionary changeThere are an ever-increasing number of threats to native wildlife, including increased habitat loss and fragmentation, non-native and invasive species, climate change and increased frequency of extreme conditions, all of which impact on genetic diversity. The detrimental consequences of the loss of genomic variation on persistence and the potential for evolutionary change to facilitate adaptation to changing conditions are widely recognised and form a key aspect of management strategies. However, critical baseline genetic data, particularly in adaptation to environmental change is still lacking for many species and evolutionary change may not be harnessed to its full effect in management. Using a range of approaches we are monitoring the level of genetic diversity and changes in this diversity across a range of groups, primarily mammals and birds across Australia, including several species that have been reintroduced Mulligan’s Flat Woodland Sanctuary such as eastern bettong and eastern quoll.Understanding trophic interactions between species and tracking change The conservation and restoration of Australia’s ecosystems requires and understanding of the community composition and the interactions between key taxa. Native faunal assemblages have been disrupted to varying degrees, with many taxa lost before scientific studies, which could have guided restoration, were undertaken. The direct trophic impacts of species can have flow on effects that result in alteration of assemblages and ecological succession and diet can be influenced by a range of factors, including availability, competition and predation risk, habitat fragmentation and urbanisation. However, predicting the direct trophic impacts of a reintroduction is not straightforward. This is because our understanding of ecosystem assemblages and interactions between individual species is limited, particularly for species which have been reintroduced to an area after local extinctions decades or even 100s of years ago. Thus, our understanding of the potential direct impacts of reintroduced species on other species in the ecosystem is limited.We are investigating the DNA found in scats we are investigating the diet of a range of animals, some of which have been reintroduced at Mulligan’s Flat – Goorooyarroo Nature Reserves and surrounds to understand how these animals may interact and their impacts on the plants and fungi in the reserve. We are also working on using other forms of eDNA – the DNA that all organisms shed into the environment to determine and track which species occur at the site."], "biography": "", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "plant reintroduction in a changing climate promises and perils edited by j maschinski k e haskins washington dc island press 2012 432 pp isbn 978 1 59726 831 8 32", "year": 2013, "source": "edinburgh journal of botany", "authors": [{"name": "linda neaves"}], "id": 115394524}, {"title": "a framework for maximising the capture of genetic diversity in sampling for ex situ conservation", "year": 2019, "source": "", "authors": [{"name": "linda neaves"}]}], "ANDS-Grants": []}