{"ANU": {"name": "Lindy Orthia", "link": "https://researchers.anu.edu.au/researchers/orthia-la", "colleges": "College of Arts and Social Sciences", "email": "lindy.orthia@anu.edu.au", "phone": "", "expertise": [], "interest": ["Lindy's current research interests are:the politics of knowledge, in particular the rhetorical power of Western science compared to the world's many other systems of science and knowledgeintersections of science and science communication with sociopolitical categories such as race, gender, sexual orientation, class and disabilityrepresentations of science in popular fiction and public responses to themhistories of science communication and the uses of history in public communication about science.For more current and complete information on Lindy's publications and bio, including a more up to date publications list, go to lindyorthia.com."], "biography": "Lindy completed a Bachelor of Science in Biological Sciences at La Trobe University then came to ANU to undertake honours in plant systematics, jointly with the Australian National Herbarium, CSIRO. She commenced a PhD in plant systematics but soon transferred to a PhD in science communication in 2005, graduating in 2010. Recognising much of her work took a historical approach, she undertook a Graduate Certificate in History from 2013-15. Prior to studying science, Lindy was an activist who spent much of her time researching, writing and agitating in regard to diverse political issues, working in student representative and community organisations.", "project": ["Lindy is currently editing a book with Dr Tara Roberson (UQ) entitled Queering Science Communication: Representations, Theory and Practice.", "She is also working on other projects related to her research interests, details to be updated as projects are formalised."], "publication": [{"title": "Strategies for including communication of non-Western\r\nand indigenous knowledges in science communication\r\nhistories", "year": "2020", "source": "Journal of Science Communication, 19(02): A02", "authors": ["Lindy Orthia"]}, {"title": "How does science fiction television shape fans", "year": "2019", "source": "relationships to science? Results from a survey of 575 Doctor Who viewers'Journal of Science Communication, 18(04): A08", "authors": ["Lindy Orthia"]}, {"title": "Knowledge, power and the ethics illusion: Explaining diverse viewer interpretations of the politics in classic era Doctor Who", "year": "2018", "source": "The Journal of Popular Television, vol. 60, no. 2, pp. 151-165", "authors": ["de Kauwe V", "Lindy Orthia"]}, {"title": "Vaccination communication strategies: What have we learned, and lost, in 200 years?", "year": "2017", "source": "Journal of Science Communication, vol. 16, no. 3, A08", "authors": ["McKinnon M", "Lindy Orthia"]}, {"title": "Democratizing science in the eighteenth century: Resonances between condorcet", "year": "2016", "source": "s Sketch (1795) and twenty-first century science communication'Journal of Science Communication, vol. 15, no. 4, pp. 1-11", "authors": ["Lindy Orthia"]}, {"title": "Laudably Communicating to the World", "year": "2016", "source": ": Science in Sydney's Public Culture1788-1821', Historical Records of Australian Science, vol. 27, no. 1, pp. 1-12. doi: 10.1071/HR15018", "authors": ["Lindy Orthia"]}, {"title": "What", "year": "2016", "source": "s Wrong with Talking About the Scientific Revolution? Applying Lessons from History of Science to Applied Fields of Science Studies'Minerva: A review of science, learning and policy , 54(3), 353-373. doi:10.1007/s11024-016-9299-4", "authors": ["Lindy Orthia"]}, {"title": "The Gendered Culture of Scientific Competence: A Study of Scientist Characters in Doctor Who 1963-2013", "year": "2016", "source": "Sex Roles, 75(3), 79-94. doi: 10.1007/s11199-016-0597-", "authors": ["Lindy Orthia"]}, {"title": "Communicating the Nature of Science Through The Big Bang Theory: Evidence from a Focus Group Study.", "year": "2016", "source": "International Journal of Science Education Part B, 6(2), 115-136", "authors": ["Li R", "Lindy Orthia"]}, {"title": "Popular Theatre for Science Engagement:  Audience Engagement with Human Cloning Following a Production of Caryl Churchill", "year": "2016", "source": "s A Number'International Journal of Science Education Part B, 6(1), 23-45, DOI:10.1080/21548455.2014.947349", "authors": ["Donkers M", "Lindy Orthia"]}, {"title": "Does a picture tell a thousand words?  The uses of digitally produced, multimodal pictures for communicating information about Alzheimer", "year": "2015", "source": "s disease'Public Understanding of Science, 24(6), 712-730, DOI:10.1177/0963662514533623", "authors": ["Lindy Orthia"]}, {"title": "Negotiating Public Resistance to Engagement in Science and Technology", "year": "2013", "source": "in John K Gilbert and Susan Stocklmayer (eds.), Communication and engagement with Science and Technology.  Issues and Dilemmas, Routledge Taylor & Francis Group, New York and Abingdon, pp. 74-90", "authors": ["Lindy Orthia"]}, {"title": "Doctor Who and Race", "year": "2013", "source": "Intellect LtdBristol and Chicago", "authors": ["Lindy Orthia"]}, {"title": "Savages, science, stagism and the naturalized ascendancy of the Not-We in Doctor Who", "year": "2013", "source": "in Lindy Orthia (ed.), Doctor Who and Race, Intellect Ltd, United Kingdom and United States, pp. 271-287", "authors": ["Lindy Orthia"]}, {"title": "Introduction", "year": "2013", "source": "in Lindy Orthia (ed.), Doctor Who and Race, Intellect Ltd, Bristol and Chicago, pp. 3-11", "authors": ["Lindy Orthia"]}, {"title": "Conclusion", "year": "2013", "source": "in Lindy Orthia (ed.), Doctor Who and Race, Intellect Ltd, Bristol and Chicago, pp. 291-296", "authors": ["Lindy Orthia"]}, {"title": "re people inspired by The Big Bang Theory to find out more about Science?  Results from focus group-based audience research", "year": "2013", "source": "4th Annual Popular Culture Association of Australia and New Zealand (PopCAANZ), Popular Culture Association of Australia and New Zealand (PopCAANZ), Sydney, pp. 248-258", "authors": ["Li R", "Lindy Orthia"]}, {"title": "Communicating endometriosis with young women to decrease diagnosis time", "year": "2013", "source": "Health Promotion Journal of Australia, vol. 24, no. 2, pp. 151-154", "authors": ["Lindy Orthia"]}, {"title": "Science Fiction", "year": "2012", "source": "in R. Gunstone (ed.), Encyclopedia of Science Fiction, Springer Verlag, Berlin Heidelberg", "authors": ["Lindy Orthia"]}, {"title": "Paradise is a little too green for me\":  Discourses of environmental disaster in Doctor Who 1963-2010", "year": "2011", "source": "Colloquy, vol. 21, pp. 56 - 80", "authors": ["Lindy Orthia"]}, {"title": "ntirationalist critique or fifth column of scientism? challenges from Doctor Who to the mad scientist trope", "year": "2011", "source": "Public Understanding of Science, vol. 20, no. 4, pp. 525-542", "authors": ["Lindy Orthia"]}, {"title": "Sociopathetic Abscess\" or \"Yawning Chasm\"? The Absent Postcolonial Transition in Doctor Who", "year": "2010", "source": "Journal of Commonwealth Literature, vol. 45, no. 2, pp. 207-225", "authors": ["Lindy Orthia"]}, {"title": "Enlightenment was the choice: Doctor Who and the Democratisation of Science", "year": "2010", "source": "PhD Thesis19/04/2010", "authors": ["Lindy Orthia"]}, {"title": "new species of Pultenaea (Mirbelieae: Fabaceae) from Kundip, Western Australia", "year": "2009", "source": "Nuytsia, vol. 19, no. 1, pp. 191-196", "authors": ["Lindy Orthia"]}, {"title": "Boundedness, Relationality and Evolution in Biological Systems", "year": "2006", "source": "Annual Conference of the Society for Literature, Science and Art 2006 New York", "authors": ["Lindy Orthia"]}, {"title": "Generic delimitation and phylogenetic uncertainty: an example from a group that has undergone an explosive radiation", "year": "2005", "source": "Australian Systematic Botany, vol. 18, pp. 41-47", "authors": ["Lindy Orthia"]}, {"title": "Bush peas: a rapid radiation with no support for monophyly of Pultenaea (Fabaceae: Mirbelieae)", "year": "2005", "source": "Australian Systematic Botany, vol. 18, pp. 133-147", "authors": ["Lindy Orthia"]}, {"title": "revision of Pultenaea (Fabaceae: Mirbelieae). 4. Species occurring in Western Australia", "year": "2005", "source": "Australian Systematic Botany, vol. 18, pp. 149-206", "authors": ["Lindy Orthia"]}, {"title": "Genetic comparison between Victorian and Tasmanian populations of Prasophyllum correctum D.L. Jones (Orchidaceae) suggests separate species", "year": "2003", "source": "Muelleria, vol. 18, pp. 79-87", "authors": ["Lindy Orthia"]}, {"title": "Genetic comparison of populations of the rare Gorae Leek Orchid, Prasophyllum diversiflorum Nicholls (Orchidaceae)", "year": "2003", "source": "Muelleria, vol. 18, pp. 89-97", "authors": ["Lindy Orthia"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}