{"ANU": {"name": "Liz Curran", "link": "https://researchers.anu.edu.au/researchers/curran-es", "colleges": "ANU College of Law", "email": "liz.curran@anu.edu.au", "phone": "Melbourne based", "expertise": ["Law", "Access To Justice", "Human Rights Law", "Law And Society", "Legal Institutions Incl. Courts And Justice Systems", "Legal Practice Lawyering And The Legal Profession", "Public Health And Health Services", "Policy And Administration"], "interest": ["Measuring Effectiveness and Quality Services (legal assistance services and non-legal community services)Access to JusticeMulti-disciplinary PracticeHealth and Justice Partnership Evaluation and ImpactEffective Legal PracticeYouth JusticeHuman Rights (domestic with specific interest in people with vulnerability or experiencing disadvantage)Clinical Legal EducationCommunity Legal Education (community development approach)Ethics and Legal ProfessionalismRule of Law, Participatory Democracy and Good GovernanceLegal and Policy ReformSocial Justice for Vulnerable and People Experiencing DisadvantageFamily Violence Project EvaluationRestorative Justice"], "biography": "", "project": ["", "In progress in 2021 two book Chapters:", "Chapter 12, 'Delayed Justice' with Sharon Lacy (Victorian Bar) in edited collection Controversies, Challenges and Change in Australian Courts, eds. Dr Alistair Harkness (University of New England) Marg Camilleri and Dr Rachel Hale (Federation University) Palgrave MacMillan Publisher.", "Chapter 'A role for student clinics in breaking down professional silos – practical examples' in Recent Developments in Clinical Legal Education' Eds. Assoc Professor Ben Livings & Matthew Atkinson (University of SA) Routledge UK publisher.", "Refereed Publications", "Books", "Better Law for a Better World:New Approaches to Law Practice and Education forthcoming from Routledge Uk April/May 2021. https://www.routledge.com/Better-Law-for-a-Better-World-New-Approaches-to-Law-Practice-and-Education/Curran/p/book/9780367180423", "‘A role for student clinics in breaking down professional silos – practical examples’ Chapter in Recent Developments in Clinical Legal Education (Eds.  Ben Livings & Matthew Atkinson) Routledge UK, (forthcoming 2021).", "‘Wellness and going bush’ Chapter in Wellness for Law: Making Wellness Core Business (ed. Judith  Mary Church & Adiva Sifris) with Pamela Taylor-Barnett, Reed  International Books Australia Pty Ltd (trading as “LexisNexis”) (28  November 2019). https://store.lexisnexis.com.au/products/wellness-for-law-making-wellness-core-business-skuwellness_for_law_making_wellness_core_business", "Chapter - ‘Enabling Marginalised Voices to Be Heard: The Challenge to LawReform Bodies’, New Directions for Law in Australia:Essays in Contemporary Law Reform, edited by Ron Levy, Molly O’Brien,Simon Rice, Pauline Ridge and Margaret Thornton, published 2017 by  ANU Press, The Australian National University, Canberra, Australia,  Chapter 48, 517 -  527. dx.doi.org/10.22459/NDLA.09.2017.4 https://pdfs.semanticscholar.org/ea79/af1abc0716614befde0e6bb86f54932a6835.pdf", "Global Perspectives on Human Rights: Oxford Human Rights Hub Blog (2nd Edition) edited by Laura Hilly and Richard Martin (2014-2015), Oxford University Press, 2016.  Chapter One: Access to Justice ‘Valuing the Work of Community Lawyers to Resolve Systemic Problems, 21-22 and Chapter Seven: Expression Association and Assembly ‘Racial Discrimination Act and Free Speech – Carte Blanche or Fair and Reasonable – What are Human Rights in all this?,  141-142. http://ohrh.law.ox.ac.uk/wordpress/wp-content/uploads/2014/04/9811-OxHRH-E-Book-2015-digital-single.pdf", "Articles:", "", "Other:", "'The Australian Legal Assistance Sector and the Critical Importance of Justice to Human Lives' May 2018, Oxford University, Faculty of Law, Oxford Human Rights Hub, http://ohrh.law.ox.ac.uk/the-australian-legal-assistance-sector-and-the-critical-importance-of-justice-to-human-lives/", "‘The Partnership between Health and Law to Ensure Human Rights’ (Oxford Human Rights Hub Blog, (OxHRH) 28 November 2016) http://ohrh.law.ox.ac.uk/the-partnership-between-health-and-law-to-ensure-human-rights", "'Freedom of      Speech or Enabling a Right to Insult? The Australian Debate over Section      18C of the Racial Discrimination Act 1975’ (OxHRH, 16 May 2017) http://ohrh.law.ox.ac.uk/freedom-of-speech-or-enabling-a-right-to-insult-the-australian-debate-over-section-18c-of-the-racial-discrimination-act-1975", "‘Government Response to the Productivity Commission Ignores Substance and Significance of the Problems of Access to Justice in Australia’ International Legal Aid Group, 31 October, 2016 http://internationallegalaidgroup.org/index.php/papers-publications/articles/19-government-response-to-productivity-commission-ignores-substance-and-significance-of-the-problems-for-access-to-justice-in-australia (4,392 hits as at 24 May, 2017)", "", "", "Liz was 'expert research adviser' to the Law Council of Australia's 'Justice Project' (February 2017 - August 2018). The Law Council of Australia undertook a comprehensive national review into the impediments to justice in Australia, focussing on those facing significant social and economic disadvantage in community. The Final Report was released on 23 August 2018 following a literature review and consultation process. See https://www.lawcouncil.asn.au/justice-project/final-report", "", "", "Some articles below available publically- See https://digitalcollections.anu.edu.au/advanced-search?query=Dr+Liz+Curran&sort_by=score&order=desc&rpp=10&etal=0&start=0", "", "", "and on SSRN  http://ssrn.com/author=2030109 and Google Scholar https://scholar.google.com/citations?user=U8danSwAAAAJ&hl=en&cstart=20&pagesize=20", "https://www.routledge.com/authors/i20976-liz-curran#", "", "", "", "For people who seek to use Dr Curran’s work.", "", "", "Dr Liz Curran’s Background Intellectual Property (including approaches, tools, questions and methodologies) emerge not only from her academic research, her practice experience, personal journey and teaching experience. They also emerge from the people over many years who have collaborated and shared their experiences with Dr Curran based on relationships of trust and courage.  For people wishing to use her Background IP Dr Curran requires a limited license agreement tominimise misuse. Not- for-profitsagencies can contact Dr Curran for the details of how these tools and approaches might be made available, but otherwise she does not make her specific tools and methods available publicy to protect their integrity. People using her work (some of which she has selectively shared with not-for profit agencies, policy makers and on SSRN) are asked to acknowledge it as a mark of respect, as an honouring of her work over many decades and the contributions of those to it who have trusted her to share their insights. This acknowledgement also ensures the authenticity of those who seek to use her work as a basis for their own.", "Liz was Visiting Fellows at the University of Portsmouth and Nottingham Trent University UK from 1 March 2020-mid July 2020 and  Keynote Guest Speaker at a CLEAR Conference planned in June 2020 on Research Impact.", "Liz has been commisioned on behalf of ANU to provide the following research & evaluations:", "December, 2019-2020", "Research Grant: Co-production of end-of-life care research together with consumers and carers, Scheme: The Australian National University Global Research Partnerships Scheme.", "Collaborators: Brett Scholz (ANU Medical School), Sydney Dy (Bloomberg School of Public Health, Johns Hopkins University), Alan Bevan (Carer and Community Representative), Matt Austin (Armstrong Institute for Patient Safety and Quality, Johns Hopkins University), Ekavi Georgousopoulou (ANU Medical School), Liz Curran (ANU College of Law), Vinh Lu (ANU College of Business and Economics), Imogen Mitchell (ANU Medical School).", "December 2018 - 2021", "Stage 2: Research Evaluation for Upper Murray Care (auspicing the Hume Riverina  Community Legal Centre), 'Invisible Hurdles - better outcomes for young  people experiencing family violence'  - multi-disciplinary practice  (with Pamela Taylor-Barnett, ANU) -community development & system reform phase.", "September 2017 – 2019", "Evaluation for The Consumer Action Law Centre ‘Responding Effectively to Family Violence Dimensions of Debt and Credit through Secondary Consultations & Training with Community Workers.’ See below for report published November 2017", "2015 - 2018", "Research Evaluation for Upper Murray Care (auspicing the Hume Riverina Community Legal Centre), 'Invisible Hurdles - better outcomes for young people experiencing family violence'  - multi-disciplinary practice (with Pamela Taylor-Barnett, ANU). See below Report published November 2018", "2014 - 2016", "Research Evaluation of the Health Justice Partnership in Bendigo a joint project of ARC Justice and Bendigo Community Health Service for ARC Justice.", "Final Research and Evaluation Report, 2016 (See below for Final Report published end 2017)", "July 2014- end May 2015", "Research Evaluation of the Loddon Campaspe Community Legal Centre Family Violence Project (Report published May 2015) for ARC Justice Ltd.", "External Consultancies/Adviser Roles:", "2020-2021", "Through  Curran Consulting: Enhancing Justice & Human Rights she is conducting a reseach evaluation of the Women's Crisis Navigator Project for the Hammsersmith Fulham Law Centre in London, UK.", "2018", "Adviser (pro bono), Steering Group, University of South Australia pilot Interdisciplinary Student Clinic since May 2018", "2017-2018", "Expert Adviser, Law Council of Australia's 'Justice Project' See https://www.lawcouncil.asn.au/justice-project", "2016 - 2019", "Adviser (pro bono) Portsmouth University, UK on a trial student interdisciplinary student clinic research & evaluation", "2014 - 2017", "Adviser to the Legal Services Board Victoria on   Consistent Benchmarking for Health Justice Partnership evaluation for   LSB Funded Projects.", "2013 - current", "Adviser (pro bono) Belle Ville Community Advocacy & Legal Centre, Ontario, Canada", "December 2015- December 2019", "Adviser (consultancy) Evaluation of Legal Secondary Consultation  Project. (Halton Community Legal Services & Community Advocacy and  Legal Centre, Ontario, Canada)", "2015 - 2016", "Advice on the Aboriginal Health Justice Partnership Evaluation for  the Redfern Community Legal Service's Indigenous Legal Clinic at the  Royal Prince Alfred Hospital in Sydney (pro bono)", "2015- 2016", "Advising Law Clinics, Ontario, Canada on Health Justice Partnership Start-ups", "2015", "Adviser (pro bono) on their evaluation Evaluation of the Community West's Mortgage Wellbeing Service withdrew December 2015.", "2011- ongoing", "Grants assessor, Victorian Legal Services Board & Commissioner", "-----------------------------------", "Reports Authored by Dr Curran", "'From Fragmented to Holistic: Starting the evidence base the client centred practice through a navigator.' A report on the research evaluation of the Hammersmith Fulham Law Centre’s, ‘Women’s Crisis Navigator Service Project’ Pilot (forthcoming April 2021).", "'Getting out of Debt: The Road to Recovery for Victim Survivors of Family Violence' ANU for Consumer Action Law Centre (January 2020). Available at SSRN: https://ssrn.com/abstract=3512672", "'Overcoming the Invisible Hurdles to Justice for Young People: A Final Research and Evaluation Report of the Invisible Hurdles Project (Health Justice Partnership) with Pamela Taylor Barnett, November 2018. http://www.hrcls.org.au/wp-content/uploads/2018/11/DESIGNED_Full-final-Report_October_20181102.pdf", "First Research and Evaluation Report Phase One Consumer Action Law Centre Project - ‘Responding Effectively to Family Violence Dimensions of Debt and Credit through Secondary Consultations & Training with Community Professionals, commissioned by the Consumer Action Law Centre, 30 November 2017, Victorian State Government, Justice and Regulation.", "https://workers.consumeraction.org.au/wp-content/uploads/sites/12/2017/12/Final-CALC-FV-Research-Evaluation-Report-Phase-One-29-November-2017.pdf", "A Research and Evaluation Report for the Bendigo Health–Justice Partnership: A Partnership between Loddon Campaspe Community Legal Centre and Bendigo Community Health Services (October 31, 2016 published 22 November 2017, ANU & ARC Justice Bendigo Ltd. Available at SSRN: https://ssrn.com/abstract=3076407 Or http://lcclc.org.au/wp-content/uploads/2017/11/HJP-full-and-final-report.pdf", "Katia Sanderson, Lachlan Edwards, Jillian Williams of Consumer Action Law Centre and Dr Liz Curran, Australian National University, School of Legal Practice, ‘Second Evaluation Report of Consumer Action Law Centre’s Worker Advice Service -A Legal Secondary Consultation Service to Community sector professionals: One year on’ 18 October 2017, https://workers.consumeraction.org.au/wp-content/uploads/sites/12/2017/11/171018-Evaluation-Report-Worker-Advice-Service-final.pdf", "S Ball, C Wong (Victorian Legal Service Board (LSB)) & L Curran ,  Facilitator and Adviser for Health Justice Partnerships for LSB, 'Health  Justice Partnerships Development Report', 2016 http://www.lsbc.vic.gov.au/documents/Report-Health_Justice_Partnership_Development-2016.PDF", "L Curran, T Willcox & Jillian Williams, 'Evaluating Consumer Action's Worker Advice Service', June 2016.", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2835377", "Curran, L (2015) 'Why Didn't You Ask?' - Evaluation of the Family Violence Project of Loddon Campaspe Community Legal Community Legal Centre, ANU,  http://lcclc.org.au/wp-content/uploads/2015/05/Final-Evaluation-Report-LSB-Family-Violence-Curran-14-May-2015.pdf", "‘Encouraging Good Practice in Measuring Effectiveness in  the Legal Service Sector’, May 2013  http://www.naclc.org.au/resources/final_version_measurementreport_gb_lc_reformatted_sf_21.5.13_1.pdf", "or http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2395031", "http://consumeraction.org.au/report-encouraging-good-practice-in-measuring-effectiveness-in-the-legal-service-sector/", "’Solving Legal Problems: A strategic approach’, March, 2013   http://consumeraction.org.au/new-report-solving-problems-a-strategic-approach/", "or http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2297705", "-------------", "Liz has been referred to and cited heavily with some recommendations adopted in recent reports on access to justice and human rights including but not limited to:", "Review of Contiuning Professional Development to the Victorian Legal Services Board and Commission, 30 June 2020. https://lsbc.vic.gov.au/sites/default/files/2020-11/CPD_Report_Final_0.pdf", "https://myviews.justice.vic.gov.au/application/files/1914/7554/7818/Access_to_Justice_Review_-_Report_and_recommendations_Volume_2.PDF", "Curran Cited Vol 2 at 372 and 422", "https://myviews.justice.vic.gov.au/application/files/2414/7554/7522/Access_to_Justice_Review_-_Report_and_recommendations_Volume_1.PDF", "(Curran Cited Vol 1, Curran on pages 70, 180, 169, 165, 155)", "The Final Report of the  Government Review of the Human Rights Charter in Victoria (September 2015 -17 Times).", "https://myviews.justice.vic.gov.au/2015-review-of-the-charter-of-human-rights", "The Productiviy Commission Full  Final Report (Vol 1 & 2) on Access to Justice Arrangements (September 2014 - at least 30 times)", "http://www.pc.gov.au/inquiries/completed/access-justice/report", "The Allen Consulting Review for the Commonwealth Attorney Ceneral's Department (July 2014 - at least seven times in each of the draft, interim and final reports)", "http://www.acilallen.com.au/projects/23/justice/126/review-of-the-national-partnership-agreement-on-legal-assistance-services/", "-----------------", "Other Reports:", "‘I Can See Now there’s Light at the End of the Tunnel’ Legal Aid ACT: Demonstrating and Ensuring Quality Service to Clients, Curran Consulting: Enhancing Justice & Human Rights and Legal Aid ACT, 2012.", "Making the Legal System More Responsive to Community: A Report on the Impact of Victorian Community Legal Centre Law Reform Initiatives. Research and Report (2007) funded by the Reichstein Foundation. ISBN 978 – 0-646-47603-2", "Ensuring Justice and Enhancing Justice: A Report on Improving Legal Aid Service Delivery to Reach Vulnerable and Disadvantaged People. Research and report funded partly by the Victorian Law Foundation (2007) ISBN 978-1-86446-585-3", "Literature Review for the Commonwealth Attorney General’s Department (by Curran Consulting: Enhancing Justice & Human Rights and) in February 2012 to inform a Review of the National Partnership of Legal Assistance Services. These services include Legal Aid Commissions, Aboriginal and Torres Strait Islander Legal Services, Family Violence and Prevention Services and Community Legal Centres. This Literature Review was made available by the Department on its web site.", "-------", "Limited licenses of Background IP including instruments of measurement and questions (subject to attribution) to:", "Consumer Action Law Centre", "Loddon Campaspe Community Legal Service (a Program of ARC Justice Ltd Bendigo)", "Hume Riverina Community Legal Service (a Program of Upper Murray Family Care)", "Refugee Law", "Mortgage Wellbeing Service", "Therapeutic Justice Program, Goulburn Valley Community Legal Centre", "Legal Services Board", "Redfern Legal Service and the Royal Prince Alfred Hospital", "Halton Community Legal Services, Ontario, Canada", "Portsmouth University Schools of Law and Nursing", "Community Advocacy and Legal Centre, Canada", "Legal Aid ACT", "WELMA Centre, initiation of a pilot clinical legal education project in a cancer ward, Faculty of Law, University of Copenhagen", "Women’s Legal Service Victoria", "Welfare Rights Victoria", "International & National Conferences:", "2020", "‘Measuring Impact through Research into Access to Justice Service Delivery and Legal Education Initiatives’, International Conference UK, Centre for Legal Education Nottingham Trent University 10 &11 June 2020.", "Seminar 'Impact Measurement: The vexed issue and how to do it ethically and well'  Nottingham Law School, Nottingham Trent University, I July 2020", "'Measuring Impact: Operationalising Evaluation and its critical  importance in determining effectiveness and quality and building the  evidence base on the impact of clinical work for clients, communities,  students and the profession’ Law Society of Ireland & International Journal of Clinical Legal Education, Dublin 13- 15 July 2020. Cancelled due to Covid 19.", "Keynote Speaker, Federation of Community Legal Centres Community Legal Education Forum 'Giving Voice to Values' Framework to Navigate Complex Ethical Dilemmas', 10 November, 2020", "2019:", "Academic International Conference on Interdisciplinary Legal Studies,  6-8 March 2019 Oxford, UK ‘Integrated justice practice- Reaching the  Excluded, Informing and Shaping Client Centred Practice and Enabling  Interdisciplinary Practice to advance Human Rights: New evidence- based  approaches’  FLE Learning Network.", "Wellbeing in the Law Forum, University of Melbourne, 14- 15 February 2019 'Wellbeing in the Bush' led by Pamela Taylor-Barnett", "2018", "‘Learning from empirical research on effective legal practice’ International Journal of Clinical Legal Education Conference in Melbourne, 28- 30 November 2018", "'Thinking outside the square making the Rule of Law happen in ways that are ethical and accessible for people and their professional supporters,' USA National Institute for Teaching Ethics & Professionalism Fall 2018 Workshop Melbourne, Australia", "International Legal Ethics Conference, 6-8 December 2018, ‘The Centrality of Client Care as a Critical Underpinning in Ethical Legal Practice’", "‘Thinking outside the square making the Rule of Law Happen: in ways that are ethical and accessible for people and their professional supporters’ Workshop USA National Institute for Teaching Ethics & Professionalism, December 2018.", "Invited as Expert 9 November 2018 of University of Sydney Law School & Macquarie University to speak on 'Measuring Policy Impact Research,' Sydney Law School.", "In her joint capacity of ANU & Senior Fellow of Nottingham Trent University, School of Law Liz ran three workshops in the United Kingdom hosted by the Centre for Legal Education with the guiding theme of ‘New Approaches to Lawyering to Better Respond to Community’ with participants from across the United Kingdom as follows:", "‘Building Collaborations Locally - Applying A Health Justice Partnerships Model to Law Clinics’, 20 June 2018", "‘Alternative Ways to Approach Legal Problem Solving and Disputes to The Adversarial Process to Seek Justice’, 25 June 2018 (Jointly hosted CLE &Nottingham Centre for Children, Young People and Families)", "‘New Approaches to Lawyering and The Implications for Legal Education: Equipping Our Students to Meet the Changing World’27 June 2018", "‘How to better prepare students for the often chaotic and fragmented nature of practice and strategies with a focus on interdisciplinary approaches that might enable them to develop insight –Interactive,’ Australian Clinical Legal Education Symposium, 5-6 April 2018.", "With Ryder, Isobel and Strevens SFHEA, Caroline, 'An Interdisciplinary Student Clinic at University of  Portsmouth (UoP): Future Practitioners Working Collaboratively to  Improve Health and Wellbeing of Clients' International Journal of Clinical legal Education ad European Clinical legal Educatio Network Conference, (Presentation Slides) (July 5,  2017) available at SSRN: https://ssrn.com/abstract=2997597", "Seminar Thursday 10 November 2016 ‘Reaching those most in need and those currently excluded from legal help: Health Justice Partnerships’ and Workshop Friday 11 November 2016 ‘Measuring Impact and evaluation – how and why? and some tips’, 10 – 11 November 2016 Law Centres UK National Conference http://www.lawcentres.org.uk/training-and-events/year:2016/month:10/event:challenging-injustice-rebalancing-the-scales-lcn-national-conference-and-agm-2016", "‘Improving access to justice through multi-disciplinary practices': Health Justice Partnerships’ Date: Tuesday 22 November 2016 Time: 5 pm – 7 pm. Location: Lecture Theatre 8, Newton building, Main Entrance, Nottingham Trent University", "", "http://www4.ntu.ac.uk/apps/events/15/home.aspx/event/189681/default/seminar_by_visiting_scholar_liz_curran", "", "Key Note Speaker Nottingham Law Centre Annual General Meeting, 28 November 2016- ‘Challenges world-wide for Access to Justice for the most vulnerable and disadvantaged in times of austerity’", "“Realizing the Right to Health for the Most Disadvantaged– Health Justice Partnerships \", Seminar/workshop for the Oxford Human Rights Hub, Law Faculty, Oxford University, 1 November 2016.", "‘Realizing the right to health and access to justice for the most disadvantaged – Health Justice Partnerships,’ A seminar for Copenhagen University (Law Faculty and WELMA (Centre for Legal Studies in Welfare and Market) 14 October, 2016, Copenhagen", "‘Access to Justice, Effective and Impact Lawyering and Health Justice Partnerships,’ Presentation organised by the Legal Action Group Policy Advisory Group. Monday 19th September 2016 at 5.30 in the National Pro Bono Centre, Chancery Lane, London, UK", "‘International Lessons on Health Justice Partnerships: their applicability for pro bono partners and managers,’ Panel Presentation, ‘Ukademy’ (‘UKademy’ is the UK Collaborative Plan for Pro Bono, with planning support from the Association of Pro Bono Counsel. Includes lawyers and managers employed by law firms who coordinate law firm pro bono programmes across the UK) Wednesday 14 September 2016 at Shearman and Sterling, Spitalfields, London UK.", "‘Health Justice Partnerships (HJP): Working ethically to reach those in most need of legal and medical support & to improve outcomes – research evidence,’ Seminar for City, University of London (Law School) 13 September, 2016, London, UK (event streamed: https://www.city.ac.uk/law/research/centre-for-the-study-of-legal-professional-practice/events/_recache)", "‘Health Justice Partnerships (HJP) Research, Evaluations and Findings, and ‘how to,’ Presentation for the Legal Education Foundation UK & Allen & Overy, 12 September 2016, London, UK.", "‘Health Justice Partnerships Research & Start-up Suggestions,’ Presentation to the China EU High Level Legal Aid Policy Dialogue Meeting, Beijing, 1-2 September, 2016, In absencia, kindly delivered by Simon Rice, ANU.", "‘Health Justice Partnership - Multi-Disciplinary Practices Research Evidencing Working Ethically to Ensure Reach to Those in Most Need & Improve Outcomes,’ Conference Paper, 14 July 2016, International Legal Ethics Conference (ILEC) VII, Stein Centre, Fordham University, NYC, USA.", "‘Increasing access to justice – exploring a new lawyering paradigm through clinical education and reflective practice,’ Symposia International Journal of Clinical Legal Education & Association for Canadian Clinical Legal Education Conference, University of Toronto (with Michele Leering, Queen’s University, Canada; Chris Casey and Professor Mary Anne Noone; La Trobe University, Australia).", "‘Health Justice Partnership Research, Start-Up Support and Evaluation Workshop’ Community, Advocacy and Legal Centre, Belleville, Ontario, Canada, 7 July 2016", "Justice and Health and Systemic Reforms for Better Health, Outcomes, Workshop for Justice Health Networks, 80 Bond Street, Toronto, Canada, 5 July 2016", "'Law Reform: Practical effective, inclusive processes and approaches that lead to responsive, connected policy by enabling voices to be heard.' National Law Reform Conference April 2016, Australian National University and University of Canberra, ANU, Canberra, April 2016.", "2015", "The Under-rated Value of Secondary Consultations in reaching clients with vulnerability or experiencing Disadvantage, National Conference of Community Legal Centres Conference, Melbourne 28 August 2015", "'Holistic approaches to reaching and assisting clients experiencing vulnerability or disadvantage - Health Justice Partnerships in Australia and beyond – with a focus on the emerging value of secondary consultations’ International Legal Aid Group Conference in Edinburgh June 2015", "'Access to Justice – Making it come alive and a reality for students and practitioner/teachers' Centre for Legal Education Trent University Nottingham UK, June 2015", "2014", "Evaluating Advocacy Health Alliances- the Challenges’, Growing Health Justice Partnerships Forum in the NSW, Department of Premier and Cabinet, 30 September 2014", "‘CLCs Having an Impact on Lives -Strategic Approaches to Problem Solving’,National Conference of Community Legal Centres Alice Springs, Friday 15 August 2014", "With Vivienne Holmes, ‘Developing Students’ Capacity to Cope with Ethical Dilemmas in Legal Practice Through Teaching ‘Giving Voice to Values’ Techniques’, International Legal Ethics Conference, London, 10-12 July 2014", "Building capacity to cope with ethical dilemmas in legal practice through teaching ‘giving voice to values’ , Panel , International Legal Ethics Conference, London, 10-12 July 2014", "2013", "With A Crockett, 'A Practical model for Demonstrating and ensuring quality legal aid service: A Case study in Applied Research', International Legal Aid Group, The Hague, June 2013 http://www.ilagnet.org/jscripts/tiny_mce/plugins/filemanager/files/The_Hague_2013/Session_Papers/Session_3_-_Liz_Curran_and_Andrew_Crockett.pdf", "With T Foley, 'Ensuring and Assessing Quality in Clinic- An exploration of two quality measures- a good client interview and quality community legal education, International Journal of Clinical Legal Education Conference and the 12th Australian Clinical Legal Education Conference, Brisbane, July, 2013.", "---------", "Policy Submissions:", "Submission to the Review of Contiuning Professional Development to the Victorian Legal Services Board and Commission, 30 June 2020. https://lsbc.vic.gov.au/resources/cpd-review-curran-dr-liz", "Submission to the Australian Human Rights Commission, 'Improved Human Rights Protection for Australia' 3 November, 2019.", "Submission to the Productivity Comimission on Indigenous Evaluation Framework, July 2019", "Joint Submission with Legal Ethics Teachers to the Victorian Royal Commission into the Management of Police Informants, March 2019.", "Submission to Urbis on the Attorney General Deaprtment's Review of the National Partnership Agreement, 2018.", "Submission to the ‘Inquiry into the Commonwealth Redress Scheme for Institutional Child Sexual Abuse Bill 2017 and Related Bill’, Senate Standing Committee on Community Affairs, Legislative Committee, 14 March 2018 (confidential)", "Submission to the Australian Law Reform Commission Review of the Family Law Act, 19 January 2018", "Submission Oral and Written to the Department of Justice ‘Access to Justice Review, 29 January 2016", "Submission to the Government Review of the Charter of Rights and Responsibilities, May 2015", "Submission to the Royal Commission into Family Violence, May 2015", "Oral submission Submission April 2014 to the  Productivity Commission Inquiry into Access to Justice Frameworks in  Australia. Recorded in Hansard.", "Submissions Response to the  Productivity Commission Inquiry into Access to Justice Frameworks in  Australia Draft t Report, February 2014.", "Submissions Part B, November, 2013 and Part B, November 2013 to the  Productivity Commission Inquiry into Access to Justice Frameworks in  Australia.", "", "Submissions Part A, October 2013 and Part B, November 2013 to the Productivity Commission Inquiry into Access to Justice Frameworks in Australia.", "Submission, Senate Committe Inquiry Into Justice Reinvestment, 2013.", "'Submission on Youth Justice System, Department of Justice Legal Workshop, ANU College of Law to the Victorian Government', 2012.", "Other Consultancies", "2013", "Family Violence and Prevention Programs, 2012-2013, Effective Change", "2011 and 2012", "Advising the Commonwealth Government Attorney General’s Department on Legal Assistance Service Quality and Outcomes", "Demonstrating and Ensuring Quality Service to Clients Evaluation, Legal Aid ACT", "-----------"], "publication": [{"title": "", "year": "2020", "source": "Getting Out of Debt: The Road to Recovery for Victim/Survivors of Family Violence", "authors": ["Liz Curran"]}, {"title": "Giving Voice to Values Ethics Education Legal Educators", "year": "2020", "source": "Association of Law Teachers UK Connecting Legal Education, ALT 2020,  United Kingdom (as Visiting Academic', University of Portsmouth)", "authors": ["Liz Curran"]}, {"title": "Interdisciplinary Learning Opportunities for Clinical Students  and Teachers - A Case Study Shared", "year": "2020", "source": "Australian Journal of Clinical Education, vol. 6, no. 1, pp. 1-13", "authors": ["Ferrar K", "Liz Curran", "Atkinson M"]}, {"title": "Evaluating projects in multifaceted and marginalised communities: The need for mixed approaches", "year": "2019", "source": "Evaluation Journal of Australasia, vol. 19, no. 1, pp. 22-38", "authors": ["Liz Curran", "Taylor-Barnett P"]}, {"title": "The Australian Legal Assistance Sector and the Critical Importance of Justice to Human Lives", "year": "2018", "source": "", "authors": ["Liz Curran"]}, {"title": "Talk tough", "year": "2018", "source": "call a review- and then do nothingp. 17", "authors": ["Liz Curran"]}, {"title": "Look at the Evidence", "year": "2018", "source": "p. 2", "authors": ["Liz Curran"]}, {"title": "Submission to Australian Law Reform Commission Review of the family Law System 15 November 2017", "year": "2017", "source": "", "authors": ["Liz Curran"]}, {"title": "", "year": "2016", "source": "A Research and Evaluation Report for the Bendigo Health-Justice Partnership: A partnership between Loddon Campaspe Community Legal Centre and Bendigo Community Health Services", "authors": ["Liz Curran"]}, {"title": "Social Justice: Making it come alive for future, ethical practitioners", "year": "2019", "source": "Nottingham Law Journal, vol. 27, no. 2, pp. 33-47", "authors": ["Liz Curran"]}, {"title": "Integrated Justice Practice-Reaching the Excluded, Informing and Shaping Client Centred Practice and Enabling Interdisciplinary Practice to Advance Human Rights: New Evidence-Based Approaches.", "year": "2019", "source": "8th International Conference on Business, Economics, Management and Marketing-ICBEMM 10 International Academic Conference on Interdisciplinary Legal Studies-AICILS 2019, File Learning, Oxford, United Kingdom", "authors": ["Liz Curran"]}, {"title": "", "year": "2019", "source": "The adequacy of legal ethics education in Victoria and elsewhere in Australia", "authors": ["Liz Curran", "Evans A", "Foley T"]}, {"title": "Sharing elements of effective practice to address earlier signs of family violence", "year": "2019", "source": "Alternative Law Journal, vol. Online, pp. 1-9", "authors": ["Liz Curran"]}, {"title": "Lessons for the Future: the Australian Royal Commission into Institutional Childhood Abuse", "year": "2018", "source": "pp. 19-20", "authors": ["Liz Curran"]}, {"title": "", "year": "2018", "source": "Overcoming the Invisible Hurdles to Justice for Young People", "authors": ["Liz Curran", "Taylor-Barnett P"]}, {"title": "Educating future practitioners through an Interdisciplinary Student Clinic", "year": "2018", "source": "International Journal of Clinical Legal Education, vol. 25, no. 1, pp. 4-34", "authors": ["Liz Curran", "Ryder I", "Strevens C"]}, {"title": "", "year": "2017", "source": "Second Evaluation Report of Consumer Action Law Centres Worker Advice Service -A Legal Secondary Consultation Service to Community sector professionals: One year on", "authors": ["Liz Curran", "Sanderson K", "Edwards L"]}, {"title": "", "year": "2017", "source": "Responding Effectively to Family Violence Dimensions of Debt and Credit through Secondary Consultations & Training with Community Professionals", "authors": ["Liz Curran"]}, {"title": "Reflecting on Community Development Practices: Improving Access to Justice by Working with Communities to Effect Change", "year": "2017", "source": "Flinders Law Journal, vol. 19, no. 1, pp. 37-88", "authors": ["Liz Curran", "Vernon A", "Taylor-Barnett P"]}, {"title": "Lawyer Secondary Consultations: improving access to justice: reaching clients otherwise excluded through professional support in a multi-disciplinary practice", "year": "2017", "source": "Journal of Social Inclusion, vol. 8, no. 1, pp. 46-77", "authors": ["Liz Curran"]}, {"title": "Multi-Disciplinary Practice Health Justice Partnerships - Working Ethically to Ensure Reach to the Most in Need", "year": "2017", "source": "Nottingham Law Journal, vol. 26, pp. 11-36", "authors": ["Liz Curran"]}, {"title": "Reflections on Practice and Recent Research to Enable Future Practitioners to Learn About Working Collaboratively Across Disciplines to Better Help the Community", "year": "2017", "source": "Journal of Commonwealth Law and Legal Education, vol. 12, no. 1, pp. 46-64", "authors": ["Liz Curran"]}, {"title": "Submission to the Royal Commission into the Protection and Detention of Children in the Northern Territory, 6 January 2017", "year": "2017", "source": "", "authors": ["Liz Curran"]}, {"title": "Enabling Marginalised Voices to Be Heard: The Challenge to Law Reform Bodies", "year": "2017", "source": "in Ron Levy, Molly O'Brien, Simon Rice, Pauline Ridge and Margaret Thornton (ed.), New Directions for Law in Australia: Essays in Contemporary Law Reform, ANU Press, Canberra, pp. 517-527", "authors": ["Liz Curran"]}, {"title": "Freedom of Speech or Enabling a Right to Insult? The Australian Debate over Section 18C of the Racial Discrimination Act 1975", "year": "2017", "source": "pp. -", "authors": ["Liz Curran"]}, {"title": "", "year": "2017", "source": "Leaders Failing to Lead.\r\nhttps://www.pressreader.com/australia/the-saturday-paper/20170610/281702614691648", "authors": ["Liz Curran"]}, {"title": "n interdisciplinary student clinic at the University of Portsmouth: Future Practitioners working collaboratively to improve health and well being of clients", "year": "2017", "source": "International Journal of Clinical Legal Education & European Clinical Legal Education Network Conferencehttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=299759", "authors": ["Liz Curran", "Ryder I", "Strevens C"]}, {"title": "Increasing access to justice - exploring a new lawyering paradigm through clinical education and reflective practice", "year": "2016", "source": "Joint Conference of the International Journal of Clinical Legal Education and the Association for Canadian Clinical Legal Education IJCLE 2016, University of Toronto, Toronto", "authors": ["Leering M", "Liz Curran", "Casey C"]}, {"title": "Measuring the impact, quality and effectiveness of legal assistance services in a climate of reduced funding and increased government expectations: the Australian experience", "year": "2016", "source": "European Journal of Current Legal Issues, vol. 22, no. 3", "authors": ["Liz Curran", "Crockett A"]}, {"title": "", "year": "2016", "source": "A Research and Evaluation Report for the Bendigo Health Justice Partnership: A partnership between ARC Justice Ltd & Bendigo Community Health Service", "authors": ["Liz Curran"]}, {"title": "SEMINAR -", "year": "2016", "source": "Health Justice Partnerships: the evidence and a case for policy settings in Tasmania''", "authors": ["Liz Curran"]}, {"title": "nightmare narrative on Nauru", "year": "2016", "source": "p. 1", "authors": ["Liz Curran"]}, {"title": "BLOG - The Partnership between Health and Law to Ensure Human Rights", "year": "2016", "source": "", "authors": ["Liz Curran"]}, {"title": "Human Rights and Realizing the Right to Health for the Most Disadvantaged -Health Justice Partnerships (Presentation Slides)", "year": "2016", "source": "Seminar/Workshop for the Oxford Human Rights Hub, Oxford University, Oxford, UK, pp. 31pp", "authors": ["Liz Curran"]}, {"title": "Government Response to the Productivity Commission Ignores Substance and Significance of the Problems of Access to Justice in Australia", "year": "2016", "source": "pp. 1-4pp", "authors": ["Liz Curran"]}, {"title": "PRESENTATION - Health Justice Partnerships: the evidence and a case for policy settings in Tasmania, 16 December 2016", "year": "2016", "source": "", "authors": ["Liz Curran"]}, {"title": "SEMINAR - Improving access to justice through multi-disciplinary practices", "year": "2016", "source": ": Health Justice Partnerships'", "authors": ["Liz Curran"]}, {"title": "PRESENTATION - Reaching People Currently Excluded by Improving Access to Justice Through Multi-Disciplinary Practices: Health Justice Partnerships - Recent Research Findings (Presentation Slides)", "year": "2016", "source": "", "authors": ["Liz Curran"]}, {"title": "Reaching People Currently Excluded by Improving Access to Justice Through Multi-Disciplinary Practicesâ€™: Health Justice Partnerships - Recent Research Findings", "year": "2016", "source": "Law Centres Network UK National Conference, Conference Organising Committee, United Kingdom, pp. 34pp", "authors": ["Liz Curran"]}, {"title": "", "year": "2016", "source": "Health-Justice Partnership Development Report 2016", "authors": ["Ball S", "Wong C", "Liz Curran"]}, {"title": "Health Justice Partnership Research, Start-Up Support and Evaluation Workshop", "year": "2016", "source": "Advocacy and Legal Centre, Health and Justice Partnerships, Australia", "authors": ["Liz Curran"]}, {"title": "Health and Justice Partnerships (HJP) Working ethically to reach those in most need of legal and medical support & to improve outcomes", "year": "2016", "source": "Health and Justice Partnership, University of London, London", "authors": ["Liz Curran"]}, {"title": "Justice and Health and Systemic Reforms for Better Health Outcomes", "year": "2016", "source": "Workshop for Justice Health Networks, St. Michael's Hospital, Toronto", "authors": ["Liz Curran"]}, {"title": "ccess to Justice - Effective and Impact Lawyering and Health Justice Partnerships", "year": "2016", "source": "Access to Justice, Health and Justice Partnerships, London, United Kingdom", "authors": ["Liz Curran"]}, {"title": "Evaluating Consumer Action", "year": "2016", "source": "s worker advice service", "authors": ["Wilcox T", "Williams J", "Liz Curran"]}, {"title": "Health Justice Partnership - Multi-Disciplinary Practices: Research Evidencing Working Ethically to Ensure Reach to Those in Most Need & Improve Outcomes", "year": "2016", "source": "International Legal Ethics Conference VII. ILEC 2016, Fordham University Press, New York, USA", "authors": ["Liz Curran"]}, {"title": "Health Justice Partnership Research, Start-Up Support and Evaluation Workshop - Halton", "year": "2016", "source": "HJP - Start up Support and Evaluation, Health and Justice Partnerships, Australia", "authors": ["Liz Curran"]}, {"title": "", "year": "2016", "source": "Health Justice Partnerships Legal Service Board Grants Program Video", "authors": ["Liz Curran"]}, {"title": "Practical, effective, inclusive processes and approaches that lead to responsive, connected policy by enabling voices to be heard", "year": "2016", "source": "The National Law Reform Conference 2016, ANU Press, Canberra", "authors": ["Liz Curran"]}, {"title": "Health Justice Partnerships (HJP) Research, Evaluations and Findings, and", "year": "2016", "source": "How To''Health and Justice Partnership, University of London, London", "authors": ["Liz Curran"]}, {"title": "International Lessons on Health Justice Partnerships: their applicability for pro bono partners and managers", "year": "2016", "source": "International Lessons on Health Justice Partnerships, Association of Pro Bono Counsel, London, United Kingdom, pp. 28pp", "authors": ["Liz Curran"]}, {"title": "Realizing the right to health and access to justice for the most disadvantaged - Health Justice Partnerships", "year": "2016", "source": "Centre for Legal Studies in Welfare and Market, University of Copenhagen, Copenhagen, Denmark", "authors": ["Liz Curran"]}, {"title": "Health Justice Partnerships Research & Start-up Suggestions", "year": "2015", "source": "China EU High Level Legal Aid Policy Dialogue Meeting, Health and Justice Partnerships, TBC", "authors": ["Liz Curran"]}, {"title": "Creating the Right Spaces: Civil Participation and Social Inclusion", "year": "2010", "source": "A Report on West Heidelberg Residents' Conflict Management Workshops", "authors": ["Vernon A", "Liz Curran"]}, {"title": "Holistic approaches to reaching and assisting clients experiencing vulnerability or disadvantage - Health Justice Partnerships in Australia and beyond - with a focus on the emerging value of secondary consultations", "year": "2015", "source": "International Legal Aid Group Conference, The International Legal Aid Group (ILAG), Scotland, pp. 22pp", "authors": ["Liz Curran"]}, {"title": "REPORT - Valuing the Work of Community Lawyers to Resolve Systemic Problems-The Productivity Commission Report on Access to Justice Arrangements in Australia", "year": "2015", "source": "", "authors": ["Liz Curran"]}, {"title": "Why Didn", "year": "2015", "source": "t You Ask?' - Evaluation of the Family Violence Project of Loddon Campaspe Community Legal Community Legal Centre", "authors": ["Liz Curran"]}, {"title": "Breaking down barriers", "year": "2015", "source": "Law Institute Journal, vol. 89, no. 7, pp. 34-34", "authors": ["Liz Curran"]}, {"title": "Medical-Legal Partnership: Prevention, Access to Justice and the Next Generation of Legal and Healthcare Professionals", "year": "2015", "source": "Australiasian Law Teachers Association Conference 2015, Legal Education and Access to Justice, Conference Organising Committee, Melbourne, Victoria", "authors": ["Liz Curran"]}, {"title": "CLCs Having an Impact on Lives: Strategic Approaches to Problem Solving", "year": "2015", "source": "National Conference of Community Legal Centres, National Association of Community Legal Centres, Sydney", "authors": ["Liz Curran"]}, {"title": "Health justice partnerships and systemic justice opportunities emerging", "year": "2015", "source": "Justice Connections Symposium 4, Conference Organising Committee, Canberra, Australia", "authors": ["Liz Curran"]}, {"title": "Partnerships in Healthcare Delivery: Health Justice Partnerships", "year": "2015", "source": "Victorian Healthcare Association Conference, Conference Organising Committee, Melbourne, Victoria, pp. 20pp", "authors": ["Liz Curran"]}, {"title": "ccess to Justice - Valuing the work of community lawyers to resolve systemic problems", "year": "2015", "source": "in Laura Hilly and Richard Martin (ed.), Global Perspectives on Human Rights, Oxford University, Oxford, pp. 21-22", "authors": ["Liz Curran"]}, {"title": "Lawyers in Australia (review)", "year": "2015", "source": "Law Institute Journal, vol. 89, no. 11, p. 64", "authors": ["Liz Curran"]}, {"title": "ccess to Justice - Making it Come Alive and a Reality for Students and Enabling Engaged Future Practitioners", "year": "2015", "source": "Centre for Legal Education Conference 2015, Conference Organising Committee, Nottingham, UK", "authors": ["Liz Curran"]}, {"title": "Hopeful Developments in Family Violence in Australia", "year": "2015", "source": "", "authors": ["Liz Curran"]}, {"title": "Enhancing wellbeing and one", "year": "2015", "source": "s capacity to deal effectively with ethical dilemmas in legal practice'National Wellness for Law Forum, Australian National University, Canberra", "authors": ["Holmes V", "Liz Curran", "Ferguson A"]}, {"title": "ustralia - Release Of The Productivity Commission Inquiry Into", "year": "2015", "source": "Access To Justice'pp. 22-24", "authors": ["Liz Curran"]}, {"title": "Building Capacity to Cope with Ethical Dilemmas in Legal Practice Through Teaching", "year": "2014", "source": "Giving Voice to Values' Techniques'VI International Legal Ethics Conference, Conference Organising Committee, London, UK, pp. 12pp", "authors": ["Liz Curran"]}, {"title": "Integrating Two Measures of Quality Practice into Clinical and Practical Legal Education Assessment: Good client interviewing and effective community legal education", "year": "2014", "source": "International Journal of Clinical Legal Education, vol. 21, no. 1, pp. 69-92", "authors": ["Liz Curran", "Foley A"]}, {"title": "Expression Association and Assembly - Racial Discrimination Act and Free Speech - Carte Blanche or Fair and Reasonable - What are Human Rights in all this?", "year": "2015", "source": "in Laura Hilly and Richard Martin (ed.), Global Perspectives on Human Rights, Oxford University, Oxford, pp. 141-142pp", "authors": ["Liz Curran"]}, {"title": "Practical Model For Demonstrating & Ensuring Quality Legal Aid Services: A Case Study In Applied Research", "year": "2013", "source": "International Legal Aid Group Conference (ILAG)-The Hague 2013, ed. NA, The International Legal Aid Group (ILAG), UK", "authors": ["Liz Curran", "Crockett A"]}, {"title": "Measuring Legal Services: A Practical methodology for measuring the quality and outcomes of legal assistance services", "year": "2013", "source": "University of Tasmania Law Review, vol. 32, no. 1, pp. 70-95", "authors": ["Liz Curran", "Crockett A"]}, {"title": "Legal Aid:Legal assistance services: Meaningful measurement and outcomes", "year": "2013", "source": "Alternative Law Journal, vol. 38, no. 1, pp. 42-44", "authors": ["Liz Curran", "Crockett A"]}, {"title": "Literature Review: Examining the Literature on How to Measure the", "year": "2012", "source": "Successful Outcomes': QualityEffectiveness and Efficiency of Legal Assistance Services", "authors": ["Liz Curran"]}, {"title": "Legal Review: Not all in the Statistics", "year": "2013", "source": "Law Institute Journal, vol. July 2013, pp. 36 - 39", "authors": ["Liz Curran"]}, {"title": "DELIVERY OF ADVICE TO MARGINALISED AND VULNERABLE GROUPS: THE NEED FOR INNOVATIVE APPROACHES", "year": "2009", "source": "Public Space: the Journal of Law and Social Justice, vol. 3, no. 7, pp. 1-29", "authors": ["Buck A", "Liz Curran"]}, {"title": "Integrating Two Measures of Quality Practice into Clinical and Practical Legal Education Assessment: Good client interviewing and effective community legal education", "year": "2014", "source": "21 International Journal of Clinical Legal Education", "authors": ["Liz Curran", "Foley T"]}, {"title": "We Can See There", "year": "2012", "source": "s a Light at the End of the Tunnel Now: Demonstrating and Ensuring Quality Service to Clients", "authors": ["Liz Curran"]}, {"title": "ccess to justice: a new approach using human rights standards", "year": "2008", "source": "International Journal of the Legal Profession, vol. 15, no. 3, pp. 195-229", "authors": ["Liz Curran", "Noone M"]}, {"title": "", "year": "2013", "source": "Encouraging Good Practice in Measuring Effectiveness in the Legal Service Sector", "authors": ["Liz Curran"]}, {"title": "", "year": "2015", "source": "Asylum seekers attitudes increasingly fostering extremism", "authors": ["Liz Curran"]}, {"title": "Politicians need to respond to suffering", "year": "2015", "source": "p. 14", "authors": ["Liz Curran"]}, {"title": "BLOG - Racial Discrimination Act and Free Speech-Carte Blanche or Fair and Reasonable-Where are Human Rights in all This?", "year": "2015", "source": "", "authors": ["Liz Curran"]}, {"title": "Productivity Commission Inquiry", "year": "2015", "source": "Alternative Law Journal, vol. 40, no. 1, pp. 61-62", "authors": ["Liz Curran"]}, {"title": "", "year": "2015", "source": "Forked Tongue", "authors": ["Liz Curran"]}, {"title": "", "year": "2014", "source": "New ways must be found", "authors": ["Liz Curran"]}, {"title": "", "year": "2014", "source": "Attorney-general George Brandis set to silence CLCs", "authors": ["Liz Curran"]}, {"title": "Human Rights Legislation in States and Territories and Opportunities Presented for Citizens", "year": "2014", "source": "Legal Date, vol. 26, no. 3, pp. 5-6", "authors": ["Liz Curran"]}, {"title": "International Journal of the Legal Profession", "year": "15 (", "source": "195-229 (with M Noone", "authors": ["", "Liz Curran"]}, {"title": "Widening the gap - indigenous affairs", "year": "2014", "source": "Dissent, vol. Autumn/Winter 2014, no. 44, pp. 36-38", "authors": ["Liz Curran"]}, {"title": "Solving Problems - A Strategic Approach: Examples", "year": "2013", "source": "Processes & Strategies", "authors": ["Liz Curran"]}, {"title": "", "year": "Aus", "source": "ralian Community Psychologis", "authors": ["", "Liz Curran"]}, {"title": "Human Rights In Australia", "year": "2008", "source": "Alternative Law Journal, vol. 33, no. 2, pp. 70-74", "authors": ["Liz Curran"]}, {"title": "", "year": "21 J", "source": "urnal of Law and Social Policy 63- 89 (with M Noone", "authors": ["", "Liz Curran"]}, {"title": "Making the Legal System More Responsive to Community: A Report on the Impact of Victorian Community Legal Centre (CLC) Law Reform Initiatives", "year": "2007", "source": "", "authors": ["Liz Curran"]}, {"title": "", "year": "2013", "source": "36 – 39", "authors": ["Law Institute Journal July", "Liz Curran"]}, {"title": "The Challenge of Defining Unmet Legal Need", "year": "2007", "source": "Journal of Law and Social Policy, vol. 21, no. 1, pp. 63-89", "authors": ["Liz Curran", "Noone M"]}, {"title": "Measuring the", "year": "2012", "source": "OutcomesQuality, Effectiveness and Efficiency' of Legal Assistance Services - Australian Developments", "authors": ["Liz Curran"]}, {"title": "", "year": "2013", "source": "Re: ˜Part One - Submission to the Productivity Commissions Inquiry into Access to Justice Arrangements™", "authors": ["Liz Curran"]}, {"title": "Re:", "year": "2013", "source": "Part Two - Submission to the Productivity Commission's Inquiry into Access to Justice Arrangements'", "authors": ["Liz Curran"]}, {"title": "Society", "year": "2013", "source": "s neediest in no position to brave the rigours of private sector", "authors": ["Liz Curran"]}, {"title": "The hurdles in accessing the legal system for the disadvantaged", "year": "2013", "source": "pp. 35-38", "authors": ["Liz Curran"]}, {"title": "The Strategic Approach to Legal Problem Solving", "year": "2013", "source": "", "authors": ["Liz Curran"]}, {"title": "", "year": "2013", "source": "Vulnerable used as pawns in election fight", "authors": ["Liz Curran"]}, {"title": "ring", "year": "2 Sp", "source": "2013,35-38", "authors": ["Dissent 4", "Liz Curran"]}, {"title": "Kids or Criminals", "year": "2008", "source": "pp. 2pp", "authors": ["Liz Curran"]}, {"title": "lternative Law Journal", "year": "2) A", "source": "200870-7", "authors": ["33 (", "Liz Curran"]}, {"title": "Law Institute Journal", "year": "2 (4", "source": "62- 6", "authors": ["8", "Liz Curran"]}, {"title": "", "year": "Int", "source": "rnational Journal of Clinical Legal Education", "authors": ["", "Liz Curran"]}, {"title": "Community Legal Centres: A Legitimate Part of the Legal Landscape", "year": "2007", "source": "Dissent, vol. 25, pp. 19-21", "authors": ["Liz Curran"]}, {"title": "", "year": "2007", "source": "Ensuring Justice and Enhancing Human Rights: A Report on Improving Legal Aid Service Delivery to Reach Vulnerable and Disadvantaged People", "authors": ["Liz Curran"]}, {"title": "Making Connections: the Benefits of Working Holistically to Resolve People", "year": "2005", "source": "s Legal Problems'eLaw Journal, vol. 12, no. 1 & 2", "authors": ["Liz Curran"]}, {"title": "he Flinders University Journal of Law Reform", "year": "2) T", "source": "287-30", "authors": ["7 (", "Liz Curran"]}, {"title": "The price of education", "year": "2006", "source": "pp. 2pp", "authors": ["Liz Curran"]}, {"title": "The Human Side of Poverty", "year": "2006", "source": "pp. 2pp", "authors": ["Liz Curran"]}, {"title": "Where now for reconciliation", "year": "2006", "source": "pp. 2-3pp", "authors": ["Liz Curran"]}, {"title": "Entrepreneurial welfare:two views", "year": "2002", "source": "pp. 28-29pp", "authors": ["Liz Curran", "Frances N"]}, {"title": "Juveniles - imprisonment and detention - easy options to complex issues - exploring socially just options and avoiding crime creation", "year": "2001", "source": "Best practice interventions in corrections for indigenous people, Australian Institute of Criminology, online, pp. 1-14", "authors": ["Liz Curran"]}]}, "Microsoft-Academic": [{"title": "lawyer secondary consultations improving access to justice and human rights reaching clients otherwise excluded through professional support in a multi disciplinary practice", "year": 2017, "source": "journal of social inclusion", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 2764425223}, {"title": "making the legal system more responsive to community a report on the impact of victorian community legal centre clc law reform initiatives", "year": 2007, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "nottingham trent university"}, {"name": "liz curran", "affiliation": "west virginia university college of law"}], "id": 2751751161}, {"title": "evaluating projects in multifaceted and marginalised communities the need for mixed approaches", "year": 2019, "source": "evaluation of journal of australasia", "authors": [{"name": "liz curran", "affiliation": "australian national university"}, {"name": "pamela taylorbarnett", "affiliation": "australian national university"}], "id": 2764723658}, {"title": "the challenge of defining unmet legal need", "year": 2007, "source": "journal of law and social policy", "authors": [{"name": "liz curran"}, {"name": "mary anne noone"}], "id": 2764758177}, {"title": "final evaluation report for the legal services board victoria why didn t you ask evaluation of the family violence project of the loddon campaspe community legal centre", "year": 2015, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "preliminary findings on the value of secondary consultations in reaching hard to reach clients and in building professional capacity", "year": 2015, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "health justice partnerships hjp working ethically to reach those in most need of legal and medical support to improve outcomes research evidence a seminar for city university of london law school 13 september 2016 london presentation slides", "year": 2016, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "health justice partnership multi disciplinary practices research evidencing working ethically to ensure reach to those in most need improve outcomes presentation slides", "year": 2016, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 2751751161}, {"title": "sharing elements of effective practice to address earlier signs of family violence", "year": 2019, "source": "alternative law journal", "authors": [{"name": "liz curran", "affiliation": "australian national university"}], "id": 87202933}, {"title": "integrating two measures of quality practice into clinical and practical legal education assessment good client interviewing and effective community legal education", "year": 2014, "source": "social science research network", "authors": [{"name": "liz curran", "affiliation": "nottingham trent university"}, {"name": "liz curran", "affiliation": "west virginia university college of law"}, {"name": "tony foley", "affiliation": "west virginia university college of law"}], "id": 2751751161}], "ANDS-Grants": []}