{"ANU": {"name": "Loan Dao", "link": "https://researchers.anu.edu.au/researchers/dao-lht", "colleges": "none", "email": "", "phone": "", "expertise": ["Language Studies", "English As A Second Language", "South East Asian Languages Excl. Indonesian", "Translation And Interpretation Studies", "Applied Linguistics And Educational Linguistics", "Linguistic Structures Incl. Grammar Phonology Lexicon Semantics"], "interest": [], "biography": "", "project": ["Processability Theory and Curriculum Development: A Longitudinal Study of Learning and Teaching Vietnamese as a Second and Foreign Language (Asia Pacific Innovation Grant (APIP), ANU). This project is to typologically test Processability Theory’s (PT) (Pienemann, 1998, 2005; Bettoni and Di Biase, 2015) validity on the acquisition order of Vietnamese by Australian Tertiary students, and to design a PT-based curriculum. The aims are to study the students’ developmental process with the existing curriculum while concurrently design and teach the new PT-based one, and investigate if applying this theory-based curriculum will enhance the students' language acquisition process.", "Trilingual First-Language-Acquisition: Vietnamese, French, English. A longitudinal study-in-progress on the speech production of a child, born in March 2013 in Canberra, who has been exposed to three languages, Vietnamese, French and English, simultaneously and from birth. Apart from aiming to longitudinally study a child’s ability to acquire three languages from birth, with one language typologically very different from the other two, this study also aims to contribute to research and theories on trilingualism by testing whether the SLA theory Emergent Functional Grammar (EFG, Charters, 2013: 267), which assumes “processing in the early stages of SLA is largely semantically and pragmatically determined” can be applied to this case of trilingual first-language-acquisition."], "publication": [{"title": "The acquisition of the English plural morpheme  in ESL/EFL learners: a lexical or a developmental morpho-phonemic feature?", "year": "2018", "source": "18th International Symposium of Processability Approaches to Language Acquisition (PALA), September, 2018, University of Sydney, Australia. CONFERENCE PAPE", "authors": ["Loan Dao"]}, {"title": "Trilingual First-Language-Acquisition: Vietnamese, French and English", "year": "2015", "source": "Fourth-combined Conference of the Applied Linguistics Association of Australia (ALAA) and the Applied Linguistics Association of New Zealand (ALANZ), ed. Angela Scarino and Tony Liddicoat, Conference Organising Committee, Australia. CONFERENCE PAPE", "authors": ["Loan Dao"]}, {"title": "Think of a number: conceptual transfer in the second language acquisition of English plural-marking", "year": "2012", "source": "CogniTextes - Revue de l'Association Francaise de Linguistique Cognitive, vol. 8", "authors": ["Charters H", "Loan Dao", "Jansen L"]}, {"title": "", "year": "2012", "source": "Foreign Language Acquisition: Processes and Constraints. Ann Arbor: ProQuest UMI Publishing", "authors": ["Loan Dao"]}, {"title": "The Vietnamese classifiers", "year": "2012", "source": "CON'CAI' and the Natural Semantic Metalanguage (NSM) approach: A preliminary study', Proceedings of the 42nd Australian Linguistic Society Conference – 2011, ed. M Ponsonnet, L Dao and M Bowler, Canberra: ANU On-line Repository, pp. 58-74", "authors": ["Loan Dao"]}, {"title": "Proceedings of the 42nd Australian Linguistics Society Conference 2011", "year": "2012", "source": "Australian Linguistics SocietyAustralia", "authors": ["Ponsonnet M", "Loan Dao", "Bowler M (eds)"]}, {"title": "Reassessing the Applicability of Processability Theory: The case of nominal plural", "year": "2011", "source": "Second Language Research, vol. 27, no. 4, pp. 509-533", "authors": ["Charters H", "Loan Dao", "Jansen L"]}, {"title": "Reassessing the application of Processability Theory: The WEAVER++ model and ESL nominal plural marking", "year": "2007", "source": "Conference on Social and Cognitive Aspects of Second Language Learning and Teaching, University of Auckland, New Zealand. CONFERENCE PAPE", "authors": ["Charters H", "Loan Dao", "Jansen L"]}]}, "Microsoft-Academic": [{"title": "asian american studies and the fight for worker justice", "year": 2019, "source": "", "authors": [{"name": "kim geron"}, {"name": "loan dao", "affiliation": "university of massachusetts boston"}, {"name": "kent wong", "affiliation": "university of california los angeles"}, {"name": "tracy lai", "affiliation": "central college"}]}, {"title": "reassessing the applicability of processability theory the case of nominal plural", "year": 2011, "source": "second language research", "authors": [{"name": "helen charters", "affiliation": "university of auckland"}, {"name": "loan dao", "affiliation": "australian national university"}, {"name": "louise jansen", "affiliation": "australian national university"}], "id": 201294665}, {"title": "what s going on with the oakland museum s california and the vietnam era exhibit", "year": 2005, "source": "amerasia journal", "authors": [{"name": "loan dao", "affiliation": "university of california berkeley"}], "id": 44448039}, {"title": "using classroom videos to stimulate professional conversations among pre service teachers windows into a mathematics classroom", "year": 2017, "source": "asia pacific journal of teacher education", "authors": [{"name": "james j watters", "affiliation": "queensland university of technology"}, {"name": "carmel m diezmann", "affiliation": "australian catholic university"}, {"name": "loan dao", "affiliation": "australian catholic university"}], "id": 63099517}, {"title": "the vietnamese classifiers con cai and the natural semantic metalanguage nsm approach a preliminary study", "year": 2012, "source": "", "authors": [{"name": "loan dao", "affiliation": "australian national university"}]}, {"title": "leading the implementation of the national curriculum a case study in one queensland school", "year": 2017, "source": "", "authors": [{"name": "loan dao"}]}, {"title": "leading the implementation of the national curriculum a case study in one queensland school", "year": 2017, "source": "", "authors": [{"name": "loan dao"}]}, {"title": "refugee representations southeast asian american youth hip hop and immigrant rights", "year": 2014, "source": "amerasia journal", "authors": [{"name": "loan dao", "affiliation": "university of massachusetts boston"}], "id": 44448039}, {"title": "think of a number conceptual transfer in the second language acquisition of english plural marking", "year": 2012, "source": "", "authors": [{"name": "helen charters", "affiliation": "university of auckland"}, {"name": "loan dao"}, {"name": "louise jansen"}]}, {"title": "think of a number learning to make nouns plural in second language acquisition", "year": 2012, "source": "", "authors": [{"name": "helen charters"}, {"name": "louise jansen"}, {"name": "loan dao"}]}], "ANDS-Grants": []}