{"ANU": {"name": "Lou Farrer", "link": "https://researchers.anu.edu.au/researchers/farrer-lm", "colleges": "College of Health & Medicine", "email": "louise.farrer@anu.edu.au", "phone": "", "expertise": ["Mental Health", "Public Health And Health Services"], "interest": ["e-Mental healthPrevention and treatment researchDepression and anxiety disordersUse of technology in mental health careUniversity student mental healthImplementation science"], "biography": "Dr Farrer’s primary research interests are in the development, evaluation, and implementation of technology-based mental health programs. Her research has focused on conducting trials of automated,  online therapy programs targeting depression and anxiety disorders.  As a  clinically-trained researcher, Dr Farrer is interested in the  intersection of technology, clinical service delivery, and research, namely,  exploring different methods of supporting users of digital interventions,  examining factors that predict response and adherence to these programs,  and investigating models of disseminating and implementing  online interventions in different settings. She is also interested in the mental health of university students, having recently completed a project funded by the Young and Well Cooperative Research Centre to develop and evaluate a virtual mental health clinic designed specifically for tertiary student populations (The Uni Virtual Clinic).", "project": [], "publication": [{"title": "Development of the Uni Virtual Clinic: an online programme for improving the mental health of university students", "year": "2020", "source": "British Journal of Guidance and Counselling, vol. 48, no. 3, pp. 333-346", "authors": ["Lou Farrer", "Gulliver A", "Katruss N"]}, {"title": "What prevents young adults from seeking help? Barriers toward help-seeking for eating disorder symptomatology", "year": "2020", "source": "International Journal of Eating Disorders, vol. 53, no. 6, pp. 894-906", "authors": ["Ali K", "Fassnacht D", "Lou Farrer"]}, {"title": "The Effect of COVID-19 on Mental Health and Wellbeing in a Representative Sample of Australian Adults", "year": "2020", "source": "Frontiers in Psychiatry, vol. 11, pp. 1-8", "authors": ["Dawel A", "Shou Y", "Smithson M", "Lou Farrer"]}, {"title": "Consumer-Guided Development of an Engagement-Facilitation Intervention for Increasing Uptake and Adherence for Self-Guided Web-Based Mental Health Programs: Focus Groups and Online Evaluation Survey", "year": "2020", "source": "JMIR Formative Research, vol. 4, no. 10, pp. 1-15", "authors": ["Gulliver A", "Calear A", "Sunderland M", "Lou Farrer"]}, {"title": "Management or missed opportunity? Mental health care planning in Australian general practice", "year": "2019", "source": "Australian Journal of Primary Health, vol. 25, no. 4, pp. 332-338", "authors": ["Banfield M", "Lou Farrer", "Harrison C"]}, {"title": "novel multi-component online intervention to improve the mental health of university students: Randomised controlled trial of the Uni Virtual Clinic", "year": "2019", "source": "Internet Interventions, vol. 18, no. 0", "authors": ["Lou Farrer", "Gulliver A", "Katruss N"]}, {"title": "brief intervention to increase uptake and adherence of an online program for depression and anxiety: Protocol for the Enhancing Engagement with Psychosocial Interventions (EEPI) Randomized Controlled Trial", "year": "2019", "source": "Contemporary Clinical Trials, vol. 78, no. March 2019, pp. 107-115", "authors": ["Batterham P", "Calear A", "Sunderland M", "Lou Farrer"]}, {"title": "Efficacy of a transdiagnostic, video-based online program for reducing depression, anxiety, and suicidal ideation in adults: Protocol for a randomised controlled trial", "year": "2019", "source": "Contemporary Clinical Trials Communications, vol. 14", "authors": ["Batterham P", "Calear A", "Gulliver A", "Lou Farrer"]}, {"title": "University staff experiences of students with mental health problems and their perceptions of staff training needs", "year": "2018", "source": "Journal of Mental Health, vol. 27, no. 3, pp. 247-256pp", "authors": ["Gulliver A", "Lou Farrer", "Bennett K"]}, {"title": "Is self-guided internet-based cognitive behavioural therapy (iCBT) harmful? An individual participant data meta-analysis", "year": "2018", "source": "Psychological Medicine, vol. 48, no. 15, pp. 2456-2466", "authors": ["Karyotaki E", "Kemmeren L", "Riper H", "Lou Farrer"]}, {"title": "Primary care access for mental illness in Australia: Patterns of access to general practice from 2006 to 2016", "year": "2018", "source": "PLOS ONE (Public Library of Science), vol. 13, no. 6, pp. 1-12pp", "authors": ["Lou Farrer", "Walker J", "Harrison C"]}, {"title": "FitMindKit: Randomised controlled trial of an automatically tailored online program for mood, anxiety, substance use and suicidality", "year": "2018", "source": "Internet Interventions, vol. 12, pp. 91-99pp", "authors": ["Batterham P", "Calear A", "Lou Farrer"]}, {"title": "University staff mental health literacy, stigma and their experience of students with mental health problems", "year": "2017", "source": "Journal of Further and Higher Education, vol. Online", "authors": ["Gulliver A", "Lou Farrer", "Bennett K"]}, {"title": "Perceived Barriers and Facilitators Towards Help-seeking for Eating Disorders: A Systematic Review", "year": "2017", "source": "International Journal of Eating Disorders, vol. 50, no. 1, pp. 9-21", "authors": ["Ali K", "Lou Farrer", "Fassnacht D"]}, {"title": "Online Recruitment: Feasibility, Cost, and Representativeness in a Study of Postpartum Women", "year": "2017", "source": "Journal of Medical Internet Research, vol. 19, no. 3, pp. 5pps", "authors": ["Leach L", "Butterworth P", "Poyser C", "Lou Farrer"]}, {"title": "Efficacy of self-guided internet-based cognitive behavioral therapy (iCBT) in treatment of depressive symptoms: An individual participant data meta-analysis", "year": "2017", "source": "JAMA Psychiatry, vol. 74, no. 4, pp. 351-359pp", "authors": ["Karyotaki E", "Riper H", "Twisk J", "Lou Farrer"]}, {"title": "University Students", "year": "2016", "source": "Views on the Perceived Benefits and Drawbacks of Seeking Help for Mental Health Problems on the Internet: A Qualitative Study'JMIR Human Factors, vol. 3, no. 1, pp. e3", "authors": ["Chan J", "Lou Farrer", "Gulliver A"]}, {"title": "Demographic and psychosocial predictors of major depression and generalised anxiety disorder in Australian university students", "year": "2016", "source": "BMC Psychiatry, vol. 16, no. 241, pp. 1-9", "authors": ["Lou Farrer", "Gulliver A", "Bennett K"]}, {"title": "Technology-based interventions for tobacco and other drug use in university and college students: a systematic review and meta-analysis", "year": "2015", "source": "Addiction Science & Clinical Practice, vol. 10, no. 5, pp. 1-10pp", "authors": ["Gulliver A", "Lou Farrer", "Chan J"]}, {"title": "Exploring the acceptability of online mental health interventions among university teaching staff: Implications for intervention dissemination and uptake", "year": "2015", "source": "Internet Interventions, vol. 2, no. 3, pp. 359-365", "authors": ["Lou Farrer", "Gulliver A", "Bennett K"]}, {"title": "Predictors of treatment dropout in self-guided web-based interventions for depression: an", "year": "2015", "source": "individual patient data' meta-analysis'Psychological Medicine, vol. 45, no. 13, pp. 2717-2726", "authors": ["Karyotaki E", "Kleiboer A", "Smit F", "Lou Farrer"]}, {"title": "Online peer to peer support for young people with mental health problems: a systematic review", "year": "2015", "source": "JMIR Mental Health, vol. 2, no. 2, pp. e19-e19", "authors": ["Ali K", "Lou Farrer", "Gulliver A"]}, {"title": "University Students’ Views on the Perceived Benefits and Drawbacks of Seeking Help for Mental Health Problems on the Internet: A Qualitative Study", "year": "2015", "source": "JMIR Mental Health, vol. 2, no. 1, pp. e2-e2", "authors": ["Lou Farrer", "Gulliver A", "Chan J"]}, {"title": "Privacy issues in the development of a virtual mental health clinic for university students: a qualitative study", "year": "2015", "source": "JMIR Mental Health, vol. 2, no. 1, pp. e9-e9", "authors": ["Gulliver A", "Bennett K", "Bennett A", "Lou Farrer"]}, {"title": "Predictors of Adherence and Outcome in Internet-Based Cognitive Behavior Therapy Delivered in a Telephone Counseling Setting", "year": "2014", "source": "Cognitive Therapy and Research, vol. 38, no. 3, pp. 358-367", "authors": ["Lou Farrer", "Griffiths K", "Christensen H"]}, {"title": "The Suicidal Ideation Attributes Scale (SIDAS): Community-Based Validation Study of a New Scale for the Measurement of Suicidal Ideation", "year": "2014", "source": "Suicide and Life-Threatening Behavior, vol. 44, no. 4, pp. 408-419", "authors": ["Van Spijker B", "Batterham P", "Calear A", "Lou Farrer"]}, {"title": "Internet Interventions for Mental Health and Addictions: Current Findings and Future Directions", "year": "2014", "source": "Current Psychiatry Reviews, vol. 16, no. 12, pp. 521-521", "authors": ["Cunningham J", "Gulliver A", "Lou Farrer"]}, {"title": "The effect of a web-based depression intervention on suicide ideation: Secondary outcome from a randomised controlled trial in a helpline", "year": "2013", "source": "BMJ Open, vol. 3, no. 6", "authors": ["Christensen H", "Lou Farrer", "Batterham P"]}, {"title": "Young and Well CRC", "year": "2013", "source": "The Australasian Student Residences Management Journal, vol. 8, no. 1, pp. 32-35", "authors": ["Lou Farrer", "Griffiths K", "Bennett K"]}, {"title": "Technology-based interventions for mental health in tertiary students: Systematic review", "year": "2013", "source": "Journal of Medical Internet Research, vol. 15, no. 5, pp. e101-e101", "authors": ["Lou Farrer", "Gulliver A", "Chan J"]}, {"title": "Explainer: what is depression?", "year": "2013", "source": "The Conversatio", "authors": ["Batterham P", "Gulliver A", "Lou Farrer"]}, {"title": "Web-Based cognitive behavior therapy for depression with and without telephone tracking in a national helpline: Secondary outcomes from a randomized controlled trial", "year": "2012", "source": "Journal of Medical Internet Research, vol. 14, no. 3, pp. 60-69", "authors": ["Lou Farrer", "Christensen H", "Griffiths K"]}, {"title": "The Effectiveness of an Online Support Group for Members of the Community with Depression: A Randomised Controlled Trial", "year": "2012", "source": "PLOS ONE (Public Library of Science), vol. 7, no. 12, pp. 1-9", "authors": ["Griffiths K", "Mackinnon A", "Crisp D", "Lou Farrer"]}, {"title": "Internet-Based CBT for Depression with and without Telephone Tracking in a National Helpline: Randomised Controlled Trial", "year": "2011", "source": "PLOS ONE (Public Library of Science), vol. 6, no. 11, pp. e28099-e28099", "authors": ["Lou Farrer", "Christensen H", "Griffiths K"]}, {"title": "Recruitment challenges associated with a randomised controlled trial within a general telephone counselling service", "year": "2010", "source": "Journal of Telemedicine & Telecare, vol. 16, no. 7, pp. 409-413", "authors": ["Burgess N", "Christensen H", "Griffiths K", "Lou Farrer"]}, {"title": "The efficiacy of internet interventions for depression and anxiety disorders: A review of randomised controlled trials", "year": "2010", "source": "Medical Journal of Australia, vol. 192, no. 11, pp. S4-S11", "authors": ["Griffiths K", "Lou Farrer", "Christensen H"]}, {"title": "dherence in Internet interventions for anxiety and depression", "year": "2009", "source": "Journal of Medical Internet Research, vol. 11, no. 2, pp. e23", "authors": ["Christensen H", "Griffiths K", "Lou Farrer"]}, {"title": "Mental health profile of callers to a generalist telephone counselling service", "year": "2008", "source": "Journal of Telemedicine & Telecare, vol. 14, no. 1, pp. 42-47", "authors": ["Burgess N", "Christensen H", "Leach L", "Lou Farrer"]}, {"title": "ge differences in mental health literacy", "year": "2008", "source": "BMC Public Health, vol. 8, no. 125, p. 8", "authors": ["Lou Farrer", "Leach L", "Griffiths K"]}, {"title": "Clickety-Click: e-mental health train on track", "year": "2007", "source": "Australasian Psychiatry, vol. 15, no. 2, pp. 100-108", "authors": ["Griffiths K", "Lou Farrer", "Christensen H"]}, {"title": "Effective treatments a click away", "year": "2006", "source": "InPsych", "authors": ["Griffiths K", "Lou Farrer", "Christensen H"]}]}, "Microsoft-Academic": [{"title": "internet interventions for mental health and addictions current findings and future directions", "year": 2014, "source": "current psychiatry reports", "authors": [{"name": "john a cunningham", "affiliation": "australian national university"}, {"name": "john a cunningham", "affiliation": "centre for addiction and mental health"}, {"name": "amelia gulliver", "affiliation": "australian national university"}, {"name": "lou farrer", "affiliation": "australian national university"}, {"name": "kylie bennett", "affiliation": "australian national university"}, {"name": "bradley carronarthur", "affiliation": "australian national university"}], "id": 124600697}, {"title": "internetinterventionsfor mental health andaddictions current findings and future directions", "year": 2014, "source": "", "authors": [{"name": "john a cunningham"}, {"name": "amelia gulliver"}, {"name": "lou farrer"}, {"name": "kylie bennett"}, {"name": "bradley carronarthur"}]}], "ANDS-Grants": []}