{"ANU": {"name": "Luke Peel", "link": "https://researchers.anu.edu.au/researchers/peel-l", "colleges": "College of Science", "email": "luke.peel@anu.edu.au", "phone": "", "expertise": ["Soil Sciences", "Environmental Science And Management", "Ecological Applications", "Ecology", "Information Systems", "Hydrogeology", "Surfacewater Hydrology", "Geomorphology And Regolith And Landscape Evolution", "Landscape Ecology", "Environmental Monitoring", "Environmental Education And Extension"], "interest": ["Research, develop and implement monitoring methods and applications with regard to natural resources using ground based methods coupled with remotely sensed (satellite, aerial, drone) data sources (mutli-spectral, LiDAR) for spatial and temporal analysis and information products. Understanding processes of landscape functionality, soil erosion, soil building, water holding and filtering within the context of regenerative land use and management, supporting the growth of appropriate flora and fauna. The use of GIS and remote sensing platforms for analysis and communication of data and esults.Use of technology to provide timely, cost-effective monitoring and reporting capabilities that reflect accurate assessment of on-ground situation for landholders to utilise for planning and decision making, reporting to stakeholders, and potentially providence to consumers of the farm product they are choosing (paddock to plate).Regenerative agriculture that promotes quality food output and improves environmental outcomes. Managing regenerative agriculture with respect to climate extremes and how agricultural and natural systems can build resilience and potentially reduce climate change."], "biography": "Since 2014 is the research coordinator for The Mulloon Institute managing the scientific program, engaging landholders, scientists, industry, and tertiary and secondary students in many facets of natural resource management, regenerative agriculture, and engendering social and community change adaptation.", "project": ["Mulloon Community Landscape Rehydration Project", "Catchment scale project working with landholders, tertiary institutions, Govt and non-Govt Agencies, private industry and volunteers to undertake field procedures, analysis and reporting of;"], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}