{"ANU": {"name": "Lynette Du Moulin", "link": "https://researchers.anu.edu.au/researchers/du-moulin-lg", "colleges": "ANU College of Law", "email": "lynn.dumoulin@anu.edu.au", "phone": "", "expertise": ["Access To Justice", "Legal Practice Lawyering And The Legal Profession", "Humanities And Social Sciences Curriculum And Pedagogy Excl. Economics Business And Management"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Leading entrepreneurial e-learning development in legal education: a longitudinal case study of universities as learning organisations", "year": "2017", "source": "The Learning Organization, vol. 24, no. 5, pp. 17pp.", "authors": ["Trevitt A", "Steed A", "Lynette Du Moulin"]}, {"title": "Practical legal education for practice: lawyers at the intersection of public policy, law, administration and politics", "year": "2007", "source": "Australasian Law Teachers Association - ALTA 2007, ed. Micheal Adams, David Barker, Katherine Poludniewski, Australasian Law Teachers Association, Australia", "authors": ["Lynette Du Moulin"]}, {"title": "New Challenges in Legal Education: Developing an Appropriate Response to the Issue of Student Workload", "year": "2008", "source": "Legal Education Review, vol. 18, no. 1 and 2, pp. 179-196", "authors": ["Macduff A", "Lynette Du Moulin"]}, {"title": "Practical legal education for practice: lawyers at the intersection of public policy, law, administration and politics", "year": "2007", "source": "Practical legal education for practice: lawyers at the intersection of public policy, law, administration and politics, ed. Michael Adams, David Barker, Katherine Poludniewski, Australasian Law Teachers Association, Australia, p. 22", "authors": ["Lynette Du Moulin"]}, {"title": "Identifying efficient learning: different approaches to understand student workload", "year": "2006", "source": "Annual Higher Education Research and Development Society of Australasia Conference (HERDSA 2006), University of Western Australia, Perth", "authors": ["Macduff A", "Lynette Du Moulin"]}, {"title": "Learning and Doing: Educating lawyers for practice", "year": "2006", "source": "Australian Law Teachers Association Conference 2006, ed. Conference Program Committee, Australasian Law Teachers Association, Melbourne", "authors": ["Lynette Du Moulin"]}, {"title": "", "year": "2004", "source": "The PLT Revolution", "authors": ["Tamsitt G", "Lynette Du Moulin"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}