{"ANU": {"name": "Lynette Johns Boast", "link": "https://researchers.anu.edu.au/researchers/johns-boast-l", "colleges": "College of Engineering & Computer Science", "email": "lynette.johns-boast@anu.edu.au", "phone": "+61 2 6125 4526", "expertise": ["Curriculum And Pedagogy Theory And Development", "Science Technology And Engineering Curriculum And Pedagogy", "Higher Education", "Software Engineering", "Information Systems Development Methodologies"], "interest": ["My broad research area is engineering education & curriculum design and development in higher education.My research includes curriculum design and development in higher education, engineering education and the transfer of learning between university and the workplace, experiential and cooperative learning, personality and successful teams in software engineering, open educational resources (OER) and learning object repositories (LOR), and women in engineering.The interest in OERs and LORs is centred on how we can design and develop repositories of educational resources that can be re-used, re-purposed and re-combined according to the official curriculum to create courseware and adaptive and personalised educational systems."], "biography": "", "project": ["December 2008 – December 2012", "The Engineering 'Hubs and Spokes' Project is a collaboration between The Australian National University and the University of South Australia. It draws on the strengths of each to provide a flexible training environment for undergraduate and graduate learning. As well as being the project manager, I have played a lead role in developing a proof of concept Learning Object Repository. The repository is used to store the courseware and artefacts created as part of the project so that they will remain accessible to staff at either university after the conclusion of the project."], "publication": [{"title": "Students", "year": "2019", "source": "Perceptions of Individual and Group Performance in Capstone Projects'Realising Ambitions: 6th Annual Symposium of the United Kingdom & Ireland Engineering Education Research Network, UK&IE EER Network 2018, ed. M Malik, J Andrews, R Clark, R Penlington & R Broadbent, University of Portsmouth, United Kingdom, pp. 45-58", "authors": ["Blackmore K", "Browne C", "Lynette Johns Boast"]}, {"title": "Curriculum: A Proposed Definitional Framework", "year": "2016", "source": "123rd Annual ASEE Conference and Exposition ASEE 2016, American Society for Engineering Education, USA, pp. 1-14", "authors": ["Lynette Johns Boast", "Corrigan G"]}, {"title": "Performance of student software development teams: the influence of personality and identifying as team members", "year": "2014", "source": "European Journal of Engineering Education, vol. 40, no. 1, pp. 52-67", "authors": ["Monaghan C", "Bizumic B", "Reynolds K (", "Lynette Johns Boast"]}, {"title": "Curriculum drift: A multi-dimensional perspective", "year": "2014", "source": "2014 Australasian Association for Engineering Education Conference (AAEE2014), Australasian Association for Engineering Education, Australia", "authors": ["Lynette Johns Boast"]}, {"title": "Developing Personal and Professional Skills in Software Engineering Students", "year": "2014", "source": "in Liguo Yu (ed.), Overcoming Challenges in Software Engineering Education: Delivering Non-Technical Knowledge and Skills, IGI Global, Hershey, PA, USA, pp. 198-228", "authors": ["Lynette Johns Boast"]}, {"title": "Simulating Industry: An Innovative Software Engineering Capstone Design Course", "year": "2013", "source": "Annual Frontiers in Education Conference 2013, IEEE Education Society, New Jersey", "authors": ["Lynette Johns Boast", "Flint S"]}, {"title": "What effect does an academic", "year": "2013", "source": "s concept of curriculum have on their engagement with its design and development?'American Society for Engineering Education International Forum 2013, American Society for Engineering Education, Washington DC", "authors": ["Lynette Johns Boast"]}, {"title": "December),", "year": "2010", "source": "A Win-Win Situation: Benefits of industry-based group projects'Australasian Association for Engineering Education Conference (AaeE 2010), ed. Anne Gardner & Dr Lesley Jolly, University of Technology Sydney, Sydney, pp. 355-360", "authors": ["Lynette Johns Boast", "Patch G ("]}, {"title": "December).", "year": "2010", "source": "Group Work and Individual Assessment'Australasian Association for Engineering Education Conference (AaeE 2010), ed. Anne Gardner & Dr Lesley Jolly, University of Technology Sydney, Sydney, pp. 46-51", "authors": ["Lynette Johns Boast"]}, {"title": "Providing students with", "year": "2010", "source": "real-world' experience through university group projects. In S. Grainger and C. Kestel (Eds.)Engineering Education: an Australian Perspective, Multi-Science Publishing Co. (pp. 87-96", "authors": ["Lynette Johns Boast"]}, {"title": "December),", "year": "2009", "source": "Providing students with real-world' experience through university group projects'Australasian Association for Engineering Education Conference (AAEE 2009), ed. Conference Program Committee, Engineers Australia, Adelaide, pp. 299-304", "authors": ["Lynette Johns Boast", "Flint S ("]}]}, "Microsoft-Academic": [{"title": "capstone design projects the project value map and the many eyes process balancing process and product to deliver measurable value to student and client", "year": 2020, "source": "international journal of engineering education", "authors": [{"name": "c a browne"}, {"name": "lynette johns boast"}, {"name": "kim blackmore"}, {"name": "shayne flint"}], "id": 140374062}], "ANDS-Grants": []}