{"ANU": {"name": "Malcolm Allbrook", "link": "https://researchers.anu.edu.au/researchers/allbrook-m", "colleges": "College of Arts and Social Sciences", "email": "malcolm.allbrook@anu.edu.au", "phone": "02 6125 4455", "expertise": [], "interest": ["Malcolm Allbrook’s research interests include:Australian historyColonial and transnational histories in the Indian Ocean region, the formal and informal networks connecting individuals and families around the oceanic sphere, and the diverse contexts in which they functioned and were sustained;Indigenous histories, including collaborative ways to research and present community histories using voice, sound, photographic and filmic imagery.Biography and life writing, particularly of those less visible in national and landscape narratives, and the use of the range of documentary source materials, including letters and journals, paintings and photographs, and oral histories.Landscape history and the deep past, particularly issues connected with biography and life writing of ancient lives."], "biography": "He completed a PhD at Griffith University in 2009 with a thesis ‘Imperial Family: the Prinseps, Empire and Colonial Government in India and Australia’ which was published as Henry Prinsep's Empire: Framing a Distant Colony by ANU Press in 2014. Before joining the ANU, he worked as a historian and exhibition curator, chiefly with Aboriginal organizations throughout Western Australia. In 2013, with the Kimberley Aboriginal elder John Darraga Watson, he published Never Stand Still: Life, land and politics in the Kimberley. He was part of a team that curated ‘Burlganya Wanggaya’, an exhibition of Aboriginal history and culture in Carnarvon, Western Australia, which was awarded the MAGNA award for best permanent exhibition in 2012. in 2017 he co-authored a collaborative community history of the Worrorra people of the Dambimangari native title lands: Barddabardda Wodjenangorddee: The creation, history and people of Dambeemahgaddee country (Fremantle Press, 2017). The same year, with Mary Anne Jebb, he published Carlotta's Perth: Memories of a Colonial Childhood (City of Perth, 2017). He is also the author of numerous articles and ADB biographies, notably of the former governor-general and cabinet minister Sir Paul Hasluck, and the historian and writer Dame Mary Durack.", "project": ["Malcolm Allbrook is currently engaged on a number of research and writing projects:", "He is a chief investigator on the ARC Indigenous Discovery project 'An Indigenous Australian Dictionary of Biography.' The project, which will publish 190 new biographies of Aboriginal and Torres Strait Islander people, and explore new biographical methodologies, started in 2017 and will run until 2020. An international conference, 'Reframing Indigenous Biography' will take place at the ANU in November 2018.", "With historian Mary Anne Jebb, since 2008 he has been associated with the Wangka Maya Pilbara Aboriginal Language Centre in Port Hedland, Western Australia, on a project entitled 'Hidden Histories of the Pilbara.' He was awarded AIATSIS research grants in 2008 and 2011, the first to prepare a historical report using archival evidence on nineteenth and early twentieth-century colonial contacts, the second to record oral histories with Aboriginal people. He is currently finalising a mss for publication on this collaborative project, with the working title 'Blood Shadow: Hidden Histories of the Pilbara.'", "His larger project on the Pilbara, which he intends to develop into a book, is driven by his interest in the interaction of people with the environment. His principal area of interest - the Burrup Peninsula and hinterland - is known for its extraordinarily rich rock art and other archaeological evidence of ancient and precolonial occupation and land use, and for its modern history as one of Australia's premier industrial regions, as well as a postcolonial history of pastoralism and pearling. How Aboriginal people negotiated, responded to and survived the impact of colonialism, including industrial development, is the central question of the project.", "Allbrook is also editor of the National Centre of Biography (School of History) journal Using Lives: Biography and History, published by ANU Press. The first number of the journal is due to appear late in 2018; two issues each year are scheduled. He has also played a central role in the formation of a family history network, which seeks to build collaboration between the academy and community-based family history researchers. He co-convened an international conference 'Related Histories' at the National Library of Australia in November 2017, and is currently preparing, with Dr Sophie Scott-Brown, an edited volume of papers from the conference.", "", "", "", "", "", ""], "publication": [{"title": "Robert John Scoll: Protection \"Pilbara-Style\"", "year": "2019", "source": "in Samual Furphy and Amanda Nettelbeck (ed.), Aboriginal Protection and its Intermediaries in Britain's Antipodean Colonies, Routledge Taylor & Francis Group, United Kingdom, pp. 212pp-228pp", "authors": ["Malcolm Allbrook"]}, {"title": "Mungo Lady", "year": "2019", "source": "Australian Dictionary of Biography (Online), pp. 1pp-2pp", "authors": ["Malcolm Allbrook"]}, {"title": "Parks, Stanley Walter ( Stan) (1925-1994)", "year": "2019", "source": "Australian Dictionary of Biography (Online), pp. 1pp-2pp", "authors": ["Malcolm Allbrook"]}, {"title": "Community collaborations: The Australian National University and the Canberra & District Historical Society", "year": "2019", "source": "Australian Journal of Biography and History, vol. 2, pp. 3-11", "authors": ["Malcolm Allbrook"]}, {"title": "Gabrielle Carey, Falling Out of Love with Ivan Southall", "year": "2019", "source": "Australian Journal of Biography and History, vol. 2, pp. 179pp-181pp", "authors": ["Malcolm Allbrook"]}, {"title": "Durack, Dame Mary Gertrude (1913-1994)", "year": "2018", "source": "", "authors": ["Malcolm Allbrook"]}, {"title": "Life Sentences Neither beaten nor bowed", "year": "2018", "source": "pp. 1pp-2pp", "authors": ["Malcolm Allbrook"]}, {"title": "Life Sentences Unravelling the great Australian silence", "year": "2018", "source": "pp. 1pp-3pp", "authors": ["Malcolm Allbrook"]}, {"title": "Transnationalism, Nationalism and Australian History", "year": "2018", "source": "Australian Historical Studies, vol. 49, no. 3, pp. 417-418pp", "authors": ["Malcolm Allbrook"]}, {"title": "ustralian Historians and Biography", "year": "2018", "source": "Australian Journal of Biography and History, vol. 1, pp. 3-21pp", "authors": ["Malcolm Allbrook", "Nolan M"]}, {"title": "Barddabardda Wodjenangorddee: We", "year": "2017", "source": "re Telling All of YouFremantle Press, North Fremantle, Western Australia", "authors": ["Malcolm Allbrook", "Woolagoodja D", "Jebb M"]}, {"title": "Carlotta", "year": "2017", "source": "s Perth: Memories of a Colonial ChildhoodCity of Perth, Freemantle, Western Australia", "authors": ["Malcolm Allbrook", "Jebb M"]}, {"title": "King, Gordon (1900-1991)", "year": "2017", "source": "in   (ed.), Australian Dictionary of Biography, Australian National University, Australia, pp. Online", "authors": ["Malcolm Allbrook"]}, {"title": "Sir Paul Meernaa Hasluck (1905-1993)", "year": "2017", "source": "in   (ed.), Australian Dictionary of Biography, Australian National University, Australia, pp. Online", "authors": ["Malcolm Allbrook"]}, {"title": "Review - Steve Hawke, A Town is Born: The Fitzroy Crossing Story", "year": "2016", "source": "Studies in Western Australian History, no. 30, pp. 144-145pp", "authors": ["Malcolm Allbrook"]}, {"title": "Book Review:Arnold, Murray: A Journey Travelled: Aboriginal-European Relations at Albany and the Surrounding Regions from First Contact to 1926", "year": "2016", "source": "Australian Historical Studies, vol. 47, no. 2, pp. 354-355", "authors": ["Malcolm Allbrook"]}, {"title": "Book Review: Paul Hasluck A life", "year": "2016", "source": "Life Writing, vol. 13, no. 4, pp. 499-502", "authors": ["Malcolm Allbrook"]}, {"title": "Collaborative Histories of the Willandra Lakes. Deepening histories and the deep past.", "year": "2015", "source": "in Ann McGrath and Mary Anne Jebb (ed.), Long History, Deep Time: Deepening Histories of Place, ANU Press, Canberra, Australian Capital Territory, pp. 241-252", "authors": ["Malcolm Allbrook", "McGrath A"]}, {"title": "Nipper Tabagee (Buck) (1920-1990)", "year": "2015", "source": "'Australian Dictionary of Biography (Online), pp. online", "authors": ["Malcolm Allbrook"]}, {"title": "Henry Prinsep", "year": "2014", "source": "s Empire: Framing a distant colonyANU Press, Canberra", "authors": ["Malcolm Allbrook"]}, {"title": "Letters across the Indian Ocean: Imagining Empire in the Private Writing of the Prinsep Family, 1866-1922", "year": "2013", "source": "in Ruth Morgan, Cecilia Leong-Salobir and Jeremy Martens (ed.), Western Australia in the Indian Ocean World, The University of Western Australia, WA, pp. 27-45", "authors": ["Malcolm Allbrook"]}, {"title": "Never Stand Still: Stories of Life", "year": "2012", "source": "Land and Politics in the KimberleyJarlmadangah Burru Aboriginal Corporation, WA", "authors": ["Malcolm Allbrook", "ed"]}, {"title": "Burlganyja Wanggaya: Old People Talking", "year": "2012", "source": "", "authors": ["Jebb M", "Malcolm Allbrook"]}, {"title": "Triple Empire ... United under One Dominion", "year": "2012", "source": ": Charles Prinsep's Schemes for Exporting Indian Labour to Australia'South Asia-Journal of South Asia Studies, vol. 35, no. 3, pp. 648-670", "authors": ["Malcolm Allbrook"]}, {"title": "Book Review - Powering Perth: a history of the East Perth Power station by Lenore Layman", "year": "2012", "source": "Circa The Journal of Professional Historians, no. 3, pp. 79-81", "authors": ["Malcolm Allbrook"]}, {"title": "Perspective", "year": "2008", "source": "First Contact''in Deborah Gare & David Ritter (ed.), Making Australian History: Perspectives on the past since 1788, Thomson Learning Australia, Melbourne, pp. 78-87", "authors": ["Jebb M", "Malcolm Allbrook"]}]}, "Microsoft-Academic": [{"title": "transnationalism nationalism and australian history", "year": 2018, "source": "australian historical studies", "authors": [{"name": "malcolm allbrook", "affiliation": "australian national university"}], "id": 199561357}, {"title": "paul hasluck a life", "year": 2016, "source": "life writing", "authors": [{"name": "malcolm allbrook", "affiliation": "australian national university"}], "id": 190712015}, {"title": "a journey travelled aboriginal european relations at albany and the surrounding regions from first contact to 1926", "year": 2016, "source": "australian historical studies", "authors": [{"name": "malcolm allbrook", "affiliation": "australian national university"}], "id": 199561357}, {"title": "imperial family the prinseps empire and colonial government in india and australia", "year": 2009, "source": "", "authors": [{"name": "malcolm allbrook"}]}, {"title": "a triple empire united under one dominion charles prinsep s schemes for exporting indian labour to australia", "year": 2012, "source": "south asia journal of south asian studies", "authors": [{"name": "malcolm allbrook", "affiliation": "university of western australia"}], "id": 120889147}, {"title": "collaborative histories of the willandra lakes", "year": 2015, "source": "", "authors": [{"name": "malcolm allbrook"}, {"name": "ann mcgrath"}]}, {"title": "george coolbul imagining a colonised life", "year": 2011, "source": "aboriginal history", "authors": [{"name": "malcolm allbrook"}], "id": 78712790}, {"title": "henry prinsep s empire", "year": 2014, "source": "", "authors": [{"name": "malcolm allbrook"}]}, {"title": "implementation and resourcing of native title and related agreements", "year": 2004, "source": "", "authors": [{"name": "malcolm allbrook"}, {"name": "mary anne jebb"}]}, {"title": "collaborative histories of the willandra lakes deepening histories and the deep past", "year": 2018, "source": "", "authors": [{"name": "malcolm allbrook"}, {"name": "ann mcgrath"}]}], "ANDS-Grants": [{"description": "The project will research Indigenous biography through collaboration between Indigenous researchers and the Australian Dictionary of Biography (ADB). Aboriginal and Torres Strait Islander people are significantly underrepresented in the ADB. The project will work with Indigenous communities to produce the Indigenous Australian Dictionary of Biography, a supplementary volume of the ADB on 190 Aboriginal and Torres Strait Islander people for use by scholars, students, and the public, and publish research articles that reframe Indigenous biographical practice. The project aims to foster reconciliation, national knowledge and pride in the ancient and modern contribution of Indigenous Australians to the nation, and to facilitate Indigenous participation at all levels of research and production.", "title": "Discovery Indigenous - Grant ID: IN170100012", "id": "945073", "institutions": ["University of Western Australia"], "key": "http://purl.org/au-research/grants/arc/IN170100012", "researchers": ["Dr Shino Konishi", "Dr Malcolm Allbrook", "Prof Thomas Griffiths"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 732704, "fundingScheme": "Discovery Indigenous", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:54Z", "dateTimeCreated": "2017-07-04T23:45:08Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Western Australia"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/IN170100012", "identifiers": ["http://purl.org/au-research/grants/arc/IN170100012", "IN170100012"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/945073"}]}]}