{"ANU": {"name": "Manuel Delicado Cantero", "link": "https://researchers.anu.edu.au/researchers/delicado-cantero-m", "colleges": "College of Arts and Social Sciences", "email": "manuel.delicado@anu.edu.au", "phone": "or", "expertise": ["Language In Time And Space Incl. Historical Linguistics Dialectology", "Linguistic Structures Incl. Grammar Phonology Lexicon Semantics", "Iberian Languages", "Linguistics", "Comparative Language Studies", "Applied Linguistics And Educational Linguistics"], "interest": ["Spanish syntax, formal syntax, historical linguistics, historical syntax, Spanish historical syntax, language change and variation, dialect syntax, Romance linguistics, pronunciation pedagogy"], "biography": "I earned my PhD in Spanish (Hispanic Linguistics) at The Ohio State University (USA) in 2009. In Spain, I obtained a licenciatura (B.A.) in Hispanic Philology (Spanish language and literature) and a Diploma de Estudios Avanzados (equivalent to M.A.) with concentration in Spanish language at the Universidad de Castilla-La Mancha (Ciudad Real campus). I also attended the Instituto Universitario Ortega y Gasset in Madrid, where I studied formal syntax.", "project": ["Projects in progress", "Australian Spanish Pronunciation Pedagogy Project, with Dr William Steed (ANU), Dr Alfredo Herrero de Haro (UoW) and Ms Alicia Mellado (CSIC, UCLM).", "The syntax and semantics of nominals in Spanish and Portuguese, with Dr Patricia Amaral (Indiana University, USA)", "The syntax of Spanish-Galician bilingual speakers, with Dr M. Carmen Parafita Couto (Leiden University, The Netherlands)", "Areas of interest/research", "-(Formal) Syntax of Spanish and other Romance languages, including dialect syntax-Historical syntax of Spanish and other Romance languages, esp. prepositional finite clauses and clausal nominalization/substantivization-Pronunciation pedagogy in Australia", "Professional memberships"], "publication": [{"title": "Substantivized embedded interrogative and exclamative finite wh-clauses in Spanish", "year": "2020", "source": "in M Gonz?lez-Rivera, S Sessarego  (ed.), Interface-Driven Phenomena in Spanish: Essays in Honor of Javier Gutiï¿½rrez-Rexach, Routledge Taylor & Francis Group, United States, pp. 85-110", "authors": ["Manuel Delicado Cantero"]}, {"title": "Not a fact: A synchronic analysis of el hecho\r\nde and o facto de", "year": "2019", "source": "Probus, vol. Online, no. 2019, pp. 1-27", "authors": ["Amaral P", "Manuel Delicado Cantero"]}, {"title": "Subcategorization and change: A diachronic analysis of sin embargo (de que)", "year": "2018", "source": "in Jonathan E MacDonald (ed.), Contemporary Trends in Hispanic and Lusophone Linguistics, John Benjamins Publishing Company, United States, pp. 31-47pp", "authors": ["Amaral P", "Manuel Delicado Cantero"]}, {"title": "Historia del español: sintaxis (History of Spanish: syntax)", "year": "2016", "source": "in Javier Gutierrez-Rexach (ed.), Enciclopedia de Lingüística Hispánica. Volume 2, Routledge Taylor & Francis Group, United Kingdom, pp. 590-600", "authors": ["Manuel Delicado Cantero"]}, {"title": "Continuity and Innovation in Peruvian Spanish: Pragmatics and Contact in (Differential) Object Marking", "year": "2015", "source": "in Sandro Sessarego and Melvin Gonzalez-Rivera (ed.), New Perspectives on Hispanic Contact Linguistics in the Americas, Iberoamericana Vervuert, Madrid and Frankfurt am Main, pp. 99-120", "authors": ["Mayer E", "Manuel Delicado Cantero"]}, {"title": "La enseñanza de la pronunciación del español en Australia: creencias y actitudes de los profesores (Teaching of the pronunciation of Spanish in Australia: beliefs and attitudes of teachers)", "year": "2015", "source": "Journal of Spanish Language Teaching, vol. online, p. 18", "authors": ["Manuel Delicado Cantero", "Steed W"]}, {"title": "Quantifying Australian L2 Spanish pronunciation", "year": "2014", "source": "Languages & Cultures Network for Australian Universities Colloquium (LCNAU 2013) - The Second National LCNAU Colloquium, ed. C Travis, J Hajek, C Nettelbeck, E Beckmann and A Lloyd-Smith, LCNAU, Australia, pp. 411-425", "authors": ["Steed W", "Manuel Delicado Cantero"]}, {"title": "Dequeísmo and queísmo in Portuguese and Spanish", "year": "2014", "source": "in Patrícia Amaral and Ana Maria Carvalho (ed.), Portuguese-Spanish Interfaces: Diachrony, synchrony, and contact, John Benjamins Publishing Company, Amsterdam Holland, pp. 95-120", "authors": ["Manuel Delicado Cantero"]}, {"title": "First things first: exploring Spanish students", "year": "2018", "source": "attitudes towards learning pronunciation in Australia'Language Learning Journal, vol. 46, no. 2, pp. 103-113", "authors": ["Steed W", "Manuel Delicado Cantero"]}, {"title": "Fair Dinkum: L2 Spanish Pronunciation in Australia by the Book", "year": "2014", "source": "Fifth Annual Conference: Pronunciation in Second Language Learning and Teaching, ed. J Levis, S McCrocklin, Iowa State University Press, USA, pp. 58-67", "authors": ["Steed W", "Manuel Delicado Cantero"]}, {"title": "Clausal Substantivization in Spanish: Syntax and Constraints\"", "year": "2013", "source": "Australian Journal of Linguistics 33.2106-120. \r\nDOI: 10.1080/07268602.2013.81452", "authors": ["Manuel Delicado Cantero"]}, {"title": "Prepositional Clauses in Spanish: A Diachronic and Comparative Syntactic Study", "year": "2013", "source": "De Gruyter MoutonBerlin Germany", "authors": ["Manuel Delicado Cantero"]}, {"title": "Relative and Possessive Features in Colloquial Spanish\"", "year": "2012", "source": "in Melvin González-Rivera and Sandro Sessarego (ed.)Current Formal Aspects of Spanish Syntax and Semantics, Cambridge Scholars Publishing, United Kingdom, pp. 78-94", "authors": ["Manuel Delicado Cantero"]}]}, "Microsoft-Academic": [{"title": "clausal substantivization in spanish syntax and constraints", "year": 2013, "source": "australian journal of linguistics", "authors": [{"name": "manuel delicado cantero", "affiliation": "australian national university"}], "id": 77346633}, {"title": "dequeismo and queismo in portuguese and spanish", "year": 2014, "source": "", "authors": [{"name": "manuel delicado cantero", "affiliation": "australian national university"}]}, {"title": "first things first exploring spanish students attitudes towards learning pronunciation in australia", "year": 2018, "source": "language learning journal", "authors": [{"name": "william steed", "affiliation": "james cook university"}, {"name": "manuel delicado cantero", "affiliation": "australian national university"}], "id": 140751389}, {"title": "la ensenanza de la pronunciacion del espanol en australia creencias y actitudes de los profesores teaching of the pronunciation of spanish in australia beliefs and attitudes of teachers", "year": 2015, "source": "", "authors": [{"name": "manuel delicado cantero", "affiliation": "australian national university"}, {"name": "william steed", "affiliation": "james cook university"}]}, {"title": "the syntax of spanish prepositional finite clauses in a historical and crosslinguistic perspective", "year": 2009, "source": "", "authors": [{"name": "manuel delicado cantero", "affiliation": "ohio state university"}]}, {"title": "subcategorization and change a diachronic analysis of sin embargo de que", "year": 2018, "source": "", "authors": [{"name": "patricia amaral"}, {"name": "manuel delicado cantero"}]}, {"title": "prepositional clauses in spanish a diachronic and comparative syntactic study", "year": 2013, "source": "", "authors": [{"name": "manuel delicado cantero"}]}, {"title": "variation and syntax in number expression in afro bolivian spanish", "year": 2011, "source": "", "authors": [{"name": "manuel delicado cantero"}, {"name": "sandro sessarego"}]}, {"title": "continuity and innovation in peruvian spanish pragmatics and contact in differential object marking", "year": 2015, "source": "", "authors": [{"name": "elisabeth mayer"}, {"name": "manuel delicado cantero"}]}, {"title": "romance linguistics in the pacific variation in time and space", "year": 2013, "source": "australian journal of linguistics", "authors": [{"name": "elisabeth mayer"}, {"name": "manuel delicado cantero"}], "id": 77346633}], "ANDS-Grants": []}