{"ANU": {"name": "Margaret (Maggie)  Brady", "link": "https://researchers.anu.edu.au/researchers/brady-ma", "colleges": "College of Arts and Social Sciences", "email": "maggie.brady@anu.edu.au", "phone": "", "expertise": ["Health And Community Services", "Public Policy", "Aboriginal And Torres Strait Islander Health", "Health Promotion", "Studies Of Aboriginal And Torres Strait Islander Society", "Public Health And Health Services", "Historical Studies"], "interest": [], "biography": "In 1998 Maggie published the first edition of a book of community development strategies for managing alcohol problems - The Grog Book - winning an Australian Award for Excellence in Educational Publishing. A revised edition was published in 2005. Maggie is also a University Medal winner, receiving the JG Crawford Prize for her PhD thesis in 2000.  Her interests include health and alcohol policies for indigenous peoples in Australia and internationally, the role of primary health care in alcohol interventions, and more recently, Aboriginal social enterprises and the liquor industry.", "project": [], "publication": [{"title": "The Reinvention of Sweden", "year": "2021", "source": "s \"Gothenburg System\" in Rural Australia: The Community Hotels Movement'Journal of Australian Studies, vol. 45, no. 1, pp. 108-124", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Radical Actions: Aboriginal and Non-Aboriginal Women", "year": "2019", "source": "s Temperance Activism in Nineteenth- and Twentieth-Century Australia'The Social History of Alcohol and Drugs, vol. 33, no. 2, pp. 286-309", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Dry Zones. Planning and the Hangovers of Liquor Licensing History", "year": "2019", "source": "Geographical Research, vol. 57, no. 4, pp. 452-453", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "They are among the Best Workers, Learning the Ways of a Vineyard Quickly\": Aboriginal People, Drinking, and Labor in the Early Australian Wine Industry", "year": "2019", "source": "Global Food History, vol. 5, no. 1-2, pp. 45-66", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Teaching", "year": "2017", "source": "Proper' Drinking? Clubs and pubs in Indigenous Australia - CAEPR Monograph 39ANU Press, Australia", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Book review:", "year": "2017", "source": "Atomic Thunder: the Maralinga Story' by Elizabeth Tynan.'Aboriginal History, vol. 41, pp. 235-236pp.", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Failing to \"carry the people along", "year": "2015", "source": "'Drug and Alcohol Review, vol. 34, no. 5, pp. 471-472", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "lcohol Fermentation among Australian Indigenous peoples", "year": "2015", "source": "in Helaine Selin (ed.), Encyclopaedia of the History of Science, Technology, and Medicine in Non-Western Cultures, Springer Netherlands, Netherlands, pp. 1-9. [3rd ed. 2016].", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Lessons from a History of Beer Canteens and Licensed Clubs in Indigenous Australian Communities", "year": "2014", "source": "CAEPR Discussion Paper, no. 290/201", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "[Review of]", "year": "2014", "source": "Drinking Smoke: The Tobacco Syndemic in Oceania By Mac Marshall Honolulu: University of Hawai'i Press. 2013'Oceania, vol. 84, no. 2, pp. 204-205", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Drug substances introduced by the Macassans: The mystery of the tobacco pipe", "year": "2013", "source": "in Marshall Clark and Sally K. May (ed.), Macassan History and Heritage: Journeys, Encounters and Influences, ANU ePress, ANU, Canberra, Australia, pp. 141-158", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Law Reforming Lawyers and Aboriginal Social Controls: The Case of the Western Australian Aboriginal Communities ACT", "year": "2013", "source": "Australian Indigenous Law Review, vol. 17, no. 1, pp. 38-46", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "The National Drug Strategy and Indigenous Australians: Missed opportunities and future challenges", "year": "2012", "source": "Drug and Alcohol Review, vol. 31, no. 6, pp. 747-753", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "The long lasting legacy of Maralinga", "year": "2011", "source": "in J. Lennon (ed.), I'm The One That Know This Country! (2nd ed), Aboriginal Studies Press, Canberra, pp. 145-153", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Fuel, cars and the geography of petrol sniffing", "year": "2011", "source": "Humanities Research, vol. 17, no. 2, pp. 121-133", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Making Tuba in the Torres Strait Islands: The Cultural Diffusion and Geographic Mobility of an Alcoholic Drink", "year": "2010", "source": "Journal of Pacific History, vol. 45, no. 3, pp. 315-330", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "On- and off-premise drinking choices among Indigenous Australians: The influence of socio-spatial factors", "year": "2010", "source": "Drug and Alcohol Review, vol. 29, no. 4, pp. 446-451", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Book review: Benelong", "year": "2009", "source": "s Haven: Recovery from Alcohol and Drug Abuse within an Aboriginal Australian Residential Treatment Centre'Australian Journal of Anthropology, The, vol. 20, no. 3, pp. 402-404", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "From platitudes to policies: The evolving response to volatile substance misuse in Australia", "year": "2008", "source": "in David Moore and Paul Dietze (ed.), Drugs and Public Health: Australian Perspectives on Policy and Practice, Oxford University Press, South Melbourne, pp. 39-48", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "First taste: how Indigenous Australians learned about grog", "year": "2008", "source": "Alcohol Education and Rehabilitation FoundationDeakin (Canberra) ACT", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Postcript to \"Fact or fiction: a critique of the National Aboriginal and Torres Strait Islander Social Survey 2002\", (letter to the Editor)", "year": "2007", "source": "Drug and Alcohol Review, vol. 26, no. 2, pp. 221-222", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Out from the shadow of prohibition", "year": "2007", "source": "in J. Altman and M. Hinkson (ed.), Coercive Reconciliation: Stabilise, Normalise, Exit Aboriginal Australia, Arena Printing and Publishing Pty Ltd, Melbourne, pp. 185-194", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "lcohol regulation and the emergency intervention: Not exactly Best Practice", "year": "2007", "source": "Dialogue (Academy of the Social Sciences in Australia), vol. 26, no. 3, pp. 59-65", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Equality and difference: Persisting historical themes in health and alcohol policies affecting Indigenous Australians", "year": "2007", "source": "Journal of Epidemiology and Community Health, vol. 61, no. 9, pp. 759-763", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Substance use in the 2002 NATSISS", "year": "2006", "source": "Indigenous Socioeconomic Outcomes: Assessing Recent Evidence, ed. B.H. Hunter, ANU ePress, Canberra, pp. 231-247", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "The role of a rural sobering up centre in managing alcohol-related harm to Aboriginal people in South Australia", "year": "2006", "source": "Drug and Alcohol Review, vol. May, no. 25, pp. 201-206", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Fact or fiction? A critique of the National Aboriginal and Torres Strait Islander Social Survey 2002", "year": "2006", "source": "Drug and Alcohol Review, vol. 25, no. 3, pp. 277-287", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Making use of medics: overcoming cultural constraints in alcohol interventions", "year": "2005", "source": "in Luke Taylor, Greme K. Ward, Graham Henderson, Richard Davis & Lynley A. Wallis (ed.), The Power of Knowledge: the resonance of tradition, Aboriginal Studies Press, Canberra Australia, pp. 130-40", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "The Grog Book goes offshore: Adapting an Australian Indigenous resource for use in South Africa", "year": "2005", "source": "Aboriginal and Islander Health Worker Journal, vol. 29, no. 4, pp. 18-20", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Tackling Alcohol Problems: Strengthening Community Action in South Africa", "year": "2005", "source": "ComPress and Blue WeaverCape Town, South Africa", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Health and wellbeing", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Pan Macmillan Publishers Australia, Sydney, Australia, pp. 156-171", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "The Grog Book: Strengthening Indigenous Community Action on Alcohol", "year": "2005", "source": "Commonwealth Department of Health and AgeingCanberra, Australia", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Indigenous Australia and Alcohol Policy: Meeting Difference with Indifference", "year": "2004", "source": "UNSW PressSydney", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Other people, other drugs: The policy response to petrol sniffing among Indigenous Australians", "year": "2004", "source": "Drug and Alcohol Review, vol. 23, pp. 253-60", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Human rights, drinking rights? Alcohol policy and Indigenous Australians", "year": "2004", "source": "Lancet, The (UK edition), vol. 364, no. Oct 2004, pp. 1282-83", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Which bloke would stand up for Yalata? The struggle of an Aboriginal community to control the availability of alcohol", "year": "2003", "source": "Australian Aboriginal Studies, vol. 2003, no. Number 2, pp. 62-71", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Mutual exploitation? Aboriginal Australian encounters with Europeans, Southeast Asians and tobacco", "year": "2003", "source": "in B. Jankowiak and D. Bradburd (ed.), Drugs, Labor, and Colonial Expansion, University of Arizona Press, Tucson, Arizona, USA, pp. 31-58", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Healthcare in remote Australian Indigenous communities", "year": "2003", "source": "Lancet, The (UK edition), vol. 362, no. s1, pp. 36-37", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Testing an Indigenous health resource: The participatory development process with The Grog Book", "year": "2002", "source": "Health Promotion Journal of Australia, vol. 13, no. 3, pp. 247-249", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "The demise of a planned randomised controlled trial in an urban Aboriginal Medical Service", "year": "2002", "source": "Medical Journal of Australia, vol. 176, pp. 273-76", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "Historical and cultural roots of tobacco use among Aboriginal and Torres Strait Islander people", "year": "2002", "source": "Australian and New Zealand Journal of Public Health, vol. 26, no. 2, pp. 120-124", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "The feasibility and acceptability of introducing brief intervention for alcohol misuse in an urban Aboriginal medical service", "year": "2002", "source": "Drug and Alcohol Review, vol. 21, pp. 375-380", "authors": ["Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady", "Margaret (Maggie)  Brady"]}, {"title": "borigines and alcohol", "year": "2002", "source": "Meanjin, vol. 61, no. 2, pp. 147-53", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Working with Dopstop: Alcohol problems in the Western Cape, South Africa", "year": "2001", "source": "Australasian Review of African Studies, vol. XXIII, no. 1, pp. 109-11", "authors": ["Margaret (Maggie)  Brady"]}, {"title": "Giving away the grog: A positive strategy for addressing substance abuse, Australia", "year": "2001", "source": "in Inuit Circumpolar Conference (Canada) (ed.), Indigenous Peoples and International Development: Case Study Profiles, Conference Organising Committee, Ottawa, Canada, pp. 87-97", "authors": ["Margaret (Maggie)  Brady"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}