{"ANU": {"name": "Margaret (Margot)  Lyon", "link": "https://researchers.anu.edu.au/researchers/lyon-ml", "colleges": "College of Arts and Social Sciences", "email": "margot.lyon@anu.edu.au", "phone": "0403770640", "expertise": ["Social And Cultural Anthropology"], "interest": ["Critical medical anthropology (including comparative biomedical systems)Theories of sickness and healingThe anthropology of pharmaceuticals (particularly changing patterns of medicine use)Emotion and social theoryEmbodiment and emotionIsland Southeast Asia, particularly IndonesiaGlobalisation and Change"], "biography": "", "project": ["Current project: Patterns of medicine use in Indonesia and the embodiment of change."], "publication": [{"title": "Testimony of a Messenger", "year": "2016", "source": "pp. 1-4. Inside Indonesia 124: April-June", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Epistemology, medical science and problem-based learning: introducing an epistemological dimension into the medical-school curriculum", "year": "2009", "source": "in Brosnan, C Taylor BS (ed.), Handbook of the Sociology of Medical Education, Routledge, Taylor & Francis Group, London, New York, pp. 207-224", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Emotion, Embodiment and Agency: the Place of a Social Emotions perspective in the Cross-Disciplinary Understanding of Emotional processes", "year": "2009", "source": "in Birgitt Rottger-Rossler, Hans J. Markowitsch (ed.), Emotions as bio-cultural processes, Springer, New York, pp. 199-213", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Lyon", "year": "2008", "source": "M. L. 2008‘Expanding Corticosteroid use in the developing world as a factor in the epidemiology of emerging and re-emerging infectious diseases’, Proceedings of the International Society for Infectious Diseases 13th International Congress on Infectious Diseases, Kuala Lumpur, Malaysia, Published by ISID. Proceedings of the International Society for Infectious Diseases 13th International Congress on Infectious Diseases, Kuala Lumpur, Malaysia, Published by ISID.", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Technologies of Feeling and Being: Medicines in Contemporary Indonesia", "year": "2005", "source": "IIAS Newsletter, vol. 37, p. 14", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Immune to Emotion: The Relative Absence of Emotion in PNI, and its Centrality to Everything Else", "year": "2003", "source": "in J. Wilce (ed.), Social and Cultural Lives of Immune Systems, Routledge, Taylor & Francis Group, London, pp. 82-104", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "Jamu for the Ills of Modernity", "year": "2003", "source": "Inside Indonesia, vol. 75, pp. 14-16", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘Emotion and embodiment: The respiratory mediation of bodily and social processes’", "year": "1999", "source": "in HintonAL (ed), Biocultural Approaches to the Emotions,  Cambridge University Press, pp. 182-212", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘The limitations of cultural constructionism in the study of emotion’", "year": "1998", "source": "in BendelowGA, Williams, SJ, (eds), Emotions in Social Life: Critical Themes and Contemporary Issues, Routledge, pp. 39-59. [VOLUME RE-ISSUED 2005 by Taylor and Francis E-Library.", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘The material body", "year": "1997", "source": "social processesand emotion: ‘Techniques of the Body’ revisited’, Body and Society 3(1):83-101, Sage.", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘C. Wright Mills meets prozac: The relevance of ‘social emotion’ to the sociology of health and illness’", "year": "1996", "source": "in JamesV, Gabe, J (eds), Health and the Sociology of Emotion, Sociology of Health and Illness Monograph Series, Blackwell, Oxford, pp. 55-78.", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘Missing emotion: The limitations of cultural constructionism in the study of emotion’", "year": "1995", "source": "Cultural Anthropology 10(2):244-263.", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘Emotion as mediator of somatic and social processes: The example of respiration’", "year": "1994", "source": "in WentworthWM, Ryan, J (eds), Series editor Franks, D, Social Perspectives on Emotion Vol. II, JAI Press, Greenwich, Conn, pp. 83-108", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "with J.M.Barbalet)", "year": "1994", "source": "‘Society’s body: Emotion and the “somatization” of social theory’in Csordas TJ (ed), Embodiment and Experience: The Existential Ground of Culture and Self, Cambridge University Press, pp. 48-66", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘Technology", "year": "1994", "source": "medicineand psychosocial context: The case of psychoneuroimmunology’, in Robinson, I (ed), Life and Death Under High Technology Medicine, Fulbright Colloquium Series, Manchester University Press, pp. 259-273", "authors": ["Margaret (Margot)  Lyon"]}, {"title": "‘Psychoneuroimmunology: The problem of the situatedness of illness and the conceptualization of healing’", "year": "1993", "source": "CultureMedicine and Psychiatry 17(1):77-97.", "authors": ["Margaret (Margot)  Lyon"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}