{"ANU": {"name": "Margaret (Marnie) Forster", "link": "https://researchers.anu.edu.au/researchers/forster-m-a", "colleges": "College of Science", "email": "marnie.forster@anu.edu.au", "phone": "", "expertise": ["Geochronology", "Mineralogy And Crystallography", "Structural Geology", "Tectonics"], "interest": ["Argon Geochronology @ argon.anu.edu.auDetermining when and how movement in the ductile zone of the Earth occur. Dating deformation and metamorphic events that occur at major zones of collision or extension during Earth's history.  Dating deformation and movement zones using Ar/Ar geochronology within the framework of structural geology and microstructure.Thermal histories and evolution of metamorphic and igneous terranes using structural geology inconjuction with temperature/time histories of specific zones.Temperature+time histories of alteration zones and fault zones. Present arenas: Australian lithosphere, SE Asia (Palawan, Sulawesi, Borneo, Java); NW Himalaya (Tso Morari, Ladakh, Rhotang); Greece (Aegean: Evia, Sifnos, Ios, Syros); European Alps, north America continent."], "biography": "", "project": [], "publication": [{"title": "r/39Ar thermochronology in the ios basement terrane resolves the tectonic significance of the south cyclades shear zone", "year": "2020", "source": "Geological Society of London Special Publication, no. 0305-8719", "authors": ["Lister G", "Margaret (Marnie) Forster", "Koudashev O"]}, {"title": "Geochemical constraints on Cenozoic intraplate magmatism and their relation to Jurassic dolerites in Tasmania, using Sr-Nd-Pb isotopes", "year": "2019", "source": "Chemical Geology, vol. 506, pp. 225-273", "authors": ["Meeuws F", "Foden J", "Holford S", "Margaret (Marnie) Forster"]}, {"title": "Structural Geology and the Seismotectonics of the 2004 Great Sumatran Earthquake", "year": "2018", "source": "Tectonics, vol. 37, no. 11, pp. 4101-4119", "authors": ["Lister G", "Margaret (Marnie) Forster", "Muston J"]}, {"title": "Miocene tectonic of the Southeast Arm of Sulawesi, Indonesia: Based on petrology data, geochemistry, and 40Ar/39Ar geochronology of metamorphic rocks from Rumbia Complex", "year": "2018", "source": "International Conference on Earth Science, Mineral, and Energy 2018, ICEMINE 2018, IOP Publishing, TBC, pp. 8pp", "authors": ["Mawaleda M", "Husain J", "Margaret (Marnie) Forster"]}, {"title": "Lineaments and earthquake ruptures on the East Japan megathrust", "year": "2018", "source": "Lithosphere, vol. 10, no. 4, pp. 512-522pp", "authors": ["Lister G", "Tkalčić H", "Hejrani B", "Margaret (Marnie) Forster"]}, {"title": "Tectonometamorphic evolution of Seram and Ambon, eastern Indonesia: Insights from 40Ar/39Ar geochronology", "year": "2017", "source": "Gondwana Research, vol. 44, pp. 35-53pp", "authors": ["Pownall J", "Margaret (Marnie) Forster", "Hall R"]}, {"title": "Rapid cooling and exhumation as a consequence of extension and crustal thinning: Inferences from the Late Miocene to Pliocene Palu Metamorphic Complex, Sulawesi, Indonesia", "year": "2017", "source": "Tectonophysics, vol. 712, pp. 600-622 pp", "authors": ["Hennig J", "Hall R", "Margaret (Marnie) Forster"]}, {"title": "Triassic to Cretaceous Sundaland-Pacific subduction margin in West Sarawak, Borneo", "year": "2017", "source": "Tectonophysics, vol. 694, pp. 35-56", "authors": ["Breitfeld H", "Hall R", "Galin T", "Margaret (Marnie) Forster"]}, {"title": "Hydrothermal alteration and timing of gold mineralisation in the Rumbia Complex, Southeast Arm of Sulawesi, Indonesia", "year": "2017", "source": "2nd Transdisciplinary Research on Environmental Problems in Southeast Asia, TREPSEA 2016, IOP Publishing, Bristol, United Kingdom, pp. 012030 (15pp)", "authors": ["Mawaleda M", "Suparka E", "Abdullah C", "Margaret (Marnie) Forster"]}, {"title": "r/39Ar Geochronology of Rumbia Schist Complex: New Implications For Timing and Hydrothermal Activity in The Southeast Sulawesi Gold Prospect, Indonesia", "year": "2016", "source": "International Journal of Engineering and Science Applications (ISEA), vol. 3, no. 2, pp. 145-152pp", "authors": ["Musri M", "Abdullah C", "Basuki N", "Margaret (Marnie) Forster"]}, {"title": "White mica 40Ar/39Ar age spectra and the timing of multiple episodes of high-P metamorphic mineral growth in the Cycladic eclogite-blueschist belt, Syros, Aegean Sea, Greece", "year": "2016", "source": "Journal of Metamorphic Geology, vol. 34, no. 5, pp. 401-421", "authors": ["Lister G", "Margaret (Marnie) Forster"]}, {"title": "Highly retentive core domains in K-feldspar and their implications for Ar-40/Ar-39 thermochronology illustrated by determining the cooling curve for the Capoas Granite, Palawan, The Philippines", "year": "2015", "source": "Australian Journal of Earth Sciences, vol. 62, no. 7, pp. 883-902", "authors": ["Margaret (Marnie) Forster", "Armstrong R", "Kohn B"]}, {"title": "r/39Ar geochronology and the diffusion of 39Ar in phengite-muscovite intergrowths during step-heating experiments in vacuo", "year": "2014", "source": "Geological Society of London Special Publication, vol. 378, pp. 117-135", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "South China continental margin signature for sandstones and granites from Palawan, Philippines", "year": "2014", "source": "Gondwana Research, vol. 26, no. 2, pp. 699-718", "authors": ["Suggate S", "Cottam M", "Hall R", "Margaret (Marnie) Forster"]}, {"title": "The timing of sedimentation and Buchan metamorphism in the Grampian Terrane in Scotland from Ar-40/Ar-39 apparent age spectra", "year": "2014", "source": "Journal of the Geological Society, vol. 171, no. 3, pp. 343-352", "authors": ["Stenhouse I", "Margaret (Marnie) Forster", "Lister G"]}, {"title": "Dating deformation using crushed alkali feldspar: 40Ar/39Ar geochronology of shear zones in the Wyangala Batholith, NSW, Australia", "year": "2014", "source": "Australian Journal of Earth Sciences, vol. 61, no. 4, pp. 619-629", "authors": ["Margaret (Marnie) Forster", "Lister G", "Lennox P"]}, {"title": "Emplacement and deformation ages of the Wyangala Granite, Cowra, NSW", "year": "2014", "source": "Australian Journal of Earth Sciences, vol. 61, no. 4, pp. 607-618", "authors": ["Lennox P", "Margaret (Marnie) Forster", "Williams I"]}, {"title": "Earth", "year": "2014", "source": "s youngest known ultrahigh-temperature granulites discovered on Serameastern Indonesia', Geology, vol. 42, no. 4, pp. 279-282", "authors": ["Pownall J", "Hall R", "Armstrong R", "Margaret (Marnie) Forster"]}, {"title": "Skewed orientation groups in scatter plots of earthquake fault plane solutions: Implications for extensional geometry at oceanic spreading centers", "year": "2014", "source": "Journal of Geophysical Research: Solid Earth, vol. 119, no. 3, pp. 2055-2067", "authors": ["Lister G", "Tkalčić H", "McClusky S", "Margaret (Marnie) Forster"]}, {"title": "Comment on \"Dextral transpression and late-Eocene magmatism in the trans-Himalayan Ladakh Batholith (North India): Implications for tectono-magmatic evolution of the Indo-Eurasian collisional arc\"", "year": "2013", "source": "International Journal of Earth Sciences (Geologische Rundschau), vol. 102, no. 3, pp. 969-972", "authors": ["White L", "Lister G", "Ahmad T", "Margaret (Marnie) Forster"]}, {"title": "Timing and heat sources for the Barrovian metamorphism, Scotland", "year": "2013", "source": "Lithos, vol. 177, pp. 148-163", "authors": ["Viete D", "Oliver G", "Fraser G", "Margaret (Marnie) Forster"]}, {"title": "Neogene rock uplift and erosion in northern Borneo: Evidence from the Kinabalu granite, Mount Kinabalu", "year": "2013", "source": "Journal of the Geological Society, vol. 170, no. 5, pp. 805-816", "authors": ["Cottam M", "Hall R", "Sperber C", "Margaret (Marnie) Forster"]}, {"title": "r/39Ar geochronology and the diffusion of 39Ar in phengite-muscovite intergrowths during step-heating experiments in vacuo. In: Advances in 40Ar/39Ar Dating: from Archaeology to Planetary Sciences", "year": "2013", "source": "Eds. JourdanF., Mark, D.F. and Verati, C. Geological Society, London, Special Publications, SP378, doi:10.1144/SP378.", "authors": ["Margaret (Marnie) Forster"]}, {"title": "Ripping and tearing the rolling-back New Hebrides slab", "year": "2012", "source": "Australian Journal of Earth Sciences, vol. 59, no. 6, pp. 899-911", "authors": ["Lister G", "White L", "Hart S", "Margaret (Marnie) Forster"]}, {"title": "Is the switch from I- to S-type magmatism in the Himalayan Orogen indicative of the collision of India and Eurasia?", "year": "2012", "source": "Australian Journal of Earth Sciences, vol. 59, no. 3, pp. 321-340", "authors": ["White L", "Ahmad T", "Lister G", "Margaret (Marnie) Forster"]}, {"title": "The nature and origin of the barrovian metamorphism, Scotland: 40Ar/39ar apparent age patterns and the duration of metamorphism in the biotite zone", "year": "2011", "source": "Journal of the Geological Society, vol. 168, no. 1, pp. 133-146", "authors": ["Viete D", "Margaret (Marnie) Forster", "Lister G"]}, {"title": "Thermal history of a pebble in the Indus Molasse at the margin of a Himalayan metamorphic core complex", "year": "2011", "source": "Journal of the Virtual Explorer, Electronic Edition, vol. 38, no. 4, pp. 1-21", "authors": ["Margaret (Marnie) Forster", "White L", "Ahmad T"]}, {"title": "Basement character and basin formation in Gorontalo Bay, Sulawesi, Indonesia: new observations from the Togian Islands", "year": "2011", "source": "Geological Society of London Special Publication, vol. 355, pp. 177-202", "authors": ["Cottam M", "Hall R", "Margaret (Marnie) Forster"]}, {"title": "", "year": "2011", "source": "The Science of Microstructure Part II. Journal of the Virtual Explorer", "authors": ["Margaret (Marnie) Forster", "Fitzgerald J", "eds"]}, {"title": "rgon enters the retentive zone: reassessment of diffusion parameters for K-feldspar in the South Cyclades Shear Zone, Ios, Greece", "year": "2010", "source": "in Spalla, M.I., Marotta, A.M. and Gosso, G. (ed.), Advances in Interpretation of Geological Processes: Refinement of Multi-scale Data and Integration in Numerical Modelling, Geological Society of London, London, pp. 17-34", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Recognizing episodic lithospheric thinning along a convergent plate margin: the example of the Early Oligocene Alps", "year": "2010", "source": "Earth-Science Reviews, vol. 103, no. 3-4, pp. 81-98", "authors": ["Beltrando M", "Lister G", "Rosenbaum G", "Margaret (Marnie) Forster"]}, {"title": "The Science of Microstructure - Part I", "year": "2010", "source": "Journal of the Virtual Explorer 2010", "authors": ["Margaret (Marnie) Forster", "Fitzgerald J", "eds"]}, {"title": "Core-complex-related extension of the Aegean lithosphere initiated at the Eocene-Oligocene transition", "year": "2009", "source": "Journal of Geophysical Research, vol. 114, no. 2, p. 36", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Porphyroblast rotation versus non-rotation: Conflict resolution: COMMENT", "year": "2009", "source": "Geology", "authors": ["Lister G", "Margaret (Marnie) Forster"]}, {"title": "Dating microstructures by the Ar-40/Ar-39 step-heating technique: deformation-pressure-temperature-time history of the Penninic Units of the Western Alps", "year": "2009", "source": "Lithos, vol. 113, no. 3-4, pp. 801-819", "authors": ["Beltrando M", "Lister G", "Margaret (Marnie) Forster"]}, {"title": "Deformation mode switches in the Penninic units of the Utier Valley (Western Alps): Evidence for a dynamic orogen", "year": "2008", "source": "Journal of Structural Geology, vol. 30, no. 2, pp. 194-219", "authors": ["Beltrando M", "Lister G", "Hermann J", "Margaret (Marnie) Forster"]}, {"title": "Boudinage of a stretching slablet implicated in earthquakes beneath the Hindu Kush", "year": "2008", "source": "Nature Geoscience, vol. 1, pp. 196-201", "authors": ["Lister G", "Kennett B", "Richards S", "Margaret (Marnie) Forster"]}, {"title": "Tectonic sequence diagrams and the structural evolution of schists and gneisses in multiply deformed terranes", "year": "2008", "source": "Journal of the Geological Society, vol. 165, pp. 923-939", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Dating movement in shear zones: The example of the south cyclades shear zone, Ios, Aegean Sea, Greece", "year": "2008", "source": "Donald D Harrington Symposium on the Geology of the Aegean, IOP Publishing, Bristol, UK", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "The accretionary model for orogenesis and its application to the evolution of the Aegean crust", "year": "2008", "source": "Donald D Harrington Symposium on the Geology of the Aegean, IOP Publishing, Bristol, UK, p. 5", "authors": ["Lister G", "Margaret (Marnie) Forster"]}, {"title": "Glaucophane schists and associated rocks from Sifnos (Cyclades, Greece): New constraints on the P-T evolution from oxidized systems", "year": "2008", "source": "Lithos, vol. Online publication 2008, pp. CHEMGE-15519", "authors": ["Groppo C", "Margaret (Marnie) Forster", "Lister G"]}, {"title": "Tectonic mode switches and the nature of orogenesis", "year": "2008", "source": "Lithos, vol. Online, p. 18", "authors": ["Lister G", "Margaret (Marnie) Forster"]}, {"title": "re-evaluation of the breakup of South America and Africa using deformable mesh reconstruction software", "year": "2007", "source": "Journal of the Virtual Explorer, vol. 25, no. 1, pp. 1-14", "authors": ["Smith M", "Kurtz J", "Richards S", "Margaret (Marnie) Forster"]}, {"title": "Inside the Aegean Metamorphic Core Complexes", "year": "2007", "source": "Journal of the Virtual Explorer, Electronic Edition, vol. 27", "authors": ["Lister G", "Margaret (Marnie) Forster", "Ring U"]}, {"title": "Several distinct tectono-metamorphic slices in the Cycladic eclogite-blueschist belt, Greece", "year": "2005", "source": "Contributions to Mineralogy and Petrology, vol. 150, pp. 523-545", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "The interpretation of 40Ar/39 Ar apparent age spectra produced by mixing: application of the method of asymptotes and limits", "year": "2004", "source": "Journal of Structural Geology, vol. 26, no. 2, pp. 287-305", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Mapping of oceanic crust with \"HP\" to \"UHP\" metamorphism: The Lago di Cignana Unit, (Western Alps)", "year": "2004", "source": "in Pasquare, G. and Venturini, C. (ed.), Mapping Geology in Italy, Geological Society of London, Bath, pp. 279-288", "authors": ["Margaret (Marnie) Forster", "Lister G", "Compagnoni R"]}, {"title": "Cretaceous metamorphic core complexes in the Otago Schist, New Zealand", "year": "2003", "source": "Australian Journal of Earth Sciences, vol. 50, pp. 181-198", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Episodicity during Orogenesis.", "year": "2001", "source": "in Miller J A, Holdsworth R E, Buick I S and Hand M (ed.), Continental Reactivation and Reworking, Geological Society of London, London, pp. 89-113", "authors": ["Lister G", "Margaret (Marnie) Forster", "Rawling T"]}, {"title": "Separate episodes of eclogite and blueschist facies metamorphism in the Aegean metamorphic core complex of Ios, Cyclades, Greece", "year": "1999", "source": "in Mac Niocaill, C and Ryan, P.D. (ed.), Continental Tectonics, Geological Society of London, London, pp. 157-177", "authors": ["Margaret (Marnie) Forster", "Lister G"]}, {"title": "Detachment faults in the Aegean core complex of Ios, Cyclades, Greece", "year": "1999", "source": "in Ring, U., Brandon, M.T., Lister, G.S. and Willett, S.D. (ed.), Exhumation Processes: Normal Faulting, Ductile Flow and Erosion, Geological Society of London, London, pp. 305-323", "authors": ["Margaret (Marnie) Forster", "Lister G"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}