{"ANU": {"name": "Maria Hynes", "link": "https://researchers.anu.edu.au/researchers/hynes-mh", "colleges": "College of Arts and Social Sciences", "email": "maria.hynes@anu.edu.au", "phone": "", "expertise": ["Sociology", "Social Philosophy", "Sociology And Social Studies Of Science And Technology", "Screen And Media Culture"], "interest": ["Art-Science in the Innovation AgeAt a time in which governments world-wide are insisting on the need for innovation in ideas, new and fascinating institutions are coming into being. This area of my research examines emerging institutions in which artists and scientists come together to engage in collaborative and interdisciplinary problem solving and experimental projects. I am especially interested in exploring the diverse forms of cognitive and affective labour to which such institutional arrangements give rise. Affect/BiopowerUnderpinning much of my research is an interest in the 'affective turn' in sociological theory and method, which involves a shift away from cognitive understandings of social action and knowledge production toward a focus on embodied capacities. I have an ongoing interest in the concept of affect as a way of understanding social action and transformation at a time in which power operates directly on our vitality, modulating our capacities for action. This interest in the affective turn has informed research in the following areas:(i) The limits of traditional humanist frameworks for approaching contemporary problems. I have undertaken post-humanist rearticulations of what would normally be seen as very human centred themes (the problem of indifference, the role of enthusiasm in our engagement with the world and the place of charismatic authority in contemporary society).(ii) The changing character of power in light of its incursion into the domain of 'life itself'. How is our very conceptualisation of life shaped by scientific knowledge and vitalised by artistic engagements?    Micropolitics and ResistanceI am interested in the micropolitical and affective dimensions of resistance. How do contemporary social actors intervene in the micropolitics of everyday life? I write on the role that art plays in challenging some of the ways that Sociology has approached the question of political action. I have also written with Scott Sharpe, a Cultural Geographer at UNSW@Canberra, on the political, cultural, aesthetic and ethical dimensions of lightness, in view of the privileging of gravity in the history of thinking about political and social action. An important aspect of this work is the role that humour can play in generating social, cultural and political change, seen from the point of view of highly visible, macropolitical struggles but especially from a more micropolitical perspective. We have written on affirmation, culture jamming and the affective politics of the anti-globalisation movement. I am an Associate Member of the Unit of Play at Goldsmiths College, University of London, which explores the problematic of play in relation to diverse empirical problems. Racism and Anti-racism I am interested in the project of decolonising the social sciences, understood not merely as a reinclusion of excluded authors from the canon but, more broadly, as a project of reconfiguring what a discipline of sociology is, once the negation of its debt to blackness and the undercommons is challenged. In this, I am very influenced by the work of Stefano Harney and Fred Moten, Denise da Silva Ferreira and Eduardo Viveiros de Castro.I have been a chief investigator on an ARC Linkage project on racism and anti-racism, titled ‘Bystander Research Proposal: From the Challenging Racism Project’. The project involves qualitative and quantitative research into the enablers and constraints of bystander action as a response to racism."], "biography": "I have been employed in Sociology at ANU on a continuing basis since February 2009 after being awarded my PhD at Macquarie University. Principally, my interest lies in the kinds of vital forces that enervate social life, producing new forms of life, innovative modes of action and transformations in our habits of thinking, doing, seeing and saying. This interest has lead me to analyse the impact of vitalist, reductionist and holist modes of thinking on our conception of ‘life itself’; the ways that life has been transformed by genetic science and technological developments; the role of art, and specifically sculpture, in producing innovative modes of thinking and being; the politics of affect broadly, and the affective politics of humour more specifically. I teach in the areas of Contemporary Social Theory and the Sociology of Resistance. While my teaching draws on a wide range of classical and contemporary social theorists, my research is largely informed by post-structuralist theory, and more particularly by the thought of Deleuze, Bergson, Guattari, Massumi, Spinoza, Leibniz, Nietzsche, Ravaisson and the Italian Autonomists.", "project": [], "publication": [{"title": "Cosmic Subjectivity: Guattari and the Production of Subjective Cartographies", "year": "2021", "source": "Area", "authors": ["Maria Hynes", "Sharpe S"]}, {"title": "The (schizo)analysis of value in the", "year": "2019", "source": "Age of Innovation''in T Jellis, J Gerlach & J-D Dewsbury (ed.), Why Guattari?: A Liberation of Cartographies, Ecologies and Politics, Routledge, Oxon, pp. 105-118", "authors": ["Maria Hynes"]}, {"title": "Design Thinking, Design Activism, Design Study", "year": "2019", "source": "Fibreculture, vol. 30, pp. 24-41", "authors": ["Maria Hynes"]}, {"title": "Encountering the animal: Temple Grandin, slaughterhouses and the possibilities of a differential ontology", "year": "2017", "source": "The Sociological Review, pp. 1-16pp.", "authors": ["Todd R", "Maria Hynes"]}, {"title": "Indifferent by nature: A post-humanist reframing of the problem of indifference", "year": "2016", "source": "Environment and Planning A, vol. 48, no. 1, pp. 24-39", "authors": ["Maria Hynes"]}, {"title": "Black-faced, red faces: the potentials of humour for anti-racist action", "year": "2016", "source": "Ethnic and Racial Studies, vol. 39, no. 1, pp. 87-104", "authors": ["Sharpe S", "Maria Hynes"]}, {"title": "Public sociology for an emergent people: The affective gift in Marina Abramovic", "year": "2016", "source": "s The Artist is Present'Sociological Review, vol. 64, no. 4, pp. 805-820", "authors": ["Maria Hynes"]}, {"title": "Habits, style and how to wear them lightly", "year": "2015", "source": "Cultural Geographies, vol. 22, no. 1, pp. 67-83", "authors": ["Maria Hynes", "Sharpe S"]}, {"title": "FFECT an unworkable concept", "year": "2015", "source": "Angelaki, vol. 20, no. 3, pp. 115-129", "authors": ["Maria Hynes", "Sharpe S"]}, {"title": "The Minute Interventions of Stewart Lee The affirmative conditions of possibility in comedy, repetition and affect", "year": "2014", "source": "Performance Research, vol. 19, no. 2, pp. 116-125", "authors": ["Sharpe S", "Dewsbury J", "Maria Hynes"]}, {"title": "The ethico-aesthetics of life: Guattari and the problem of bioethics", "year": "2013", "source": "Environment and Planning A, vol. 45, no. 8, pp. 1929 - 1943", "authors": ["Maria Hynes"]}, {"title": "Worshipping Bodies: Affective Labour in the Hillsong Church", "year": "2013", "source": "Geographical Research, vol. 51, no. 2, pp. 173-179", "authors": ["Wade M", "Maria Hynes"]}, {"title": "Reconceptualizing resistance: sociology and the affective dimension of resistanc", "year": "2013", "source": "British Journal of Sociology, vol. 64, no. 4, pp. 559-577", "authors": ["Maria Hynes"]}, {"title": "The Contemporary and Eccentric Position of", "year": "2012", "source": "The Winnebago Man''Parallax, vol. 18, no. 2, pp. 17-31", "authors": ["Sharpe S", "Maria Hynes"]}, {"title": "Unveiling seductions beyond societies of control: affect, security, and humour in spaces of aeromobility", "year": "2012", "source": "Environment and Planning D: Society and Space, vol. 30, no. 4, pp. 694-710", "authors": ["Bissell D", "Maria Hynes", "Sharpe S"]}, {"title": "ppearing true in the social sciences: Reflections on an academic hoax", "year": "2012", "source": "Journal of Sociology, Vol. 48, No. 3, September, ISSN 1440-7833", "authors": ["Maria Hynes", "S Sharpe A Greig"]}, {"title": "Surpassing Ecstasy, Infinite Enthusiasm", "year": "2011", "source": "Parallax, vol. 17, no. 2, pp. 59-70", "authors": ["Maria Hynes"]}, {"title": "Yea-Saying Laughter", "year": "2010", "source": "Parallax, vol. 16, no. 3, pp. 44-54", "authors": ["Maria Hynes", "Sharpe S"]}, {"title": "ffected With Joy: Evaluating the mass actions of the anti-globalisation movement", "year": "2009", "source": "Borderlands e-journal, vol. 8, no. 3, pp. 1-21", "authors": ["Maria Hynes", "Sharpe S ("]}, {"title": "The Windschuttle Hoax and the Problem of Truth", "year": "2009", "source": "Annual Conference of The Australian Sociological Association (TASA 2009), ed. The Australian Sociological Association, TASA (the Australian Sociological Association), Canberra, p. 14", "authors": ["Maria Hynes", "Greig A", "Sharpe S ("]}, {"title": "Cities of race hatred?: The Spheres of Racism and Anti Racism in Contemporary Australian Cities", "year": "2009", "source": "Cosmopolitan Civil Societies: An Interdisciplinary Journal, vol. 1, no. 1, pp. 14 pp", "authors": ["Dunn K", "Forrest J", "PePua R (", "Maria Hynes"]}, {"title": "Chasing Democracy: Dissent, Democracy and APEC", "year": "2008", "source": "Social Alternatives, vol. 27, no. 1, pp. 34-38", "authors": ["Maria Hynes", "Sharpe S", "Greig A ("]}, {"title": "Laughing With the Yes Men: the Politics of Affirmation", "year": "2007", "source": "Continuum: Journal of Media and Cultural Studies, vol. 21, no. 1, pp. 107-121", "authors": ["Maria Hynes", "Sharpe S", "Fagan R ("]}, {"title": "Thinking Sculpturally", "year": "2007", "source": "in Barbara Bolt, Felicity Colman, Graham Jones, Ashley Woodward (ed.), Sensorium: Aesthetics, Art, Life, Cambridge Scholars Publishing, Newcastle, UK, pp. 152-164", "authors": ["Maria Hynes"]}, {"title": "Rethinking Reductionism", "year": "2005", "source": "Culture Machine, vol. 7, p. 25", "authors": ["Maria Hynes"]}, {"title": "Beat me, Whip me, Spank me, Just Make it Right Again: beyond the didactic masochism of global resistance", "year": "2005", "source": "Fibreculture, vol. Issue 6, p. 16", "authors": ["Sharpe S", "Maria Hynes", "Fagan R ("]}, {"title": "Political Action and the Play of Appearances: Theorising the Political Implications of a Comic Event", "year": "2003", "source": "Annual Conference of The Australian Sociological Association (TASA 2003), ed. P Corrigan, M Gibson, G Hawkes, E Livingston, J Scott, S Thiele and G Carpenter, TASA (the Australian Sociological Association), Australia", "authors": ["Sharpe S", "Maria Hynes", "Fagan R ("]}]}, "Microsoft-Academic": [{"title": "cities of race hatred the spheres of racism and anti racism in contemporary australian cities", "year": 2009, "source": "cosmopolitan civil societies an interdisciplinary journal", "authors": [{"name": "kevin m dunn", "affiliation": "university of western sydney"}, {"name": "james forrest", "affiliation": "macquarie university"}, {"name": "rogelia pepua", "affiliation": "university of new south wales"}, {"name": "maria hynes", "affiliation": "australian national university"}, {"name": "karin maederhan", "affiliation": "university of western sydney"}], "id": 2765079493}, {"title": "reconceptualizing resistance sociology and the affective dimension of resistance", "year": 2013, "source": "british journal of sociology", "authors": [{"name": "maria hynes", "affiliation": "australian national university"}], "id": 173252385}, {"title": "the ethico aesthetics of life guattari and the problem of bioethics", "year": 2013, "source": "environment and planning a", "authors": [{"name": "maria hynes", "affiliation": "australian national university"}], "id": 87933477}, {"title": "unveiling seductions beyond societies of control affect security and humour in spaces of aeromobility", "year": 2012, "source": "environment and planning d society & space", "authors": [{"name": "david bissell", "affiliation": "australian national university"}, {"name": "maria hynes", "affiliation": "australian national university"}, {"name": "scott sharpe", "affiliation": "university of new south wales"}], "id": 199377086}, {"title": "affect an unworkable concept", "year": 2015, "source": "angelaki", "authors": [{"name": "maria hynes", "affiliation": "australian national university"}, {"name": "scott sharpe", "affiliation": "australian defence force academy"}], "id": 139573839}, {"title": "the minute interventions of stewart lee", "year": 2014, "source": "performance research", "authors": [{"name": "scott sharpe"}, {"name": "johndavid c dewsbury"}, {"name": "maria hynes"}], "id": 122812943}, {"title": "witnessing anti white racism white victimhood and reverse racism in australia", "year": 2018, "source": "journal of intercultural studies", "authors": [{"name": "jacqueline nelson", "affiliation": "university of technology sydney"}, {"name": "maria hynes", "affiliation": "australian national university"}, {"name": "scott sharpe", "affiliation": "university of new south wales"}, {"name": "yin paradies", "affiliation": "deakin university"}, {"name": "kevin m dunn", "affiliation": "university of sydney"}], "id": 161901644}, {"title": "indifferent by nature a post humanist reframing of the problem of indifference", "year": 2016, "source": "environment and planning a", "authors": [{"name": "maria hynes", "affiliation": "australian national university"}], "id": 87933477}, {"title": "worshipping bodies affective labour in the hillsong church", "year": 2013, "source": "geographical research", "authors": [{"name": "matthew wade", "affiliation": "australian national university"}, {"name": "maria hynes", "affiliation": "australian national university"}], "id": 173349649}, {"title": "black faced red faces the potentials of humour for anti racist action", "year": 2016, "source": "ethnic and racial studies", "authors": [{"name": "scott sharpe", "affiliation": "university of new south wales"}, {"name": "maria hynes", "affiliation": "australian national university"}], "id": 96629499}], "ANDS-Grants": []}