{"ANU": {"name": "Maria Nugent", "link": "https://researchers.anu.edu.au/researchers/nugent-ml", "colleges": "College of Arts and Social Sciences", "email": "maria.nugent@anu.edu.au", "phone": "61 2 61252445", "expertise": ["Australian History Excl. Aboriginal And Torres Strait Islander History", "Aboriginal And Torres Strait Islander History"], "interest": ["Australian Aboriginal History, public history, history, memory and oral history, and cross-cultural history."], "biography": "", "project": ["Remembering Dispossession: Interpreting Aboriginal Historical Narratives (FT100100073)", "This project grapples with the challenge to produce Australian historical studies that have Aboriginal people's own interpretations and moral reasonings at their core. The notion of 'remembering dispossession' is offered as a means for exploring the ways in which Aboriginal people have used historical storytelling and other modes of remembrance to make sense of their experience, and of themselves and others, under radically altered condition. The project entails fresh critical engagement with 'dispossession' as a key theme and concept in Australian history.", "The relational museum and its objects (LP150100423)", "This an ARC Linkage project involving the ANU, the National Museum of Australia, the British Museum. and Wagga Wagga City Council. The research team includes Professor Howard Morphy (ANU), Dr Maria Nugent (ANU), Robyn McKenzie (ANU), Dr Lissant Bolton (BM), Dr Gaye Sculthorpe (BM), Dr Ian Coates (NMA) and Dr Mathew Trinca (NMA).", "Reconnecting Indigenous Australian communities with ethnographic collections is central to contemporary museum practice. Yet, the historical dispersal of objects across museums, nationally and internationally, makes relationship and reconnection a challenge to communities and museums alike. This partnership between the ANU, the NMA and British Museum, in collaboration Indigenous communities and regional museums in the UK and Australia, aims to develop and pilot approaches that facilitate Indigenous people’s access to and engagements with distributed collections and objects. By doing so, the project seeks to contribute to new theory around the ‘relational museum’, and new modelling of museum practice and museum development in Australia.", "How Meston's Wild Australia Show Shaped Australian Aboriginal History (LP160100415)", "This is an ARC Linkage project involving UQ, ANU, Queensland Museum, State Library of NSW, and Museum Victoria. The research team includes Professor Paul Memmott (UQ), Dr Maria Nugent (ANU), Dr Timothy O'Rourke (UQ), Lindy Allen (MV), Chantalle Knowles (QM) and Richard Neville (SLNSW) and Michael Aird and Jonathan Richards.", "Archibald Meston’s ‘Wild Australia Show’ (1892-93), staged by a diverse company of Aboriginal people for metropolitan audiences, provides the focus for an interdisciplinary study of performance, photography, collections and race relations in colonial Australia. Using extensive archival and visual records, and in partnership with key cultural institutions and Aboriginal communities, we will provide an authoritative and original interpretation of the Show that situates it within local, national and transnational contexts. Significantly, it will illuminate Indigenous people’s agency as performers as well as chart changing ideas about race at a critical juncture in Australian history.", "'The Queen Gave Us The Land': Aboriginal people's histories and memories of Queen Victoria (DP110100230)", "Queen Victoria is a potent figure in Aboriginal people's histories and memories. This project examines Aboriginal people's interactions with and interpretations of her as a means by which to chart their changing understandings about such matters as sovereignty and the authority and morality of the British Crown. By examining both interactions (i.e. petitioning) and interpretations (i.e. narratives), a key aim is to explore and theorise the relationship between historical experience and historical remembrance. An edited collection Mistress of Everything: Queen Victoria in Indigenous Worlds (Manchester University Press) was published in 2016 and co-edited with Professor Sarah Carter, University of Alberta.", "Exploring the Middle Ground: New Histories of Cross-Cultural Encounters in Australian Maritime and Land Exploration (DP110100931)", "This is a collaborative research project with Dr Shino Konishi (UWA) and Dr Tiffany Shellam (Deakin University).", "The study proposes the concept of the middle ground to describe and represent the nature of cross-cultural encounters and relations within the history of Australian maritime and land exploration. Through as series of detailed cross-cultural historical studies of key exploration expeditions, the study seeks to re-establish the critical importance of exploration as a 'site' in which relations between Indigenous people and others developed, including in ways that were influential in shaping later race relations within the context of occupation and settlement. In this way, the concept of the middle ground is also presented as a means by which to unsettle Australian history's conventional periodisation into pre-settlement and settlement phases. Two edited collections, Indigenous Intermediaries: New Perspectives on Exploration Archives (2015) and Brokers and Boundaries: Colonial Exploration in Indigenous Territory (2016) have been published by ANU Press.", "Engaging Objects: Indigenous communities, museum collections and the representation of Indigenous histories (LP110100623)", "This an ARC Linkage project involving the ANU, the National Museum of Australia and the British Museum. The research team includes Professor Howard Morphy (ANU), Dr Maria Nugent (ANU), Dr John Carty (ANU), Dr Lissant Bolton (BM), Dr Ian Coates (NMA) and Dr Michael Pickering (NMA).", "This partnership between ANU, the National Museum of Australia and the British Museum, in collaboration with Indigenous research participants and communities, centres on the research process leading up to a major exhibition of the British Museum's Australian Indigenous collections, and the post-exhibition impacts. it analyses historical and representational issues evoked in researching and creating the exhibition. It will result in new understandings of foundational Australian Indigenous collections and their historical and contemporary significance for scholars, Indigenous peoples and museums. It will contribute to the development of new museological paradigms about the display of Indigenous collections. The project contributed to two major exhibitions - Indigenous Australia: Enduring Civilisation at the British Museum, and Encounters: Revealing Stories of Aboriginal and Torres Strait Islander Objects from the British Museum at the National Museum of Australia.", "", "", ""], "publication": [{"title": "Protection Talk and Popular Performance: The Wild Australia Show on Tour, 1892-1893", "year": "2018", "source": "in Samual Furphy and Amanda Nettelbeck (ed.), Aboriginal Protection and its Intermediaries in Britain's Antipodean Colonies, Routledge Taylor & Francis Group, United Kingdom, pp. 228pp-247pp", "authors": ["Maria Nugent"]}, {"title": "Shield Loaded with History: Encounters, Objects\r\nand Exhibitions", "year": "2018", "source": "Australian Historical Studies, vol. 48, no. 1, 2018, pp. 28-44", "authors": ["Maria Nugent", "Sculthorpe G"]}, {"title": "From the Edge: Australia", "year": "2018", "source": "s Lost Histories'Aboriginal History, vol. 42, pp. 183-185. Book revie", "authors": ["Maria Nugent"]}, {"title": "Moment of Truth: History and Australia", "year": "2018", "source": "s Future'Aboriginal History, vol. 42, no. 0, pp. 183-185. Book revie", "authors": ["Maria Nugent"]}, {"title": "Indigenous/European encounters", "year": "2017", "source": "in Susan Broomhall (ed.), Early Modern Emotions: An introduction, Routledge, Taylor & Francis Group, 2 Park Sq, Milton Park, Abingdon, Oxon OX14 4RN, pp. 406-409", "authors": ["Maria Nugent"]}, {"title": "ustralian Humanities Review", "year": "2016", "source": "issue 59May 2016, Special Section", "authors": ["Kennedy R", "Maria Nugent", "eds"]}, {"title": "Brokers and boundaries : colonial exploration in indigenous territory", "year": "2016", "source": "ANU PressCanberra", "authors": ["Shellam T", "Maria Nugent", "Konishi S eds"]}, {"title": "Brokering in colonial exploration: Biographies, geographies and histories", "year": "2016", "source": "in Tiffany Shellam. Maria Nugent, Shino Konishi and Allison Cadzow (ed.), Brokers and boundaries : colonial exploration in indigenous territory, ANU Press, Canberra, pp. 1-14pp", "authors": ["Shellam T", "Maria Nugent", "Konishi S"]}, {"title": "Mistress of Everything: Queen Victoria in Indigenous Worlds", "year": "2016", "source": "Manchester University PressManchester", "authors": ["Maria Nugent", "Carter S", "eds"]}, {"title": "Intro: Indigenous histories, settler colonies and Queen Victoria", "year": "2016", "source": "in Sarah Carter and Maria Nugent (ed.), Mistress of Everything: Queen Victoria in Indigenous Worlds**, Manchester University Press, Manchester, pp. 1-21", "authors": ["Maria Nugent", "Carter S"]}, {"title": "The politics of memory and the memory of politics: Australian Aboriginal interpretations of Queen Victoria 1881-2011", "year": "2016", "source": "in Sarah Carter and Maria Nugent (ed.), Mistress of Everything: Queen Victoria in Indigenous Worlds, Manchester University Press, Manchester, pp. 100-121pp.", "authors": ["Maria Nugent"]}, {"title": "On Buses: Still Photographs, Travelling Memories and Transnational Histories of Civil Rights Activism in Australia and North America", "year": "2016", "source": "Australian Humanities Review, vol. 59, no. 59, pp. 96-113", "authors": ["Maria Nugent"]}, {"title": "Scales of Memory: Reflections on an Emerging Concept", "year": "2016", "source": "Australian Humanities Review, vol. April/May 2016, no. 59, pp. 61-76", "authors": ["Kennedy R", "Maria Nugent"]}, {"title": "Roundtable: Message from Mungo and the Scales of Memory", "year": "2016", "source": "Australian Humanities Review, vol. 59, no. 59, pp. 247-259", "authors": ["Kennedy R", "Leane J", "McGrath A", "Maria Nugent"]}, {"title": "Indigenous Intermediaries: New Perspectives on Exploration Archives", "year": "2015", "source": "ANU PressCanberra, online", "authors": ["Maria Nugent", "Konishi S", "Shellam T (eds)"]}, {"title": "Exploration Archives and Indigenous History: An Introduction", "year": "2015", "source": "in S Konishi, M Nugent and T Shellam (ed.), Indigenous intermediaries: new perspectives on exploration archives, ANU Press, Canberra, pp. online", "authors": ["Maria Nugent", "Konishi S", "Shellam T"]}, {"title": "Jacky Jacky and the Politics of Aboriginal Testimony", "year": "2015", "source": "in S Konishi, M Nugent and T Shellam (ed.), Indigenous intermediaries: new perspectives on exploration archives, ANU Press, Canberra, pp. 67-84", "authors": ["Maria Nugent"]}, {"title": "n Echo of That Other Cry", "year": "2015", "source": ": Re-Enacting Captain Cook's First Landing as Conciliation Event'in Kate Darian-Smith and Penelope Edmonds (ed.), Conciliation on Colonial Frontiers: Conflict, Performance and Commemoration in Australia and the Pacific Rim, Routledge Taylor & Francis Group, New York and Abingdon, pp. 193-209", "authors": ["Maria Nugent"]}, {"title": "Encounters in country", "year": "2015", "source": "in G Sculthorpe, L Bolton, J Carty, H Morphy and M Nugent  (ed.), The BP exhibition: Indigenous Australia enduring civilisation, The British Museum Press, London, United Kingdom, pp. 120-210", "authors": ["Maria Nugent"]}, {"title": "Forty Millennia of Indigenous History at the British Museum", "year": "2015", "source": "Inside Storypp. 8pps", "authors": ["Maria Nugent"]}, {"title": "Shellwork on show: Colonial history, Australian Aboriginal women and the display of decorative objects", "year": "2014", "source": "Journal of Material Culture, vol. 19, no. 1, pp. 75-92", "authors": ["Maria Nugent"]}, {"title": "Book Review - Coranderrk: We will Show the Country by Giordano Nanni & Andrea James", "year": "2014", "source": "Oceania, vol. 84, no. 3, pp. 349-351", "authors": ["Maria Nugent"]}, {"title": "boriginal Australians and Boundary Crossings", "year": "2014", "source": "Melbourne Historical Journal, vol. 42, pp. 37-81", "authors": ["Konishi S", "Shellam T", "Maria Nugent"]}, {"title": "Museum and Exhibit Reviews - Landmarks: People and Places Across Australia", "year": "2013", "source": "The Public Historian, vol. 35, no. 2, pp. 121-124", "authors": ["Maria Nugent"]}, {"title": "Newcomers, c. 1600-1800", "year": "2013", "source": "in Alison Bashford and Stuart Macintyre (ed.), The Cambridge History of Australia, Cambridge University Press, United States, pp. 43-67", "authors": ["Konishi S", "Maria Nugent"]}, {"title": "Tracing lineages: The work of remembering, mourning and honouring in Romaine Moreton", "year": "2013", "source": "s the Farm'Studies in Australasian Cinema, vol. 7, no. 2-3, pp. 179-188", "authors": ["Maria Nugent"]}, {"title": "Book review -", "year": "2013", "source": "26 views of the Starburst World:  William Dawes at Sydney Cove 1788-91' by Ross GibsonAustralian Historical Studies, vol. 44, no. 2, pp. 295-297", "authors": ["Maria Nugent"]}, {"title": "book review, Fiona Paisley,", "year": "2013", "source": "The Lone Protestor:  AM Fernando in Australia and Europe'Journal of Australian Studies, vol. 37, no. 3, pp. 409-411", "authors": ["Maria Nugent"]}, {"title": "Sites of segregation/sites of memory: Remembrance and \"race", "year": "2013", "source": "in Australia'Memory Studies, vol. 6, no. 3, pp. 299-309", "authors": ["Maria Nugent"]}, {"title": "boriginal people and their children", "year": "2013", "source": "in Michelle Hetherington (ed.), Glorious Days Australia 1913, National Museum of Australia Press, Canberra, pp. 87-95pp.", "authors": ["Maria Nugent"]}, {"title": "Displaying the decorative: An exhibition history of La Perouse Aboriginal women", "year": "2012", "source": "s shellwork'reCollections: Journal of the National Museum of Australia, vol. 7, no. 2", "authors": ["Maria Nugent"]}, {"title": "The queen gave us the land", "year": "2012", "source": "Aboriginal peopleQueen Victoria and historical remembrance', History Australia, vol. 9, no. 2, pp. 182-200", "authors": ["Maria Nugent"]}, {"title": "Book Review - Agnew, Vanessa, Enlightenment Orpheus: The Power of Music in Other Worlds", "year": "2012", "source": "in Kevin L. Cope and Robert C. Leitz, III (ed.), ECCB The Eighteenth-Century Current Bibliography 34, AMS Press, Inc, New York, pp. 374-376pp", "authors": ["Maria Nugent"]}, {"title": "n Economy of Shells: A brief history of La Perouse Aboriginal women", "year": "2012", "source": "s shell-work and its markets1880-2010', in N Fijn, I Keen, C Lloyd & M Pickering (ed.), Indigenous Participation in Australian Economies II: Historical Engagements and Current Enterprises, ANU ePress, Canberra, pp. 211-227pp.", "authors": ["Maria Nugent"]}, {"title": "Book review: Captain Cook: Master of the Seas", "year": "2012", "source": "History, vol. 9, no. 327, pp. 505-506", "authors": ["Maria Nugent"]}, {"title": "boriginal History", "year": "2011", "source": "vol 35", "authors": ["Maria Nugent", "Konishi S (eds)"]}, {"title": "Preface", "year": "2011", "source": "Aboriginal Historyvol 35", "authors": ["Maria Nugent"]}, {"title": "Every Right to be There\": Cinema Spaces and Racial Politics in Baz Luhrmann", "year": "2011", "source": "s Australia'Australian Humanities Review, no. 51, pp. 5-23", "authors": ["Maria Nugent"]}, {"title": "You really only made it because you needed the money\": Aboriginal Women and Shellwork Production, 1870s to 1970s", "year": "2011", "source": "Labour History, vol. 101, pp. 71-90", "authors": ["Maria Nugent"]}, {"title": "Baz Luhrmann", "year": "2010", "source": "s Australia Reviewed'Studies in Australasian Cinema, vol. 4, no. 2, pp. 93-96", "authors": ["Maria Nugent", "Konishi S", ""]}, {"title": "Studies in Australasian Cinema, Special Volume: Baz Luhrmann", "year": "2010", "source": "s Australia Reviewedvol 4, no 2", "authors": ["Maria Nugent", "Konishi S (eds)"]}, {"title": "boriginal History", "year": "2010", "source": "vol 34", "authors": ["Konishi S", "Maria Nugent", "(eds)"]}, {"title": "Preface", "year": "2010", "source": "Aboriginal Historyvol 34", "authors": ["Konishi S", "Maria Nugent", ""]}, {"title": "Book Review: The Colony: A History of Early Sydney", "year": "2010", "source": "Labour History, vol. 98, no. November, pp. 237-239", "authors": ["Maria Nugent"]}, {"title": "Captain Cook was here", "year": "2009", "source": "Cambridge University PressMelbourne Australia", "authors": ["Maria Nugent"]}, {"title": "From Landing Place to Meeting Place: The Heritage of Cross-cultural Encounters on the Beach", "year": "2009", "source": "in Susan Hosking, Rick Hosking, Rebecca Pannell and Nena Bierbaum (ed.), Something Rich & Strange: Sea Changes, Beaches and the Littoral in The Antipodes, Wakefield Press, South Australia, pp. 253-263", "authors": ["Maria Nugent"]}, {"title": "Reviewing Indigenous History in Baz Luhrmann", "year": "2009", "source": "s AustraliaInside Story", "authors": ["Konishi S", "Maria Nugent"]}, {"title": "To Try to Form Some Connections with the Natives", "year": "2008", "source": ": Encounters between Captain Cook and Indigenous People at Botany Bay in 1770'History Compass, vol. 6, no. 2, pp. 469-487", "authors": ["Maria Nugent"]}, {"title": "Mapping memories: Oral History for Aboriginal Cultural Heritage in New South Wales, Australia", "year": "2008", "source": "in Paula Hamilton and Linda Shopes (ed.), Oral History and Public Memories, Temple University Press, Philadelphia, pp. 47-65", "authors": ["Maria Nugent"]}, {"title": "The encounter between Captain Cook and Indigenous people at Botany Bay in 1770 reconsidered", "year": "2008", "source": "in Peter Veth, Peter Sutton, Margo Neale (ed.), Strangers on the Shore: Early coastal contacts in Australia, National Museum of Australia Press, Canberra, pp. 198-207", "authors": ["Maria Nugent"]}, {"title": "Emma Timbery", "year": "2007", "source": "in   (ed.), Dictionary of Australian Artists Online, Australian Government Publishing Service, Australia, pp. 5pp", "authors": ["Maria Nugent"]}, {"title": "Historical encounters: Aboriginal testimony and colonial forms of commemoration", "year": "2006", "source": "Aboriginal History, vol. 30, pp. 33-48", "authors": ["Maria Nugent"]}, {"title": "Book Review: Aboriginal Victorians: a history since 1800", "year": "2006", "source": "Aboriginal History, vol. 30, pp. 230-231", "authors": ["Maria Nugent"]}, {"title": "Botany Bay: Where Histories Meet", "year": "2005", "source": "Allen & UnwinCrows Nest", "authors": ["Maria Nugent"]}, {"title": "Oral traditions", "year": "2005", "source": "in M Spongberg, A Curthoys and B Caine (ed.), Companion to Women's Historical Writing, Palgrave Macmillan Ltd, Basingstoke, UK, pp. 381-389", "authors": ["Maria Nugent"]}, {"title": "Mapping Attachment: A spatial approach to Aboriginal post-contact heritage", "year": "2004", "source": "NSW Department of Environment and ConservationHurstville", "authors": ["Byrne D", "Maria Nugent"]}, {"title": "boriginal Family History: Some reflections", "year": "2003", "source": "Australian Cultural History: The Journal of the History of Culture in Australia, vol. 22, pp. 143-154", "authors": ["Maria Nugent"]}, {"title": "Leprosy and the management of race, sexuality and nation in tropical Australia", "year": "2001", "source": "in Alison Bashford and Claire Hooker (ed.), Contagion: Historical and Cultural Studies, Routledge, Taylor & Francis Group, London and New York, pp. 106-129", "authors": ["Bashford A", "Maria Nugent"]}]}, "Microsoft-Academic": [{"title": "a shield loaded with history encounters objects and exhibitions", "year": 2018, "source": "australian historical studies", "authors": [{"name": "maria nugent", "affiliation": "australian national university"}, {"name": "gaye sculthorpe"}], "id": 199561357}, {"title": "biventricular pacing improves left ventricular function by 2 d strain in right ventricular failure", "year": 2012, "source": "journal of surgical research", "authors": [{"name": "casey wong", "affiliation": "cornell university"}, {"name": "santos e cabreriza", "affiliation": "newyork presbyterian hospital"}, {"name": "maria nugent", "affiliation": "albert einstein college of medicine"}, {"name": "daniel y wang", "affiliation": "newyork presbyterian hospital"}, {"name": "rabin gerrah", "affiliation": "newyork presbyterian hospital"}, {"name": "alexander rusanov", "affiliation": "newyork presbyterian hospital"}, {"name": "vinay yalamanchi", "affiliation": "newyork presbyterian hospital"}, {"name": "alice wang", "affiliation": "newyork presbyterian hospital"}, {"name": "bin cheng", "affiliation": "columbia university"}, {"name": "henry m spotnitz", "affiliation": "newyork presbyterian hospital"}], "id": 45161156}, {"title": "mapping attachment a spatial approach to aboriginal post contact heritage", "year": 2004, "source": "", "authors": [{"name": "dennis byrne"}, {"name": "maria nugent"}]}, {"title": "indigenous intermediaries new perspectives on exploration archives", "year": 2016, "source": "", "authors": [{"name": "shino konishi"}, {"name": "maria nugent", "affiliation": "australian national university"}, {"name": "tiffany shellam", "affiliation": "deakin university"}]}, {"title": "captain cook was here", "year": 2009, "source": "", "authors": [{"name": "maria nugent"}]}, {"title": "mistress of everything queen victoria in indigenous worlds", "year": 2016, "source": "", "authors": [{"name": "sarah carter"}, {"name": "maria nugent"}]}, {"title": "kayang and me", "year": 2005, "source": "times literary supplement tls", "authors": [{"name": "maria nugent"}], "id": 2764457167}, {"title": "sites of segregation sites of memory remembrance and race in australia", "year": 2013, "source": "memory studies", "authors": [{"name": "maria nugent", "affiliation": "australian national university"}], "id": 144836642}, {"title": "shellwork on show colonial history australian aboriginal women and the display of decorative objects", "year": 2014, "source": "journal of material culture", "authors": [{"name": "maria nugent", "affiliation": "australian national university"}], "id": 179822231}, {"title": "botany bay where histories meet", "year": 2005, "source": "", "authors": [{"name": "maria nugent"}]}], "ANDS-Grants": [{"description": "This project, being conducted in collaboration with Indigenous communities and regional museums in Australia and the United Kingdom, aims to develop and to pilot approaches that facilitate Indigenous people&rsquo;s access to and engagement with museum collections and objects. Reconnecting Indigenous Australian communities with ethnographic collections is central to contemporary museum practice. Yet, the historical dispersal of objects across museums, nationally and internationally, makes relationship and reconnection a challenge to communities and museums alike. The project seeks to address this and to contribute to new museum practice and museum development in Australia.", "title": "Linkage Projects - Grant ID: LP150100423", "id": "625869", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP150100423", "researchers": ["Prof Howard Morphy", "Dr Maria Nugent", "Dr Lissant Bolton", "Dr Gaye Sculthorpe", "Dr Ian Coates", "Dr Mathew Trinca"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 699310, "fundingScheme": "Linkage Projects", "startDate": 2015, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:54Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP150100423", "identifiers": ["http://purl.org/au-research/grants/arc/LP150100423", "LP150100423"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/625869"}]}, {"description": "This project aims to produce an authoritative and original interpretation of the Wild Australia Show (1892&ndash;93), staged by a diverse company of Aboriginal people for metropolitan audiences. The Show will be the focus of an interdisciplinary study of performance, photography, collections and race relations in colonial Australia, using archival and visual records. The project will situate the Show in local, national and transnational narratives informed by contemporary Indigenous perspectives. This research should illuminate Aboriginal agency in the ensemble, reconnect Aboriginal kin to performers, and chart changing concepts of race at a critical juncture in Australian history.", "title": "Linkage Projects - Grant ID: LP160100415", "id": "941830", "institutions": ["University of Queensland"], "key": "http://purl.org/au-research/grants/arc/LP160100415", "researchers": ["Prof Paul Memmott", "Dr Maria Nugent", "Dr Timothy O'Rourke", "Ms Lindy Allen", "Dr Charlotte Smith", "Ms Chantal Knowles", "Mr Richard Neville"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 360000, "fundingScheme": "Linkage Projects", "startDate": 2016, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:55Z", "dateTimeCreated": "2017-07-04T23:44:53Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Queensland"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP160100415", "identifiers": ["http://purl.org/au-research/grants/arc/LP160100415", "LP160100415"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/941830"}]}]}