{"ANU": {"name": "Mathieu O'Neil", "link": "https://researchers.anu.edu.au/researchers/o-neil-m", "colleges": "College of Arts and Social Sciences", "email": "mathieu.oneil@anu.edu.au", "phone": "", "expertise": ["Social Change", "Communication Technology And Digital Media Studies", "Sociology"], "interest": ["Mathieu’s research focuses on the communicational, political-economic  and organizational aspects of commons-based and oriented peer  production, such as free and open source software. He is currently  leading an international team investigating the co-production of free  and open source software by firms and projects as well as how this  co-production is represented in IT media (Critical Digital Infrastructure Fund,  Sloan and Ford Foundations, 2019-2020). Mathieu has played a key role  in developing the field of peer production studies by founding the Journal of Peer Production; editing four issues of this journal; and being lead editor of a Handbook of Peer Production (Wiley, 2020).Mathieu has also made significant contributions to the development of  innovative online research methods and concepts through his work with  the ANU's Virtual Observatory for the Study of Online Networks, a world  leader in computational social science, web science, and big data  analytics. Mathieu was a member of the team which obtained ARC grant  SR0567298, a Special Research Initiative (e-Research Support) to set up  the Observatory. His subsequent research on social movements, risk issue  diffusion and the adoption of innovation in the online environment  brought together conceptual frameworks such as social network analysis  and the sociologies of fields and controversies. The quality of this  research was recognised when Mathieu and his co-author Robert Ackland  were awarded the 2012 Communication, Information Technologies, and  Media Sociology (CITAMS) section of the American Sociological  Association Paper Award. They are the sole recipients of the CITAMS  Paper Award outside North America, which recognises an ‘outstanding  published paper or book chapter related to the sociology of  communications or the sociology of information technology’.Mathieu's research has been published in two books and in peer-reviewed journals such as Social Networks, Information, Communication & Society, Réseaux, New Media and Society, and Organization Studies,  amongst others. He previously held academic appointments at the  Université Stendhal - Grenoble 3, the Australian National University and  the Université Paris Sorbonne. He has also worked as a magazine editor  and exhibition curator in Singapore, and as a researcher for the  Australian Department of Broadband, Communications and the Digital  Economy."], "biography": "In 2008-2009 Mathieu worked as a researcher for the Department of Broadband, Communications and the Digital Economy on a project to survey digital identity management practices across the Australian Public Service. In 2009-2013 Mathieu lectured in sociology of communications at the American Society and Politics department, Université Paris Sorbonne (Paris 4). In October 2013 he was appointed Associate Professor of Communication at the University of Canberra.", "project": ["Journal of Peer Production", "http://peerproduction.net/", "", "Virtual Observatory for the Study of Online Networks", "http://vosonlab.net/", "Mapping the co-production of digital infrastructure by peer projects and firms", "https://www.canberra.edu.au/research/faculty-research-centres/nmrc/research/mapping-the-co-production-of-digital-infrastructure-by-peer-projects-and-firms"], "publication": [{"title": "Risk issue adoption in an online social movement field [IN PRESS]", "year": "2019", "source": "Information, Communication and Society, vol. online", "authors": ["Mathieu O'Neil", "Ackland R"]}, {"title": "Engagement with news on Twitter: insights from Australia and Korea", "year": "2019", "source": "Asian Journal of Communication, vol. 29, no. 3, pp. 235-251", "authors": ["Ackland R", "Mathieu O'Neil", "Park S"]}, {"title": "Hacking Weber: legitimacy, critique, and trust in peer production", "year": "2014", "source": "Information, Communication and Society, vol. 17, no. 7, pp. 872-888", "authors": ["Mathieu O'Neil"]}, {"title": "Collaborative Internet governance: Terms and conditions of analysis.", "year": "2013", "source": "Special issue on Contested Internet Governance (ed. D. Frau-Meigs)Revue Francaise d'Etudes Americaines, pp. 98-113", "authors": ["Mathieu O'Neil"]}, {"title": "Domination et critique dans les projects collaboratifs sur Internet", "year": "2013", "source": ". In pressReseaux", "authors": ["Mathieu O'Neil"]}, {"title": "Online collective identity: The case of the environmental movement", "year": "2011", "source": "Social Networks, vol. 33, no. 3. pp.177-190", "authors": ["Ackland R", "Mathieu O'Neil"]}, {"title": "Wikipedia and authority", "year": "2011", "source": ". In G. Lovink and N. TkaczCritical Point of View Reader, Institute of Network Cultures, Amsterdam, pp 309-324", "authors": ["Mathieu O'Neil"]}, {"title": "Domination and networks", "year": "2011", "source": "Journal of Peer Production no. 0. [In response to N. Tkacz, third part of a debate on ANT and Power'.", "authors": ["Mathieu O'Neil"]}, {"title": "The sociology of critique in Wikipedia", "year": "2011", "source": "Journal of Peer Production, no. 0, pp. 1-11", "authors": ["Mathieu O'Neil"]}, {"title": "L", "year": "2010", "source": "autorita  su Internet: per una teoria povera'Aut Aut: rivista di filosofia e di cultura, vol. 347, pp. 36-51", "authors": ["Mathieu O'Neil"]}, {"title": "Shirky and Sanger, or the costs of crowdsourcing", "year": "2010", "source": "Journal of Science Communication, vol. 9, no. 1, pp. 1-6", "authors": ["Mathieu O'Neil"]}, {"title": "Cyberchiefs: Autonomy and Authority in Online Tribes", "year": "2009", "source": "Pluto PressLondon", "authors": ["Mathieu O'Neil"]}, {"title": "Radical tribes at warre: Primitivists on the Net", "year": "2008", "source": "in T. L. Adams and S. A. Smith (ed.), Electronic Tribes: The Virtual Worlds of Geeks, Gamers, Shamans, and Scammers, University of Texas Press, Austin, TX, pp. 251-268", "authors": ["Mathieu O'Neil"]}, {"title": "The structural role of nanotechnology-opposition in online environmental activist networks", "year": "2006", "source": "International Sunbelt Social Network Conference 2006, ed. International Network for Social Network Analysis, International Network for Social Network Analysis, unknown, pp. 1-32", "authors": ["Mathieu O'Neil", "Ackland R"]}, {"title": "New methods for studying online environmental - activist networks", "year": "2006", "source": "International Sunbelt Social Network Conference 2006, ed. International Network for Social Network Analysis, International Network for Social Network Analysis, unknown, pp. 1-39", "authors": ["Ackland R", "Mathieu O'Neil", "Bimber B"]}, {"title": "VOSON: A web services approach for facilitating research into online networks", "year": "2006", "source": "International Conference on e-Social Science 2006, ed. The National Centre for e-Social Science, National Centre for e-Social Science, Manchester, pp. 1-12", "authors": ["Ackland R", "Mathieu O'Neil", "Standish R"]}, {"title": "Rebels for the system? Virus writers, general intellect, cyberpunk and criminal capitalism", "year": "2006", "source": "Continuum: Journal of Media and Cultural Studies, vol. 20, no. 2, pp. 225-241", "authors": ["Mathieu O'Neil"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}