{"ANU": {"name": "Megan Outram", "link": "https://researchers.anu.edu.au/researchers/outram-m", "colleges": "College of Science", "email": "Megan.Outram@anu.edu.au", "phone": "0261251247", "expertise": ["Structural Biology Incl. Macromolecular Modelling", "Plant Cell And Molecular Biology"], "interest": ["I am intersted inusing structural biology and protein biochemistry techniques to understand how plant pathogens are able to cause disease, and in turn how plants recognise and respond to these pathogens."], "biography": "I was awarded my PhD in structural biology and protein biochemistry from the University of Queensland (Brisbane, Australia) in August 2019. My doctoral studies were carried out in the laboratory of Prof. Bostjan Kobe (School of Chemistry and Molecular Biosciences), in collaboration with Dr. Simon Williams and Prof. Peter Solomon in the Research School of Biology at The Australian National University (Canberra, Australia). My PhD focused on understanding the structural basis of effector-triggered susceptibility using the wheat-Parastagonospora nodorum pathosystem. Primarily this work involved the development of expression and purification protocols for small, cysteine-rich proteins, crystallisation and structure determination utilising X-ray crystallography, and the subsequent biochemical and biophysical analysis of the isolated proteins. In March 2019, I moved to The Australian National University to work in the plant structural immunology laboratory lead by Dr. Simon Williams. My current research focuses on using structural biology and protein biochemistry techniques to understand effector function as well as effector recognition and activation of plant innate immune receptor proteins in a variety of plant-pathogen interactions.", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "development of a pcr rflp method to distinguish species within the ilyonectria macrodidyma complex", "year": 2014, "source": "new zealand plant protection", "authors": [{"name": "megan outram", "affiliation": "lincoln university"}, {"name": "e e jones"}, {"name": "m v jaspers"}, {"name": "h j ridgway"}], "id": 2764884290}, {"title": "variable levels of laccase are secreted by four species of ilyonectria that infect grapevines", "year": 2014, "source": "", "authors": [{"name": "blessy pathrose"}, {"name": "megan outram"}, {"name": "e e jones"}, {"name": "m v jaspers"}, {"name": "h j ridgway"}]}], "ANDS-Grants": []}