{"ANU": {"name": "Meghan Samantha Miller", "link": "https://researchers.anu.edu.au/researchers/miller-mx", "colleges": "College of Science", "email": "Meghan.Miller@anu.edu.au", "phone": "+61 2 6125 3073", "expertise": ["Geophysics", "Seismology And Seismic Exploration", "Tectonics", "Geodynamics"], "interest": ["Most of my research focuses on tectonic plate boundaries, in particular subduction zones where oceanic plates are descending into the Earth’s deep interior, but are still relatively poorly understood.  These are regions where tectonic activity, as observed in seismicity and volcanism, is localized, making them natural targets of high scientific and societal relevance. As a complement to the dynamic, active plate boundary research, I also have an interest in understanding the structure of stable continental interiors as they provide the best long-term record of plate tectonic processes."], "biography": "University of British Columbia - Postdoctoral Research Associate, Vancouver, British Columbia, 2006-2008", "project": ["Banda Arc Project – Eastern Indonesia is one of the least well-understood geological domains of our planet, and yet the region provides a truly remarkable location for unraveling some of the major puzzles of plate tectonics. The recent collision of the Australian continent with the active volcanic arc in the Banda region effectively captures the initiation of continental mountain building and the cessation of island arc volcanism, offering a rare glimpse into a set of processes that have shaped Earth’s evolution over geologic time.  Since oceanic subduction and subsequent continental collision have occurred in different stages along the Banda arc, we plan to use the region to study and assess the spatio-temporal evolution of this transition using a variety of methods: seismology, geodyanmics, tectonics, low-temperature geochemistry, and geomorphology.  We have installed 30 broadband seismometers, including the first ever seismometer on Timor Leste, across the archipelago of eastern Indonesia (NTT) in 2014.   The award is co-funded by the NSF Geophysics and Tectonics Programs, and the Office of International Science and Engineering (OISE) – Global Venture Fund (GVF) and led by M.S. Miller, T.W. Becker, and A.J. West.", "Congested Subduction:  ARC Discovery Project led by L. Moresi, P. Betts, J. Whittaker and M.S. Miller. The project addresses the geodynamics of congested subduction zones and their impacts on the convergent margins.  We are using a combination of 3D geodynamic modelling, plate kinematic reconstruction and geological and geophysical synthesis to determine how congested subduction zones influence plate kinematics, subduction dynamics, and tectonic evolution at orogen and global scales. We aim to deliver a transformation change in understanding the links between congested subduction, mantle flow, trench migration, crustal growth, transitions between stable convergent margin configurations, and deformation in the overriding plates of subduction zones. Determining these relationships is significant because it will provide dynamic context to interpret the geological record of ancient convergent margins, which host a large percentage of Earth's metal resources.", "ICED (Imaged Crust Denali Exhumation) Project:  National Science Foundation (Tectonics and EarthScope programs) funded project led by S. Roeske, T. Waldien, J. Benowitz and M.S. Miller. This project entitled \"A four-dimensional view of deformation in the Eastern Alaska Range - Where did the slip on the Denali fault go?\"   The Denali fault in south-central Alaska ruptured in a 7.9 magnitude earthquake in 2002, one of the largest continental strike-slip (horizontal motion of blocks of rocks past each other) earthquakes ever recorded. The event brought attention to this little-studied but major fault, which crosses the trans-Alaska oil pipeline as well as the two main highways in Alaska. Scientists predicted Denali fault earthquakes to have only strike-slip motion, but instead, the 2002 quake started as a thrust (putting one block of rock over another) earthquake and uplifted rocks in the Alaska Range along a previously unknown thrust fault. The unexpected earthquake uplift pattern provided the scientific community additional evidence that thrust faults can siphon lateral motion from the strike-slip Denali fault. If these types of fault interactions persist for millions of years, then determining the amount of thrust faulting next to the Denali fault could help solve a long- lived controversy of how much total displacement has taken place across the Denali fault and explain why the Denali fault is surrounded by large mountains on all sides (forming the Alaska Range). Unraveling the history of thrust faulting and uplift next to the Denali fault will not only help us chip away at these intriguing scientific questions but will also inform us on how significant these faults have been in the past and where the greatest seismic hazards in the Alaska Range are today."], "publication": [{"title": "Mapping Earth", "year": "2020", "source": "s deepest secrets'Science, vol. 368, no. 6496, pp. 1183-1184", "authors": ["Meghan Samantha Miller"]}, {"title": "Subducted lithospheric boundary tomographically imaged beneath the arc-continent collision in eastern Indonesia", "year": "2020", "source": "Journal of Geophysical Research: Solid Earth, vol. 125, no. 8", "authors": ["Harris C", "Meghan Samantha Miller", "Supendi P"]}, {"title": "Global Quieting of High-Frequency Seismic Noise Due to COVID-19 Pandemic Lockdown Measures", "year": "2020", "source": "Science, vol. 369, pp. 1338-1343", "authors": ["Lecocq T", "Hicks S", "Koen V", "Meghan Samantha Miller"]}, {"title": "Introduction to \"Orogenic Cycles: From Field Observations to Global Geodynamics\"", "year": "2019", "source": "Tectonics, vol. 38, no. 1, pp. 3-6", "authors": ["Toy V", "Manatschal G", "Rosenbaum G", "Meghan Samantha Miller"]}, {"title": "Intermediate-Depth Earthquakes Controlled by Incoming Plate Hydration Along Bending-Related Faults", "year": "2019", "source": "Geophysical Research Letters, vol. 46, no. 7, pp. 3688-3697", "authors": ["Boneh Y", "Schottenfels E", "Kwong K", "Meghan Samantha Miller"]}, {"title": "Seismic imaging the D`` region beneath the Central Atlantic", "year": "2019", "source": "Physics of the Earth and Planetary Interiors, vol. 292, pp. 76-86", "authors": ["Li Y", "Meghan Samantha Miller", "Sun D"]}, {"title": "Mapping the Alaskan Moho", "year": "2018", "source": "Seismological Research Letters, vol. 89, no. 6, pp. 2430-2436pp", "authors": ["Meghan Samantha Miller", "Moresi L"]}, {"title": "Updates to FuncLab, a Matlab based GUI for handling receiver functions", "year": "2018", "source": "Computers and Geosciences, vol. 111, pp. 260-271", "authors": ["Porritt R", "Meghan Samantha Miller"]}, {"title": "Tomographic Imaging of Slab Segmentation and Deformation in the Greater Antilles", "year": "2018", "source": "Geochemistry, Geophysics, Geosystems, vol. 19, no. 8, pp. 2292-2307pp", "authors": ["Harris C", "Meghan Samantha Miller", "Porritt R"]}, {"title": "The structural evolution of the deep continental lithosphere", "year": "2017", "source": "Tectonophysics, vol. 695, pp. 100-121", "authors": ["Cooper C", "Meghan Samantha Miller", "Moresi L"]}, {"title": "Crustal Structure of Active Deformation Zones in Africa: Implications for Global Crustal Processes", "year": "2017", "source": "Tectonics, vol. 36, no. 12, pp. 3298-3332pp", "authors": ["Ebinger C", "Keir D", "Bastow I", "Meghan Samantha Miller"]}, {"title": "Banda Arc Experiment-Transitions in the Banda Arc-Australian Continental Collision", "year": "2016", "source": "Seismological Research Letters, vol. 87, no. 6, pp. 1417-1423", "authors": ["Meghan Samantha Miller", "O'Driscoll L", "Roosmawati N"]}, {"title": "Continent-arc collision in the Banda Arc imaged by ambient noise tomography", "year": "2016", "source": "Earth and Planetary Science Letters, vol. 449, pp. 246-258", "authors": ["Porritt R", "Meghan Samantha Miller", "O'Driscoll L"]}, {"title": "Major disruption of D\" beneath Alaska", "year": "2016", "source": "Journal of Geophysical Research: Solid Earth, vol. 121, no. 5, pp. 3534-3556pp", "authors": ["Sun D", "Helmberger D", "Meghan Samantha Miller", ""]}, {"title": "Lithospheric architecture beneath Hudson Bay", "year": "2015", "source": "Geochemistry, Geophysics, Geosystems, vol. 16, no. 7, pp. 2262-2275", "authors": ["Porritt R", "Meghan Samantha Miller", "Darbyshire F"]}, {"title": "Mantle flow at the highly arcuate northeast corner of the Lesser Antilles subduction zone: Constraints from shear-wave splitting analyses", "year": "2015", "source": "Lithosphere, vol. 7, no. 5, pp. 579-587", "authors": ["Hodges M", "Meghan Samantha Miller"]}, {"title": "Lithospheric discontinuity structure in Alaska, thickness variations determined by Sp receiver functions", "year": "2015", "source": "Tectonics, vol. 34, no. 4, pp. 694-714", "authors": ["O'Driscoll L", "Meghan Samantha Miller"]}, {"title": "Collisional processes and links to episodic changes in subduction zones", "year": "2015", "source": "Elements, vol. 11, no. 2, pp. 119-124pp", "authors": ["van Hunen J", "Meghan Samantha Miller"]}, {"title": "Geodynamics of oceanic plateau and plume head accretion and their role in Phanerozoic orogenic systems of China", "year": "2015", "source": "Geoscience Frontiers (Previously Earth Science Frontiers), vol. 6, no. 1, pp. 49-59", "authors": ["Betts P", "Moresi L", "Meghan Samantha Miller", "Willis D", ""]}, {"title": "Flat-slab subduction, topography, and mantle dynamics in southwestern Mexico", "year": "2015", "source": "Tectonics, vol. 34, no. 9, pp. 1892-1909", "authors": ["Gerault M", "Husson L", "Meghan Samantha Miller"]}, {"title": "Craton formation: Internal structure inherited from closing of the early oceans", "year": "2014", "source": "Lithosphere, vol. 6, no. 1, pp. 35-42", "authors": ["Cooper C", "Meghan Samantha Miller"]}, {"title": "Reactivated lithospheric-scale discontinuities localize dynamic uplift of the Moroccan Atlas Mountains (Forum Reply)", "year": "2014", "source": "Geology, vol. 42, no. 6, pp. E338-E338", "authors": ["Meghan Samantha Miller", "Becker T"]}, {"title": "Subduction-driven recycling of continental margin lithosphere", "year": "2014", "source": "Nature, vol. 515, no. 7526, pp. 253-U219", "authors": ["Levander A", "Bezada M", "Niu F", "Meghan Samantha Miller"]}, {"title": "High frequency seismic waves and slab structures beneath Italy", "year": "2014", "source": "Earth and Planetary Science Letters, vol. 391, pp. 212-223pp", "authors": ["Sun D", "Meghan Samantha Miller", "Agostinetti N"]}, {"title": "Isostasy, dynamic topography, and the elevation of the Apennines of Italy", "year": "2014", "source": "Earth and Planetary Science Letters, vol. 407, pp. 163-174pp", "authors": ["Faccenna C", "Becker T", "Meghan Samantha Miller"]}, {"title": "Insights on the upper mantle beneath the Eastern Alps", "year": "2014", "source": "Earth and Planetary Science Letters, vol. 403, pp. 199-209pp", "authors": ["Bianchi I", "Meghan Samantha Miller", "Bokelmann G"]}, {"title": "The fate of the downgoing oceanic plate: Insight from the Northern Cascadia subduction zone", "year": "2014", "source": "Earth and Planetary Science Letters, vol. 408, pp. 237-251pp", "authors": ["Agostinetti N", "Meghan Samantha Miller"]}, {"title": "Moho structure across the San Jacinto fault zone: Insights into strain localization at depth", "year": "2014", "source": "Lithosphere, vol. 6, no. 1, pp. 43-47", "authors": ["Meghan Samantha Miller", "Zhang P", "Dolan J"]}, {"title": "Evidence of an upper mantle seismic anomaly opposing the Cocos slab beneath the Isthmus of Tehuantepec, Mexico", "year": "2014", "source": "Geochemistry, Geophysics, Geosystems, vol. 15, no. 7, pp. 3021-3034pp", "authors": ["Kim Y", "Lim H", "Meghan Samantha Miller", ""]}, {"title": "Reactivated lithospheric-scale discontinuities localize dynamic uplift of the Moroccan Atlas Mountains", "year": "2014", "source": "Geology, vol. 42, no. 1, pp. 35-38", "authors": ["Meghan Samantha Miller"]}, {"title": "Dynamics of continental accretion", "year": "2014", "source": "Nature, vol. 508, no. 7495, pp. 245-248", "authors": ["Moresi L", "Betts P", "Meghan Samantha Miller", "Cayley R", ""]}, {"title": "Hot upwelling conduit beneath the Atlas Mountains, Morocco", "year": "2014", "source": "Geophysical Research Letters, vol. 41, no. 22, pp. 8037-8044pp", "authors": ["Sun D", "Meghan Samantha Miller", "Becker TW"]}, {"title": "Constraints on the tectonic evolution of the westernmost Mediterranean and northwestern Africa from shear wave splitting analysis", "year": "2013", "source": "Earth and Planetary Science Letters, vol. 375, pp. 234-243pp", "authors": ["Meghan Samantha Miller", "Allam A", "Becker T"]}, {"title": "Study of the western edge of the African large low shear velocity province", "year": "2013", "source": "Geochemistry, Geophysics, Geosystems, vol. 14, no. 8, pp. 3109-3125pp", "authors": ["Sun D", "Meghan Samantha Miller"]}, {"title": "spherical structural heterogeneity within the uppermost inner core: Insights into the hemispherical boundaries and core formation", "year": "2013", "source": "Physics of the Earth and Planetary Interiors, vol. 223, pp. 8-20pp", "authors": ["Meghan Samantha Miller", "Niu F", "Vanacore E"]}, {"title": "Structure beneath the Alboran from geodynamic flow models and seismic anisotropy", "year": "2013", "source": "Journal of Geophysical Research: Solid Earth, vol. 118, no. 8, pp. 4265-4277pp", "authors": ["Meghan Samantha Miller"]}, {"title": "Insights into the evolution of the Italian lithospheric structure from S receiver function analysis", "year": "2012", "source": "Earth and Planetary Science Letters, vol. 345, pp. 49-59pp", "authors": ["Meghan Samantha Miller", "Agostinetti N"]}, {"title": "Seismic imaging of the Cocos plate subduction zone system in central Mexico", "year": "2012", "source": "Geochemistry, Geophysics, Geosystems, vol. 13, no. 7, pp. 1-16pp", "authors": ["Kim Y", "Meghan Samantha Miller", "Pearce F"]}, {"title": "Evolutionary aspects of lithosphere discontinuity structure in the western US", "year": "2012", "source": "Geochemistry, Geophysics, Geosystems, vol. 13, no. 1, pp. 1-22pp", "authors": ["Levander A", "Meghan Samantha Miller"]}, {"title": "Mantle flow deflected by interactions between subducted slabs and cratonic keels", "year": "2012", "source": "Nature Geoscience, vol. 5, no. 10, pp. 726-730pp", "authors": ["Meghan Samantha Miller", "Becker T"]}, {"title": "Co-seismic deformation of deep slabs based on summed CMT data", "year": "2012", "source": "Journal of Geophysical Research, vol. 117, pp. 1-19pp", "authors": ["Bailey I", "Alpert L", "Becker T", "Meghan Samantha Miller"]}, {"title": "Vs and density structure beneath the Colorado Plateau constrained by gravity anomalies and joint inversions of receiver function and phase velocity data", "year": "2012", "source": "Journal of Geophysical Research, vol. 117, no. 2, pp. 1-18pp", "authors": ["Bailey I", "Meghan Samantha Miller", "Liu K", "Levander A", ""]}, {"title": "Erosion of the continental lithosphere at the cusps of the Calabrian arc: Evidence from S receiver functions analysis", "year": "2011", "source": "Geophysical Research Letters, vol. 38, no. 23, pp. 1-6pp", "authors": ["Meghan Samantha Miller", "Agostinetti N"]}, {"title": "Continuing Colorado plateau uplift by delamination-style convective lithospheric downwelling", "year": "2011", "source": "Nature, vol. 472, no. 7344, pp. 461-U540", "authors": ["Levander A", "Schmandt B", "Meghan Samantha Miller"]}, {"title": "Imaging crustal and upper mantle structure beneath the Colorado Plateau using finite frequency Rayleigh wave tomography", "year": "2011", "source": "Geochemistry, Geophysics, Geosystems, vol. 12, no. 7, pp. 1-24pp", "authors": ["Liu K", "Levander A", "Niu F", "Meghan Samantha Miller"]}, {"title": "Three-dimensional numerical models of the influence of a buoyant oceanic plateau on subduction zones", "year": "2010", "source": "Tectonophysics, vol. 483, no. 1-2, pp. 71-79", "authors": ["Mason W", "Moresi L", "Betts P", "Meghan Samantha Miller"]}, {"title": "Formation of cratonic mantle keels by arc accretion: Evidence from S receiver functions", "year": "2010", "source": "Geophysical Research Letters, vol. 37, no. 18, pp. 1-5", "authors": ["Meghan Samantha Miller", "Eaton D"]}]}, "Microsoft-Academic": [{"title": "four dimensional structural evolution of the western pacific convergent margin based on seismic tomography and palaeogeographic reconstructions", "year": 2006, "source": "", "authors": [{"name": "meghan samantha miller"}]}], "ANDS-Grants": []}