{"ANU": {"name": "Melinda Choy", "link": "https://researchers.anu.edu.au/researchers/choy-m", "colleges": "College of Health & Medicine", "email": "melinda.choy@anu.edu.au", "phone": "61745592", "expertise": ["Primary Health Care"], "interest": ["General Practice and Primary CareHealth of Socioeconomically Disadvantaged PopulationsThe Digital Health Divide and Digital Health InclusionImprovement of Healthcare Access via Patient-Centred ResearchTechnology Enhanced Learning and Teaching"], "biography": "Melinda completed her undergraduate medical degree at the University of New South Wales. She completed her junior medical officer training at Royal Prince Alfred Hospital in Sydney and her Master of Medicine (Clinical Epidemiology) through the University of Sydney. Melinda also works part-time clinically at Gordon Family Practice. She teaches within the Academic Unit of General Practice and Clinical Skills Unit and is engaged in Technology-Assisted Learning initiatives within these Units.", "project": ["Choy M.A., Sturgiss E., Goodyear-Smith F., Smith G.J. (2020) Digital Health Tools and Patients With Drug Use Disorders: Qualitative Patient Experience Study of the Electronic Case-Finding and Help Assessment Tool (eCHAT) J Med Internet Res 22(9):e19256 DOI: 10.2196/19256", "Sutarsa, N., Astuti, P., Choy, M., Moore, M. 2020. COVID-19 Pandemic: Opportunity to Accelerate e-Health in Indonesia. Public Health and Preventive Medicine Archive 8(1): 1-3.", "Choy, MA, Sturgiss, EA, Goodyear-Smith, F, Smith, G. Digital health tools and the therapeutic relationship. North American Primary Care Research Group Annual Scientific Meeting, Toronto, Canada: November 2019.", "Choy, MA, Sturgiss, EA. Digital health tools in populations with socioeconomic disadvantage: A narrative review of the patient experience. North American Primary Care Research Group Annual Scientific Meeting, Toronto, Canada: November 2019.", "Choy, MA, Barnes, K, Sturgiss, EA, Rieger, E, Douglas, K. Digital health and disadvantage: a qualitative study exploring how patients with chronic disease experience ehealth. International Conference on Quality in Primary Care, Toronto, Canada: November 2019.", "Choy, M., Sturgiss, E.,Goodyear-Smith, F., Clark, A., Smith, G. (2018). Digital Health Tools and the Therapeutic Relationship:  Can eCHAT help a Vulnerable Popultion in General Practice? Poster section. U. o. A. 2018 Qual-World Interactive Virtual Conference. December 4 2018.", "Choy, M. B., P. (2018). Cystic fibrosis in the adult patient: diagnosis and a review of new treatments for CF lung disease. GP 18 - RACGP. Gold Coast 11-13 October 2018.", "Choy, M. S., E; Goodyear-Smith, F; Clark, A; Smith, G. (2018). Digital health tools and the therapeutic relationship: can eCHAT help a vulnerable population? GP 18 - RACGP. Gold Coast, Queensland.", ""], "publication": []}, "Microsoft-Academic": [{"title": "covid 19 pandemic opportunity to accelerate e health in indonesia", "year": 2020, "source": "public health and preventive medicine archive", "authors": [{"name": "melinda choy"}, {"name": "putu ayu swandewi astuti"}, {"name": "malcolm moore"}, {"name": "nyoman sutarsa"}], "id": 2764501316}], "ANDS-Grants": []}