{"ANU": {"name": "Michael Roettger", "link": "https://researchers.anu.edu.au/researchers/roettger-me", "colleges": "College of Arts and Social Sciences", "email": "Mike.Roettger@anu.edu.au", "phone": "", "expertise": ["Criminology", "Demography", "Sociological Methodology And Research Methods", "Family And Household Studies", "Causes And Prevention Of Crime"], "interest": ["Analysis of panel dataParental incarceration and long-term outcomes of childrenGene-environment interplay in health and problem behaviorsInequality related to crime and punishment"], "biography": "Roettger is especially interested in issues related to parental incarceration.  He is an internationally recognised expert in the field, and his research has examined adverse long-term outcomes associated with having a parent undergo incarceration.   His research has documented adverse outcomes in the U.S. population that include mental and physical health issues, substance abuse, delinquency, and criminal justice involvement.", "project": [], "publication": [{"title": "Prospective relations between prenatal maternal cortisol and child health outcomes", "year": "2019", "source": "Psychosomatic Medicine, vol. 81, no. 6, pp. 557-565", "authors": ["Michael Roettger", "Schreier H", "Feinberg M"]}, {"title": "Family and Child Outcomes 2 Years After a Transition to Parenthood Intervention", "year": "2018", "source": "Family Relations, vol. 67, no. 2, pp. 270-286pp", "authors": ["Jones D", "Feinberg M", "Hostetler M", "Michael Roettger"]}, {"title": "Interrupting Intergenerational Offending in the Context of America", "year": "2018", "source": "s Social Disaster of Mass Imprisonment'American Behavioral Scientist, vol. 62, no. 11, pp. 1545-1561", "authors": ["Michael Roettger", "Dennison S"]}, {"title": "Trauma Exposure and Aggression Toward Partners and Children: Contextual Influences of Fear and Anger", "year": "2018", "source": "Journal of Family Psychology, vol. 32, no. 6, pp. 710-721", "authors": ["Marshall A", "Michael Roettger", "Mattern A"]}, {"title": "Couple-focused prevention at the transition to parenthood, a randomized trial: Effects on coparenting, parenting, family violence, and parent and child adjustment", "year": "2016", "source": "Prevention Science, vol. 17, no. 6, pp. 751-764", "authors": ["Feinberg M", "Jones D", "Hostetler M", "Michael Roettger"]}, {"title": "Preventive effects on birth outcomes: Buffering impact of maternal stress, depression, and anxiety", "year": "2016", "source": "Maternal and Child Health Journal, vol. 20, no. 1, pp. 56-65", "authors": ["Feinberg M", "Jones D", "Michael Roettger"]}, {"title": "Promoting child wellbeing among children who experience maternal incarceration", "year": "2015", "source": "Criminology and Public Policy, vol. 14, no. 1, pp. 121-124", "authors": ["Michael Roettger"]}, {"title": "Effects of a psychosocial couple-based prevention program on adverse birth outcomes", "year": "2015", "source": "Maternal and Child Health Journal, vol. 19, no. 1, pp. 102-111", "authors": ["Feinberg M", "Michael Roettger", "Jones D"]}, {"title": "Genes in the Dopaminergic System and Delinquent Behaviors Across the Life Course The Role of Social Controls and Risks", "year": "2014", "source": "Criminal Justice and Behavior, vol. 41, no. 6, pp. 713-731", "authors": ["Boardman J", "Menard S", "Michael Roettger"]}, {"title": "Measures of sexual minority status and suicide risk among young adults in the United States", "year": "2014", "source": "Archives of Suicide Research, vol. 18, no. 3, pp. 274-281", "authors": ["Almazan E", "Michael Roettger", "Acosta P"]}, {"title": "Long-Term Follow-Up of a Randomized Trial of Family Foundations: Effects on Children", "year": "2014", "source": "s EmotionalBehavioral, and School Adjustment', Journal of Family Psychology, vol. 28, no. 6, pp. 821-831", "authors": ["Feinberg M", "Jones D", "Michael Roettger"]}, {"title": "Incarcerated fathers: Implications for father involvement", "year": "2013", "source": "in Jyotsna Pattnik (ed.), Father Involvement in Young Children's Lives: A Global Analysis, Springer Science+Business Media, Dordrecht, pp. 107-122pp", "authors": ["Michael Roettger", "Swisher R"]}, {"title": "Employing Du Boi and Myrdal to analyse the US criminal justice system", "year": "2013", "source": "Race, Gender & Class, vol. 20, no. 1/2, pp. 141-155", "authors": ["Semien D", "Michael Roettger"]}, {"title": "Father", "year": "2012", "source": "s incarceration and youth delinquency and depression: Examining differences by race and ethnicity'Journal of Research on Adolescence, vol. 22, no. 4, pp. 597-603", "authors": ["Swisher R", "Michael Roettger"]}, {"title": "Gene-environment interactions related to body mass: School policies and social context as environmental moderators", "year": "2012", "source": "Journal of Theoretical Politics, vol. 24, no. 3, pp. 370-388", "authors": ["Boardman J", "Michael Roettger", "Domingue B"]}, {"title": "Parental incarceration and gender-based risks for increased body mass index: Evidence from the National Longitudinal Study of Adolescent Health in the United States", "year": "2012", "source": "American Journal of Epidemiology, vol. 175, no. 7, pp. 636-644", "authors": ["Michael Roettger", "Boardman J"]}, {"title": "ssociations of fathers", "year": "2011", "source": "history of incarceration with sons' delinquency and arrest among BlackWhite, and Hispanic males in the United States', Criminology, vol. 49, no. 4, pp. 1109-1147", "authors": ["Michael Roettger", "Swisher R"]}, {"title": "Paternal incarceration and trajectories of marijuana and other illegal drug use from adolescence into young adulthood: Evidence from longitudinal panels of males and females in the United States", "year": "2011", "source": "Addiction, vol. 106, no. 1, pp. 121-132", "authors": ["Michael Roettger", "Swisher R", "Kuhl D"]}, {"title": "Paternal incarceration and adversity in young adulthood", "year": "2009", "source": "Corrections Today, vol. 71, no. 6, pp. 18-20", "authors": ["Michael Roettger"]}, {"title": "The VNTR 2 repeat in MAOA and delinquent behavior in adolescence and young adulthood: Associations and MAOA promoter activity", "year": "2008", "source": "European Journal of Human Genetics, vol. 16 , no. 5, pp. 626-634", "authors": ["Guo G", "Ou X", "Michael Roettger"]}, {"title": "The integration of genetic propensities into social-control models of delinquency and violence among male youths", "year": "2008", "source": "American Sociological Review, vol. 73, no. 4, pp. 543-568", "authors": ["Guo G", "Michael Roettger", "Cai T"]}, {"title": "Contributions of the DAT1 and DRD2 genes to serious and violent delinquency among adolescents and young adults", "year": "2007", "source": "Human Genetics, vol. 121, no. 1, pp. 125-136", "authors": ["Guo G", "Michael Roettger", "Shih J"]}]}, "Microsoft-Academic": [{"title": "bus system master slave subscriber data transmission for vehicle air conditioning system", "year": 1995, "source": "", "authors": [{"name": "michael roettger"}]}, {"title": "automatic selection of ventilation inlet in passenger vehicles", "year": 1997, "source": "", "authors": [{"name": "oliver dipl ing kaefer", "affiliation": "behr"}, {"name": "michael roettger", "affiliation": "behr"}]}, {"title": "method of operating an electric motor esp for a motor vehicle air conditioning system", "year": 1998, "source": "", "authors": [{"name": "michael roettger", "affiliation": "behr"}, {"name": "bjoern lindner", "affiliation": "behr"}, {"name": "gerd bierbaum", "affiliation": "behr"}]}, {"title": "regular session submission or poster session 504 the demographic effects of racial and ethnic disparities in", "year": 2011, "source": "", "authors": [{"name": "sara wakefield"}, {"name": "michael roettger"}]}, {"title": "verfahren und vorrichtung zum betreiben eines elektromotors insbesondere einer klimaanlage eines kraftfahrzeugs", "year": 1998, "source": "", "authors": [{"name": "michael roettger"}, {"name": "bjoern lindner"}, {"name": "gerd bierbaum"}]}, {"title": "verfahren und anordnung zur ubertragung von daten zwischen teilnehmern eines bussystems insbesondere fur kraftfahrzeuge", "year": 1995, "source": "", "authors": [{"name": "michael roettger"}]}, {"title": "method and arrangement for transmitting data between participants of a bus system particularly for motor vehicles", "year": 1995, "source": "", "authors": [{"name": "michael roettger"}]}], "ANDS-Grants": []}