{"ANU": {"name": "Neil Ramsey", "link": "https://researchers.anu.edu.au/researchers/ramsey-nd", "colleges": "College of Arts and Social Sciences", "email": "NEIL.RAMSEY@anu.edu.au", "phone": "", "expertise": ["British And Irish Literature"], "interest": ["Romantic Literature and Print Culture; Early Victorian Literature; War Literature; Nineteenth-Century Autobiography, Travel Writing and Labouring-Class Poetry; Masculinity and Literature."], "biography": "Neil Ramsey received a PhD in 2008 from The Australian National University. His research is\nconcerned with the literary and artistic response to war during the Romantic era. His PhD thesis,\nThe Military Author and Romantic War, offers the first literary history of military memoirs\npublished in Britain during the period. In 2009 he was awarded a three year Australian\nPostdoctoral Fellowship, War, Literary Culture and Masculinity in Romantic Period Britain, 1750-\n1850, to commence in October 2010.", "project": ["War, Literary Culture and Masculinity in Romantic Period Britain, 1750-1850: The aim of this\nproject is to broaden our understanding of the relationship between war and culture by providing\na literary analysis of Romantic period military and naval war writing. This was the first body of\nmilitary writing to have circulated widely within a civilian, commercial market and my project will\nprovide insight into its formative role in the development of a modern culture of war. I will\nexamine its influence on literary theory and practice of the period and will consider how it shaped\ncultural and gender identities through its representations of military service. By recovering this\nwriting I will thrown new light onto our understanding of the militaristic dimensions of Romantic\nand modern culture."], "publication": [{"title": "Question of Literature\": The Romantic Writer and Modern Wars of Empire", "year": "2009", "source": "in Christa Knellwolf King, Margarete Rubik (ed.), Stories of Empire: Narrative Strategies for the Legitimation of an Imperial World Order, WVT Wissenschaftlicher Verlag Trier, Dusseldorf, Germany, pp. 49-67", "authors": ["Neil Ramsey"]}, {"title": "Horrid Scenes and Marvellous Sights: The Citizen-Soldier and Sir Robert Ker Porter", "year": "2007", "source": "s Spectacle of War'Romanticism on the Net, vol. 46, pp. 1-10", "authors": ["Neil Ramsey"]}, {"title": "Making My Self a Soldier", "year": "2007", "source": ": The Role of Soldiering in the Autobiographical Work of John Clare'Romanticism, vol. 13, no. 2, pp. 177-188", "authors": ["Neil Ramsey"]}, {"title": "Romanticism and War", "year": "2006", "source": "Literature Compass, vol. 3, no. 2, pp. 117-126", "authors": ["Neil Ramsey"]}]}, "Microsoft-Academic": [{"title": "mary shelley and the monstrosity of war frankenstein and the post waterloo politics of life", "year": 2020, "source": "eighteenth century life", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 161618848}, {"title": "lily gurton wachter s watchwords romanticism and the poetics of attention", "year": 2020, "source": "romanticism", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 69977080}, {"title": "jacques ranciere and the politics of war literature poetry and trauma in edmund blunden s undertones of war 1928", "year": 2020, "source": "", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}]}, {"title": "military periodicals discipline and wartime emotion in the 1790s", "year": 2019, "source": "", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}]}, {"title": "the military memoir and romantic literary culture 1780 1835", "year": 2011, "source": "", "authors": [{"name": "neil ramsey"}]}, {"title": "romanticism in the shadow of war literary culture in the napoleonic war years byron s war romantic rebellion greek revolution watching war", "year": 2016, "source": "european romantic review", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 136064895}, {"title": "scotland and the british army 1700 1750 defending the union by victoria henshaw london bloomsbury 2014 299 p 65 hb isbn 978 1 4725 0730 3", "year": 2016, "source": "journal for eighteenth century studies", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 68052740}, {"title": "philip shaw suffering and sentiment in romantic military art", "year": 2015, "source": "the bars review", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 2764510953}, {"title": "reframing regicide symbolic politics and the sentimental trial of james hadfield 1800", "year": 2013, "source": "journal for eighteenth century studies", "authors": [{"name": "neil ramsey"}], "id": 68052740}, {"title": "kenneth johnston unusual suspects pitt s reign of alarm and the lost generation of the 1790s", "year": 2014, "source": "the review of english studies", "authors": [{"name": "neil ramsey", "affiliation": "university of new south wales"}], "id": 185276071}], "ANDS-Grants": []}