{"ANU": {"name": "Nicolas Peterson", "link": "https://researchers.anu.edu.au/researchers/peterson-n", "colleges": "College of Arts and Social Sciences", "email": "Nicolas.Peterson@anu.edu.au", "phone": "02-61254727", "expertise": ["Studies Of Aboriginal And Torres Strait Islander Society", "Social And Cultural Anthropology", "Other Studies In Human Society"], "interest": ["Social organisation, economic anthropology, ritual and symbolism, land and sea tenure, fourth world people and the state, social change and applied anthropology, anthropology of photography, ethnographic film, history of Australian Anthropology, anthropology of native title."], "biography": "Director of the Centre for Native Title Anthropology:  This Centre, established in 2010, has been funded by the Attorney-General's Department, Canberra, to contribute to the professional development of anthropologists working in the native title area and to attract younger scholars into making a career in native title work.  The Centre has been refunded for a further three years till 2022. Day to day the Centre is run by Dr Julie Finlayson.", "project": ["Vitality and change in Warlpiri songs at Yuendumu (Linkage Project LP160100743 held with Professor Linda Barwick the primary investigator, Dr Myfany Turpin, Mr Simon Fisher and Ms Valerie Martin running from 2016-2019). the project seeks to understand the reasons behind the reported decline in knowledge of songs amongst younger generations at Yuendumu in the past 40-50 years.  I will analyse selected songs cycles over time to look at differences in content and interpretation.", "Heritage in the limelight: the magic lantern in Australia and the world (Discovery grant DP160102509 held with Dr Martyn Jolly the primary investigator, Dr Martin Thomas, Professor Jane Lydon, Professor Paul Pickering and Dr Joe Kember, running from 2016-2018). The project aims to discover and analyse the large number of glass magic lantern slides that remain under-utilised in public collections. In particular to understand how diverse audiences affectively experienced these powerful forms of early media. I will look at the role that lantern slides played in the early photographic visual literacy of Aboriginal people in central Australia and the uses made of images of Aboriginal people in lantern slide lectures by missionaries and others.", "While the following projects have been formally finished  there is on-going work related to each of them by myself, and the other  researchers involved in each of the projects, including the doctoral  students who have all completed their theses.", "The long-term dynamics of higher order social organisations in Aboriginal Australia (Discovery grant DP140102983 held With Dr Patrick McConvell the primary investigator running from 2014-2016).The two principal aims of this project are to show that the Holocene prehistory of Australia was dynamic, involving signiificant expansion and migration of language groups, and that in such expansion and migration, and resistance to them, higher-order social groupsing were formed.  These are the nations reported by earlier anthropologists and the cultural bloc of recent anthropology. This grant will support a PhD scholarship for Mr Tony Jefferies as well as research by Dr McConvell and myself.", "Rescuing Carl Strehlow's Indigenous cultural heritage legacy: the neglected German tradition of Arandic ethnography (ARC Linkage grant LP110200803, 2011-2014). This Linkage grant is held with the Central Land Council and the Strehlow Research Centre, both of Alice Springs. The researchers involved are: Dr Anna Kenny post doctoral fellow; Dr John Henderson, linguist from the University of Western Australia; Michael Cawthorn, Director of the Strehlow Research Centre; Helen Wilmot, anthropologist at the Central Land Council; and myself.", "The first results of the is project appeared with the publication of Dr Anna Kenny's book \"The Aranda' pepa\" by ANU Press which can be downloaded free in electronic form from the Press's website or bought in hard copy. A co-edited book by myself and Anna Kenny on \"German ethnography in Australia\" appeared late in 2017 and  by mid-2018 Carl Strehlow's dictionary, accompanied by five introductory essays, will also be in print.", "This project had three interconnected aims:", "* To bring the last major ethnography of classical Aboriginal life into the world of Australian scholarship by setting out its ethnographic significance to Aboriginalist anthropology and in so doing exploring the contribution of the neglected German tradition of humanistic anthropology to contemporary issues and debates. * To repatriate Indigenous intellectual property by collaborating with Arrernte and Luritja speakers to translate Carl Strehlow's unpublished 10,000 word dictionary and other cultural materials currently unavailable to them because of the language and scripts in which they are written, or being research notes and, * To examine the relationship, and sources of difference, between the work of TGH Strehlow and that of his father Carl in the areas of genealogy, territorial organisation, mythology, and totemism as a contribution to reducing contemporary conflict over traditional lands in particular, and to understanding the trajectories of change in Arrernte and Luritja social orders in the 20th century", "Carl Strehlow’s seven-volume work on the Arrernte (Aranda) and Luritja, Die Aranda- und Loritja Stämme in Zentral-Australien, is the last ethnography of classical Aboriginal life that has yet to be brought into the wider world of Aboriginalist scholarship. There are several reasons for its neglect. The most obvious is that it is in German and that there is a lack of a published translation because senior Arrernte men are concerned about the amount of restricted information throughout the text. There is also an important academic reason that relates to the history of Australian anthropology. Sir Baldwin Spencer saw Carl’s views on aspects of Arrernte culture as a threat to his ethnographic authority and from as early as 1903 began to attack Carl’s work, and his bona fides as an ethnographer.  Spencer claimed Carl’s reports were tainted by his status as a missionary, but an equally fundamental issue was the difference in intellectual traditions: Carl’s humanistic anthropology was deeply at odds with Spencer’s biologically influenced social evolutionary views.  Spencer’s position as Professor of Biology at the University of Melbourne, the great acclaim received by his two ethnographies of central Australia, written with Frank Gillen, (1899, 1904), and the wide availability of these two books further combined to completely marginalise Carl’s profoundly rich work.", "This project has rpreented a unique opportunity for collaboration between the School of Archaeology and Anthropology at the Australian National University, the Strehlow Research Centre, the Central Land Council and senior Arrernte speakers to make available to both Aboriginal people, and the world of scholarship, the dictionary and other material that are rich in cultural heritage significance for Aboriginal people. This ethnographic material is also highly relevant to understanding the changes that have taken place in Arrernte and Luritja social orders since the beginning of the 20th century, helpful in clarifying issues creating tensions in present day society especially in relation to land, and in enriching the history of Australian anthropology.", "Dr Kenny has worked with Arrernte and Luritja linguists to translate the dictionary from German into English starting from the original manuscript with technical advice on dictionary making from Dr Henderson. She will also write a book on the work of Carl Strehlow. Mr Cawthorn and Ms Wilmot worked on the clarification and elaboration of the genealogies, especially as they relate to land and Professor Peterson focused on the place of Ronald and Catherine Berndt who he believes were the last exemplars of the German humanistic tradition, until the recent arrival of a wave of new scholars trained in Germany, in the history of Australian anthropology.", "", "Pintupi dialogues: reconstructing memories of art, land and Community through the visual record (ARC Linkage grant LP100200359, 2010-2013). This ARC Linkage grant is held with Papunya Tula Artists Ltd and the National Museum of Australia, Professor Fred Myers of New York University, Dr Peter Thorley of the National Museum of Australia, and Ms Philippa Deveson and myself of ANU. Together with the members of the Kintore community we will be using film and photography to reflect on a pivotal period in Pintupi history. In 1964, internationally renowned filmmaker, Ian Dunlop accompanying Jeremy Long, had photographed Pintupi people still living a nomadic life in central Australia's western desert. He returned in 1974 to film these same people, now living at Yayayi outstation where Fred Myers was carrying out his doctoral fieldwork.", "People like the Pintupi have been referred to as 'People without History'. Such a view emphasises the difficulty of creating a history when they have no written records of their own. This is culturally compounded by the lack of any notion of a chronological career or biographical narrative among many remote Aboriginal people. Rather, Pintupi lives and past events are encompassed in a rich array of contextually elicited or triggered stories about particular episodes and events. This leads to episodic accounts of the past that obscure the persistence of motivations, the long-term commitment to particular courses of action and the ways people have consistently worked towards specific goals, making their lives seem fragmented, reactive and lacking in clear direction. However, with a layered dialogic approach, incorporating multiple perspectives, it is possible to work collaboratively to overcome these difficulties and create a nuanced and evidence based narrative account of intent and purpose that can bridge this cultural difference in historical consciousness.", "Pintupi Dialogues is built around a unique research resource ideally suited to the cultural specificities of the Pintupi historical consciousness:", "- thirteen hours of raw synchronous sound film, shot by internationally renowned           ethnographic filmmaker Ian Dunlop at the Pintupi outstation of Yayayi in 1974, and", "- over 600 still photographs, taken by Dunlop in 1964 of some of the same people,           and their parents, when they were living a completely independent traditional life           'beyond the frontier'.", "Using these visual records as the basis for a dialogue between Myers and the Pintupi we will reconstruct an account of how the Pintupi sought to fashion their own modernity, with a particular emphasis on the great transition in their lives that took place in the 1960s and 1970s.", "Such a history is important to the Pintupi, faced as they are with a burgeoning young population and the rapid disappearance of people who have knowledge of this transition. It will help the younger generation understand what those making the transition struggled for, and how against seemingly insuperable odds, they first got their own outstation at Yayayi, eventually leading to their own towns of Kintore and Kiwirrkura in the remoteness of the western desert. Not only was this a struggle for self-determination but it was also a crucial period when they came to terms with the cash economy by becoming involved in the Papunya Tula art movement. For the project team the history is important for an additional reason: it will be a gateway to examining the origins and development of self-determination as manifested in the outstation movement and the moral and humanitarian concerns behind government policy as it sought a mutual accommodation with Pintupi people.", "Anthropological and Aboriginal perspectives on the Donald Thomson Collection: material culture, collecting and identity (ARC Linkage grant 2003-2006). In conjunction with Museum Victoria, Dr Louise Hamby, post doctoral fellow, and I, from the School of Archaeology and Anthropology at the Australian National University, and Ms Lindy Allen, Senior Curator, from Museum Victoria have been working on the Donald Thomson Arnhem Land Collection made between 1935-43. His Arnhem Land Collection of photographs, objects and notes together form the most comprehensive record of any fully functioning, self-suporting Aboriginal society we shall every have. The project has involved, among other things, digital modes of repatriation, extensive field based documentation of the many hundreds of images, exploration of material culture and ethnotechnology and research on Donald Thomson's place in Australian anthropology. Many Indigenous knowledge holders have been brought down to work at the Museum with the more than 4,500 objects and over 2000 photographs as well. Work related to this project will continue well into the future.", "Warlpiri songlines: anthropological, linguistic and Indigenous perspectives (ARC Linkage grant 2005-2007). In conjunction with the Warlpiri Janganpa Association, and the Central Land Council, the School of English at the University of Queensland and the Schools of Music and Archaeology and Anthropology at the Australian National University have a three year research project into Warlpiri songlines. The project combines anthropologists, linguists, musicologists, Indigenous knowledge holders and Indigenous bicultural linguists to record, transcribe and translate many of the cycles of songs that are no longer frequently performed, and, therefore, not being passed on to the younger generations. Warlpiri songs link ancestral power with the landscape, emotions and aesthetics and are central to Warlpiri religious life. The project is creating a cultural archive at Yuendumu informed by indigenous exegesis that is also integrating appropriate aspects into the world of scholarship and eventually providing materials for Warlpiri school curricula. This project includes a postgraduate research student, Georgia Curran, who is working with Warlpiri collaborations over a fifteen month period at Yuendumu, Dr Mary Laughren, Dr Stephen Wild and Ms Anna Meltzer. Key Warlpiri collaborators are Mr Thomas Rice Jangala and Ms Jeannie Egan Nungarrayi.  Other Current Research Economy and culture: I am interested in the relationship of Indigenous Australian forms of sociality, organisation and economic practices with those of the encompassing nation-state. Currently I am investigating the modernising of the Indigenous domestic moral economy (see 1991, 1993, 2005 and Peterson and Taylor 2003; 2013; 2015).", "Early twentieth century photography of Aboriginal people: In this project I am examining the ways in which Aboriginal people were represented in popular imagery (eg see 2003; 2006; 2020)."], "publication": [{"title": "The Missionaries", "year": "2020", "source": "Servant: BabelFunding and the Bible Society in Australia', in Martyn Jolly & Elisa deCourcy (ed.), The Magic Lantern at Work: Witnessing, Persuading, Experiencing and Connecting, Routledge, New York, pp. 88-101", "authors": ["Nicolas Peterson"]}, {"title": "Women", "year": "2018", "source": "s yawulyu songs as evidence of connections to and knowledge of land: the\r\nJardiwanpa'in Peter K Austin, Harold Koch and Jane Simpson (ed.), Language, Land and Song: Studies in honour of Luise Hercus, Batchelor Institute Press, Australia, pp. 344-371", "authors": ["Laughren M", "Curran G", "Turpin M", "Nicolas Peterson"]}, {"title": "Is There a Role for Anthropology in Cultural Reproduction? Maps, Mining, and the \"Cultural Future\" in Central Australia", "year": "2017", "source": "in Francoise Dussart and Sylvie Poirier (ed.), Entangled Territorialities: Negotiating Indigenous Lands in Australia and Canada, University of Toronto Press, Canada", "authors": ["Nicolas Peterson"]}, {"title": "The origins and history of outstations as Aboriginal Life projects", "year": "2016", "source": "in Nicolas Peterson, Fred Myers (ed.), Experiments in Self-Determination : Histories of the outstation movement in Australia, ANU Press, Canberra, pp. 1-22", "authors": ["Nicolas Peterson"]}, {"title": "Experiments in Self-Determination : Histories of the outstation movement in Australia", "year": "2016", "source": "ANU PressCanberra, Australia", "authors": ["Nicolas Peterson", "Myers F", "eds"]}, {"title": "What is the policy significance of the hybrid economy?", "year": "2016", "source": "in Will Sanders (ed.), Engaging Indigenous Economy: Debating diverse approaches, ANU Press, Acton ACT 2601, pp. 55-64", "authors": ["Nicolas Peterson"]}, {"title": "What was Dr Coombs thinking? Nyirrpi, policy and the future", "year": "2016", "source": "in Nicolas Peterson and Fred Myers (ed.), Experiments in Self-Determination: Histories of the outstation movement in Australia, ANU Press, Canberra, Australia, pp. 161-179", "authors": ["Nicolas Peterson"]}, {"title": "Place, Personhood and Marginalization: Ontology and Community in Remote Desert Australia", "year": "2015", "source": "Anthropologica, vol. 57, no. 9, pp. 491-500", "authors": ["Nicolas Peterson"]}, {"title": "Studying man and man", "year": "2015", "source": "s nature: A history of the institutionalisation of Aboriginal anthropology (1990 Wentworth Lecture)'in Robert Tonkinson (ed.), The Wentworth Lectures: Honouring fifty years of Australian Indigenous Studies, Aboriginal Studies Press, Canberra, pp. 102-124pp", "authors": ["Nicolas Peterson"]}, {"title": "Two takes on social problems in Central Australia", "year": "2014", "source": "Australian Aboriginal Studies, no. 1, pp. 88-89", "authors": ["Nicolas Peterson", "Merlan F"]}, {"title": "The present and the ethnographic present: change in the production of anthropological knowledge about Aboriginal Australia", "year": "2014", "source": "International Symposium on Australian Aboriginal Anthropology, ed. Michael Houseman, Musee du Quai Branly, France", "authors": ["Nicolas Peterson"]}, {"title": "tin", "year": "Mar", "source": "D. TriggerD. Burke, P. Memmott, P. Holcombe, S. Veth, P. Winn, P, N. Peterson and Palmer, K. “Forensic Social Anthropology” Chapter 36 in Expert Evidence. Thomson Reuters.", "authors": ["", "Nicolas Peterson"]}, {"title": "nthropology, Public Policy and Social Process in Indigenous Australia", "year": "2013", "source": "The Asia Pacific Journal of Anthropology, vol. 14, no. 4, pp. 297-303", "authors": ["Merlan F", "Nicolas Peterson"]}, {"title": "Community development, civil society and local government in the future of remote Northern Territory growth towns", "year": "2013", "source": "Asia Pacific Journal of Anthropology, vol. 14, no. 4, pp. 339-352", "authors": ["Nicolas Peterson"]}, {"title": "Finding one", "year": "2013", "source": "s way in Arnhem land'in Shore, C. and Trnka, S. (ed.), Up close and personal: on peripheral perspectives and the production of anthropological knowledge, Berghahn Books, United States, pp. 108-124", "authors": ["Nicolas Peterson"]}, {"title": "On the persistence of sharing: Personhood, asymmetrical reciprocity, and demand sharing in the Indigenous Australian domestic moral economy", "year": "2013", "source": "Australian Journal of Anthropology, The, vol. 24, no. 2, pp. 166-176", "authors": ["Nicolas Peterson"]}, {"title": "ustralasian contrasts.", "year": "2012", "source": "in R. FardonO. Harris, T. Marchand, M. Nuttall, C. Shore, V. Strang and R. Wilson (ed.), The SAGE handbook of social anthropology, 2 vols, SAGE, London,  pp.443-464", "authors": ["Nicolas Peterson"]}, {"title": "ustralasian Contrasts", "year": "2012", "source": "in Richard Fardon, John Gledhill (ed.), The SAGE Handbook of Social Anthropology, Sage Publications Inc, United Kingdom, pp. 443-448", "authors": ["Nicolas Peterson", "Gardner D", "Urry J"]}, {"title": "Is the Aboriginal landscape sentient? Animism, the new animism and the Warlpiri", "year": "2011", "source": "Oceania, vol. 81, no. 2, pp. 167-179", "authors": ["Nicolas Peterson"]}, {"title": "Other peoples lives: Secular assimilation, culture and ungovernability", "year": "2010", "source": "in Jon Altman and Melinda Hinkson (ed.), Culture Crisis: Anthropology and Politics in Aboriginal Australia, UNSW Press, Sydney, pp. 248-258", "authors": ["Nicolas Peterson"]}, {"title": "Common law, Statutory law and the Political economy of the recognition of Indigenous Australian rights in land", "year": "2010", "source": "in Knafla, L. A and Westra, H (ed.), Aboriginal Title and indigenous peoples: Canada, Australia and New Zealand, UBC Press, Vancouver, pp. 171-184", "authors": ["Nicolas Peterson"]}, {"title": "The cultural context of art from the desert", "year": "2009", "source": "in Claudette Chubb & Nancy Sever (ed.), Indigenous Art at the Australian National University, Palgrave Macmillan Ltd, Melbourne, pp. 127-152", "authors": ["Nicolas Peterson"]}, {"title": "Just Humming: the Consequence of the Decline of Learning Contexts among the Walpiri", "year": "2008", "source": "in J. Kommers and E. Venbrux (ed.), Cultural Styles of Knowledge Transmission: Essays in Honour of Ad Borsboom, Amsterdam University Press, Amsterdam, pp. 114-118", "authors": ["Nicolas Peterson"]}, {"title": "Too sociological", "year": "2008", "source": "? Revisiting Aboriginal territorial organization''in M. Hinkson and J. Beckett (ed.), An Appreciation of Difference: W.E.H. Stanner and Aboriginal Australia, Aboriginal Studies Press, Canberra, pp. 185-197", "authors": ["Nicolas Peterson"]}, {"title": "Introduction [to The Makers and Making of Indigenous Australian Museum Collections]", "year": "2008", "source": "in Nicolas Peterson, Lindy Allen and Louise Hamby (ed.), The Makers and Making of Indigenous Australian Museum Collections, Melbourne University Press (an imprint of Melbourne University Publishing), Melbourne, pp. 1-26", "authors": ["Nicolas Peterson", "Allen L", "Hamby L"]}, {"title": "The Makers and Making of Indigenous Australian Museum Collections", "year": "2008", "source": "Melbourne University Press (an imprint of Melbourne University Publishing)Melbourne", "authors": ["Nicolas Peterson", "Allen L", "Hamby L", "eds"]}, {"title": "Culture", "year": "2006", "source": "Indigenous Socioeconomic Outcomes: Assessing Recent Evidence, ed. B.H. Hunter, ANU ePress, Canberra, pp. 269-277", "authors": ["Nicolas Peterson"]}, {"title": "Early 20th Century Photography of Australian Aboriginal Families: Illustration or Evidence?", "year": "2006", "source": "Visual Anthropology Review, vol. 21, no. 1-2, pp. 11-26", "authors": ["Nicolas Peterson"]}, {"title": "I cant follow you on this horde-clan business at all: Donald Thomson, Radcliffe-Brown and a Final Note on the Horde", "year": "2006", "source": "Oceania, vol. 76, pp. 16-26", "authors": ["Nicolas Peterson"]}, {"title": "Repositioning Anthropology, 1972-1980", "year": "2006", "source": "in Robert Layton, Stephen Shennan & Peter Stone (ed.), A Future for Archaeology, Cavendish Publishing Ltd, United Kingdom, pp. 31-40", "authors": ["Nicolas Peterson"]}, {"title": "Visual Knowledge: Spencer and Gillens use of photography in The Native tribes of Central Australia", "year": "2006", "source": "Australian Aboriginal Studies, vol. 2006, no. 1, pp. 12-22", "authors": ["Nicolas Peterson"]}, {"title": "Biamanga and Gulaga", "year": "2005", "source": "Cultural Heritage Research CentreUniversity of Canberra", "authors": ["Egloff B", "Nicolas Peterson", "Wendong T"]}, {"title": "Modes of research", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Macquarie University, Macquarie University, pp. 248-257", "authors": ["Nicolas Peterson", "Arthur W"]}, {"title": "On the visibility of indigenous Australian systems of marine tenure", "year": "2005", "source": "New Interdisciplinary Approaches to the Study of Indigenous Use and Management of Migratory Marine Resources, ed. N Kishigami and JM Savelle, National Museum of Ethnology Japan, Osaka, Japan, pp. 427-444", "authors": ["Nicolas Peterson"]}, {"title": "The use of Spencer", "year": "2005", "source": "s Photographic Imagery'in Philip Batty, Lindy Allen, John Morton (ed.), The Photographs of Baldwin Spencer (revised edition), Melbourne University Press (an imprint of Melbourne University Publishing), Melbourne, pp. 154-157", "authors": ["Nicolas Peterson"]}, {"title": "Thomsons place in Australian anthropology", "year": "2005", "source": "Donald Thomson Centenary Anniversary Symposium 2001, ed. Bruce Rigsby and Nicolas Peterson, Academy of the Social Sciences in Australia, Canberra Australia, pp. 29-44", "authors": ["Nicolas Peterson"]}, {"title": "What can the pre-colonial and frontier economies tell us about engagement with the real economy? Indigenous life projects and the conditions for development", "year": "2005", "source": "in Diane Austin-Broos, Gaynor Macdonald (ed.), Culture, Economy and Governance in Aboriginal Australia, University of Sydney Press, Sydney, pp. 7-18", "authors": ["Nicolas Peterson"]}, {"title": "Social and cultural life", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Macquarie University, Macquarie University, pp. 88?107", "authors": ["Nicolas Peterson", "McConvell P", "McDonald H"]}, {"title": "Introduction [to Donald Thomson: the man and scholar]", "year": "2005", "source": "Donald Thomson Centenary Anniversary Symposium 2001, ed. Bruce Rigsby and Nicolas Peterson, Academy of the Social Sciences in Australia, Canberra Australia, pp. 1-16", "authors": ["Rigsby B", "Nicolas Peterson"]}, {"title": "Donald Thomson: The Man and Scholar", "year": "2005", "source": "Academy of the Social Sciences in AustraliaCanberra, Australia", "authors": ["Rigsby B", "Nicolas Peterson", "eds"]}, {"title": "Myth of the walkabout: Movement in the Aboriginal Domain", "year": "2004", "source": "in John Taylor and Martin Bell (ed.), Population Mobility and Indigenous Peoples in Australasia and North America, Routledge, Taylor & Francis Group, London, pp. 223-238", "authors": ["Nicolas Peterson"]}, {"title": "The modernising of the Indigenous domestic moral economy: Kinship, accumulation and household composition", "year": "2003", "source": "The Asia Pacific Journal of Anthropology, vol. 4, no. 1&2, pp. 105-122", "authors": ["Nicolas Peterson", "Taylor J"]}, {"title": "Biographical Sketch of Donald Thomson", "year": "2003", "source": "in Donald Thomson (ed.), Donald Thomson in Arnhem Land (revised ed), Melbourne University Press (an imprint of Melbourne University Publishing), Carlton, Victoria, pp. 1-21", "authors": ["Nicolas Peterson"]}, {"title": "Preface - Donald Thomson in Arnhem Land", "year": "2003", "source": "in Donald Thomson (ed.), Donald Thomson in Arnhem Land (revised ed), Melbourne University Press (an imprint of Melbourne University Publishing), Carlton, Victoria, pp. xi-xvi", "authors": ["Nicolas Peterson"]}, {"title": "The changing photographic contract: Aborigines and image ethics", "year": "2003", "source": "in Christopher Pinney and Nicolas Peterson (ed.), Photography's Other Histories, Duke University Press, Durham, pp. 119-145", "authors": ["Nicolas Peterson"]}, {"title": "Photographys Other Histories", "year": "2003", "source": "Duke University PressDurham", "authors": ["Pinney C", "Nicolas Peterson"]}, {"title": "boriginal intermarriage and economic status in western New South Wales", "year": "2002", "source": "People and Place, vol. 10, no. 4, pp. 11-16", "authors": ["Nicolas Peterson", "Taylor J"]}, {"title": "n expanding Aboriginal Domain: mobility and initiation journey", "year": "2000", "source": "Oceania, vol. 70, no. 3, pp. 205-218", "authors": ["Nicolas Peterson"]}, {"title": "The popular image", "year": "2000", "source": "BlackFlash: Canadian Journal of Photo-Based and Electronic Arts Production, vol. 18, no. 1, pp. 24-35", "authors": ["Nicolas Peterson"]}, {"title": "Introduction: Australia", "year": "1999", "source": "in <> (ed.), <>, pp. 317-323pp", "authors": ["Nicolas Peterson"]}]}, "Microsoft-Academic": [{"title": "photography s other histories", "year": 2003, "source": "international journal of african historical studies", "authors": [{"name": "christopher pinney"}, {"name": "nicolas peterson"}, {"name": "nicholas thomas"}, {"name": "joanne driessens"}, {"name": "michael aird"}], "id": 169569900}, {"title": "demand sharing reciprocity and the pressure for generosity among foragers", "year": 1993, "source": "american anthropologist", "authors": [{"name": "nicolas peterson", "affiliation": "australian national university"}], "id": 102499938}, {"title": "what can the pre colonial and frontier economies tell us about engagement with the real economy indigenous life projects and the conditions for development", "year": 2005, "source": "", "authors": [{"name": "nicolas peterson"}]}, {"title": "the modernising of the indigenous domestic moral economy kinship accumulation and household composition", "year": 2003, "source": "asia pacific journal of anthropology", "authors": [{"name": "nicolas peterson", "affiliation": "australian national university"}, {"name": "john taylor", "affiliation": "australian national university"}], "id": 191816521}, {"title": "an expanding aboriginal domain mobility and the initiation journey", "year": 2000, "source": "oceania", "authors": [{"name": "nicolas peterson", "affiliation": "australian national university"}], "id": 58557618}, {"title": "on the persistence of sharing personhood asymmetrical reciprocity and demand sharing in the indigenous australian domestic moral economy", "year": 2013, "source": "the australian journal of anthropology", "authors": [{"name": "nicolas peterson", "affiliation": "australian national university"}], "id": 202606351}, {"title": "citizenship and indigenous australians changing conceptions and possibilities", "year": 2008, "source": "", "authors": [{"name": "nicolas peterson"}, {"name": "will sanders"}]}, {"title": "method and apparatus for affecting controlled movement of at least a portion of the body", "year": 2007, "source": "", "authors": [{"name": "whitney brown"}, {"name": "loutfallah georges chedid"}, {"name": "portia lane"}, {"name": "nicolas peterson"}, {"name": "gary rogers"}, {"name": "jake tisdale"}]}, {"title": "secular and ritual links two basic and opposed principles of australian social organization as illustrated by walbiri ethnography", "year": 2009, "source": "mankind", "authors": [{"name": "nicolas peterson", "affiliation": "university of sydney"}], "id": 73464505}, {"title": "myth of the walkabout movement in the aboriginal domain", "year": 2004, "source": "", "authors": [{"name": "nicolas peterson"}]}], "ANDS-Grants": [{"description": "The two principal aims of the project are to show: that the Holocene prehistory of Australia was dynamic, involving significant expansion and migration of language groups; and, that in such expansion, migration, and resistance to them, higher-order social groupings were formed: the &lsquo;nations&rsquo; reported by earlier anthropology and the &lsquo;cultural blocs&rsquo; of recent anthropology. Evidence will come from comparative linguistics, anthropology, and the role of geography in the distribution of social groupings, principally in subtropical Eastern Australia but also in the Victoria River district and Tanami Desert, Northern Territory. This project challenges the dominant view of static Indigenous Australia pre-colonially, and will benefit Native Title anthropology.", "title": "Discovery Projects - Grant ID: DP140102983", "id": "517689", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP140102983", "researchers": ["Dr Patrick McConvell", "Prof Nicolas Peterson"], "status": "closed", "fundingAmount": 146000, "fundingScheme": "Discovery Projects", "startDate": 2014, "endDate": 2016, "dateTimeModified": "2016-05-29T08:51:53Z", "dateTimeCreated": "2015-04-12T05:06:50Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP140102983", "identifiers": ["http://purl.org/au-research/grants/arc/DP140102983", "DP140102983"], "subjects": ["ANTHROPOLOGY", "STUDIES IN HUMAN SOCIETY", "australian aborigines", "prehistory", "social organisation"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517689"}]}, {"description": "This project aims to understand the reasons behind the reported decline in knowledge of songs amongst younger generations at Yuendumu in the past 40-50 years, using a Central Australian music archive. This project will analyse selected song repertories over time, with insights and advice from today's senior custodians; and design strategies for Warlpiri people to re-engage with this important body of Warlpiri-initiated research in their own country. This research is expected to reinvigorate inter-generational transfer of highly significant cultural knowledge and practices.", "title": "Linkage Projects - Grant ID: LP160100743", "id": "942043", "institutions": ["University of Sydney"], "key": "http://purl.org/au-research/grants/arc/LP160100743", "researchers": ["Prof Linda Barwick", "Dr Myfany Turpin", "Prof Nicolas Peterson", "Mr Simon Fisher", "Ms Valerie Martin"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 195000, "fundingScheme": "Linkage Projects", "startDate": 2016, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:56Z", "dateTimeCreated": "2017-07-04T23:44:54Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Sydney"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP160100743", "identifiers": ["http://purl.org/au-research/grants/arc/LP160100743", "LP160100743"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/942043"}]}, {"description": "The project aims to discover and analyse the large number of glass magic lantern slides that remain under-used in our public collections. International scholarship has recently begun to show that lantern slide shows were a ubiquitous, globalised and formative cultural experience. The project aims to explore the international reach and diversity of this globalised modernist apparatus from the Australian perspective. It plans to understand how diverse audiences affectively experienced these powerful forms of early media, and to develop ways for today&rsquo;s Australians to re-experience their magic, invigorating and expanding our cultural heritage.", "title": "Discovery Projects - Grant ID: DP160102509", "id": "664059", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP160102509", "researchers": ["Dr Martyn Jolly", "A/Prof Martin Thomas", "Prof Jane Lydon", "Prof Nicolas Peterson", "Prof Paul Pickering", "Dr Joe Kember"], "status": "active", "fundingAmount": 260000, "fundingScheme": "Discovery Projects", "startDate": 2016, "endDate": 2020, "dateTimeModified": "2018-10-02T04:21:37Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP160102509", "identifiers": ["http://purl.org/au-research/grants/arc/DP160102509", "DP160102509"], "subjects": ["ART THEORY AND CRITICISM", "STUDIES IN CREATIVE ARTS AND WRITING"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/664059"}]}]}