{"ANU": {"name": "Nikolay Shirokikh", "link": "https://researchers.anu.edu.au/researchers/shirokikh-n", "colleges": "College of Health & Medicine", "email": "nikolay.shirokikh@anu.edu.au", "phone": "0432847526", "expertise": ["Analytical Biochemistry", "Cell Development Proliferation And Death", "Structural Biology Incl. Macromolecular Modelling", "Gene Expression Incl. Microarray And Other Genome Wide Approaches"], "interest": ["Dr Nikolay Shirokikh is a biochemist and molecular biologist interested in mechanisms underlying the decoding of genetic information. Instructions on how, when and where to make proteins to fulfil the ever-changing requirements of the living cells are encoded in the ribonucleic acid messages (messenger(m)RNA). Translation of mRNA into protein is central to all life. Mechanisms regulating translation are important for cell survival and wellbeing. In eukaryotic cells, where production of each type or variant of protein can be individually regulated, translational control is especially complex. Control of protein synthesis is directly involved in the processes critical for multicellular eukaryotes, such as cell differentiation, synaptic plasticity, adaptation and pro- and counter-survival decision making of the somatic and germline cells. Malignant cells utilise alternative translation pathways to survive and escape treatment through drug resistance. The primary interest of Dr Shirokikh is to obtain deep knowledge of eukaryotic translation that will allow to decipher, and eventually manipulate, the mRNA regulatory elements responsible for mRNA-wise regulation of protein synthesis. Dr Shirokikh has a particular interest and expertise in mammalian translation, but also works with yeast when accessibility of genetics is necessary. He uses a variety of molecular biology, biophysics, biochemistry and genetics approaches applied to synthetic systems that model in vivo molecular interactions, and also works directly with live cells. He is currently using high-throughput RNA sequencing methods to obtain the new knowledge of how different eukaryotic mRNAs can control their translation."], "biography": "In 2019, Nikolay Shirokikh was awarded an NHMRC Emerging Leadership Investigator Grant to expand the research of rapid translational control in the areas of cell stress response and cancer biology.", "project": ["1. Rapid translation-based stress responses to environmental changes.", "Across eukaryotes a fast, initial response to stress is mediated by messenger (m)RNAs already present in the cytoplasm, before transcription in the nucleus is re-programmed. However, major questions about the molecular mechanisms of rapid stress adaptation remain unanswered: (1) What are the mRNA sequences controlling rapid adaptation? (2) Which translation factors dynamically adjust proteome composition? (3) How do alternative translation pathways contribute to the response? (4) How do changes in ribosomal configuration, availability for translation and structural arrangement of RNA drive the response? During stress, mammalian frontline responses regulating mRNA and its translation are pervasive and critical for cell death/survival decisions and adaptation, but the transnational control and input of the different phases of translation remains largely unknown. We wish to provide this information.", "2. Translational control in cancer.", "New avenues to suppress adaptation of cancer cells to efficacy of drugs in standard and prospective therapies are critically needed to improve treatment outcomes. While many current anti-cancer drugs are initially efficacious, most eventually lead to resistance and patient relapse. Drug treatment induces cell stress response, which may allow some of the tumour cells to survive. These may adapt into drug-resistant malignancy during chemotherapy by rounds of clonal selection of existing or acquired transcriptional, epigenetic and genetic alterations. We wish to identify malignant-specific rapid responses to drug stress and find new compounds that would block such responses and reduce the adaptation rate.", "3. Innovative methods to detect rapid translational control.", "The major current limitations in the field include (a) lack of simple, reliable methods for surveying data on translational control concurrently to the information about abundances of the transcripts, (b) inability to precisely relate RNA footprint and fragment data to diverse isoforms and modifications of RNA and (c) the absence of an integrative view which would incorporate the observed changes in transcriptional and cytoplasmic RNA activity and the respective structure and isoform-level gene involvement of the RNA. We wish to address these gaps in capability by using accurate read-outs of translation efficiency available to us and developing methods for parallel extraction of structural, isoform and RNA-binding protein (RBP) positional data, together with ligand-specific ribosome localisation read-outs, in collaboration with the other JCSMR and external groups, along with streamlining the approaches to collect this information."], "publication": [{"title": "Migration of Small Ribosomal Subunits on the 5", "year": "2019", "source": "Untranslated Regions of Capped Messenger RNA'International Journal of Molecular Sciences, vol. 20, no. 18. pp. 446", "authors": ["Nikolay Shirokikh", "Dutikova Y"]}, {"title": "Cover Image", "year": "2018", "source": "Wiley Interdisciplinary Reviews: RNA\r\n, vol. 9, no. 4, pp. e1490", "authors": ["Nikolay Shirokikh", "Preiss T"]}, {"title": "Translation initiation by cap-dependent ribosome recruitment: Recent insights and open questions", "year": "2018", "source": "Wiley Interdisciplinary Reviews: RNA\r\n, vol. 9, no. 4, pp. e1473 (1-45)", "authors": ["Nikolay Shirokikh", "Preiss T"]}, {"title": "Translation complex profile sequencing to study the in vivo dynamics of mRNA-ribosome interactions during translation initiation, elongation and termination", "year": "2017", "source": "Nature Protocols, vol. 12, no. 4, pp. 697-731", "authors": ["Nikolay Shirokikh", "Archer S", "Beilharz T"]}, {"title": "Dynamics of ribosome scanning and recycling revealed by translation complex profiling", "year": "2016", "source": "Nature, vol. 535, no. 7613, pp. 570-574", "authors": ["Nikolay Shirokikh"]}, {"title": "Probe-directed degradation (PDD) for flexible removal of unwanted cDNA sequences from RNA-seq libraries", "year": "2015", "source": "in A. Boyle, J.L Haines, B. R Korf (ed.), Current Protocols in Human Genetics, John Wiley & Sons Inc., New Jersey, USA, pp. 11.15.1-11.15.36", "authors": ["Nikolay Shirokikh"]}, {"title": "Leader sequences of eukaryotic mRNA can be simultaneously bound to initiating 80S ribosome and 40S ribosomal subunit", "year": "2012", "source": "Biochemistry. Biokhimiia, vol. 77, no. 4, pp. 342-345", "authors": ["Sogorin E", "Nikolay Shirokikh", "Ibragimova A"]}, {"title": "Insight into the structural organization of the omega leader of TMV RNA: The role of various regions of the sequence in the formation of a compact structure of the omega RNA", "year": "2011", "source": "Biochemical and Biophysical Research Communications, vol. 404, no. 1, pp. 250-253", "authors": ["Agalarov S", "Sogorin E", "Nikolay Shirokikh"]}, {"title": "Quantitative analysis of ribosome-mRNA complexes at different translation stages", "year": "2010", "source": "Nucleic Acids Research, vol. 38, no. 3, pp. e15-e15", "authors": ["Nikolay Shirokikh", "Alkalaeva E", "Vassilenko K"]}, {"title": "Chemical and enzymatic probing of spatial structure of the omega leader of tobacco mosaic virus RNA", "year": "2010", "source": "Biochemistry. Biokhimiia, vol. 75, no. 4, pp. 405-411", "authors": ["Nikolay Shirokikh", "Agalarov S", "Spirin A"]}]}, "Microsoft-Academic": [], "ANDS-Grants": [{"description": "This project aims to reveal currently unknown molecular details of protein synthesis, a step of gene expression that is central to all of life. To achieve this, innovative methods based on next-generation sequencing will be deployed in the yeast model organism. Yeasts are of importance as pathogens as well as in the food and biotechnology industry sector. Thus, new knowledge generated in this project will help solve problems of invasive pathogenic behaviour and biomass production.", "title": "Discovery Projects - Grant ID: DP180100111", "id": "1315549", "key": "http://purl.org/au-research/grants/arc/DP180100111", "researchers": ["Prof Thomas Preiss", "Dr Nikolay Shirokikh", "Dr Leos Valasek", "Dr Alan Hinnebusch"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 471552, "fundingScheme": "Discovery Projects", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:39Z", "dateTimeCreated": "2018-03-06T23:37:29Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP180100111", "identifiers": ["http://purl.org/au-research/grants/arc/DP180100111", "DP180100111"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1315549"}]}]}