{"ANU": {"name": "Nilantha Hulugalle", "link": "https://researchers.anu.edu.au/researchers/hulugalle-nr", "colleges": "College of Science", "email": "nilantha.hulugalle@anu.edu.au", "phone": "0437666691", "expertise": ["Soil Physics", "Carbon Sequestration Science", "Farming Systems Research", "Agricultural Land Management", "Agronomy", "Crop And Pasture Production Not Elsewhere Classified"], "interest": ["Soil & water conservation & management Hydrological processes in irrigated and dryland farming systemsOrganic matter management, dynamics and carbon sequestration in soilFarming & cropping systems (tillage, rotation and stubble management systems, soil amendments). Experienced in cotton, maize and cassava-based cropping systems, irrigated row crops, and agro-forestry systems.Soil quality (soil structure, sodicity, salinity, interactions between soil biology, physics and chemistry)Wastewater and solid waste reuseRoot growth and dynamics"], "biography": "Principal Research Scientist, Department of Primary Industries, Narrabri, NSW, 2011-2015", "project": [], "publication": [{"title": "Sowing maize as a rotation crop in irrigated cotton cropping systems in a Vertosol: effects on soil properties, greenhouse gas emissions, black root rot incidence, cotton lint yield and fibre quality", "year": "2020", "source": "Soil Research, vol. 58, no. 2, pp. 137-150", "authors": ["Nilantha Hulugalle", "Nachimuthu G", "Kirkby K"]}, {"title": "Leaching of dissolved organic carbon and nitrogen under cotton farming systems in a Vertisol", "year": "2019", "source": "Soil Use and Management, vol. 35, no. 3, pp. 443-452", "authors": ["Nachimuthu G", "Watkins M", "Nilantha Hulugalle"]}, {"title": "Irrigation induced surface carbon flow in a Vertisol under furrow irrigated cotton cropping systems", "year": "2018", "source": "Soil and Tillage Research, vol. 183, pp. 8-18pp", "authors": ["Nachimuthu G", "Nilantha Hulugalle", "Watkins M"]}, {"title": "Carbon gains and losses with irrigation, runoff and drainage in cotton farming systems", "year": "2018", "source": "National Soil Science Conference, National Library of Australia, Canberra", "authors": ["Nachimuthu G", "Nilantha Hulugalle", "Watkins M"]}, {"title": "Carbon, nitrogen and phosphorus stoichiometric ratios under cotton cropping systems in Australian Vertisols: a meta-analysis of seven experiments", "year": "2017", "source": "Nutrient Cycling in Agroecosystems, vol. 107, no. 3, pp. 357-367", "authors": ["Nilantha Hulugalle", "Strong C", "McPherson K"]}, {"title": "Fallow soil evaporation in a grey Vertisol under contrasting wheat stubble management practices in cotton cropping systems", "year": "2017", "source": "Soil and Tillage Research, vol. 165, pp. 41-45", "authors": ["Nilantha Hulugalle", "Weaver T", "Finlay L"]}, {"title": "Soil structure in permanent beds under irrigated cotton-based\r\ncropping systems in a Vertisol", "year": "2017", "source": "Soil and Tillage Research, vol. 165, pp. 107-112pp", "authors": ["Nilantha Hulugalle", "Weaver T", "Finlay L"]}, {"title": "Soil properties and carbon stocks in a grey Vertosol irrigated with treated sewage effluent", "year": "2016", "source": "Soil Research, vol. 54, no. 7, pp. 847-856", "authors": ["Nilantha Hulugalle", "Weaver T", "Finlay L"]}, {"title": "Soil properties under cotton-corn rotations in australian cotton farms", "year": "2016", "source": "Journal of Cotton Science, vol. 20, no. 4, pp. 294-298", "authors": ["Nilantha Hulugalle", "McCorkell B", "Heimoana V"]}, {"title": "Response to Letter to the Editor \"Comments on\" Modelling soil organic carbon storage with RothC in irrigated Vertisols under cotton cropping systems in the sub-tropics\" (Nimai Senapati, Nilantha R. Hulugalle, Pete Smith, Brian R. Wilson, Jagadeesh B. Yelur", "year": "2016", "source": "Soil and Tillage Research, vol. 155, pp. 535-539", "authors": ["Senapati N", "Nilantha Hulugalle", "Smith P"]}, {"title": "On-farm gains and losses of soil organic carbon in terrestrial hydrological pathways: A review of empirical research", "year": "2016", "source": "International Soil and Water Conservation Research, vol.4, 245-25", "authors": ["Nachimuthu G", "Nilantha Hulugalle"]}, {"title": "Irrigation induced deep drainage losses of soil carbon in a cotton farming system of Australia", "year": "2015", "source": "2nd Australian Cotton Research Conference 2015, The Association of Australian Cotton Scientists, Australia, pp. 20pp", "authors": ["Watkins M", "Nachimuthu G", "Nilantha Hulugalle"]}, {"title": "Influence of crop rotation and residue management on surface soil shrinkage in a grey Vertosol", "year": "2015", "source": "2nd Australian Cotton Research Conference 2015, The Association of Australian Cotton Scientists, Australia, pp. 61, 66pp", "authors": ["Nilantha Hulugalle", "Weaver T"]}, {"title": "Terrestrial carbon losses in cotton farming systems in Australia", "year": "2015", "source": "20th Conference of the International Soils Tillage Research Organisation, 20th Conference of the International Soils Tillage Research Organisation, China, pp. 44pp", "authors": ["Nachimuthu G", "Nilantha Hulugalle", "Finlay L"]}, {"title": "Long-term changes in soil chemical properties of a Vertosol irrigated with tertiary treated sewage effluent", "year": "2015", "source": "2nd Australian Cotton Research Conference 2015, The Association of Australian Cotton Scientists, Australia, pp. 13-14pp", "authors": ["Nilantha Hulugalle", "Weaver T", "Finlay L"]}, {"title": "Irrigation induced runoff and carbon balance in cotton farming systems", "year": "2015", "source": "2nd Australian Cotton Research Conference 2015, The Association of Australian Cotton Scientists, Australia, pp. 13pp", "authors": ["Nachimuthu G", "Nilantha Hulugalle", "Finlay L"]}, {"title": "Chloride mass balance models are an economic method of assessing the effects of cotton farming systems on deep drainage in Vertosols", "year": "2015", "source": "2nd Australian Cotton Research Conference 2015, The Association of Australian Cotton Scientists, Australia, pp. 19pp", "authors": ["Weaver T", "Nilantha Hulugalle"]}, {"title": "Influence of Crop Management and Environmental Factors on Wolf Spider Assemblages (Araneae: Lycosidae) in an Australian Cotton Cropping System", "year": "2015", "source": "Environmental Entomology, vol. 44, no. 1, pp. 174-185", "authors": ["Rendon D", "Whitehouse M", "Nilantha Hulugalle"]}, {"title": "Fine root production and mortality in irrigated cotton, maize and sorghum sown in vertisols of northern New South Wales, Australia", "year": "2015", "source": "Soil and Tillage Research, vol. 146, pp. 313-322", "authors": ["Nilantha Hulugalle", "Broughton K", "Tan D"]}, {"title": "Comparison of organic and conventional managements on yields, nutrients and weeds in a corn-cabbage rotation", "year": "2015", "source": "Renewable Agriculture and Food Systems, vol. 30, no. 2, pp. 132-142", "authors": ["Bajgai Y", "Kristiansen P", "Nilantha Hulugalle"]}, {"title": "Soil organic carbon and microbial biomass carbon under organic and conventional vegetable cropping systems in an Alfisol and a Vertisol", "year": "2015", "source": "Nutrient Cycling in Agroecosystems, vol. 101, no. 1, pp. 1-15", "authors": ["Bajgai Y", "Kristiansen P", "Nilantha Hulugalle"]}, {"title": "Root growth of irrigated summer crops in cotton-based farming systems sown in Vertosols of northern New South Wales", "year": "2015", "source": "Crop and Pasture Science, vol. 66, no. 2, pp. 158-167", "authors": ["Nilantha Hulugalle", "Broughton K", "Tan D"]}]}, "Microsoft-Academic": [{"title": "travel conference for american societies of agronomy soil science crop science using saline and sodic soils", "year": 2017, "source": "", "authors": [{"name": "nilantha hulugalle"}]}], "ANDS-Grants": []}