{"ANU": {"name": "Nola Cooke", "link": "https://researchers.anu.edu.au/researchers/cooke-nj", "colleges": "College of Asia & the Pacific", "email": "", "phone": "", "expertise": ["Asian History"], "interest": ["Southern Vietnam under the Nguyen, 17-19th centuries; Catholicism in early  modern southern Vietnam; and the interactions of Chinese and local peoples in  19th Vietnam and Cambodia."], "biography": "My doctorate on the relationship between French political myth and colonial  politics in Central Vietnam (Annam) in the early colonial era (1897-1925)  created an interest in researching the antecedents of the colonial Vietnamese  political elite of central Vietnam. From there my research expanded to consider  the influence of its pre-dynastic southern heritage on the political and  administrative life of the nineteenth-century Nguyen Empire and its ruling  elite. One of my two current research interests builds on this by using French  missionary archives to illuminate the 17th and 18th century history of Nguyen  Cochinchina (modern central to southern Vietnam) and the history of Vietnamese  Catholicism there. My other research focus, on Chinese in Vietnam and Cambodia,  arises from my participation in an ARC-funded project researching commercial and  other interactions between Chinese and local peoples and regimes in the  19th-century.", "project": [], "publication": [{"title": "Strange brew: Global, regional and local factors behind the 1690 prohibition of Christian practice in Nguyen Cochinchina", "year": "2008", "source": "Journal of Southeast Asian Studies, vol. 39, no. 3, pp. 383-409", "authors": ["Nola Cooke"]}, {"title": "", "year": "2008", "source": "Chinese Southern Diaspora Studies", "authors": ["Nola Cooke", "Li T", "eds"]}, {"title": "King Norodom", "year": "2007", "source": "s Revenue Farming System in Later Nineteenth-Century Cambodia and his Chinese Revenue Farmers (1860-1891)'Chinese Southern Diaspora Studies, vol. 1, pp. 30-55", "authors": ["Nola Cooke"]}, {"title": "Water Frontier: Commerce and the Chinese in the Lower Mekong Region", "year": "2004", "source": "1750-1880Rowman & Littlefield Publishers Inc., Singapore", "authors": ["Nola Cooke", "Li T", "eds"]}, {"title": "Water World: Chinese and Vietnamese on the Riverine Water Frontier, from Ca Mau to Tonle Sap (c.1850-1884)", "year": "2004", "source": "in Nola Cooke and Li Tana (ed.), Water Frontier: Commerce and the Chinese in the Lower Mekong Region, 1750-1880, Rowman & Littlefield Publishers Inc., Singapore, pp. 139-157", "authors": ["Nola Cooke"]}, {"title": "Early Nineteenth-Century Vietnamese Catholics and Others in the Pages of the Annales de la Propagation de la Foi", "year": "2004", "source": "Journal of Southeast Asian Studies, vol. 35, no. 2, pp. 261-285", "authors": ["Nola Cooke"]}]}, "Microsoft-Academic": [{"title": "nineteenth century vietnamese confucianization in historical perspective evidence from the palace examinations 1463 1883", "year": 1994, "source": "journal of southeast asian studies", "authors": [{"name": "nola cooke", "affiliation": "national university of singapore"}], "id": 133648787}, {"title": "early christian conversion in seventeenth century cochinchina", "year": 2013, "source": "", "authors": [{"name": "nola cooke"}]}, {"title": "views of seventeenth century vietnam christoforo borri on cochinchina and samuel baron on tonkin", "year": 2008, "source": "journal of social issues in southeast asia", "authors": [{"name": "nola cooke"}], "id": 6555897}, {"title": "chapter 9 chinese merchants and mariners in nineteenth century tongking", "year": 2011, "source": "", "authors": [{"name": "vũ ðường luân"}, {"name": "nola cooke"}]}, {"title": "the myth of the restoration dang trong influences in the spiritual life of the early nguyen dynasty 1802 47", "year": 1997, "source": "", "authors": [{"name": "nola cooke"}]}], "ANDS-Grants": []}