{"ANU": {"name": "Pamela Faye McGrath", "link": "https://researchers.anu.edu.au/researchers/mcgrath-pf", "colleges": "College of Arts and Social Sciences", "email": "pamela.mcgrath@landpeoplerights.com", "phone": "0439958646", "expertise": ["Studies Of Aboriginal And Torres Strait Islander Society", "Heritage And Cultural Conservation", "Aboriginal And Torres Strait Islander Policy", "Economic Development Policy", "Law And Society"], "interest": ["Native title law and policyIndigenous cultural hertiage managementIndigenous peoples and miningIndigenous information governanceintercultural sociality and identityCamera culturesWestern Desert and Pilbara, Western Australia"], "biography": "Pamela has been involved with native title claim research, policy analysis and the teaching of native title anthropology for two decades. She was a founding collaborator of the ANU’s Centre for Native Title Anthropology, where she worked as a Research Fellow until moving to the Native Title Research Unit at AIATSIS in 2012. Pamela’s applied and academic research has focused primarily on the social and economic impacts of the native title regime, Indigenous cultural heritage regulation, and the management of native title archives. HEr publications include The Right to Protect Sites (2016), an edited anthology of interdisciplinary analysis about the management of place-based Indigenous heritage in the era of native title. The book includes a chapter on her research into the scale and impacts of cultural heritage activities occurring under the future act regime. Pamela has also conducted research on the information management capabilities of native title organisations and the design of guidelines to assist native title holders to secure and provide access to their collections of unique native title materials. She has also researched and written about aspects of intercultural   sociality, identity and camera culture on the Australian frontier. Her   doctoral thesis (2011) involved the re-documentation and repatriation of   a significant number of historical films and photographs, which she employed to examine   social relations around cameras during the early years of settler   contact with Ngaanyatjarra people of the Western Desert. Pam is currently Director of LPR Consulting Pty Ltd, and continues to provide expert research and mediation services for native title matters.", "project": ["The right to protect sites: Indigenous heritage management in the era of native title (AIATSIS 2016).  Following strong interest from Indigenous stakeholders for a project   focused on cultural heritage management and native title, this three  year  project examines the interesection of native title rights with the state and territory regulatory regimes of heritage protection in the context of resource extraction and other development projects. With a focus on the intents and impacts of heritage regimes, it explores how Aboriginal and Torres Strait Islander peoples are strategically engaging with them to them in order to leverage local social and economic objectives.", "Managing Information in Native Title (AIATSIS NTRU project 2013-2015) This three year project has been initiated in response to concerns raised by numerous native title organisations and traditional owner groups regarding the management of the large amount of information they have accumulated in the process of securing and managing their native title rights. Drawing on the findings of recent research into information managment capacity and information inequities in the native title system, as well as the outcomes of a large workshop of representatives from native title organisations around the country, the MINT project will produce a number of online tools, advice and guides to support traditional onwers in their efforts to access, secure and manage their substantial and unique collections of native title materials.", "The Nyangumarta Corporate History Research Project (AIATSIS NTRU project 2013-2015) Working in partnership with the Nyangumarta Warrarn Registered Native Title Body Corporate (RNTBC) and Yamatji Marlpa Aboriginal Corporation (YMAC), the Nyangumarta Corporate History Research Project provides insights into the nature and amount of corporate work required of Aboriginal and Torres Strait Islander people to achieve recognition of their native title rights and then manage them into the future. Using data gleaned from historical legal files and focusing exclusively on external (or intercultural) activities and relationships, this project quantifies the ‘work’ of the Nyangumarta people over a 15 year period as they pursued and ultimately won recognition of their native title rights.", "Centre for Native Title Anthropology Dr McGrath was a founding collaborator in the Centre for Native Title Anthropology (CNTA), and was their principal Research Fellow from 2010 to 2012. CNTA  aims to enhance the practice of native title anthropology in Australia  through a series of innovative programs and workshops for applied  anthropologists."], "publication": [{"title": "Providing public access to native title records: balancing the risks against the benefits", "year": "2019", "source": "in Ann Genovese, Trish Luker & Kim Rubenstein (ed.), The Court as archive: Rethinking the institutional role of federal superior courts of record, ANU Press, Canberra, Australia, pp. 213-238pp", "authors": ["Pamela Faye McGrath"]}, {"title": "Native Title Anthropology after the Timber Creek Decision", "year": "2017", "source": "Land, Rights, Laws: Issues of Native Title, vol. 6, no. 5, pp. 1-6", "authors": ["Pamela Faye McGrath"]}, {"title": "The right to protect sites: Indigenous heritage management in the era of native title", "year": "2016", "source": "AIATSIS Research PublicationsCanberra, Australia", "authors": ["Pamela Faye McGrath", "ed"]}, {"title": "The fate of Indigenous place-based heritage in the era of native title", "year": "2016", "source": "in Pamela McGrath (ed.), The right to protect sites: Indigenous heritage management in the era of native title, AIATSIS Research Publications, Canberra, Australia, pp. 1-25pp", "authors": ["Pamela Faye McGrath", "Lee E"]}, {"title": "The work of rights: the nature of native title labour", "year": "2016", "source": "in Will Sanders (ed.), Engaging Indigenous Economy: Debating diverse approaches, ANU Press, Acton ACT 2601, pp. 251-263", "authors": ["Pamela Faye McGrath"]}, {"title": "Future acts, future heritage? The extraordinary scale and unknown impacts of development-related indigenous heritage management on native title lands", "year": "2016", "source": "in Pamela McGrath (ed.), The right to protect sites: Indigenous heritage management in the era of native title, AIATSIS Research Publications, Canberra, Australia, pp. 49-76pp", "authors": ["Pamela Faye McGrath"]}, {"title": "Three weeks with strangers: Photography and the production of social identity during the 1935 Board of Anthropological Research expedition to the Warburton Range, Western Australia", "year": "2015", "source": "Australian Journal of Anthropology, The, vol. 26, no. 1, pp. 74-93", "authors": ["Pamela Faye McGrath"]}, {"title": "Managing Information in Native Title (MINT) Survey and Workshop Report. Australian Institute of Aboriginal and Torres Strait Islander Studies", "year": "2015", "source": "Canberra", "authors": ["Pamela Faye McGrath", "Dinkler L", "Andriolo A"]}, {"title": "n overview of the Registered Native Title Bodies Corporate regime", "year": "2013", "source": "in T Bauman, LM Strelein and JK Weir (eds), Living with native title: the experiences of registered native title corporations, AIATSIS, Canberra, pp.27-64", "authors": ["Pamela Faye McGrath"]}, {"title": "recent history of the professionalisation of Australian applied anthropology and its relevance to native title practice", "year": "2012", "source": "Australian Aboriginal Studies, vol. 1, no. 1, pp. 63-76", "authors": ["Pamela Faye McGrath"]}, {"title": "The past is everywhere: Ngaanyatjarra history paintings", "year": "2012", "source": "in John Carty & Tim Acker (ed.), Ngaanyatjarra: Art of the Lands, University of Western Australia Publishing, Crawley, pp. 209-213", "authors": ["Pamela Faye McGrath"]}, {"title": "nthropologies of Change: Select Proceedings of a Workshop for Native Title Anthropologists", "year": "2012", "source": "AIATSIS Research PublicationCanberra", "authors": ["Pamela Faye McGrath"]}, {"title": "Nyarapayi Giles", "year": "2012", "source": ". In AckerTim and John Carty (Eds.) Ngaanyatjarra Art of the Lands. Crawley, W.A: UWA Publishing, pp.24", "authors": ["Pamela Faye McGrath"]}, {"title": "Supporting a community of professional practice for native title anthropologists: Lessons from a short history of the professionalisation of Australian anthropology", "year": "2011", "source": ". AIATSISCanberra. http://aiatsis.gov.au/ntru/nativetitleconference/conf2011/papers/mcgrath.pdf", "authors": ["Pamela Faye McGrath"]}, {"title": "Their Darkest Hour: the films and photographs of William Grayden and the history of the \"Warburton Range controversy\" of 1957", "year": "2010", "source": "Aboriginal History, vol. 34, pp. 115-141", "authors": ["Pamela Faye McGrath", "Brooks D"]}]}, "Microsoft-Academic": [{"title": "their darkest hour the films and photographs of william grayden and the history of the warburton range controversy of 1957", "year": 2011, "source": "aboriginal history", "authors": [{"name": "pamela faye mcgrath"}, {"name": "david brooks"}], "id": 78712790}, {"title": "report on the preliminary findings of the 2018 global survey of anthropological practice how we move through the world how the world moves through us", "year": 2018, "source": "", "authors": [{"name": "pamela faye mcgrath", "affiliation": "australian national university"}, {"name": "greg acciaioli"}, {"name": "adele millard"}]}, {"title": "three weeks with strangers photography and the production of social identity during the 1935 board of anthropological research expedition to the warburton range western australia", "year": 2015, "source": "the australian journal of anthropology", "authors": [{"name": "pamela faye mcgrath", "affiliation": "australian national university"}], "id": 202606351}, {"title": "hard looking a historical ethnography of photographic encounters with aboriginal families in the ngaanyatjarra lands western australia", "year": 2010, "source": "", "authors": [{"name": "pamela faye mcgrath"}]}, {"title": "the fate of indigenous place based heritage in the era of native title", "year": 2016, "source": "", "authors": [{"name": "pamela faye mcgrath"}, {"name": "e lee"}]}, {"title": "managing information in native title mint survey and workshop report", "year": 2015, "source": "", "authors": [{"name": "pamela faye mcgrath"}, {"name": "ludger dinkler"}, {"name": "alexandra andriolo"}]}, {"title": "providing public access to native title records balancing the risks against the benefits", "year": 2019, "source": "", "authors": [{"name": "pamela faye mcgrath"}]}, {"title": "native title anthropology after the timber creek decision", "year": 2017, "source": "", "authors": [{"name": "pamela faye mcgrath"}]}, {"title": "native title from mabo to akiba a vehicle for change and empowerment book review", "year": 2016, "source": "aboriginal history", "authors": [{"name": "pamela faye mcgrath"}], "id": 78712790}, {"title": "the work of rights the nature of native title labour", "year": 2016, "source": "", "authors": [{"name": "pamela faye mcgrath"}]}], "ANDS-Grants": []}