{"ANU": {"name": "Patricia O'Brien", "link": "https://researchers.anu.edu.au/researchers/o-brien-pa", "colleges": "College of Arts and Social Sciences", "email": "Patricia.OBrien@anu.edu.au", "phone": "", "expertise": ["Pacific History Excl. New Zealand And Maori", "Maori History", "Aboriginal And Torres Strait Islander History", "Australian History Excl. Aboriginal And Torres Strait Islander History", "British History", "Culture Gender Sexuality", "Pacific Cultural Studies"], "interest": ["My research interests include indigenous resistance, colonial violence, power, gender and race.  My work is primarily focussed on Australia and the Pacific but extends further afield. My current ARC Future Fellowship project is concerned with the interwar colonial period, and the histories of League of Nations Mandated Territories within a long view of imperial histories from around the world. The impact of World War One on Pacific imperialism and reforged nationalisms in Australia and New Zealand after this event are some focal points of this study, as is the shifting landscape of ideas about race, gender and violence in this age of 'protective' colonialism. I explore the impact of these changed circumstances and ideas on indigenous peoples, especially in Australia, New Zealand, New Guinea and Samoa in a number of ways; first through a biography of the Samoan nationalist leader Ta'isi O. F. Nelson."], "biography": "I was awarded an Australian Research Council Future Fellowship at the Australian National University in 2013 for my project 'Colonialism, Violence and Resistance in the interwar Pacific: Australia, New Zealand, New Guinea, Samoa and beyond'.", "project": [], "publication": [{"title": "Empires and Indigenous Worlds: Violence and the Pacific Ocean, 1760 to 1930s", "year": "2020", "source": "in Louise Edwards, Nigel Penn & Jay Winter (ed.), The Cambridge World History of Violence - Volume 4: 1800 to the Present, Cambridge University Press, Cambridge, pp. 20-41", "authors": ["Patricia O'Brien"]}, {"title": "Decolonizing Pacific History and Writing Indigenous Biography Response", "year": "2019", "source": "The Journal of Pacific History, vol. 54, no. 2, pp. 278-281", "authors": ["Patricia O'Brien"]}, {"title": "League of Nations:\r\n\r\nHistories", "year": "2018", "source": "Legacies and Impact(Melbourne: Melbourne University Press)", "authors": ["Patricia O'Brien", "and Damousi J eds"]}, {"title": "", "year": "2017", "source": "200 Treasures of the Australian Museum (Sydney: Australian Museum Press)", "authors": ["Patricia O'Brien"]}, {"title": "Tautai: Samoa, World History and the Life of Ta", "year": "2017", "source": "isi O. F. Nelson (Honolulu: University of Hawai'i Press", "authors": ["Patricia O'Brien"]}, {"title": "Bridging the Pacific: Ta", "year": "2017", "source": "isi O.F. NelsonAustralia and the Samoan Mau', History Australia, vol. 14, no. 1, pp. 13-31pp", "authors": ["Patricia O'Brien"]}, {"title": "‘From Sudan to Samoa: Imperial Legacies", "year": "2015", "source": "Cultures and New Zealand’s Rule over the Mandated Territory of Western Samoa’New Zealand’s Empire, Katie Pickles and Catharine Coleborne eds. (Manchester: Manchester University Press).", "authors": ["Patricia O'Brien"]}, {"title": "The Anzacs in the Pacific-Myths in the Pacific", "year": "2015", "source": "Australian Journal of International Affairs, vol. Online", "authors": ["Patricia O'Brien"]}, {"title": "Ta", "year": "2014", "source": "isi O.F. Nelson and Sir Maui Pomare Samoans and Maori Reunited'Journal of Pacific History, vol. 49, no. 1, pp. 26-49", "authors": ["Patricia O'Brien"]}, {"title": "Gender", "year": "2014", "source": "in David Armitage and Alison Bashford (ed.), Pacific Histories: Ocean, Land, People, Palgrave Macmillan Ltd, Basingstoke, UK and New York, USA, pp. 282-305", "authors": ["Patricia O'Brien"]}, {"title": "Reactions to Australian Colonial Violence in New Guinea: The 1926 Nakanai Massacre in a Global Context", "year": "2012", "source": "Australian Historical Studies, vol. 43, no. 2, pp. 191-209", "authors": ["Patricia O'Brien"]}, {"title": "Glamour in the Pacific: Cultural Internationalism and Race Politics in the Women", "year": "2012", "source": "s Pan-Pacific'Journal of Women's History, vol. 24, no. 2, pp. 214-223", "authors": ["Patricia O'Brien"]}, {"title": "Centre-Periphery Relations and Borders in Western New Guinea", "year": "2011", "source": "in James Clad, Sean M. McDonald and Bruce Vaughn (ed.), The Borderlands of Southeast Asia: Geopolitics, Terrorism, and Globalization, National Defense University Press, Washington DC, pp. 211-233pp.", "authors": ["Patricia O'Brien", "Vaughn B"]}, {"title": "The Politics of Mines and Indigenous Rights: A Case Study of the Grasberg Mine in Indonesia", "year": "2010", "source": "s Papua Province'Georgetown Journal of International Affairs, vol. xi, no. 1, pp. 47-56", "authors": ["Patricia O'Brien"]}, {"title": "Remaking Australia", "year": "2009", "source": "s Colonial Culture?: White Australia and its Papuan Frontier 1901-1940'Australian Historical Studies, vol. 40, no. 1, pp. 96-112", "authors": ["Patricia O'Brien"]}]}, "Microsoft-Academic": [], "ANDS-Grants": [{"description": "Colonialism, violence and resistance in the interwar Pacific unveil fresh perspectives on how Australian and New Zealand settler violence was situated within the global dynamics of the 1920s and 1930s. This project illuminates unresolved tensions about the League of Nations mandate system and re-examines events that continue to cast a long and contested shadow over the present. It places these Pacific colonial histories, forged in the First World War, within the longer histories of violence and resistance with Australian Aboriginal People and Maori, highlighting critically important connections between these deputised British colonial powers and their colonies as well as overlooked Indigenous historical figures and methods of resistance.", "title": "Future Fellowships - Grant ID: FT130100697", "id": "517347", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/FT130100697", "researchers": ["Dr Patricia O'Brien"], "status": "closed", "fundingAmount": 689524, "fundingScheme": "Future Fellowships", "startDate": 2013, "endDate": 2017, "dateTimeModified": "2017-07-05T03:01:38Z", "dateTimeCreated": "2015-04-12T05:06:21Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/FT130100697", "identifiers": ["http://purl.org/au-research/grants/arc/FT130100697", "FT130100697"], "subjects": ["HISTORICAL STUDIES", "HISTORY AND ARCHAEOLOGY", "frontier violence", "indigenous resistance", "pacific colonialism"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517347"}]}]}