{"ANU": {"name": "Patrick Guinness", "link": "https://researchers.anu.edu.au/researchers/guinness-ph", "colleges": "College of Arts and Social Sciences", "email": "Patrick.Guinness@anu.edu.au", "phone": "", "expertise": ["Social And Cultural Anthropology", "Anthropology Of Development", "Religion And Religious Studies"], "interest": ["Participatory development, applied anthropology, urban anthropology, Southeast Asian societies, especially Indonesia and Malaysia, East African societies, religious change especially in Islam and Christianity, globalisation. social and economic changes in Papua New Guinea, service learning through fieldschools"], "biography": "Patrick Guinness came to anthropology as a consequence of working on a cattle station and indigenous community in North Queensland. After his undergraduate degree he undertook his first fieldwork in West New Britain, Papua New Guinea where he researched folklore for his master's degree and later worked with the local Airmen's Memorial Primary School and the Department of Agriculture, Stock and Fisheries. After an absence of three decades he again returned to West New Britain in 2009 to renew community and research interests, particularly the impact of oil palm industry on the indigenous people. His interest in Indonesia stemmed from a two year placement as an Australian Volunteer Abroad in 1970-2 at the Department of Anthropology at Universitas Indonesia in Jakarta, He taught anthropology there and conducted research among the indigenous Betawi communities being absorbed within a rapidly expanding city. Several years later he returned to Indonesia as a volunteer researcher at the Population Studies Institute in Gadjah Mada University in Yogyakarta where he coordinated a large research program on Transmigrasi resettlement programs in South Kalimantan and South Sulawesi and taught anthropology. In 1978-82 he undertook his PhD focusing on off-street and squatter communities within Yogyakarta city, and has returned many times since then to renew contacts and research change in these communities. Following the PhD he became Advisor at the Social Sciences Foundation at Airlangga University in Surabaya, Indonesia which focused on improving the research skills of academic staff in regional universities. He then spent two years on an aid project in Tanzania, coordinating community data collection and consultation for a District water provision program before returning to Canberra to work in the Evaluations section of the Australian Development Assistance Bureau. In 1986 he returned to the ANU as a Research Fellow with the Industrialisation Project focusing on the impact of industrialisation in two rural districts of East Java and the southern state of Johor, Malaysia. He returned to academic teaching as a Lecturer and Senior Lecturer at La Trobe University 1990-1993 and then as a Lecturer, Senior lecturer and Reader at the ANU from 1994. During that time he has continued his research in Malaysia, Indonesia and Papua New Guinea.", "project": ["Current Research Projects My most recent book entitled Kampung, Islam and State in Urban Java, examines state discourses of urban community and development and the local constructions of community in conjunction with and independently of these state discourses and policies. This book examines the changes in urban low-income settlements over the last thirty years under the New Order and Reformasi eras of central government.", "Since 2009 I have been conducting a fieldschool in Indonesia, first in the kampung of Yogyakarta and then and then in mountain villages west of Yogyakarta city, with an emphasis on livelihoods, land accessibility and cash cropping. This has led to an edited book on the village and several articles on the place of service learning and research-based learning through fieldschools in development training In 2013-4 the fieldschool, run in cooperation with Duta Wacana University in Yogyakarta, was located in the North Maluku in affiliation with the District Government and in 2015-6 it was held on the islands of Rote and Sumba in Eastern Indonesia.", "Since 2008 I have returned to an earlier research site in West New Britain, Papua New Guinea among Maututu Nakanai villagers and migrant oil palm settlers, focusing on land conflicts, oil palm production and religious revival in a rapidly changing society and environment."], "publication": [{"title": "Land and housing security for the urban poor", "year": "2016", "source": "in John F. McCarthy and Kathryn Robinson (ed.), Land & Development in Indonesia, ISEAS Publishing, Singapore, pp. 206-224pp", "authors": ["Patrick Guinness"]}, {"title": "Dwindling Space and Expanding Worlds for Youth in Rural and Urban Yogyakarta", "year": "2016", "source": "in Kathryn Robinson (ed.), Youth Identities and Social Transformations in Modern Indonesia, Brill, Leiden/Boston, pp. 134-155pp", "authors": ["Patrick Guinness"]}, {"title": "The Development Squeeze: Cash Crops, Land", "year": "2015", "source": "s End and Alternate Pathways'Asia Pacific Journal of Anthropology, vol. 16, no. 4, pp. 424 - 429", "authors": ["Patrick Guinness"]}, {"title": "Religion, Community and Conflict in Indonesia: Reflections on Chris Duncan", "year": "2015", "source": "s Violence and Vengeance'The Asia Pacific Journal of Anthropology, vol. 16, no. 1, pp. 74-83", "authors": ["Patrick Guinness"]}, {"title": "griculture Empowerment and Tourism Potentials in Banjaroya Village Kulon Progo", "year": "2014", "source": "International Service LearningYogyakarta", "authors": ["Bawole P", "Patrick Guinness", "eds"]}, {"title": "Is research-led learning serviceable? University Field School and Government Development Programs", "year": "2014", "source": "in Paulus Bawole, Patrick Guinnes (ed.), Agriculture Empowerment and Tourism Potentials in Banjaroya Village Kulon Progo, International Service Learning, Yogyakarta, pp. 25-44", "authors": ["Patrick Guinness"]}, {"title": "Research-Based Learning: Teaching Development Through Fieldschools", "year": "2012", "source": "Journal of Geography in Higher Education, vol. 36, no. 3, pp. 329-339", "authors": ["Patrick Guinness"]}, {"title": "Research based learning: an Indonesian field school experience", "year": "2011", "source": "in Bawole, P. and Guinness, P. (ed.), Strengthening the Environmental Quality of Urban Kampung, Duta Wacana University Press, Yogyakarta Indonesia, pp. 13-23", "authors": ["Patrick Guinness"]}, {"title": "Service Learning as a basic strategy to learn local wisdom in low income settlements", "year": "2011", "source": "Duta Wacana University PressYogyakarta Indonesia", "authors": ["Bawole P", "Patrick Guinness", "eds"]}, {"title": "The Kampung Fieldschool: Multi-disciplinary and Cross-cultural Research", "year": "2009", "source": "in Ing Ir Paulus Bawole (ed.), Proceedings of the Workshop and International Conference Experiencing The Dynamics of Kampung Life, Duta Wacana University Press, Yogyakarta Indonesia, pp. 2-6", "authors": ["Patrick Guinness"]}, {"title": "Rukun Kampong and Kenduren: is Kampong Solidarity Declining?", "year": "2009", "source": "in Ing Ir Paulus Bawole (ed.), Proceedings of the Workshop and International Conference Experiencing The Dynamics of Kampung Life, Duta Wacana University Press, Yogyakarta Indonesia, pp. 78-86", "authors": ["Patrick Guinness"]}, {"title": "Kampung", "year": "2009", "source": "Islam and State in Urban JavaNUS Press - National University of Singapore, Singapore", "authors": ["Patrick Guinness"]}, {"title": "Spirituality on Campus", "year": "2005", "source": "ANU Chaplaincy", "authors": ["Patrick Guinness"]}, {"title": "Indigenous Culture and Culture of Violence", "year": "2004", "source": "Kampung, vol. 1, no. 1, pp. 95-115", "authors": ["Patrick Guinness"]}, {"title": "Reflections from Yogya: Portraits of Indonesian Social Life", "year": "2003", "source": "Galang PressYogyakarta", "authors": ["Singarimbun M", "Patrick Guinness", "Suyenaga J"]}, {"title": "Contested imaginings of the city: City as locus of status, capitalist accumulation, and community: Competing cultures of Southeast Asian societies", "year": "2000", "source": "in Bridge, G.; Watson, S. (ed.), A Companion to the City, Blackwell Publishing Ltd, Oxford, pp. 87-98", "authors": ["Patrick Guinness"]}, {"title": "Local community and the state", "year": "1999", "source": "The Asia Pacific Journal of Anthropology, vol. 22, no. 1, pp. 88-110", "authors": ["Patrick Guinness"]}]}, "Microsoft-Academic": [{"title": "research based learning teaching development through fieldschools", "year": 2012, "source": "journal of geography in higher education", "authors": [{"name": "patrick guinness", "affiliation": "australian national university"}], "id": 203620496}, {"title": "kampung islam and state in urban java", "year": 2009, "source": "", "authors": [{"name": "patrick guinness"}]}, {"title": "managing risk in uncertain times", "year": 2020, "source": "ethnos", "authors": [{"name": "patrick guinness", "affiliation": "australian national university"}], "id": 43131466}, {"title": "indonesian migrants in johor an itinerant labour force", "year": 1990, "source": "bulletin of indonesian economic studies", "authors": [{"name": "patrick guinness", "affiliation": "la trobe university"}], "id": 203364070}, {"title": "harmony and hierarchy in a javanese kampung", "year": 1986, "source": "", "authors": [{"name": "patrick guinness"}]}, {"title": "getting by class and state formation among chinese in malaysia", "year": 2017, "source": "asia pacific journal of anthropology", "authors": [{"name": "patrick guinness", "affiliation": "australian national university"}], "id": 191816521}, {"title": "the development squeeze cash crops land s end and alternate pathways", "year": 2015, "source": "asia pacific journal of anthropology", "authors": [{"name": "patrick guinness", "affiliation": "australian national university"}], "id": 191816521}, {"title": "on the margin of capitalism people and development in mukim plentong johor malaysia", "year": 1992, "source": "", "authors": [{"name": "patrick guinness"}]}, {"title": "the unbounded space and moral transgression capitalist expansion in west new britain", "year": 2018, "source": "anthropological forum", "authors": [{"name": "patrick guinness"}], "id": 92835259}, {"title": "understanding witchcraft and sorcery in southeast asia", "year": 1994, "source": "the journal of asian studies", "authors": [{"name": "patrick guinness"}, {"name": "c w watson"}, {"name": "roy f ellen"}], "id": 114691300}], "ANDS-Grants": []}