{"ANU": {"name": "Patrick  De Deckker", "link": "https://researchers.anu.edu.au/researchers/de-deckker-p", "colleges": "College of Science", "email": "Patrick.Dedeckker@anu.edu.au", "phone": "", "expertise": ["Palaeoecology", "Surface Processes", "Palaeontology Incl. Palynology", "Quaternary Environments", "Biological Oceanography", "Palaeoclimatology", "Atmospheric Aerosols", "Inorganic Geochemistry", "Geomorphology And Regolith And Landscape Evolution", "Marine Geoscience", "Isotope Geochemistry", "Oceanography", "Physical Geography And Environmental Geoscience", "Geochemistry"], "interest": [], "biography": "Brady Medal awarded by The Micropalaeontological Society: November 2019 for major influence on micropalaeontology via a substantial body of excellent research.", "project": ["Understanding the origin and composition of Australian dust has implications on the environment, ocean and human health. However, there is scant published information on the chemical and biological composition of airborne dust from the Australian continent. For example, an isotopic comparison of aeolian material from the southern continents with dust recovered in Antarctic ice cores listed only 5 samples for the entire Australian continent, and consequently argued for a Patagonian source during glacial periods for dust recovered at Vostok and EPICA Dome C. We now have published a paper further demonstrating the link between dust recovered in Antarctic ice cores and dust sources in the Murray Darling Basin [De Deckker, P., Norman, M., Goodwin, I. D., Wain, A., Gingele , F.X. 2010. Lead isotopic evidence for an Australian source of aeolian dust to Antarctica at times over the last 170,000 years, Palaeogeography, Palaeoclimatology, Palaeoecology 285, 205-223.]", "Thus far, we have undertaken an intensive, multidisciplinary and collaborative analysis of dust from the October 22, 2002 \"Canberra dust storm\" event [see McTainsh et al. Atmospheric Environment 39, 1227-1236 (2005) for a description of the event]. Interestingly, DNA from 75 different microbial species was extracted from the dust by Drs R. Abed and D. de Beer from the Max-Planck Institute of Marine Microbiology in Bremen, and a great variety of organic compounds were also found by Dr E. Schefuss and Prof. Kai-Uwe Hinrichs from the University of Bremen. Dr J.-B. Stuut, from the same institution, studied the sedimentological aspect of the dust. Using a variety of geochemical and palynological [by Dr S. van der Kaars of Monash] 'fingerprinting' analyses, including investigations of Nd and Sr isotopes [made by Dr M. Norman from the Research School of Earth Sciences at ANU] linked the dust that rained down in Canberra to the Bourke area of western NSW. Investigation of the meteorological events at this time by Prof. N. Tapper and Dr T. O'Loingsigh, both from Monash, corroborated with these results. Our results were published in G-3 [De Deckker, P., Abed, R. M. M., de Beer, D., Hinrichs, K., O'Loingsigh, T., Schefuß, E., Stuut, J. W., Tapper, N. J., van der Kaars, s. 2008, Geochemical and microbiological fingerprinting of airborne dust that fell in Canberra, Australia, in October 2002, Geochem Geophys. Geosyst., 9, Q12Q10, doi:10.1029/2008GC002091]. Current investigatiosn concern the analysis of samples collected during the large dust storms that affected a large part of eastern Australia in September 2009.", "Finally, preliminary investigations by Dr G. Allison, Mr C. Munday and Mr D. Stephenson [from the ANU Medical School] of the microbiological communities isolated from aerosols pumped at sea offshore Australia has commenced and the results are being prepared for publication.", "For further details on our work on the Canberra dust event, visit the following web site: http://www.anu.edu.au/CSEM/newsletters/2006/MMAug06.pdf", "We successfully completed the mapping of the some of the deep-sea canyons that was commenced during the AUSTREA and AUSCAN cruises on the L'Atalante and Marion Dufresne vessels in 1999/2001 and 2003 respectively [see other report entitled 'Deep-sea Canyons']. As a result, we now have a high-resolution map of the Sprigg Canyon. We have identified that some of the conduits [channels] in several of the canyons are definitely transporting upper slope material down to the abyss.", "We found, by attempting to core the large, deep holes located at great depths [> 4.5km] below the canyons that they are not sites of substantial sedimentation. In addition, we did not find any hydrochemical anomaly that could have been generated by fluid/gas emission, although we did not manage to rest the CTD equipment on the floor of the holes.  In addition, we located the position of ancient courses of the Murray across the Lacepede Shelf and discovered the presence of an extensive estuary that would have been dammed by outcrops and possibly a large dune field.   We traced the ancient courses of the River Murray for the last glacial-interglacial period, with one possible exception that may go as far as the mid-Pleistocene. No evidence was found for much older geomorphic features, assuming either that they were eroded away or that the sub-bottom profiling equipment did not permit us to penetrate deeper into the sedimentary sequences. However, in most cases, recognised fluvial features did sit directly on the basement.", "We obtained good CTD data down to great depths [>5,000m] in the canyons [perhaps the deepest CTD obtained with the Southern Surveyor] and these will prove very useful for future research on deep water. In conclusion, we have a better understanding of the nature of the deep-sea canyons offshore Kangaroo Island. These sites are likely to be visited by cetaceans and will be of use to future biological surveys in the region. We have found ancient lacustrine deposits that have the potential, if cored, to provide information on past climatic regimes that affected Australia during a very wet period coinciding with the filling of the Willandra Lakes [e.g. Mungo] and the extensive river flows registered in the Murray Darling Basin. We have mapped possible ancient courses of the ancestral River Murray offshore Portland and discovered significant undersea slides that potentially could cause tsunamis.", "We have commenced a program of filtering air at sea to determine the nature of aerosols and identify their microbiological contents. For further details, visit http://www.marine.csiro.au/nationalfacility/voyagedocs/2006/SUM_SS02-2006a.pdf, http://www.marine.csiro.au/nationalfacility/voyagedocs/documents/TRAN-SST02-2007.pdf", "", "The University of the Sea is a partnership between the Intergovernmental Oceanographic Commission of UNESCO, the Australian National University, the University of Sydney, the University of New South Wales, the University of Technology Sydney, the University of Tokyo, the Korean Ocean Research and Development Institute, Tongji University China, the Partnership for Observation of the Global Oceans Canada, the National Institute of Oceanography Goa, and the Indonesian Research Centre for Marine Technology. Together these institutions make up the Asian Neighbours Global Change Network, whose secretariat is located at the University of Sydney.  The University of the Sea programme was funded by grants from the Toyota Foundation in Japan, the Australian Earth Systems Science Network (through the ARC), and the Asia Pacific Network for Global Change Research. The programme is made possible by the support of the French Polar Institute (IPEV) who host the University of the Sea onboard their research vessel the Marion Dufresne. The University of the Sea is dedicated to building marine science capacity in the Asia Pacific region. It aims to bring together senior researchers and young local scholars to address marine science issues of direct interest to the region. The programme endeavours to give these students the opportunity to gain the skills and knowledge required for participation in the global debate on the use of the ocean. The first University of the Sea training program took place in the Coral Sea - Arafura Sea region onboard the French research vessel Marion Dufresne between June 24 and July 8, 2005. The ship sailed from Port Moresby (PNG) to Darwin (Australia).  During this two-week period, twenty students representing ten countries [Australia, P.R. China, East Timor, Indonesia, Japan, Malaysia, New Zealand, Papua New Guinea, the Philippines and Sri Lanka] got \"hands on\" practical experience in both marine data collection and marine research problem solving. The students were under the supervision of Professor Patrick De Deckker (Australian National University) and Assoc. Professor Jock Keene (The University of Sydney). The second University of the Sea training program took part in 2006 with the cruise departing from Auckland on February 7 and went via Noumea, to finish in Sydney on February 26. The shipboard programme was supervised by Drs Jock Keene and Julie Dickinson from the University of Sydney, Dr Greg Skilbeck from the University of Technology Sydney, and Professor Patrick De Deckker from the Australian National University. The University of the Sea students joined a research program developed by marine geoscientists from Geoscience Australia. It was part of their 'Lord Howe Rise Project' to evaluate the gas hydrates ('frozen' methane) in the sediments.  Geoscience Australia's survey was primarily involved in the collection of six giant CALYPSO piston cores over areas of possible gas hydrate (bottom simulating reflectors, BSRs) on the northern Lord Howe Rise. In addition to the coring program, swath, sub-bottom profiler, gravity and magnetometer data were collected on transits to and from the sampling sites. These data provided detailed information on the bathymetry and structure of the seafloor and underlying geology, particularly of the continental margin of central and northern New South Wales and of the eastern flank of the Lord Howe Rise. Also, a small number of dredge hauls were taken during the swath mapping on the eastern flank of the Rise. For further details, visit the following site describing the 2 cruises held so far in 2005 and 2006. http://uos.anu.edu.au/2006.html", "", "FOR MORE INFORMATION CHECK MY WEB SITE AT RSES THAT INCLUDES IMAGES AND POWER POINTS: http://rses.anu.edu.au/people/dedeckker_p/"], "publication": [{"title": "irborne dust traffic from Australia in modern and Late Quaternary times", "year": "2020", "source": "Global and Planetary Change, vol. 184, pp. 1-19", "authors": ["Patrick  De Deckker"]}, {"title": "Reply to: Sources of C30 steroid biomarkers in NeoproterozoicCambrian rocks and oils", "year": "2020", "source": "Nature Ecology & Evolution, vol. 4, no. 1, pp. 37-39", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "From \"source to sink\" A new perspective on the past dynamics of the Murray Canyon Group from benthic foraminiferal communities", "year": "2020", "source": "Marine Micropaleontology, vol. 160, pp. 1-19", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "n evaluation of Australia as a major source of dust", "year": "2019", "source": "Earth-Science Reviews, vol. 194, pp. 536-567", "authors": ["Patrick  De Deckker"]}, {"title": "Groundwater interactions control dolomite and magnesite precipitation in saline playas in the Western District Volcanic Plains of Victoria, Australia", "year": "2019", "source": "Sedimentary Geology, vol. 380, pp. 105-126", "authors": ["Patrick  De Deckker"]}, {"title": "Land-sea correlations in the Australian region: 460 ka of changes recorded in a deep-sea core offshore Tasmania. Part 2: the marine compared with the terrestrial record", "year": "2019", "source": "Australian Journal of Earth Sciences, vol. 66, no. 1, pp. 17-36pp and supplement 7pp", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "On the long-ignored scientific achievements of the Belgica expedition 1897-1899", "year": "2018", "source": "Polar Research, vol. 37, no. 1, pp. 1-8pp", "authors": ["Patrick  De Deckker"]}, {"title": "Heat export from the tropics drives mid to late Holocene palaeoceanographic changes offshore southern Australia", "year": "2018", "source": "Quaternary Science Reviews, vol. 180, pp. 96-110pp", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Cyprideis torosa: a model organism for the Ostracoda?", "year": "2017", "source": "Journal of Micropalaeontology, vol. 36, no. 1, pp. 3-6pp", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The contribution of Richard M. Forester to the knowledge of the paleohydrologic and paleoclimatic significance of Cenozoic non-marine Ostracoda: An introduction to the Richard M. Forester memorial issue", "year": "2017", "source": "Hydrobiologia, 786: 1-4", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Trace-element and stable-isotope composition of the Cyprideis torosa (Crustacea, Ostracoda) shell", "year": "2017", "source": "Journal of Micropalaeontology, vol. 36, no. 1, pp. 38-49pp", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The Indo-Pacific Warm Pool: critical to world oceanography and world climate", "year": "2016", "source": "Geoscience Letters (2016) 3:20, DOI 10.1186/s40562-016-0054-", "authors": ["Patrick  De Deckker"]}, {"title": "Trace elemental distribution in ostracod valves. From solution ICPMS and laser ablation ICPMS to microprobe mapping: a tribute to Rick Forester", "year": "2015", "source": "Hydrobiologia, DOI 10.1007/s10750-015-2534-", "authors": ["Patrick  De Deckker"]}, {"title": "Combining the Mg/Ca of the ostracod Cyprideis torosa with its ontogenic development for reconstructing a 28 kyr temperature record for Lake Banyoles (NE Spain)", "year": "2016", "source": "Journal of Micropalaeontology doi:10.1144/jmpaleo2015-00", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Land-sea correlations in the Australian region: Post-glacial onset of the monsoon in northwestern Western Australia", "year": "2015", "source": "Quaternary Science Reviews, vol. 105, pp. 181-194", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Present-day sedimentation rates on the southern and southeastern Australian continental margins", "year": "2015", "source": "Australian Journal of Earth Sciences, vol. 62, no. 2, pp. 143-150", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Sea-surface temperature reconstruction from trace elements variations of tropical coralline red algae", "year": "2014", "source": "Quaternary Science Reviews, vol. 93, pp. 34-46", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Characterisation of the major dust storm that traversed over eastern Australia in September 2009; a multidisciplinary approach", "year": "2014", "source": "Aeolian Research, vol. 15, pp. 133-149", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "ka record of aeolian activity near North West Cape, Australia: inferences from grain-size distributions and bulk chemistry of SE Indian Ocean deep-sea sediments", "year": "2014", "source": "Quaternary Science Reviews, vol. 83, pp. 83-94", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Cross-continent comparison of high-resolution Holocene climate records from southern Australia - Deciphering the impacts of far-field teleconnections", "year": "2013", "source": "Earth-Science Reviews, vol. 121, pp. 55-72", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Extraordinary morphological changes in valve morphology during the ontogeny of several species of the Australian ostracod genus Bennelongia (Crustacea, Ostracoda)", "year": "2013", "source": "European Journal of Taxonomy, vol. 36, pp. 1-37", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Extraordinary morphological changes in valve morphology during the ontogeny of several species of the Australian ostracod genus Bennelongia (Crustacea, Ostracoda)", "year": "2013", "source": "European Journal of Taxonomy  36pp. 1-37", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Recent benthic foraminifera from Twofold Bay, Eden NSW: Community structure, biotopes and distribution controls", "year": "2013", "source": "Australian Journal of Earth Sciences, vol. 60, no. 4, pp. 475-496", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "ves", "year": "Ree", "source": "Jessica M.Helen C. Bostock, Linda K. Ayliffe, Timothy T. Barrows, Patrick De Deckker, Laurent S. Devriendt, Gavin B. Dunbar, Russell N. Drysdale, Kathryn E. Fitzsimmons, Michael K. Gagan, Michael L. Griffiths, Simon G. Haberle, John D. Jansenk, Claire Krause, Stephen Lewis, Helen V. McGregor, Scott D. Mooney, Patrick Moss, Gerald C. Nanson, Anthony Purcell, Sander van der Kaars. “Palaeoenvironmental change in tropical Australasia over the last 30,000 years – A synthesis by the OZ-INTIMATE group”. Quaternary Science Reviews, v.74, pp 9", "authors": ["Patrick  De Deckker"]}, {"title": "Comparison of U37K", "year": "2013", "source": "TEX86H and LDI temperature proxies for reconstruction of south-east Australian ocean temperatures', Organic Geochemistry, vol. 64, pp. 94-104", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The Chemical Composition of Ostracod Shells. Applications in Quaternary Palaeoclimatology", "year": "2012", "source": "Developments in Quaternary Science, vol. 17, pp. 131-143", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Influence of the tropics and southern westerlies on glacial interhemispheric asymmetry", "year": "2012", "source": "Nature Geoscience, vol. 5, no. 4, pp. 266-269", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The Chemical Composition of Ostracod Shells: Applications in Quaternary Palaeoclimatology", "year": "2012", "source": ". Developments in Quaternary Science. v. 17http://dx.doi.org/10.1016/B978-0-444-53636-5.00008-1", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Environmental reconstructions of the upper 500 m of the southern Indian Ocean over the last 40 ka using Radiolarian (Protista) proxies", "year": "2011", "source": "Quaternary Science Reviews, vol. 30, no. 7-8, pp. 876-886", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Late Quaternary palaeohydrological changes in the large playa Lake Frome in central Australia, recorded from the Mg/Ca and Sr/Ca in ostracod valves and biotic remains", "year": "2011", "source": "Journal of Arid Environments, vol. 75, no. 1, pp. 38-50", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "re the Murray Canyons offshore southern Australia still active for sediment transport?", "year": "2010", "source": "Geological Society of London Special Publication, vol. 346, pp. 43-55", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Re-evaluation of the composition of sediments from the Murray Darling Basin of Australia as a Potential Source Area for airborne dust to EPICA Dome C in Antarctica. Reply to Comment on \"Lead isotopic evidence for an Australian source of aeolian dust to Ant", "year": "2010", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 298, no. 3-4, pp. 437-442", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "years of environmental changes recorded in Blue Lake, South Australia, based on ostracod ecology and valve chemistry", "year": "2010", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 297, no. 1, pp. 223-237", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "lkalinity control on the partition coefficients in lacustrine ostracodes from Australia", "year": "2010", "source": "Geology, vol. 38, no. 4, pp. 359-362", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Inter-hemispheric asymmetry in the early Pleistocene Pacific warm pool", "year": "2010", "source": "Geophysical Research Letters, vol. 37, no. 11, L11601, doi:10.1029/2010GL04319", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Lead isotopic evidence for an Australian source of aeolian dust to Antarctica at times over the last 1700,000 years", "year": "2010", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 285, no. 3-4, pp. 205-223", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Carbon and oxygen isotope geochemistry of live (stained) benthic foraminifera from the Aleutian Margin and the Southern Australian Margin", "year": "2009", "source": "Marine Micropaleontology, vol. 70, pp. 89-101", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Holocene climate variability in the Southern Ocean recorded in a deep-sea sediment core off South Australia", "year": "2009", "source": "Quaternary Science Reviews, vol. 28, pp. 1932-1940", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Micropalaeontological evidence for Late Quaternary sea-level changes in Bonaparte Gulf, Australia", "year": "2009", "source": "Global and Planetary Change, vol. 66, pp. 85-92", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Middle-late Pleistocene deep water circulation in the southwest subtropical Pacific", "year": "2009", "source": "Paleoceanography, vol. 24, no. PA4205, p. 16", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Surface and subsurface seawater temperature reconstruction using Mg/Ca microanalysis of planktonic foraminifera Globigerinoides ruber, Globigerinoides sacculifer, and Pulleniatina obliquiloculata", "year": "2009", "source": "Paleoceanography, vol. 24, no. PA3201, p. 17", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "ncestral Murray River on the Lacepede Shelf, southern Australia: Late Quaternary migrations of a major river outlet and strandline development", "year": "2009", "source": "Australian Journal of Earth Sciences, vol. 56, no. 2, pp. 135-157", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Defining the Geochemical composition of the EPICA Dome C ice core dust during the last glacial-interglacial cycle", "year": "2008", "source": "Geochemistry, Geophysics, Geosystems, vol. 9, no. 10, p. 11", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Geochemical and microbiological fingerprinting of airborne dust that fell in Canberra, Australia, in October 2002", "year": "2008", "source": "Geochemistry, Geophysics, Geosystems, vol. 9, no. Number 12 24 december 2008, p. 22", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Response to Comment on \"Absence of Cooling in New Zealand and the Adjacent Ocean During the Younger Dryas Chronozone\"", "year": "2008", "source": "Science, vol. 320, no. 5877, pp. 746d", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Uncertainties in seawater thermometry deriving from intratest and interest Mg/Ca variability in Globigerinoides ruber.", "year": "2008", "source": "Paleoceanography, vol. 23, no. 1, p. 12", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "year record of changes in the eastern Indian Ocean offshore Sumatra", "year": "2008", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 265, no. 2008, pp. 195-213", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Long-term sea surface temperature and climate change in the Australian-New Zealand region", "year": "2007", "source": "Paleoceanography, vol. 22, no. 2, pp. 1-17", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "bsence of Cooling in New Zealand and the Adjacent Ocean During the Younger Dryas Chronozone", "year": "2007", "source": "Science, vol. 318, pp. 86-89", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The Late Quaternary evolution of water masses in the eastern Indian Ocean between Australia and Indonesia, based on benthic foraminifera faunal and carbon isotopes analyses", "year": "2007", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 247, no. 3-4, pp. 382-401", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Radiolaria as a reflection of environmental conditions in the eastern and southern sectors of the Indian Ocean: A new statistical approach", "year": "2007", "source": "Marine Micropaleontology, vol. 65, pp. 137-162", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Groundwater Ostracods from the arid Pilbara region of northwestern Australia: distribution and water chemistry", "year": "2007", "source": "Hydrobiologia, vol. 585, pp. 99-118", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Palaeoenvironmental change in the Gulf of Carpentaria (Australia) since the last interglacial based on Ostracoda", "year": "2007", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 246, no. 2-4, pp. 163-187", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "ntarctic deglacial pattern in a 30 kyr record of sea surface temperature offshore South Australia", "year": "2007", "source": "Geophysical Research Letters, vol. 34, no. 13, pp. 1-6", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Long records of climate in southern Australasia", "year": "2007", "source": "PAGES (Post Global Changes)", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "South Tasman Sea alkenone palaeothermometry over the last four glacial/interglacial cycles", "year": "2006", "source": "Marine Geology, vol. 230, pp. 73-86", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Germanium incorporation into sponge spicules: Development of a proxy for reconstructing inorganic germanium and silicon concentrations in seawater", "year": "2006", "source": "Earth and Planetary Science Letters, vol. 243, pp. 749-759", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Germanium incorporation into sponge spicules: Development of a proxy for reconstructing inorganic germanium and silicon concentrations in seawater", "year": "2006", "source": "Earth and Planetary Science Letters, vol. 243, pp. 749-759", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "year record of annual and seasonal rainfall and temperature for northwestern Australia based on a pollen record obtained offshore", "year": "2006", "source": "Journal of Quaternary Science, vol. 21, no. 8, pp. 879-889", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Conservation and management of Australia", "year": "2005", "source": "s Water Resources: 20/20 Vision or Blind Faith'Hydrobiologia, vol. 552", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Preface: Conservation and Management of Australia", "year": "2005", "source": "s Water Resources: 20/20 Vision or Blind Faith. A tribute to the late Bill Williams'Hydrobiologia, vol. 552", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Late Quaternary fluctuations of palaeoproductivity in the Murray Canyons area, South Australian continental margin", "year": "2005", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 220, pp. 361-373", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Characterization of Mg/Ca distributions in planktonic foraminifera species by electron microprobe mapping", "year": "2005", "source": "Geochemistry, Geophysics, Geosystems, vol. 6, no. 12, pp. 1-14", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Clay mineral, geochemical and Sr-Nd isotopic fingerprinting of sediments in the Murray-Darling fluvial system, southeast Australia", "year": "2005", "source": "Australian Journal of Earth Sciences, vol. 52, pp. 965-974", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Geomorphology and evolution of the gigantic Murray canyons on the Australian southern margin", "year": "2005", "source": "Australian Journal of Earth Sciences, vol. 52, pp. 117-136", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The distribution of deep-sea benthic foraminifera in core tops from the eastern Indian Ocean", "year": "2005", "source": "Marine Micropaleontology, vol. 56, pp. 25-49", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Palaeoceanography of the Banda Sea, and Late Pleistocene initiation of the Northwest Monsoon", "year": "2005", "source": "Global and Planetary Change, vol. 49, pp. 28-46", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Preface: a tribute to Bill Williams and his contribution to limnology", "year": "2005", "source": "Hydrobiologia, vol. 552, pp. vii-x", "authors": ["Patrick  De Deckker"]}, {"title": "Optical Dating of Deep-Sea Sediments using Single Grains of Quartz: a Comparison with Radiocarbon", "year": "2004", "source": "Sedimentary Geology, vol. 169, pp. 175-189", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Modulation and daily banding of Mg/Ca Orbulina universa tests by symbiont photosynthesis and respiration: a complication for seawater thermometry?", "year": "2004", "source": "Earth and Planetary Science Letters, vol. 225, pp. 411-419", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Fingerprinting Australia", "year": "2004", "source": "s rivers with clay minerals and the application for the marine record of climate change'Australian Journal of Earth Sciences, vol. 51, pp. 339-348", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Dust-induced changes in phytoplankton composition in the Tasman Sea during the last four glacial cycles", "year": "2004", "source": "Paleoceanography, vol. 19, no. PA2020, pp. 1-10", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "taxonomic and distributional survey of marine benthonic Ostracoda off Kerguelen and Heard Islands, South Indian Ocean", "year": "2004", "source": "Journal of Micropalaeontology, vol. 23, pp. 15-38", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "On the celestite-secreting Acantharia and their effect on seawater strontium to calcium ratios", "year": "2004", "source": "Hydrobiologia, vol. 517, pp. 1-13", "authors": ["Patrick  De Deckker"]}, {"title": "Late Quaternary terrigenous sediments from the Murray Canyons area, offshore South Australia and their implications for sea level change, palaeoclimate and palaeodrainage of the Murray-Darling Basin", "year": "2004", "source": "Marine Geology, vol. 212, pp. 183-197", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "On a new terrestrial genus and species of Scottiinae (Crustacea, Ostracoda) from Australia, with a discussion on the phylogeny and the zoogeography of the subfamily", "year": "2004", "source": "Zoologischer Anzeiger, vol. 243, pp. 21-36", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Reply to Sea-level observations around the Last Glacial Maximum from the Bonaparte Gulf, NW Australia by I Shennan and G Milne", "year": "2003", "source": "Quaternary Science Reviews, vol. 22, no. 14, pp. 1549-1550", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Chemical diversity in south-eastern Australian saline lakes II: biotic implications", "year": "2003", "source": "Marine and Freshwater Research, vol. 54, pp. 895-912", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Pollen distribution in marine surface sediments offshore Western Australia", "year": "2003", "source": "Review of Palaeobotany and Palynology, vol. 124, pp. 113-129", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Ostracodes and their shell chemistry: Implications for Paleohydrologic and Paleoclimatologic Applications", "year": "2003", "source": "The Paleontological Society. Papers, vol. 9, pp. 119-151", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "modern analogue for tectonic, eustatic, and climatic processes in cratonic basins: Gulf of Carpentaria, Northern Australia", "year": "2003", "source": "in C B Cecil and N T Edgar (ed.), Climate controls on stratigraphy, Society for Sedimentary Geology, Reston, VA, pp. 193-205", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Marine Isotopic Stage 5e in the Southwest Pacific: Similarities with Antarctica and ENSO inferences", "year": "2003", "source": "Geophysical Research Letters, vol. 30, no. 23, pp. CLM2 1-5", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Mg/Ca variation in planktonic foraminifera tests: implications for reconstructing palaeo-seawater temperature and habitat migration", "year": "2003", "source": "Earth and Planetary Science Letters, vol. 212, pp. 291-306", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Saline playa-groundwater interactions in the western district of Victoria", "year": "2003", "source": "CRC LEME Regional Regolith Symposia 2003, ed. Ian C Roach, CRC LEME, Australia, pp. 91-94", "authors": ["Patrick  De Deckker"]}, {"title": "Fingerprinting Australia", "year": "2003", "source": "s rivers using clays and the application for the marine record of rapid climate change'CRC LEME Regional Regolith Symposia 2003, ed. Ian C Roach, CRC LEME, Australia, pp. 140-143", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Holocene record of allochthonous, aeolian mineral grains in an Australian alpine lake; implications for the history of climate change in southeastern Australia", "year": "2002", "source": "Journal of Paleolimnology, vol. 27, pp. 207-219", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Late Quaternary pollen record from deep-sea core Fr10/95, GC17 offshore Cape Range Peninsula, northwestern Western Australia", "year": "2002", "source": "Review of Palaeobotany and Palynology, vol. 120, pp. 17-39", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "The Extent of the Western Pacific Warm pool (WPWP) into the Eastern Indian Ocean during the Last Glacial Maximum", "year": "2002", "source": "in Chen-Tung Arthur Chen (ed.), Marine Environment: The Past, Present and Future, The Fuwen Press, Kaohsiung, Taiwan, pp. 9-14", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Oxygen-isotope Systematics of the Nektic Ostracod Australocypris robusta", "year": "2002", "source": "in Jonathan A Holmes and Allan R Chivas (ed.), The Ostracoda: Applications in Quaternary Research, American Geophysical Union, Washington, DC, pp. 301-313", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Sea Level Changes in Southeast Asia over the Last 150,000 years. Implications for geographical settings and oceanic currents", "year": "2002", "source": "in Chen-Tung Arthur Chen (ed.), Marine Environment: The Past, Present and Future, The Fuwen Press, Kaohsiung, Taiwan, pp. 76-78", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Ostracod Palaeoecology", "year": "2002", "source": "in Jonathan A Holmes and Allan R Chivas (ed.), The Ostracoda: Applications in Quaternary Research, American Geophysical Union, Washington, DC, pp. 121-133", "authors": ["Patrick  De Deckker"]}, {"title": "The status of the Indo-Pacific Warm Pool and adjacent land at the Last Glacial Maximum", "year": "2002", "source": "Global and Planetary Change, vol. 35, pp. 25-35", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Discussion on the Possible Significance of the Warm Pool on Global Oceanic Circulation during the Late Quaternary", "year": "2002", "source": "in Chen-Tung Arthur Chen (ed.), Marine Environment: The Past, Present and Future, The Fuwen Press, Kaohsiung, Taiwan, pp. 1-8", "authors": ["Patrick  De Deckker"]}, {"title": "On the occurrence of the giant diatom Ethmodiscus rex in an 80-ka record from a deep-sea core, southeast of Sumatra, Indonesia : implications for tropical palaeoceanography", "year": "2002", "source": "Marine Geology, vol. 183, pp. 31-43", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Palaeoceanography of the Western Pacific Warm Pool During the Last Glacial Maximum: Long-term Climatic Monitoring of the Maritime Continent", "year": "2002", "source": "in P. Kershaw, B. David, N. Tapper, D. Penny and J. Brown (ed.), Bridging Wallace's Line: The environmental and cultural history and dynamics of the SE-Asian-Australian Region, Catena Verlag GMBH, Germany, pp. 147-172", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "History of the South Java Current over the past 80 ka", "year": "2002", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 183, pp. 247-260", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Magnesium, calcium and strontium in waters of the southern Tasman Sea at the confluence of the Indian, Pacific and Southern Oceans", "year": "2002", "source": "Marine and Freshwater Research, vol. 53, pp. 1115-1128", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "ustralian Quaternary studies:a tribute to Jim Bowler.", "year": "2001", "source": "Pergamon-Elsevier LtdNetherlands", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Sea-level and environmental changes since the last interglacial in the Gulf of Carpentaria, Australia: an overview.", "year": "2001", "source": "Quaternary International, vol. 83-85, pp. 19-46", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Last interglacial coral record of enhanced insolation seasonality and seawater 18O enrichment in the Ryukyus Islands, northwest Pacific", "year": "2001", "source": "Geophysical Research Letters, vol. 28, pp. 3685-3688", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Timing of the Last Glacial Maximum from observed sea-level minima: Correction", "year": "2001", "source": "Nature, vol. 412, p. 99", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Records of environmental changes in the Australian sector of PEP II point to broad trends of climate change", "year": "2001", "source": "PAGES News, vol. 9, no. 2, pp. 4-5", "authors": ["Patrick  De Deckker"]}, {"title": "Terrestrial evidence for a spatial structure of tropical-polar interconnections during the Younger Dryas episode", "year": "2001", "source": "Earth and Planetary Science Letters, vol. 191, pp. 231-239", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Late Quaternary fluctuations of the Leeuwin Current and palaeoclimates on the adjacent land masses: clay mineral evidence", "year": "2001", "source": "Australian Journal of Earth Sciences, vol. 48, pp. 867-874", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Late Quaternary cyclic aridity in tropical Australia", "year": "2001", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 170, pp. 1-9", "authors": ["Patrick  De Deckker"]}, {"title": "Sea-level at the Last Glacial Maximum: evidence from northwestern Australia to constrain ice volumes for oxygen isotope stage 2", "year": "2001", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 165, pp. 281-297", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Clay mineral distribution in surface sediments between Indonesia and NW Australia - source and transport by ocean currents", "year": "2001", "source": "Marine Geology, vol. 179, pp. 135-146", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Sea-surface temperatures of the southwest Pacific Ocean during the Last Glacial Maximum.", "year": "2000", "source": "Paleoceanography, vol. 15, pp. 95-109", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Timing of the Last Glacial Maximum from observed sea-level minima", "year": "2000", "source": "Nature, vol. 406, pp. 713-716", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Uptake of Mg and Sr in the eurhyaline ostracod Cyprideis determined from in vitro experiments.", "year": "1999", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 148(1999), pp. 105-116", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "Palaeoceanography of the last glacial maximum in the eastern Indian Ocean: planktonic foraminiferal evidence", "year": "1999", "source": "Palaeogeography, Palaeoclimatology, Palaeoecology, vol. 147, pp. 73-99", "authors": ["Patrick  De Deckker", "Patrick  De Deckker"]}, {"title": "diatom and benthic foraminiferal record from the South Tasman Rise (southeastern Indian Ocean): implications for palaeoceanographic changes for the last 200,000 years", "year": "1999", "source": "Marine Micropaleontology, vol. 38, pp. 69-89", "authors": ["Patrick  De Deckker", "Patrick  De Deckker", "Patrick  De Deckker"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}