{"ANU": {"name": "Paul K. Jones", "link": "https://researchers.anu.edu.au/researchers/jones-px", "colleges": "College of Arts and Social Sciences", "email": "Paul.Jones@anu.edu.au", "phone": "", "expertise": ["Sociology", "Social Theory"], "interest": ["Demagogic Populism and the fate of the public sphere; cultural sociology; media sociology; critical theory; social theory"], "biography": "Paul Jones works at the intersection of sociology, critical theory and  political communication.  He has published widely on the relations  between media policy, political communication and the public sphere in  Australia and increasingly within the international comparative 'media  systems'.  He has held ARC grants and/or participated in local and  international research teams in this area.  He is also an authority on  the work of Raymond Williams and well-published in cultural sociology.   He was an executive board member of The International Sociological  Association's Sociological Theory research committee 2006 - 2014.  He  has been a Visiting Fellow at the London School of Economics (Sociology  & Media and Communications separately). the University of Cambridge (Sociology), the University of California, Berkeley  (History) and the Yale Center for Cultural Sociology.  Paul Jones came  to ANU in 2016 from Sociology at UNSW, Australia.", "project": ["His Critical Theory and Demagogic Populism (Manchester University Press) was published in November 2020.", "Related articles and chapters:", "Jones, P.K. 2021. 'Demagogic  Populism & Media System: a preliminary articulation'. European Journal of Communication. Online first", "Jones, P.K. (forthcoming) ‘Gramsci and a Critical Sociology of Demagogic Populism’. The Companion to Gramsci. Ed. D. Riley and M. Santoro. Anthem Press.", "Jones, P.K. 2020. 'Márkus and the Retrieval of the Sociological Adorno’. Thesis Eleven: a journal of critical theory and historical sociology 160 (1):58-72.", "Jones, P. K. 2019. 'Insights from the infamous: Recovering the social-theoretical first phase of populism studies'. European Journal of Social Theory, 22, 458-476.", "Jones, P. K. 2016. 'Demagogic Populism and US Culture Industries: A long tradition'. Australasian Journal of American Studies, 35, 11-28."], "publication": [{"title": "Critical Theory and Demagogic Populism", "year": "2020", "source": "Manchester University PressManchester United Kingdom", "authors": ["Paul K. Jones"]}, {"title": "Key Concepts in Media and Communications", "year": "2011", "source": "SAGE PublicationsLondon", "authors": ["Paul K. Jones"]}, {"title": "Raymond Williams", "year": "2004", "source": "s Sociology of Culture: A Critical ReconstructionPalgrave Macmillan, United Kingdom", "authors": ["Paul K. Jones"]}, {"title": "Williams, Raymond", "year": "2016", "source": "In K. B. JensenR. T. Craig, J. D. Pooley, & E. W. Rothenbuhler (Eds.),The International Encyclopedia of Communication Theory and Philosophy. Hoboken, N.J., USA: John Wiley & Sons, Inc", "authors": ["Paul K. Jones"]}, {"title": "Marxist Cultural Sociology", "year": "2016", "source": "in D. Inglis and A. Almila (ed.), The SAGE Handbook of Cultural Sociology, SAGE Publications Ltd, London, pp. 11-25.", "authors": ["Paul K. Jones"]}, {"title": "Beyond the Semantic Big Bang: Cultural Sociology and an Aesthetic Public Sphere", "year": "2010", "source": "in J. Gripsrud, H Moe, A Molander and G Murdock (ed.), The Public Sphere, SAGE Publications, London United Kingdom", "authors": ["Paul K. Jones"]}, {"title": "Tragic Utopianism & Critique in Raymond Williams", "year": "2006", "source": "in A. Milner, M. Ryan and R. Savage (ed.), Imagining the Future: Utopia and Dystopia, Arena Publications, Melbourne Australia", "authors": ["Paul K. Jones"]}, {"title": "Class and Media Influence in Australia", "year": "2004", "source": "in D Heider (ed.), Class and News, Rowman & Littlefield Publishers Inc., United States", "authors": ["Paul K. Jones"]}, {"title": "Beyond \"Ages\" and \"Eras\": sidestepping societal \"projections\" by typologising ICTs (published conf. paper)", "year": "2003", "source": "in B. Miege and G Tremblay (ed.), 2001 Bogues: globalisme et pluralisme, Presses de l'UniversiteÌ Laval, Canada, pp. 111-128", "authors": ["Paul K. Jones"]}, {"title": "Williams and Markus on Production", "year": "2002", "source": "in J E Grumley, P Crittenden and P Johnson (ed.), Culture and enlightenment: essays for George Markus, Ashgate Publishing Ltd, United Kingdom", "authors": ["Paul K. Jones"]}, {"title": "Markus and the retrieval of the sociological Adorno", "year": "2020", "source": "Thesis Eleven, vol. 160, no. 1, pp. 58-72", "authors": ["Paul K. Jones"]}, {"title": "Insights from the infamous: Recovering the social-theoretical first phase of populism studies", "year": "2019", "source": "European Journal of Social Theoryvol 22(4) pp. 458-47", "authors": ["Paul K. Jones"]}, {"title": "Demagogic Populism and US Culture Industries: a long tradition", "year": "2016", "source": "Australasian Journal of American Studies (AJAS), vol. 35, no. 1, pp. 11-28", "authors": ["Paul K. Jones"]}, {"title": "Why Are \"Others\" So Polarized? Perceived Political Polarization and Media Use in 10 Countries", "year": "2016", "source": "Journal of Computer-Mediated Communication, vol. 21, no. 5, pp. 349-367", "authors": ["Yang J", "Rojas H", "Wojcieszak M", "Paul K. Jones"]}, {"title": "Sources in the News: A comparative study", "year": "2014", "source": "Journalism Studies, vol. 15, no. 4, pp. 374-391", "authors": ["Tiffen R", "Paul K. Jones"]}, {"title": "Reconsidering", "year": "2014", "source": "virtuous circle' and media malaise' theories of the media: An 11-nation study'Journalism, vol. 15, no. 7, pp. 815-833", "authors": ["Curran J", "Coen S", "Soroka S", "Paul K. Jones"]}, {"title": "ONLINE THREAT, BUT TELEVISION IS STILL DOMINANT A comparative study of 11 nations", "year": "2013", "source": "news consumption'Journalism Practice, vol. 7, no. 6, pp. 690-704", "authors": ["Papathanassopoulos S", "Coen S", "Curran J", "Paul K. Jones"]}, {"title": "Internet Revolution Revisited: A Comparative Study of Online News", "year": "2013", "source": "Media, Culture & Society, vol. 35, no. 7, pp. 880-897", "authors": ["Curran J", "Coen S", "Aalberg T", "Paul K. Jones"]}, {"title": "Border communication: media sociology and STS", "year": "2012", "source": "Media, Culture & Society, vol. 34, no. 6, pp. 673-690", "authors": ["Wajcman J", "Paul K. Jones"]}, {"title": "untie Knows Best? Public Broadcasters and Current Affairs Knowledge", "year": "2013", "source": "British Journal of Political Science, vol. 43, no. 4, pp. 719-739", "authors": ["Soroka S", "Andrew B", "Aalberg T", "Paul K. Jones"]}, {"title": "The moment of Leveson: Beyond", "year": "2012", "source": "First Amendment fundamentalism' in news regulatory policies'Pacific Journalism Review, vol. 18, no. 2, pp. 51-67", "authors": ["Paul K. Jones"]}, {"title": "Political communication and", "year": "2010", "source": "media system': the Australian canary'Media, Culture & Society, vol. 32, no. 3, pp. 451-471", "authors": ["Paul K. Jones", "Pusey M"]}, {"title": "Raymond Williams & Bruno Latour:", "year": "2010", "source": "formalism' in the sociology of culture and technology'Sociologie de l’Art,  OpuS 15, pp. 59-83", "authors": ["Paul K. Jones"]}, {"title": "Mediated political communication in Australia: leading issues, new evidence", "year": "2008", "source": "Australian Journal of Social Issues, vol. 43, no. 4, pp. 583-599", "authors": ["Paul K. Jones", "Pusey M"]}, {"title": "Beyond the Semantic", "year": "2007", "source": "Big Bang': Cultural Sociology and an Aesthetic Public Sphere'Cultural Sociology, vol. 1, no. 1, pp. 73-95", "authors": ["Paul K. Jones"]}, {"title": "ntipodean Public Spherists", "year": "2007", "source": "Southern Review, vol. 39, no. 3, pp. 111-128", "authors": ["Paul K. Jones"]}, {"title": "Thirty Years of Keywords: Review essay on Raymond William", "year": "2006", "source": "s Keywords: A Vocabulary of Culture and SocietyLondon, Flamingo, 1983 and Tony Bennett et al, New Keywords: A Revised Vocabulary of Culture and Society, Oxford, Blackwell, 2005', Sociology, vol. 40, no. 6, pp. 1209-1215", "authors": ["Paul K. Jones"]}, {"title": "ustralian Cross-Media Ownership Rules and Freedom of Political Communication", "year": "2005", "source": "University of New South Wales Law Journal, vol. 28, no. 3, pp. 916-923", "authors": ["Paul K. Jones"]}, {"title": "The Implied Constitutional Freedom of Political Communication and Australian Media Policy", "year": "2003", "source": "The UTS Law Review, vol. 5, pp. 65-85", "authors": ["Paul K. Jones"]}, {"title": "Free Speech Discourse as an Emancipatory Ideology: a reply to Lawrence McNamara", "year": "2003", "source": "The UTS Law Review, vol. 5, pp. 92-100", "authors": ["Paul K. Jones"]}, {"title": "The Best of Both Worlds? Freedom of Communication and Positive Broadcasting Regulation", "year": "2001", "source": "Media, Culture & Society, vol. 23, no. 3, pp. 407-417", "authors": ["Paul K. Jones"]}, {"title": "Paradigmatic Tensions in the Sociology of News (review essay)", "year": "2000", "source": "Journal of Sociology, vol. 36, no. 2, pp. 239-247", "authors": ["Paul K. Jones"]}, {"title": "McLuhanist Projections and Social Theory: some reflections", "year": "2000", "source": "Media International Australia incorporating Culture and Policy, vol. 94, pp. 39-55", "authors": ["Paul K. Jones"]}, {"title": "Democratic Norms and Means of Communication:Public Sphere, Fourth Estate, Freedom of Communication", "year": "2000", "source": "Critical Horizons: a journal of philosophy and social theory, vol. 1, no. 2, pp. 307-339", "authors": ["Paul K. Jones"]}, {"title": "The problem is always one of method... : cultural materialism, political economy and cultural studies", "year": "1999", "source": "Key Words: a journal of cultural materialism, vol. 2, pp. 28-46", "authors": ["Paul K. Jones"]}, {"title": "Between Cultural Studies and Critical Sociology: public spheres, counter public spheres and journalism (review essay on J Hartley, Popular Reality: journalism, modernity, popular culture. London, Arnold 1996)", "year": "1998", "source": "Media International Australia incorporating Culture and Policy, vol. 88, pp. 121-133", "authors": ["Paul K. Jones"]}, {"title": "The Technology is not the Cultural Form?: Raymond Williams", "year": "1998", "source": "s Sociological Critique of Marshall McLuhan'Canadian Journal of Communication, vol. 23, no. 4, pp. 423-454", "authors": ["Paul K. Jones"]}, {"title": "Moral Panic: the legacy of Stan Cohen and Stuart Hall", "year": "1997", "source": "Media International Australia incorporating Culture and Policy, vol. 85, no. November issue, pp. 6-16", "authors": ["Paul K. Jones"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}