{"ANU": {"name": "Paul Maharg", "link": "https://researchers.anu.edu.au/researchers/maharg-p", "colleges": "ANU College of Law", "email": "paul.maharg@anu.edu.au", "phone": "", "expertise": ["Curriculum And Pedagogy", "Other Law And Legal Studies"], "interest": [], "biography": "My first employment was as an adult education outreach worker in Glasgow, and part-time academic literacies tutor at Glasgow University. After a law degree I worked for seven years as lecturer then senior lecturer at Glasgow Caledonian University Law Dept, focusing on curriculum development and use of IT in legal learning. In 1999 I was appointed to the newly-formed Glasgow Graduate School (GGSL), University of Strathclyde, first as senior lecturer then professor. There, I was Co-Director of Legal Practice Courses, and Director of the innovative Learning Technologies Development Unit, as well as Director of the two-year, JISC/UKCLE-funded project, SIMPLE (SIMulated Professional Learning Environment). In 2010 I was invited to join Northumbria Law School as Professor of Legal Education, and in 2013 appointed to a professorial post at the Australian National University. Currently I spend five months on campus at ANU, seven months in the UK (Glasgow and Orkney), where I live with my wife Nicola.", "project": [], "publication": [{"title": "Editorial: Learning/Technology", "year": "2016", "source": "The Law Teacher: Journal of the Association of Law Teachers, vol. 50, no. 1, pp. 15-23", "authors": ["Paul Maharg"]}, {"title": "Disintermediation", "year": "2016", "source": "The Law Teacher: Journal of the Association of Law Teachers, vol. 50, no. 1, pp. 114-131", "authors": ["Paul Maharg"]}, {"title": "", "year": "2015", "source": "European Journal of Law and Technology", "authors": ["Paul Maharg", "ed"]}, {"title": "Res Publica: The early days of a better world", "year": "2015", "source": "Demos, vol. Online, no. 03/09/2015, pp. 5pp", "authors": ["Paul Maharg"]}, {"title": "Editorial", "year": "2015", "source": "European Journal of Law and Technology, vol. 6, no. 3, pp. 2pp", "authors": ["Paul Maharg"]}, {"title": "Democracy begins in conversation", "year": "2015", "source": ": The phenomenology of problem-based learning and legal education'Nottingham Law Journal, vol. 24, no. 1, pp. 94-111", "authors": ["Paul Maharg"]}, {"title": "Shared space: regulation, technology and legal education in a global context", "year": "2015", "source": "European Journal of Law and Technology, vol. 6, no. 1, pp. 1-31", "authors": ["Paul Maharg"]}, {"title": "n overture for well-tempered regulators: four variations on a LETR theme", "year": "2015", "source": "The Law Teacher: Journal of the Association of Law Teachers, vol. 49, no. 2, pp. 143-164", "authors": ["Ching J", "Paul Maharg", "Sherr A"]}, {"title": "Death masks and professional masks: community, values and ethics in legal education", "year": "2014", "source": "REDU Revista de docencia Universitaria, vol. 12, no. 3, pp. 127-151", "authors": ["Paul Maharg"]}, {"title": "Convergence and fragmentation: legal research, legal informatics and legal education", "year": "2014", "source": "European Journal of Law and Technology, vol. 5, no. 3, pp. 1-23", "authors": ["Paul Maharg"]}, {"title": "Simulation and Technology in Legal Education: a Systematic Review", "year": "2014", "source": "in C Strevens, R Grimes, E Phillips (ed.), Legal Education: Simulation in Theory and Practice, Ashgate Publishing Limited, Surrey, England, pp. 17-42", "authors": ["Paul Maharg", "Nicol E"]}, {"title": "Digital Games and Learning", "year": "2014", "source": "RoutledgeUSA", "authors": ["de Freitas S", "Paul Maharg", "eds"]}, {"title": "ssociated life", "year": "2013", "source": ": democratic professionalism and the moral imagination'in Bankowski, Zenon & Del Mar, Maksymilian (ed.), The Moral Imagination and the Legal Life: Beyond Text in legal Education, Ashgate Publishing Ltd, England, pp. 111-143", "authors": ["Paul Maharg"]}, {"title": "Too many laws, too few examples", "year": "2013", "source": ": Regulationtechnology, law & legal education (Editorial: BILETA2012 Conference journal special issue)', European Journal of Law and Technology, vol. 4, no. 1", "authors": ["Paul Maharg", "Bloxham S"]}, {"title": "iPads in Legal Learning (iLEGALL): mobile devices in professional legal learning", "year": "2013", "source": "European Journal of Law and Technology, vol. 4, no. 1, p. 27", "authors": ["Bainbridge J", "Counsell K", "Grealy F", "Paul Maharg"]}, {"title": "", "year": "2013", "source": "Setting Standards. The Future of Legal Services Education and Training Regulation in England and Wales", "authors": ["Webb J", "Ching J", "Paul Maharg"]}, {"title": "Too many laws, too few examples.", "year": "2013", "source": "Regulationtechnology, law & legal education', European Journal of Law and Technology, vol. 4, no. 1", "authors": ["Bloxham S", "Paul Maharg"]}, {"title": "Prefessor Abdul Paliwala - an appreciation", "year": "2013", "source": "European Journal of Law and Technology, vol. 4, no. 1", "authors": ["Paul Maharg"]}, {"title": "BILETA2012 Conference", "year": "2013", "source": "Too many lawstoo few examples.' Regulation, technology, law & legal education', European Journal of Law and Technology, vol. 4, no. 1, pp. 9pp", "authors": ["Paul Maharg"]}, {"title": "Professor Abdul Paliwala - An Appreciation", "year": "2013", "source": "European Journal of Law and Technology, vol. 4, no. 1", "authors": ["Paul Maharg", ""]}, {"title": "The Arts and the Legal Academy: Beyond Text in Legal Education", "year": "2012", "source": "Ashgate Publishing LtdAldershot, UK and Burlington, VT, USA", "authors": ["Bankowski Z", "del Mar M", "Paul Maharg", "eds"]}, {"title": "Simulation: A Pedagogy Emerging from the Shadows", "year": "2012", "source": "in O Goodenough, M Lauritsen (ed.), Educating the Digital Lawyer, LexisNexis, New Providence and San Francisco, pp. 1-23", "authors": ["Paul Maharg"]}, {"title": "You Are Here", "year": "2012", "source": ": Learning LawPractice and Professionalism in the Academy', in Z Bankowski, M Del Mar, P Maharg (ed.), The Arts and the Legal Academy, Ashgate Publishing Ltd, Aldershot, UK and Burlington, VT, USA, pp. 189-212", "authors": ["Barton K", "Garvey J", "Paul Maharg"]}, {"title": "ssessing legal professionalism in simulations: The case of SIMPLE", "year": "2012", "source": "", "authors": ["Paul Maharg"]}, {"title": "Introduction: the Arts and the Legal Academy", "year": "2012", "source": "in Z Bankowski, M Del Mar, P Maharg (ed.), The Arts and the Legal Academy, Ashgate Publishing Ltd, Aldershot, UK and Burlington, VT, USA, pp. 1-13", "authors": ["Bankowski Z", "del Mar M", "Paul Maharg"]}, {"title": "The Identity of Scots Law: Redeeming the Past", "year": "2012", "source": "in M A Mulhern (ed.), Scottish Life and Society: The Law, Birlinn, Edinburgh", "authors": ["Paul Maharg"]}, {"title": "Space, absence, silence: the intimate dimensions of legal learning", "year": "2011", "source": "in Maharg, P; Maughan,C (ed.), Affect and Legal Education: Emotion in Learning and Teaching the Law, Ashgate Publishing Ltd, Aldershot, pp. 283-305", "authors": ["Paul Maharg"]}, {"title": "ffect and Legal Education: Emotion in Learning and Teaching the Law", "year": "2011", "source": "Ashgate Publishing LtdAldershot", "authors": ["Paul Maharg", "Maughan C", "eds"]}, {"title": "Sea-change", "year": "2011", "source": "International Journal of the Legal Profession, vol. 18, no. 1-2, pp. 139-164", "authors": ["Paul Maharg"]}, {"title": "Introduction", "year": "2011", "source": "in Maharg, P; Maughan,C (ed.), Affect and Legal Education: Emotion in Learning and Teaching the Law, Ashgate Publishing Ltd, Aldershot", "authors": ["Paul Maharg", "Maughan C"]}, {"title": "Digital games and learning: modelling learning experiences in the digital age", "year": "2011", "source": "in Sara de Freitas and Paul Maharg (ed.), Digital Games and Learning, Continuum International Publishing Group, New York, USA, pp. 17-41PP", "authors": ["de Freitas S", "Paul Maharg"]}, {"title": "Construction and constructivism: learning contract management and administration via simulated transactions", "year": "2010", "source": "Centre for Education in the Built Environment Transactions Journal, vol. 7, no. 2, pp. 37-54", "authors": ["Agapiou A", "Paul Maharg", "Nicol E"]}, {"title": "Simulation, technology and professionalism", "year": "2009", "source": "in   (ed.), New Currents in Law School Education: The Use of Simulation and Web-Based Approaches, Kwansei Gakuin University Press, Japan, pp. 15-42", "authors": ["Paul Maharg"]}, {"title": "Cyberdam and SIMPLE: a study in divergent developments and convergent aims", "year": "2009", "source": "in Warmelink, H; Mayer, I (ed.), Learning in a virtual world, Wolf Legal Publishers, Nijmegen", "authors": ["Paul Maharg"]}, {"title": "The narrative event diagram: a tool for designing professional simulations", "year": "2009", "source": "in David Gibson and Young Kyun Baek (ed.), Digital Simulations for Improving Education: Learning Through Artificial Teaching Environments, IGI Global Books, Hershey, PA, pp. 101-118", "authors": ["Gould H", "Hughes M", "Paul Maharg"]}, {"title": "", "year": "2008", "source": "SIMulated Professional Learning Environment (SIMPLE): Programme Final Report", "authors": ["Hughes M", "Gould H", "Mckellar P", "Paul Maharg"]}, {"title": "uthentic fictions: simulation, professionalism and legal learning", "year": "2007", "source": "Clinical Law Review, vol. 14, no. 1, pp. 143-193", "authors": ["Paul Maharg"]}, {"title": "Black box, Pandora", "year": "2007", "source": "s box or virtual toolbox? An experiment in a journal's transparent peer review on the web'International Review of Law, Computers and Technology, vol. 21, no. 2, pp. 109-128", "authors": ["Paul Maharg"]}, {"title": "SIMPLE: simulation learning and professional practice", "year": "2007", "source": "in Igor Mayer and Hanneke Mastik (ed.), Organizing and Learning through Gaming and Simulation. Proceedings of Isaga 2007, Eburon, Delft, pp. 211-220", "authors": ["Paul Maharg"]}, {"title": "Transforming Legal Education: Learning and Teaching the Law in the Early Twenty-first Century", "year": "2007", "source": "Ashgate Publishing LtdAldershot and Burlington", "authors": ["Paul Maharg"]}, {"title": "uthenticity and professionalism: transactional learning in virtual communities", "year": "2007", "source": "Innovating e-Learning 2006, ed. Sara de Freitas and Ros Smith, JISC, Bristol", "authors": ["Paul Maharg"]}, {"title": "E-simulations in the wild: interdisciplinary research, design and implementation", "year": "2007", "source": "in David Gibson, Clark Aldrich, Marc Prensky (ed.), Games and Simulations in Online Learning, IGI Global, USA, pp. 115-149", "authors": ["Paul Maharg", "Barton K"]}, {"title": "Epilogue: Future directions for gaming and simulation", "year": "2007", "source": "in Igor Mayer, Geertje Bekebrede, Karen Jager (ed.), Spelend Leren in Virtuele Werelden: Bouwstenen voor Online Gaming in het Hoger Onderwijs, Wolters-Noordhoff, Groningen, Netherlands, pp. 235-237", "authors": ["Paul Maharg"]}, {"title": "Portrait of the online tutor as Thelonius Monk.  Directions", "year": "2005", "source": "11Autumn.  Warwick, UK Centre for Legal Educatio", "authors": ["Paul Maharg"]}, {"title": "Virtual firms: transactional learning on the web", "year": "2004", "source": "The Journal of the Law Society of Scotland, vol. November 2004", "authors": ["Paul Maharg"]}, {"title": "Virtual communities on the web: transactional learning and teaching", "year": "2004", "source": "in Anton Vedder (ed.), Aan het werk met ICT in het academisch onderwijs, Wolf Legal Publishers, Netherlands, pp. 75-90", "authors": ["Paul Maharg"]}, {"title": "Negotiating the Learning Process with Electronic Resources", "year": "2002", "source": "in Roger Burridge, Karen Hinett, Abdul Paliwala, Tracey Varnava (ed.), Effective Learning and Teaching in Law, Kogan Page, London, pp. 81-104", "authors": ["Paul Maharg", "Paliwala A"]}, {"title": "", "year": "2002", "source": "Test of Professional Competence First Pilot Examination: Report on First Pilot Feedback", "authors": ["Paul Maharg"]}, {"title": "Imagined communities, imaginary conversations: failure and the construction of legal identities", "year": "2001", "source": "in Lindsay Farmer, Rob Dunbar (ed.), The State of Scots Law: law and government after the Devolution Settlement, LexisNexis, London, UK, pp. 135-150", "authors": ["Paul Maharg"]}, {"title": "Plans for action, time for reflection: an experiment with time, action and personal development", "year": "2001", "source": "in Charlews Juwah, Lorraine Stefani, Jenny Westwood, Craig Gray, Jan Drysdale (ed.), Personal Development Planning in Practice: A Series of Case Studies, Personal Development Planning in Higher Education (Scotland) Group, Scotland, pp. 1-5", "authors": ["Paul Maharg"]}, {"title": "Context, cues, cognition\": writing, rhetoric and legal argumentation", "year": "2000", "source": "in Sally Mitchell, Richard Andrews (ed.), Learning to Argue in Higher Education, Heinemann, USA", "authors": ["Paul Maharg"]}]}, "Microsoft-Academic": [{"title": "digital games and learning", "year": 2011, "source": "", "authors": [{"name": "sara de freitas"}, {"name": "paul maharg"}]}, {"title": "on the edge ict and the transformation of professional legal learning", "year": 2006, "source": "", "authors": [{"name": "paul maharg"}]}, {"title": "on the edge ict and the transformation of professional legal learning", "year": 2008, "source": "social science research network", "authors": [{"name": "paul maharg"}], "id": 2751751161}, {"title": "transforming legal education learning and teaching the law in the early twenty first century", "year": 2007, "source": "", "authors": [{"name": "paul maharg"}]}, {"title": "negotiating the learning process with electronic resources", "year": 2002, "source": "", "authors": [{"name": "paul maharg"}, {"name": "abdul paliwala"}]}, {"title": "construction and constructivism learning contract management and administration via simulated transactions", "year": 2010, "source": "", "authors": [{"name": "andrew agapiou"}, {"name": "paul maharg"}, {"name": "emma nicol"}]}, {"title": "e simulations in the wild interdisciplinary research design and implementation", "year": 2007, "source": "", "authors": [{"name": "karen barton"}, {"name": "paul maharg", "affiliation": "university of strathclyde"}]}, {"title": "legal education and training review a five year retro prospective", "year": 2018, "source": "the law teacher", "authors": [{"name": "j ching", "affiliation": "nottingham trent university"}, {"name": "paul maharg", "affiliation": "nottingham trent university"}, {"name": "paul maharg", "affiliation": "york university"}, {"name": "avrom sherr", "affiliation": "university of london"}, {"name": "julian webb", "affiliation": "university of melbourne"}], "id": 177893221}, {"title": "authentic fictions simulation professionalism and legal learning", "year": 2007, "source": "", "authors": [{"name": "karen barton"}, {"name": "patricia mckellar"}, {"name": "paul maharg"}]}, {"title": "authentic fictions simulation professionalism and legal learning", "year": 2008, "source": "social science research network", "authors": [{"name": "karen barton"}, {"name": "patricia mckellar"}, {"name": "paul maharg"}], "id": 2751751161}], "ANDS-Grants": []}