{"ANU": {"name": "Peter Alwast", "link": "https://researchers.anu.edu.au/researchers/alwast-pr", "colleges": "College of Arts and Social Sciences", "email": "peter.alwast@anu.edu.au", "phone": "", "expertise": ["Fine Arts Incl. Sculpture And Painting ", "Lens Based Practice", "Art Theory", "Art History", "Aesthetics", "Poststructuralism"], "interest": ["Theoretical research includes contemporay aesthetic debates, post-structuralism, new materialism, formalism and the work of Jean-Luc Nancy, Jacques Ranciere and Bernard Stiegler.Studio research iis based on relations and discordances between paintings, prints and video works that invoke a range of personal and political mediations about institutions, social fragmentation and community."], "biography": "Peter Alwast has held over 17 solo exhibitions and has been shown in group exhibitions at the Tate Modern (London), Museum of Old and New Art (Tasmania), the Greater Taipei Biennial, the Australian Centre for Photography (Sydney), GOMA - Gallery of Modern Art, Brisbane, among others. His work is held in public and private collections in Australia and the  United States. Alwast's practice employs a range of media including painting, video, computer graphics and drawing. In 1999, Alwast was  awarded a Samstag International Visual Arts Scholarship and since  completing his Masters in Fine Art degree from the Parsons School of  Design, New School University, New York in 2001, he has exhibited   nationally and internationally. In 2013 Alwast undertook a residency and  solo exhibition at Videotage in Hong Kong . In 2011 he created a solo  exhibition Future Perfect at the Institute of Modern Art, Brisbane and  his work was seen in the group exhibition Experimenta Utopia Now  travelling to MONA, Tasmania as well as Selectively Revealed at the Aram  Art Gallery, Seoul, South Korea.  In 2010 Alwast's video animation work  'Everything' received an honourable mention in Update III, at the  Liedts Meesen foundation in Ghent, Belgium.  His drawing work ‘Trees,  Waterfall, Back’ won the Jacaranda drawing award in Grafton Regional  Gallery. In 2008 he was the  inaugural recipient of The New Media Art Award, hosted by The Gallery of  Modern Art in Brisbane, Australia.", "project": ["Solo Exhibitions", "2018  'Making Sense', Gallery9, Sydney", "2016  'Here and There' The Garage, Canberra", "2015 '1,2,3' Gallery9, Sydney, 'Being Together' The Block, QUT, Brisbane, 'Video Works' Screen Space, Melbourne", "2014 'The Origins of Humanity, Boxcopy, Brisbane", "2013 'Looking Down', Videotage, Hong Kong, 'Frozen In The Tracks', Ryan Renshaw Gallery, Brisbane, Duets, Gallery9, Sydney", "2012 'Translations', Grafton Regional Gallery", "2011 'Future Perfect', Institute of Modern Art, Brisbane, New Work, Ryan Renshaw, Brisbane, Drawings, Gallery9, Sydney", "2008 'The Landing', Gallery Barry Keldoulis, Sydney", "2007 'Places That Don’t Exist, George Petelin Gallery, Gold Coast, Now That The Neighbours Can Dance, Gallery Barry Keldoulis, Sydney", "2006 'The Night Sky', MSSR, Brisbane", "2005 'Somewhere In The South Pacific, Blindside, Melbourne, 'Delivery', Metro Arts, Brisbane", "2003 'Working Like A Tiger', The Farm Space, Brisbane", "", "Group Exhibitions", "2020 'Mosman Art Prize' finalist, Mosman Art Gallery, Sydney", "2019 'Unfinished Business', Canberra Contemporary Art Space", "2018 'Painting Amongst Other Things' Drill Hall Gallery, Canberra.", "2017 'Red,Green Blue', A History of Australian Video Art, Griffith University, Brisbane", "2016 'Greater Taipei Biennale', NTUA Art Musuem, Taipei, Fishers Ghost Exhibition, Campbelltown Arts Centre.", "2015  A Time and a Place, Landscapes from the Griffith University Art Collection, Albany Art Prize, WA.", "2014 'Art Stage Singapore', Singapore Art Fair, Always Foever Now- Timelessness and The Currency of New Media Art, Das Weisse Haus, Vienna, Austria.", "2013 'The Wandering', Museum of Contemporary Art Touring Exhibition, Fishers Ghost Art Award, Campbeltown Arts Center, Albany Art Prize, Albany Town Hall, WA, Works on Paper, Hazelhurst Regional Art Gallery", "2012 'Selectively Revealed' National Taiwan Museum of Fine Arts,Taipei, Selectively Revealed Chulalongkorn University Art Spapce,Bangkok, Thailan.", "2011 'Selectively Revealed', Aram Art Gallery, Seoul, South Korea, Group Show, Gallery9, Sydney, Experimenta Biennale of Media Art- Utopia Now, Melbourne Arts Centre, Mornington Peninsula Regional Gallery, Experimenta Utopia Now, Museum of Old and New Art, Tasmania", "2010 'Update III',Liedts-Meesen Foundation, Ghent, Belgium, 'No Soul For Sale', Tate Modern, United Kingdom, 'Dream Home', Australian Center for Photography, Sydney, 'Move on Asia', Para-Site, Hong Kong, 'Move on Asia', Loop Gallery, Seoul, South Korea, 'Experimenta', Utopia Now, The Arts Center, Melbourne", "2009 'Souviners from Earth', Video Art Tv Channel, Germany and France online: http://www.souvenirsfromearth.tv  Fremantle Print Award, Fremantle Art Gallery, Fremantle Temperature Two, New Art From Queensland, Museum of Brisbane, Australia, No Identifiable Culture Campbelltown Arts Centre, Campbelltown, NSW 'I Have Not Been Myself Lately', QCA Gallery, Griffith University, Brisbane", "2008 'The Premier of Queensland New Media Award', Gallery of Modern Art, Brisbane 'Tidal', Davonport Regional Gallery, Tasmania, 'Video Ground', (Touring) -Bangkok Experimental Film Festival, Bangkok, Thailand, University of Chicago, Chicago, 'Gifted' - New to the Griffith University Collection, Dell Gallery, Brisbane, Wilson HTM Art Prize (Touring), Sophie Gannon Gallery, Melbourne, Grantpirrie, Sydney, Jan Manton Art, Brisbane"], "publication": [{"title": "Contemporary Positions on Aesthetics and Politics beyond Identity and Representation", "year": "2020", "source": "ICCT NYU Winter Institute 2020, New York University, New York, United States of America, p. 36", "authors": ["Peter Alwast"]}, {"title": "Science fiction and the antimony of images: Peter Alwast", "year": "2014", "source": "Eyeline Contemporary Visual Art MagazineVol 8", "authors": ["Geczy A", "Peter Alwast"]}, {"title": "Virtual Materiality", "year": "2013", "source": "Australian Art CollectorIssue 64, April-June 201", "authors": ["Kubler A", "Peter Alwast"]}, {"title": "Sideways Look At Our Vertical City", "year": "2013", "source": "South China Morning PostSunday December", "authors": ["Lam L", "Peter Alwast"]}, {"title": "Future Perfect Catalogue", "year": "2011", "source": "Institute of Modern ArtBrisban", "authors": ["Stevens G", "Peter Alwast"]}, {"title": "Peter Alwast and The Aesthetics of Disinclination", "year": "2006", "source": "Eyeline Contemporary Visual Arts MagazineNumber 5", "authors": ["Penning M", "Peter Alwast"]}, {"title": "Everything as a Meta-Picture in Motion", "year": "2008", "source": "Catalogue for New Media AwardGOMA, Brisbane", "authors": ["Evans N", "Peter Alwast"]}]}, "Microsoft-Academic": [{"title": "finance tower ii", "year": 2018, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "plumbers who work at night", "year": 2018, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "the grenfell tower", "year": 2018, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "last night we found out how it all worked together", "year": 2013, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "in the morning", "year": 2013, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "in the evening", "year": 2013, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "the summit at koblenz", "year": 2018, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "i never thought it would end that way", "year": 2011, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "1 2 3 gallery 9 2015", "year": 2019, "source": "", "authors": [{"name": "peter alwast"}]}, {"title": "over here and over there", "year": 2015, "source": "", "authors": [{"name": "peter alwast"}]}], "ANDS-Grants": []}