{"ANU": {"name": "Peter Brown", "link": "https://researchers.anu.edu.au/researchers/brown-pt", "colleges": "College of Arts and Social Sciences", "email": "Peter.Brown@anu.edu.au", "phone": "61 2 61252768", "expertise": ["Pacific Literature", "French Language", "Postcolonial Studies", "Literature In French"], "interest": [], "biography": "D.Phil, University of Oxford.", "project": ["French literature of the Pacific; New Caledonia: literature and culture; Postcolonialism; La Francophonie; 19th century French literature;"], "publication": [{"title": "ugustine Soubeiran (1858-1933). Innovative Educator and Dynamic Secretary of the French-Australian League of Help", "year": "2015", "source": "in Eric Berti and Ivan Barko (ed.), French lives in Australia: a collection of biographical essays, Australian Scholarly Publishing Pty Ltd, North Melbourne, pp. 319-337", "authors": ["Peter Brown"]}, {"title": "ustralie-France: année de grandes rencontres (Australia-France: Year of major meetings)", "year": "2015", "source": "L' Année Francophone Internationale, 2015-2016", "authors": ["Peter Brown"]}, {"title": "L", "year": "2015", "source": "Australie et la mort : commémorationoubli, scandale (Australia and death: commemoration oblivion, scandal)', Hermes, vol. 72, pp. 266-266", "authors": ["Peter Brown"]}, {"title": "Le théâtre en Nouvelle-Calédonie: genre exogène intégré (Theatre in New Caledonia: exogenous genre integrated), in Francoise Quillet (ed.), La scène mondiale aujourd", "year": "2015", "source": "hui: Des formes en mouvementl'Harmattan, France, pp. 265-279", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "2014", "source": "L' Annee Francophone Internationale, vol. 2014/2015, pp. 307-309", "authors": ["Peter Brown"]}, {"title": "The French-Australian League of Help: Restoring the Record", "year": "2014", "source": "The French Australian Review, no. 56, pp. 26-50", "authors": ["Peter Brown", "Dwyer J"]}, {"title": "Le Festival des Arts du Pacifique (the Pacific Art Festival)", "year": "2013", "source": "Hermes, vol. 65, pp. 162-164", "authors": ["Peter Brown"]}, {"title": "ustralie: Politique", "year": "2013", "source": "L' Année Francophone Internationale, vol. 2013-2104, CIDEF-AFI, Quebec City, pp. 334-335", "authors": ["Peter Brown"]}, {"title": "La France et les puissances ascendantes: Australie", "year": "2013", "source": "in Michel Foucher (ed.), Atlas de l'influence française au XXI siècle, Institut Français, Paris, pp. 89-89", "authors": ["Peter Brown"]}, {"title": "La société mise en scène: Quelques accords et désaccords dans le théâtre de la Nouvelle-Calédonie (Society on the stage: Some accords and disagreements in New Caledonian theatre)", "year": "2013", "source": "in Jean Bessière & Sylvie André (ed.), Literatures of the Pacific Islands, Honoré Champion Editeur, Paris, pp. 331-346", "authors": ["Peter Brown"]}, {"title": "Negotiating postcolonial identities in the shadow of the EU: New Caledonia", "year": "2013", "source": "in Rebecca Adler-Nissen and Ulrik Pram Gad (ed.), European Integration and Postcolonial Sovereignty Games: The EU Overseas Countries and Territories, The New International Relations Series, Routledge, London and New York, pp. 169-186", "authors": ["Peter Brown"]}, {"title": "Religion et société dans l", "year": "2013", "source": "oeuvre de Claudine Jacques : la parabole païenne de L'Âge du perroquet-banane (Religion and Society in the Work of Claudine Jacques: the pagan parable of L'Âge du perroquet-banane)'in Florence Faberon and Jean-Yves Faberon (ed.), Religion et Société en Nouvelle-Calédonie et en Océanie, Clermont-Ferrand - Université d'Auvergne, France, pp. 235-248", "authors": ["Peter Brown"]}, {"title": "Translation of Mallarmé", "year": "2013", "source": "s seminal poem: \"Throw of the Dice\"' in Christopher Brennan/Stéphane MallarméUncollected Works Press, Melbourne, pp. 46-70", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "2012", "source": "in Loïc Hervouet (ed.), L'Année Francophone Internationale 2012/2013, CIDEF-AFI, Quebec, Canada, pp. 313-315", "authors": ["Peter Brown"]}, {"title": "La France vue d", "year": "2012", "source": "Australieune vieille histoire en mutation (France through Australian eyes: an old history undergoing change)', in Michel Korinman (ed.), Outre-Terre: Revue européenne de géopolitique 33/34, Editions Glyphe, Paris, France, pp. 391-397", "authors": ["Peter Brown"]}, {"title": "La Francophonie: From the Postcolonial to the Post-Cold War Eras", "year": "2011", "source": "Australian Journal of French Studies, vol. 48, no. 1, pp. 19-33", "authors": ["Peter Brown"]}, {"title": "ustralie. Du Tour de France à  la marche vers l", "year": "2011", "source": "ONU' (Australia. From the Tour de France to the United Nations)'L'Année Francophone Internationale, CIDEF-AFI, Quebec City, pp. 327-329", "authors": ["Peter Brown"]}, {"title": "Les musées du Pacifique: un autre regard sur le monde (Museums of the Pacific: another look at the world)", "year": "2011", "source": "Hermes, vol. 61, pp. 144-146", "authors": ["Peter Brown"]}, {"title": "Mémoire de passés, mémoire d", "year": "2011", "source": "avenirs: Que se cache-t-il derrière le mot \"pardon\"? (Memories of pastsmemories of futures: What is hidden behind the word \"pardon\"?)', in Jacques Beauchemin (ed.), Mémoire et démocratie en Occident: Concurrence des mémoires ou concurrence victimaire, Peter Lang Publishing Group, Belgium, pp. 105-120", "authors": ["Peter Brown"]}, {"title": "ustralie-France: mémoire, océan et culture partagés", "year": "2010", "source": "in Loïc Hervouet (ed.), L'Année Francophone Internationale 2010, CIDEF-AFI, Quebec, Canada, pp. 315-316", "authors": ["Peter Brown"]}, {"title": "Book Review: Poinciana", "year": "2010", "source": "Explorations: ISFAR (Institute for the Study of French-Australian Relations), vol. 48, pp. 55-59", "authors": ["Peter Brown"]}, {"title": "De la rhétorique au", "year": "2010", "source": "rhetoric': petite histoire d'une grande ambivalence'Hermes, vol. 58, pp. 29-32", "authors": ["Peter Brown"]}, {"title": "Vive le Canada libre! The 12th Sommet de la Francophonie, Quebec City, October (17-19 October 2008)", "year": "2009", "source": "International Journal of Francophone Studies, vol. 12, no. 1, pp. 127-136", "authors": ["Peter Brown"]}, {"title": "ustralie-France: vision commune", "year": "2009", "source": "in Loïc Hervouet (ed.), L'Année Francophone Internationale 2009, CIDEF-AFI, Quebec, Canada, pp. 295-296", "authors": ["Peter Brown"]}, {"title": "La Nouvelle-Calédonie : trouble-fête du Pacifique ou site de l", "year": "2009", "source": "entendement interculturel franco-australien ? Le cas de Noumea' (New Caledonia: Pacific troublemaker' or site of French-Australian intercultural understanding? The case of Noumea')in Salhia Ben-Messahel (ed.), Des frontières de l'interculturalité: Etude pluridisciplinaire de la représentation culturelle : Identité et Altérité, Presses Universitaires du Septentrion, France, pp. 55-68", "authors": ["Peter Brown"]}, {"title": "Book Review: Littératures d", "year": "2008", "source": "émergence et mondialisationby Sonia Faessel and Michel Perez', International Journal of Francophone Studies, vol. 11, pp. 243-246", "authors": ["Peter Brown"]}, {"title": "Colonisation française et littérature du Pacifique: le cas de la Nouvelle-Zélande", "year": "2008", "source": "in Frederic Angleviel and Stephen Levine (ed.), New Zealand - New Caledonia: Neighbours, Friends, Partners, Victoria University Press, Wellington, New Zealand, pp. 317-336", "authors": ["Peter Brown"]}, {"title": "Les Dieux sont borgnes et la question de l", "year": "2008", "source": "histoire (The Gods are one-eyed and the question of history)'in Eddy Wadrawane and Frédéric Angleviel (ed.), La Nouvelle-Calédonie: Les Kanaks et l'histoire, Les Indes Savantes, Paris, France, pp. 87-103", "authors": ["Peter Brown"]}, {"title": "Les événements de Nouvelle-Calédonie et les relations franco-australiennes: représentations littéraires et discours de légitimation (The New Caledonian events and French-Australian relations: Literary representations and discourse of legitimation)", "year": "2008", "source": "in Sylvette Boubin-Boyer (ed.), Révoltes, conflits et Guerres mondiales en Nouvelle-Calédonie et dans sa région, L'Harmattan, Paris, France, pp. 173-190", "authors": ["Peter Brown"]}, {"title": "Mémoire et identité nationale: la guerre des histoires en Australie (Memoirs and national identity: the historical wars in Australia)", "year": "2008", "source": "in P. Blanchard, M. Ferro and I.Veyrat-Masson (ed.), Hermes: Les Guerres de Mémoires dans le Monde, CNRS Editions, Paris, France, pp. 133-138", "authors": ["Peter Brown"]}, {"title": "Récit fondateur et culture politique en Nouvelle-Calédonie.", "year": "2008", "source": "Tea Kanake'de Mélanésia 2000 au Festival des Arts du Pacifique (1975-2000)', International Journal of Francophone Studies, vol. 11, no. 4, pp. 539-557", "authors": ["Peter Brown"]}, {"title": "rt History. Art as History New Caledonian Women Artists in Dialogue on the Eve of the Noumea Accord", "year": "2007", "source": "in Frédéric Angleviel (ed.), Histoire de la Nouvelle-Calédonie: Approches croisées, Les Indes Savantes, Paris, pp. 105-113", "authors": ["Peter Brown"]}, {"title": "La mémoire comme connaissance et la connaissance comme mémoire Complémentarité de l", "year": "2007", "source": "oralité et de l'écriture chez Déwé Gorodé (Nouvelle-Calédonie) (Memory as knowledge and knowledge as memory: the complimentarity of oral and written traditions in the work'in Jean-François de Raymond, Isabelle Collombat et Loïc Hervouet (ed.), Alexandrie, métaphore de la francophonie: La transmission des connaissances, des savoirs et des cultures, l'Université Catholique de l'Ouest, Paris, pp. 211-216", "authors": ["Peter Brown"]}, {"title": "L", "year": "2007", "source": "Australie: politique et économiehistoire et culture', in Loïc Hervouet (ed.), L'Année Francophone Internationale 2007, CIDEF-AFI, Quebec, Canada, pp. 324-325", "authors": ["Peter Brown"]}, {"title": "Book Review: Violences Oceaniennes", "year": "2006", "source": "Journal of Pacific History, vol. 41, no. 1, pp. 118-119", "authors": ["Peter Brown"]}, {"title": "ustralia as an \"Island Home\" on Stage and Screen. Radiance (Louis Nowra, Rachel Perkins) as Intertextual Metaphor", "year": "2006", "source": "in Louise Maurer and Roger Hillman (ed.), Reading Images, Viewing Texts: Lire les images, voir les textes. Crossdisciplinary Perspectives, Perspectives pluridisciplinaires, Peter Lang Publishing Group, Bern, pp. 183-202", "authors": ["Peter Brown"]}, {"title": "Books, writing and cultural politics in the Pacific: the New Caledonian Salon du livre, October 2003-October 2005", "year": "2006", "source": "International Journal of Francophone Studies, vol. 9, no. 2, pp. 239-256", "authors": ["Peter Brown"]}, {"title": "Conference Report: The 11th Sommet de la Francophonie, Bucharest, Romania, 27-29 September 2006: The Senghor Centenary and the rise of...Europe", "year": "2006", "source": "International Journal of Francophone Studies, vol. 9, no. 3, pp. 415-421", "authors": ["Peter Brown"]}, {"title": "Désir indésirable au Paradis: Représentations littéraires de l", "year": "2006", "source": "autre en Nouvelle-Calédonie (Undesirable desire in Paradise: Literary representations of the Other in New Caledonia)'Dialogos: problemi dell'istruzione e della ricerca scientifica, vol. 13, pp. 65-74", "authors": ["Peter Brown"]}, {"title": "Rokonok/Relations", "year": "2006", "source": "Film InternationalIssue 21, Vol. 4, No. 3, pp. 85-87", "authors": ["Peter Brown"]}, {"title": "The Geopolitics of French Language and Culture and \"La Francophonie\"", "year": "2005", "source": "CESAA Review-Contemporary European Studies Association of Australia, vol. 33, pp. 42-57", "authors": ["Peter Brown"]}, {"title": "From place to space: Australian culture from My place to the Plains of promise and the Sydney Olympics", "year": "2005", "source": "in Hamid Mokaddem (ed.), Eleven approaches to Culture and Nature in the South Pacific, Cultural Affairs Programme, Noumea, Noumea, pp. 147-161", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "2005", "source": "in Michel Tétu (ed.), L'Année Francophone Internationale: Le point sur l'espace francophone, l'Université Catholique de l'Ouest, Canada, pp. 293-295", "authors": ["Peter Brown"]}, {"title": "From", "year": "2005", "source": "Beyrouth' to Déroute'? Some reflections on the 10th Sommet de la FrancophonieOuagadougou, Burkina Faso, 25-26 November 2004', International Journal of Francophone Studies, vol. 8, no. 1, pp. 93-103", "authors": ["Peter Brown"]}, {"title": "From exclusion and alienation to a", "year": "2005", "source": "multi-racial community': The image of the métis in New Caledonian literature'International Journal of Francophone Studies, vol. 8, no. 3, pp. 305-320", "authors": ["Peter Brown"]}, {"title": "Jouer et déjouer les stéréotypes dans le théâtre calédonien: l", "year": "2005", "source": "exemple de \"V\" d'Anne Bihan (Performing and deconstructing sterotypes in New Caledonian theatre: the example of \"V\" by Anne Bihan)'in Véronique Fillol et Jacques Vernaudon (ed.), Stéréotypes et représentations en Océanie, Corail, Noumea, pp. 271-287", "authors": ["Peter Brown"]}, {"title": "LAustralie: LAmitie contre la discorde", "year": "2004", "source": "in Michel Tetu (ed.), L'Annee Francophone Internationale 2004, Agence de la Francophonie, Quebec City, pp. 294-296", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "2004", "source": "in Michel Tetu (ed.), L'Année Francophone Internationale 2004, Agence de la Francophonie, Quebec City, pp. 294-296", "authors": ["Peter Brown"]}, {"title": "Endnotes", "year": "2004", "source": "in Peter Brown (ed.), Selected Short Fiction of Dewe Gorodé: The Kanak Apple Season, Pandanus Books, Canberra, pp. 195-226", "authors": ["Peter Brown"]}, {"title": "Introduction", "year": "2004", "source": "in Peter Brown (ed.), Selected Short Fiction of Déwé Gorodé: The Kanak Apple Season, Pandanus Books, Canberra, pp. ix-xxxix", "authors": ["Peter Brown"]}, {"title": "Introduction", "year": "2004", "source": "in Raylene Ramsay and Deborah Walker (ed.), Selected Poems of Déwé Gorodé: Sharing as Custom Provides, Pandanus Books, Canberra, pp. ix-xliv", "authors": ["Peter Brown"]}, {"title": "La place des enfants dans la littérature d", "year": "2004", "source": "Australie et de Nouvelle-Calédonie: quelques réflexions sur un thème préoccupant (The place of children in the literature of Australia and New Caledonia: some reflections on a disturbing subject)'in Sonia Faessel and Michel Pérez (ed.), Littératures d'émergence et mondialisation, In Press Editions, Paris, pp. 213-234", "authors": ["Peter Brown"]}, {"title": "Selected Short Fiction of Déwé Gorodé: The Kanak Apple Season", "year": "2004", "source": "Pandanus BooksCanberra", "authors": ["Peter Brown", "ed"]}, {"title": "New Caledonia: An Emerging Literature as Social Project", "year": "2003", "source": "in Salhi, K. (ed.), Francophone Post Colonial Cultures, Lexington Books, USA, pp. 345-355", "authors": ["Peter Brown"]}, {"title": "Le Dialogue des cultures and the Ninth Sommet de la Francophonie (Beirut, 18-20 October 2002)", "year": "2003", "source": "International Journal of Francophone Studies, vol. 6, no. 1, pp. 53-58", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "2003", "source": "in Michel Tetu (ed.), L'Année Francophone Internationale 2003, Agence de la Francophonie, Quebec City, pp. 314-315", "authors": ["Peter Brown"]}, {"title": "De My Place (Talahue) aux Plains of Promise (Plaines de l", "year": "2003", "source": "espoir) et aux Jeux Olympiques: cultures de la nature dénaturée en Australie'in Mokaddem, H. (ed.), Approches autour de culture et nature dans le Pacifique Sud, Expressions, Noumea, pp. 319-337", "authors": ["Peter Brown"]}, {"title": "French in Australia: Policies and Practices", "year": "2002", "source": "in Kamal Salhi (ed.), French in and out of Australia: Language Policies, Intercultural Antagonisms and Dialogue, Peter Lang Publishing Group, Bern, pp. 266-290", "authors": ["Peter Brown", "Crozet C", "Maurer L"]}, {"title": "Nature, Culture and the Noumea Accord. The CORAIL Conference on Culture et Nature dans la Pacifique, New Caledonia, 3-6 December 2001", "year": "2002", "source": "International Journal of Francophone Studies, vol. 4, no. 3, pp. 183-189", "authors": ["Peter Brown"]}, {"title": "La Dernière Mode ou le premier mode de Mallarmé", "year": "2002", "source": "in Jill Anderson (ed.), Australian Divagations: Mallarmé and the 20th Century, Peter Lang Publishing Group, New York, pp. 182-205", "authors": ["Peter Brown"]}, {"title": "L", "year": "2002", "source": "Enfant chez Henri Lopes (Congo): Il n'y a pas d'orphelin en Afrique'Mots Pluriels, vol. 22, no. September 2002, pp. 1-9", "authors": ["Peter Brown"]}, {"title": "Report of the Tenth Anniversary Conference, L", "year": "2002", "source": "Année Francophone InternationaleParis, 17-20 May 2001', International Journal of Francophone Studies, vol. 4, no. 3, pp. 178-182", "authors": ["Peter Brown"]}, {"title": "The Political Economy of the Asia-Pacific Region-States, Markets and Civil Society in Asia Pacific", "year": "2001", "source": "China Perspectives, pp. 76-77", "authors": ["Peter Brown"]}, {"title": "Law Making in the Peoples Republic of China", "year": "2001", "source": "China Perspectives, vol. tba, pp. 80-82", "authors": ["Peter Brown"]}, {"title": "The Rain Blows Up a Storm in Paris", "year": "2001", "source": "p. 12", "authors": ["Peter Brown"]}, {"title": "Encountering Chinese Networks-Western, Japanese and Chinese Corporations in China, 1880-1937", "year": "2001", "source": "China Perspectives, vol. tba, pp. 74-75", "authors": ["Peter Brown"]}, {"title": "The Privatisation of Education in China", "year": "2001", "source": "China Perspectives, vol. tba, pp. 27-34", "authors": ["Peter Brown"]}, {"title": "Rodin: Sculpture and Drawings", "year": "2001", "source": "National Gallery of AustraliaCanberra, Australia", "authors": ["Peter Brown"]}, {"title": "New Caledonia: A Pacific Island or an Island in the Pacific? The Eighth Pacific Arts Festival", "year": "2001", "source": "International Journal of Francophone Studies, vol. 4, no. 1, pp. 33-41", "authors": ["Peter Brown"]}, {"title": "L", "year": "2001", "source": "Australie'in Tetu, Michel (ed.), L'Annee Francophone Internationale 2002, Bibliotheque nationale du Quebec, Bibliotheque nationale du Canada, Quebec, pp. tba", "authors": ["Peter Brown"]}, {"title": "caccia dell", "year": "2000", "source": "immigrato perfetto'in Mauro De Bonis (ed.), Australia L'occidente agli antipodi, Gruppo editoriale l'espresso, Rome, Italy, pp. 94-95", "authors": ["Peter Brown"]}, {"title": "Nel paese dei paradossi (In the country of the paradox)", "year": "2000", "source": "in Mauro De Bonis (ed.), Australia L'occidente agli antipodi, Gruppo editoriale l'espresso, Rome, Italy, pp. 121-127", "authors": ["Peter Brown"]}, {"title": "Mwa Vee: Kanak cultural review - Living Heritage Kanak Culture Today", "year": "2000", "source": "Special Issue", "authors": ["Peter Brown", "ed"]}, {"title": "Parlez-vous francais? VIIIth Sommet de la Francophonie (Moncton, Canada, 3-5 September 1999)", "year": "1999", "source": "International Journal of Francophone Studies, vol. 2, no. 2/10/99, pp. 188-191", "authors": ["Peter Brown"]}, {"title": "Parlez-vous francais? VIIIth Sommet de la Francophonie (Moncton, Canada, 3-5 September 1999)", "year": "1999", "source": "International Journal of Francophone Studies, vol. 2, no. 2/10/99, pp. 188-191", "authors": ["Peter Brown"]}, {"title": "Kakadu en Australie - Reponse du Gouvernement Australien au Comit du Patrimoine Mondial de LUnesco concernant le Parc National de Kakadu", "year": "1999", "source": "Australian Government Publishing ServiceCanberra", "authors": ["Peter Brown"]}, {"title": "l", "year": "1999", "source": "écoute de Nicolas Kurtovitch'Mots Pluriels, vol. 10, no. May, pp. n/a", "authors": ["Peter Brown"]}, {"title": "Stéphane Mallarmé and the Artist as Celebrant of Cultural Transformation", "year": "1999", "source": "in T O'Neill (ed.), From Baudelaire to Bonnefoy and Beyond: Australian Essays on Modern and Contemporary French Poetry, Monash University Publishing, Melbourne, pp. 14-26", "authors": ["Peter Brown"]}, {"title": "L", "year": "1999", "source": "enseignement a distance en Australie: Au-dela de le'enjeu geographique'Revue internationale d'education, vol. 23, pp. 141-147", "authors": ["Peter Brown", "Crozet C", "Trevitt A"]}, {"title": "New Caledonia: Strangers in Paradise, Stranger than Paradise", "year": "1998", "source": "International Journal of Francophone Studies, vol. 1, no. 3, pp. 125-139", "authors": ["Peter Brown"]}, {"title": "Mallarmé et l", "year": "1998", "source": "écriture en mode mineurLettres modernes Minard, Paris", "authors": ["Peter Brown"]}, {"title": "ustralie", "year": "1998", "source": "in Michel Tétu (ed.), L'Année Francophone Internationale 1998, AFI, Quebec Canada, pp. 282-285", "authors": ["Peter Brown"]}, {"title": "Déwé Gorodé Utê Mûrûnû, petite fleur de cocotier", "year": "1998", "source": "in Notre Librairie, Vol. 134, CLEF, Paris, pp. 103-104", "authors": ["Peter Brown", "ed"]}]}, "Microsoft-Academic": [{"title": "sundials suite of nonlinear and differential algebraic equation solvers", "year": 2005, "source": "acm transactions on mathematical software", "authors": [{"name": "alan c hindmarsh", "affiliation": "lawrence livermore national laboratory"}, {"name": "peter brown", "affiliation": "lawrence livermore national laboratory"}, {"name": "k e grant", "affiliation": "lawrence livermore national laboratory"}, {"name": "steven l lee", "affiliation": "lawrence livermore national laboratory"}, {"name": "radu serban", "affiliation": "lawrence livermore national laboratory"}, {"name": "dan e shumaker", "affiliation": "lawrence livermore national laboratory"}, {"name": "carol s woodward", "affiliation": "lawrence livermore national laboratory"}], "id": 163326656}, {"title": "reference model for service oriented architecture 1 0", "year": 2006, "source": "", "authors": [{"name": "c matthew mackenzie"}, {"name": "ken laskey"}, {"name": "francis g mccabe"}, {"name": "peter brown"}, {"name": "rebekah metz"}]}, {"title": "adaptive deep brain stimulation in advanced parkinson disease", "year": 2013, "source": "annals of neurology", "authors": [{"name": "simon little", "affiliation": "john radcliffe hospital"}, {"name": "a pogosyan"}, {"name": "spencer neal"}, {"name": "baltazar zavala"}, {"name": "ludvic zrinzo"}, {"name": "marwan hariz"}, {"name": "thomas foltynie"}, {"name": "patricia limousin"}, {"name": "keyoumars ashkan"}, {"name": "james j fitzgerald"}, {"name": "alexander l green"}, {"name": "tipu z aziz"}, {"name": "peter brown"}], "id": 114530997}, {"title": "the ppars from orphan receptors to drug discovery", "year": 2000, "source": "journal of medicinal chemistry", "authors": [{"name": "timothy m willson", "affiliation": "research triangle park"}, {"name": "peter brown", "affiliation": "glaxosmithkline"}, {"name": "daniel d sternbach", "affiliation": "glaxosmithkline"}, {"name": "brad r henke", "affiliation": "glaxosmithkline"}], "id": 162030435}, {"title": "the ppars from orphan receptors to drug discovery", "year": 2000, "source": "cheminform", "authors": [{"name": "timothy m willson", "affiliation": "research triangle park"}, {"name": "peter brown", "affiliation": "research triangle park"}, {"name": "daniel d sternbach", "affiliation": "research triangle park"}, {"name": "brad r henke", "affiliation": "research triangle park"}], "id": 41354064}, {"title": "the promise and peril of chemical probes", "year": 2015, "source": "nature chemical biology", "authors": [{"name": "c h arrowsmith", "affiliation": "princess margaret cancer centre"}, {"name": "c h arrowsmith", "affiliation": "structural genomics consortium"}, {"name": "james e audia"}, {"name": "christopher m austin", "affiliation": "national institutes of health"}, {"name": "jonathan b baell", "affiliation": "monash university"}, {"name": "j a bennett", "affiliation": "merck co"}, {"name": "julian blagg", "affiliation": "institute of cancer research"}, {"name": "c bountra", "affiliation": "structural genomics consortium"}, {"name": "paul brennan", "affiliation": "university of oxford"}, {"name": "paul brennan", "affiliation": "structural genomics consortium"}, {"name": "peter brown", "affiliation": "structural genomics consortium"}, {"name": "mark e bunnage", "affiliation": "pfizer"}, {"name": "carolyn buserdoepner", "affiliation": "glaxosmithkline"}, {"name": "robert m campbell", "affiliation": "eli lilly and company"}, {"name": "adrian carter", "affiliation": "boehringer ingelheim"}, {"name": "philip cohen", "affiliation": "university of dundee"}, {"name": "robert a copeland"}, {"name": "ben cravatt", "affiliation": "scripps research institute"}, {"name": "jayme l dahlin", "affiliation": "mayo clinic"}, {"name": "dashyant dhanak", "affiliation": "janssen pharmaceutica"}, {"name": "a m edwards", "affiliation": "structural genomics consortium"}, {"name": "mathias frederiksen", "affiliation": "novartis"}, {"name": "stephen v frye", "affiliation": "university of north carolina at chapel hill"}, {"name": "nathanael s gray", "affiliation": "harvard university"}, {"name": "charles e grimshaw", "affiliation": "takeda pharmaceutical company"}, {"name": "david hepworth", "affiliation": "pfizer"}, {"name": "trevor howe", "affiliation": "janssen pharmaceutica"}, {"name": "k huber", "affiliation": "austrian academy of sciences"}, {"name": "jian jin", "affiliation": "icahn school of medicine at mount sinai"}, {"name": "s knapp", "affiliation": "university of oxford"}, {"name": "s knapp", "affiliation": "structural genomics consortium"}, {"name": "joanne kotz", "affiliation": "broad institute"}, {"name": "ryan g kruger", "affiliation": "glaxosmithkline"}, {"name": "derek b lowe", "affiliation": "vertex pharmaceuticals"}, {"name": "mary margaret mader", "affiliation": "eli lilly and company"}, {"name": "brian d marsden", "affiliation": "structural genomics consortium"}, {"name": "anke muellerfahrnow", "affiliation": "bayer healthcare pharmaceuticals"}, {"name": "susanne muller", "affiliation": "university of oxford"}, {"name": "susanne muller", "affiliation": "structural genomics consortium"}, {"name": "ronan c ohagan", "affiliation": "merck co"}, {"name": "john p overington", "affiliation": "european bioinformatics institute"}, {"name": "dafydd r owen", "affiliation": "pfizer"}, {"name": "saul h rosenberg"}, {"name": "ruth a ross", "affiliation": "university of toronto"}, {"name": "bryan l roth", "affiliation": "university of north carolina at chapel hill"}, {"name": "matthieu schapira", "affiliation": "university of toronto"}, {"name": "matthieu schapira", "affiliation": "structural genomics consortium"}, {"name": "stuart l schreiber", "affiliation": "broad institute"}, {"name": "brian k shoichet", "affiliation": "university of california san francisco"}, {"name": "m sundstrom", "affiliation": "karolinska university hospital"}, {"name": "m sundstrom", "affiliation": "structural genomics consortium"}, {"name": "giulio supertifurga", "affiliation": "medical university of vienna"}, {"name": "giulio supertifurga", "affiliation": "austrian academy of sciences"}, {"name": "jack taunton", "affiliation": "university of california san francisco"}, {"name": "leticia toledosherman", "affiliation": "chdi foundation"}, {"name": "chris walpole", "affiliation": "structural genomics consortium"}, {"name": "michael a walters", "affiliation": "university of minnesota"}, {"name": "timothy m willson", "affiliation": "university of north carolina at chapel hill"}, {"name": "paul workman", "affiliation": "institute of cancer research"}, {"name": "robert n young", "affiliation": "simon fraser university"}, {"name": "william j zuercher", "affiliation": "university of north carolina at chapel hill"}], "id": 51309854}, {"title": "pathological synchronization in parkinson s disease networks models and treatments", "year": 2007, "source": "trends in neurosciences", "authors": [{"name": "constance hammond", "affiliation": "aix marseille university"}, {"name": "hagai bergman", "affiliation": "hebrew university of jerusalem"}, {"name": "peter brown"}], "id": 114966740}, {"title": "fatty acids and eicosanoids regulate gene expression through direct interactions with peroxisome proliferator activated receptors α and γ", "year": 1997, "source": "proceedings of the national academy of sciences of the united states of america", "authors": [{"name": "steven a kliewer"}, {"name": "scott s sundseth"}, {"name": "stacey a jones"}, {"name": "peter brown"}, {"name": "g bruce wisely"}, {"name": "cecilia s koble"}, {"name": "pallavi r devchand"}, {"name": "walter wahli"}, {"name": "timothy m willson"}, {"name": "james m lenhard"}, {"name": "jurgen m lehmann"}], "id": 125754415}, {"title": "healthy nature healthy people contact with nature as an upstream health promotion intervention for populations", "year": 2006, "source": "health promotion international", "authors": [{"name": "cecily maller", "affiliation": "deakin university"}, {"name": "mardie townsend", "affiliation": "deakin university"}, {"name": "anita pryor", "affiliation": "deakin university"}, {"name": "peter brown", "affiliation": "deakin university"}, {"name": "lawrence st leger", "affiliation": "deakin university"}], "id": 94746221}, {"title": "a new small bodied hominin from the late pleistocene of flores indonesia", "year": 2004, "source": "nature", "authors": [{"name": "peter brown", "affiliation": "university of new england"}, {"name": "thomas sutikna"}, {"name": "michael j morwood", "affiliation": "university of new england"}, {"name": "r p soejono"}, {"name": "jatmiko"}, {"name": "e wayhu saptomo"}, {"name": "rokus awe due"}], "id": 137773608}], "ANDS-Grants": [{"description": "Deep brain stimulation is an established therapy for Parkinson's disease when patients&rsquo; symptoms cannot be controlled adequately using medication. Although deep brain stimulation usually improves quality of life significantly, existing devices have shortcomings that often result in poor symptom alleviation and/or undesirable side-effects. This project is aimed at developing an innovative system that automatically adjusts stimulation according to the continually fluctuating needs of each patient.", "title": "Closed-loop deep brain stimulation: Optimising treatment of Parkinson’s disease using adaptive stimulation", "id": "662662", "institutions": ["University of Melbourne"], "key": "http://purl.org/au-research/grants/nhmrc/1103238", "researchers": ["Prof Hugh Mcdermott", "Prof Peter Brown", "Dr Thushara Perera", "Dr Arthur Thevathasan", "Dr Kristian Bulluss"], "status": "active", "fundingAmount": 748351.2, "fundingScheme": "Project Grants", "startDate": 2016, "endDate": 2019, "dateTimeModified": "2018-03-07T07:53:11Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["University of Melbourne"], "principalInvestigator": ["Dr Arthur Thevathasan"], "purl": "http://purl.org/au-research/grants/nhmrc/1103238", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1103238", "1103238"], "subjects": ["Central Nervous System", "MEDICAL AND HEALTH SCIENCES", "NEUROSCIENCES", "Parkinson disease", "neuromodulation", "parkinsonism", "neurosurgery", "implant design"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/662662"}]}, {"description": "Deep brain stimulation is an established therapy for Parkinson's disease when patients&rsquo; symptoms cannot be controlled adequately using medication. Although deep brain stimulation usually improves quality of life significantly, existing devices have shortcomings that often result in poor symptom alleviation and/or undesirable side-effects. This project is aimed at developing an innovative system that automatically adjusts stimulation according to the continually fluctuating needs of each patient.", "title": "Closed-loop deep brain stimulation: Optimising treatment of Parkinson’s disease using adaptive stimulation", "id": "1346270", "key": "http://purl.org/au-research/grants/nhmrc/GNT1103238", "researchers": ["Dr Thushara Perera", "Prof Peter Brown", "Prof Hugh McDermott", "Dr Arthur Thevathasan", "Dr Kristian Bulluss"], "institutions": null, "status": "active", "fundingAmount": 726177, "fundingScheme": "Project Grants", "startDate": 2016, "endDate": null, "dateTimeModified": "2019-06-03T04:23:23Z", "dateTimeCreated": "2018-10-03T01:49:43Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Dr Arthur Thevathasan"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1103238", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1103238", "GNT1103238"], "subjects": ["Clinical Medicine and Science", "parkinson disease | neuromodulation | parkinsonism | neurosurgery | implant design"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1346270"}]}, {"description": "This project aims to expand the Desert Fireball Network (DFN) and build a Global Fireball Observatory. Nearly everything known about the origin and evolution of the solar system comes from analysis of meteorite falls, but scientists have almost no constraint on where they come from. This project will address this constraint by tracking hundreds of meteorite falls, and pinpointing each one&rsquo;s origin in the solar system. Benefits include capitalising on the innovations and technologies that underpinned the DFN, and leveraging a NASA partnership for administrative support and advanced instrumentation development. Tracking for space situational awareness is also expected to benefit Australian national security.", "title": "Linkage Infrastructure, Equipment and Facilities - Grant ID: LE170100106", "id": "945166", "institutions": ["Curtin University of Technology"], "key": "http://purl.org/au-research/grants/arc/LE170100106", "researchers": ["Prof Philip Bland", "Prof Trevor Ireland", "A/Prof Tracy Rushmer", "A/Prof Jonathan Horner", "A/Prof Gretchen Benedix", "Dr Andrew Tomkins", "Dr Jean-Pierre Macquart", "A/Prof Hasnaa Chennaoui", "Dr Gareth Collins", "Prof Peter Brown", "Dr Peter Jenniskens", "Prof Dr Christopher Herd", "Prof Timothy Swindle", "Dr Yvonne Pendleton"], "status": "active", "fundingAmount": 780000, "fundingScheme": "Linkage Infrastructure, Equipment and Facilities", "startDate": 2017, "endDate": 2018, "dateTimeModified": "2018-10-02T04:21:29Z", "dateTimeCreated": "2017-07-04T23:45:08Z", "funder": ["Australian Research Council"], "managingInstitution": ["Curtin University of Technology"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LE170100106", "identifiers": ["http://purl.org/au-research/grants/arc/LE170100106", "LE170100106"], "subjects": ["GEOLOGY", "EARTH SCIENCES"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/945166"}]}]}