{"ANU": {"name": "Peter Solomon", "link": "https://researchers.anu.edu.au/researchers/solomon-px", "colleges": "College of Science", "email": "peter.solomon@anu.edu.au", "phone": "", "expertise": ["Plant Pathology", "Post Harvest Horticultural Technologies Incl. Transportation And Storage", "Plant Physiology", "Plant Cell And Molecular Biology", "Proteomics And Intermolecular Interactions Excl. Medical Proteomics", "Microbial Genetics", "Analytical Biochemistry", "Mycology", "Plant Biology", "Oenology And Viticulture", "Population Ecological And Evolutionary Genetics", "Biochemistry And Cell Biology", "Microbiology"], "interest": ["Fungal diseases of wheat threaten global food securityFungal diseases are the cause of millions of tonnes in yield losses each on farms around the world. This is serious issue not only in terms of financial losses, but also when considering food security and stability. As an example, the Table below outlines losses on Australian wheat farms to disease. The top 4 diseases in terms of losses are caused by fungal pathogens (based on 2008 prices). Using today's wheat prices, the losses from fungi in Australia exceed $1 billion dollars, and that is using effective control measures; without these losses would exceed $5 billion dollars. Thus there are many good reasons to better understand how these pathogens cause disease!Wheat Disease$/ha AUDTotal losses($M AUD)yellow spot17.82212stripe rust10.62127septoria nodorum blotch9.07108crown rot6.6379Pratylenchus neglectus6.1373Total losses from others26.37314Total present loss76.94913                            How do these pathgoens cause disease?Our laboratory focuses on two significant pathogens of wheat. Stagonospora nodorum is a fungus that causes leaf and glume blotch disease on wheat (septoria nodorum blotch). This disease causes greater than $100 million dollars in yield losses per annum in Australia alone and has been recently ranked as the third most important disease of wheat in this country. Traditional breeding methods for disease controls have only been partially successful at best and new and innovative anti-fungal strategies are required to prevent disease and secure Australian and global wheat supplies in the future.Not only is S. nodorum a threat to global food security, its also extremely interesting and versatile to work with! S. nodorum can be cultured in the lab and is amenable to many common genetic techniques such as targeted gene disruption and gene overexpression. The genome sequence has been completed and extensive proteomics and metabolomics resources have been developed making S. nodorum a perfect model pathogen to better understand plant-pathogen interactions.                        The second wheat pathogen we study in the lab is Zymoseptoria tritici. Z. tritici is the most important pathogen of wheat in Europe, the region that produces one-fifth of the world's wheat supply. Zymospetoria tritici is a fungal pathogen of wheat related to Stagonospora nodorum, and is the causal agent of the most important wheat disease in Europe (septoria tritici blotch). This single disease alone is responsible for greater than $1 billion dollars in losses each year. The disease is particualrly problematic in that natural sources of resistance are difficult to source and the pathogen is very adept at rapidly evolving fungicide resistance. Interestingly, the disease isn't currently a major problem in Australia. There are many postualted reasons for this including the possibility that European isolates of the pathogen have evolved to be more aggressive. Fortuantely, Australian quaratine has prevented these isolates from entering Australia however the pathogen remains a serious biosecurity risk.Our lab is studying all aspects of the above diseases with a focus implementing this improved undersantding to facilitate new and novel disease management strategies. Fungi synthesize an amazing range of novel and active compounds!Another research area in the lab is focused on understadning fungal secondary metabolism and idenitfying novel metabolites. Fungal secondary metabolites are amongst the biologically active compunds on the earth and are part of our dailey lives, for good or bad ... . For example, its almost impossible to count how many lives penicillin has saved. More recently, statin-based drugs have an enourmous impact of many peoples lives in terms of cholesterol control. However, not all these compounds are benenfical. Many fungi produce compounds that are lethal. Aflatoxin is the worst carcinogenic toxin produced in nature whilst a variety of palant pathogenic fungi produce mycotoxins that render the plant useless to eat (for humans or animals). And who can forget death cap mushrooms!Our lab has multiple projects available from everything including determining the relevance of these secondary metabolite compounds on plant disease to isolating new compounds as novel bioactives."], "biography": "", "project": ["", ""], "publication": [{"title": "Transposon-Mediated Horizontal Transfer of the Host-Specific Virulence Protein ToxA between Three Fungal Wheat Pathogens", "year": "2019", "source": "mBio, vol. 10, no. 5, pp. 1-22", "authors": ["McDonald M", "Taranto A", "Hill E", "Peter Solomon"]}, {"title": "Have we finally opened the door to understanding Septoria tritici blotch disease in wheat?", "year": "2017", "source": "New Phytologist, vol. 214, no. 2, pp. 493-495", "authors": ["Peter Solomon"]}, {"title": "Production of small cysteine-rich effector proteins in Escherichia coli for structural and functional studies", "year": "2017", "source": "Molecular Plant Pathology, vol. 18, no. 1, pp. 141-151", "authors": ["Zhang X", "Nguyen N", "Breen S", "Peter Solomon"]}, {"title": "Fungal phytopathogens encode functional homologues of plant rapid alkalinisation factor (RALF) peptides", "year": "2017", "source": "Molecular Plant Pathology, vol. 18, no. 6, pp. 811-824", "authors": ["Thynne E", "Saur I", "Simbaqueba J", "Peter Solomon"]}, {"title": "Wheat PR-1 proteins are targeted by necrotrophic pathogen effector proteins", "year": "2016", "source": "The Plant Journal, vol. 88, no. 1, pp. 13-25", "authors": ["Breen S", "Williams S", "Winterberg B", "Peter Solomon"]}, {"title": "Differential effector gene expression underpins epistasis in a plant fungal disease", "year": "2016", "source": "The Plant Journal, vol. 87, no. 4, pp. 343-354", "authors": ["Phan H", "Rybak K", "Furuki E", "Peter Solomon"]}, {"title": "Wheat PR-1 proteins are targeted by necrotrophic pathogen effector proteins", "year": "2016", "source": "The Plant Journal, vol. 88, no. 1, pp. 13-25", "authors": ["Breen S", "Williams S", "Winterberg B", "Peter Solomon"]}, {"title": "Utilizing gene tree variation to identify candidate effector genes in Zymoseptoria tritici", "year": "2016", "source": "G3: Genes, Genomes, Genetics, vol. 6, no. 4, pp. 779-791", "authors": ["McDonald M", "McGinness L", "Hane J", "Peter Solomon"]}, {"title": "Production of small cysteine-rich effector proteins in Escherichia coli for structural and functional studies", "year": "2016", "source": "Molecular Plant Pathology, vol. online preprint, pp. (11 pp)", "authors": ["Zhang X", "Nguyen N", "Breen S  Williams SJ (", "Peter Solomon"]}, {"title": "Recent Advances in the Zymoseptoria tritici-wheat interaction: insights from pathogenomics", "year": "2015", "source": "Frontiers in Plant Science, vol. 6, no. 2015, pp. 102-102", "authors": ["McDonald M", "McDonald B", "Peter Solomon"]}, {"title": "Dissecting the role of G-protein signalling in primary metabolism in the wheat pathogen Stagonospora nodorum", "year": "2013", "source": "Microbiology (UK), vol. 159, no. PART 9, pp. 1972-1985", "authors": ["Gummer J", "Trengove R", "Oliver R", "Peter Solomon"]}, {"title": "The necrotrophic effector SnToxA induces the synthesis of a novel phytoalexin in wheat", "year": "2013", "source": "New Phytologist, vol. 200, no. 1, pp. 185-200", "authors": ["DuFall L", "Peter Solomon"]}, {"title": "Coverage and consistency: Bioinformatics aspects of the analysis of multirun iTRAQ experiments with wheat leaves", "year": "2013", "source": "Journal of Proteome Research, vol. 12, no. 11, pp. 4870-4881", "authors": ["Pascovici D", "Gardiner D", "Song X", "Peter Solomon"]}, {"title": "Characterising the Role of GABA and Its Metabolism in the Wheat Pathogen Stagonospora nodorum", "year": "2013", "source": "PLOS ONE (Public Library of Science), vol. 8, no. 11, pp. e78368-e78368", "authors": ["Mead O", "Thynne E", "Winterberg B", "Peter Solomon"]}, {"title": "Comparative Pathogenomics Reveals Horizontally Acquired Novel Virulence Genes in Fungi Infecting Cereal Hosts", "year": "2012", "source": "PLoS Pathogens, vol. 8, no. 9, pp. e1002952-e1002952", "authors": ["Gardiner D", "McDonald M", "Covarelli L", "Peter Solomon"]}, {"title": "The Cysteine Rich Necrotrophic Effector SnTox1 Produced by Stagonospora nodorum Triggers Susceptibility of Wheat Lines Harboring Snn1", "year": "2012", "source": "PLoS Pathogens, vol. 8, no. 1, pp. e1002467-e1002467", "authors": ["Liu Z", "Zhang Z", "Faris J", "Peter Solomon"]}, {"title": "functional genomics approach to dissect the mode of action of the Stagonospora nodorum effector protein SnToxA in wheat", "year": "2012", "source": "Molecular Plant Pathology, vol. 13, no. 5, pp. 467-482", "authors": ["Vincent D", "DuFall L", "Livk A", "Peter Solomon"]}, {"title": "Transcriptome analysis of Stagonospora nodorum: gene models, effectors, metabolism and pantothenate dispensability", "year": "2012", "source": "Molecular Plant Pathology, vol. 13, no. 6, pp. 531-545", "authors": ["Ipcho S", "Hane J", "Antoni E", "Peter Solomon"]}, {"title": "Proteomic Techniques for Plant-Fungal Interactions", "year": "2012", "source": "in Bolton, Melvin D.; Thomma, Bart P.H.J. (ed.), Plant Fungal Pathogens: Methods and Protocols, Humana Press, New York, pp. 75-96", "authors": ["Vincent D", "Tan K", "Cassidy L", "Peter Solomon"]}, {"title": "Metabolomics Protocols for Filamentous Fungi", "year": "2012", "source": "in Bolton, Melvin D.; Thomma, Bart P.H.J. (ed.), Plant Fungal Pathogens: Methods and Protocols, Humana Press, New York, pp. 237-254", "authors": ["Gummer J", "Krill C", "DuFall L", "Peter Solomon"]}, {"title": "The Cysteine Rich Necrotrophic Effector SnTox1 Produced by Stagonospora nodorum Triggers Susceptibility of Wheat Lines Harboring Snn1", "year": "2012", "source": "PLoS Pathogens, vol. 8, no. 1, pp. e1002467-e1002467", "authors": ["Liu Z", "Zhang Z", "Faris J", "Peter Solomon"]}, {"title": "Comparative Pathogenomics Reveals Horizontally Acquired Novel Virulence Genes in Fungi Infecting Cereal Hosts", "year": "2012", "source": "PLoS Pathogens, vol. 8, no. 9, pp. e1002952-e1002952", "authors": ["Gardiner D", "McDonald M", "Covarelli L", "Peter Solomon"]}, {"title": "comparative analysis of the heterotrimeric G-protein GÎ±, GÎ² and GÎ³ subunits in the wheat pathogen Stagonospora nodorum", "year": "2012", "source": "BMC Microbiology, vol. 12, pp. 131-131", "authors": ["Gummer J", "Trengove R", "Oliver R", "Peter Solomon"]}, {"title": "Influence of geographic origin on the sensory characteristics and wine composition of Vitis vinifera cv. Cabernet Sauvignon wines from Australia", "year": "2012", "source": "American Journal of Enology and Viticulture, vol. 63, no. 4, pp. 467-476", "authors": ["Robinson A", "Adams D", "Boss P", "Peter Solomon"]}, {"title": "Stagonospora nodorum: From Pathology to Genomics and Host Resistance", "year": "2012", "source": "Annual Review of Phytopathology, vol. 50, no. Epub 2012 May 1, pp. 23-43", "authors": ["Oliver R", "Friesen T", "Faris J", "Peter Solomon"]}, {"title": "ssessing the mycotoxigenic threat of necrotrophic pathogens of wheat", "year": "2011", "source": "Mycotoxin Research, vol. 27, no. 4, pp. 231-237", "authors": ["Peter Solomon"]}, {"title": "The relationship between sensory attributes and wine composition for Australian Cabernet Sauvignon wines", "year": "2011", "source": "Australian Journal of Grape and Wine Research, vol. 17, no. 3, pp. 327-340", "authors": ["Robinson A", "Adams D", "Boss P", "Peter Solomon"]}, {"title": "Role of Cereal Secondary Metabolites Involved in Mediating the Outcome of Plant-Pathogen Interactions", "year": "2011", "source": "Metabolites, vol. 1, no. 1, pp. 64-78", "authors": ["DuFall L", "Peter Solomon"]}, {"title": "Influence of Yeast Strain, Canopy Management, and Site on the Volatile Composition and Sensory Attributes of Cabernet Sauvignon Wines from Western Australia", "year": "2011", "source": "Journal of Agricultural and Food Chemistry, vol. 59, no. 7, pp. 3273-3284", "authors": ["Robinson A", "Boss P", "Heymann H", "Peter Solomon"]}, {"title": "Development of a sensitive non-targeted method for characterizing the wine volatile profile using headspace solid-phase microextraction comprehensive two-dimensional gas chromatography time-of-flight mass spectrometry", "year": "2011", "source": "Journal of Chromatography A, vol. 1218, no. 3, pp. 504-517", "authors": ["Robinson A", "Boss P", "Heymann H", "Peter Solomon"]}, {"title": "Photochemical characterization of a novel fungal rhodopsin from Phaeosphaeria nodorum", "year": "2011", "source": "Biochimica et Biophysica Acta: Bioenergetics, vol. 1807, no. 11, pp. 1457-1466", "authors": ["Fan Y", "Peter Solomon", "Oliver R"]}, {"title": "ssessing the Influence of Site on Wine Composition and Sensory Characteristics of Cabernet Sauvignon", "year": "2010", "source": "American Journal of Enology and Viticulture, vol. 61, no. 3, pp. 430A-431A", "authors": ["Robinson A", "Boss P", "Heymann H", "Peter Solomon"]}, {"title": "Ubiquity of ToxA and absence of ToxB in Australian populations of Pyrenophora tritici-repentis", "year": "2010", "source": "Australasian Plant Pathology, vol. 39, no. 1, pp. 63-68", "authors": ["Antoni E", "Rybak K", "Tucker M", "Peter Solomon"]}, {"title": "Pathogen effectors shed light on plant diseases", "year": "2010", "source": "Functional Plant Biology, vol. 37, no. 10, pp. iii - iv", "authors": ["Peter Solomon", "Rathjen J"]}, {"title": "New developments in pathogenicity and virulence of necrotrophs", "year": "2010", "source": "Current Opinion in Plant Biology, vol. 13, no. 4, pp. 415-419", "authors": ["Oliver R", "Peter Solomon"]}, {"title": "Effect of Simulated Shipping Conditions on Sensory Attributes and Volatile Composition of Commercial White and Red Wines", "year": "2010", "source": "American Journal of Enology and Viticulture, vol. 61, no. 3, pp. 337-347", "authors": ["Robinson A", "Mueller M", "Heymann H", "Peter Solomon"]}, {"title": "The Transcription Factor StuA Regulates Central Carbon Metabolism, Mycotoxin Production, and Effector Gene Expression in the Wheat Pathogen Stagonospora nodorum", "year": "2010", "source": "Eukaryotic Cell, vol. 9, no. 7, pp. 1100-1108", "authors": ["Ipcho S", "Tan K", "Koh G", "Peter Solomon"]}, {"title": "Quantitative proteomic analysis of G-protein signalling in Stagonospora nodorum using isobaric tags for relative and absolute quantification", "year": "2010", "source": "Proteomics, vol. 10, no. 1, pp. 38-47", "authors": ["Casey T", "Peter Solomon", "Bringans S"]}, {"title": "Spatial and Developmental Differentiation of Mannitol Dehydrogenase and Mannitol-1-Phosphate Dehydrogenase in Aspergillus niger", "year": "2010", "source": "Eukaryotic Cell, vol. 9, no. 9, pp. 1398-1402", "authors": ["Aguilar-Osorio G", "VanKuyk P", "Seiboth B", "Peter Solomon"]}, {"title": "Proteinaceous necrotrophic effectors in fungal virulence", "year": "2010", "source": "Functional Plant Biology, vol. 37, no. 10, pp. 907-912", "authors": ["Tan K", "Oliver R", "Peter Solomon"]}, {"title": "SnTox3 Acts in Effector Triggered Susceptibility to Induce Disease on Wheat Carrying the Snn3 Gene", "year": "2009", "source": "PLoS Pathogens, vol. 5, no. 9, p. 27", "authors": ["Liu Z", "Faris J", "Oliver R", "Peter Solomon"]}, {"title": "Metabolite profiling identifies the mycotoxin alternariol in the pathogen Stagonospora nodorum", "year": "2009", "source": "Metabolomics, vol. 5, pp. 330-335", "authors": ["Tan K", "Trengove R", "Maker G", "Peter Solomon"]}, {"title": "SnTox3 Acts in Effector Triggered Susceptibility to Induce Disease on Wheat Carrying the Snn3 Gene", "year": "2009", "source": "PLoS Pathogens, vol. 5, no. 9, p. 27", "authors": ["Liu Z", "Faris J", "Oliver R", "Peter Solomon"]}, {"title": "Trehalose biosynthesis is involved in sporulation of Stagonospora nodorum", "year": "2009", "source": "Fungal Genetics and Biology, vol. 46, pp. 381-389", "authors": ["Lowe R", "Lord M", "Rybak K", "Peter Solomon"]}, {"title": "Interactions between Wine Volatile Compounds and Grape and Wine Matrix Components Influence Aroma Compound Headspace Partitioning", "year": "2009", "source": "Journal of Agricultural and Food Chemistry, vol. 57, pp. 10313-10322", "authors": ["Robinson A", "Ebeler S", "Heymann H", "Peter Solomon"]}, {"title": "Deep proteogenomics; high throughput gene validation by multidimensional liquid chromatography and mass spectrometry of proteins from the fungal wheat pathogen Stagonospora nodorum", "year": "2009", "source": "BMC Bioinformatics, vol. 10, no. 301, p. 9", "authors": ["Bringans S", "Hane J", "Casey T", "Peter Solomon"]}, {"title": "Prevalence of ToxA-sensitive alleles of the wheat gene Tsn1 in Australian and Chinese wheat cultivars", "year": "2009", "source": "Crop and Pasture Science, vol. 60, pp. 348-352", "authors": ["Oliver R", "Rybak K", "Peter Solomon"]}, {"title": "ssessing the impact of transcriptomics, proteomics and metabolomics on fungal phytopathology", "year": "2009", "source": "Molecular Plant Pathology, vol. 10, no. 5, pp. 703-715", "authors": ["Tan K", "Ipcho S", "Trengove R", "Peter Solomon"]}, {"title": "Proteomic identification of extracellular proteins regulated by the Gna1 Ga subunit in Stagonospora nodorum", "year": "2009", "source": "Mycological Research, vol. 113, no. 5, pp. 523-531", "authors": ["Tan K", "Heazlewood J", "Millar A", "Peter Solomon"]}, {"title": "Malayamycin, a new streptomycete antifungal compound, specifically inhibits sporulation of tagonospora nodorum (Berk) Castell and Germano, the cause of wheat glume blotch disease", "year": "2008", "source": "Pest Management Science, vol. 64, no. 12, pp. 1294-1302(9)", "authors": ["Wenfeng L", "Csukai M", "Corran M", "Peter Solomon"]}, {"title": "metabolomic approach to dissecting osmotic stress in the wheat pathogen Stagonospora nodorum", "year": "2008", "source": "Fungal Genetics and Biology, vol. 45, pp. 1479-1486", "authors": ["Lowe R", "Lord M", "Rybak K", "Peter Solomon"]}, {"title": "Host-specific toxins: effectors of necrotrophic pathogenicity", "year": "2008", "source": "Cellular Microbiology, vol. 10, no. 7, pp. 1421-1428", "authors": ["Friesen T", "Faris J", "Peter Solomon"]}, {"title": "Emergence of Tan Spot Disease Caused by Toxigenic Pyrenophora tritici-repentis in Australia Is Not associated with Increased Deployment of Toxin-Sensitive Cultivars", "year": "2008", "source": "Phytopathology, vol. 98, no. 5, pp. 488-491", "authors": ["Oliver R", "Lord M", "Rybak K", "Peter Solomon"]}, {"title": "Recent Fungal Diseases of Crop Plants: Is Lateral Gene Transfer a Common Theme?", "year": "2008", "source": "Molecular Plant-Microbe Interactions (MPMI), vol. 21, no. 3, pp. 287-293", "authors": ["Oliver R", "Peter Solomon"]}, {"title": "quantitative PCR approach to determine gene copy number", "year": "2008", "source": "Fungal Genetics Reports, vol. 55, pp. 5-7", "authors": ["Peter Solomon", "Ipcho S", "Hane J"]}, {"title": "Quantitative disease resistance assessment by real-time PCR using the Stagonospora nodorum-wheat athosystem as a model", "year": "2008", "source": "Plant Pathology, vol. 57, no. 3, pp. 527-532", "authors": ["Oliver R", "Rybak K", "Shankar M", "Peter Solomon"]}, {"title": "Characterization of the Interaction of a Novel Stagonospora nodorum Host-Selective Toxin with a Wheat Susceptibility Gene1[W]", "year": "2008", "source": "Plant Physiology, vol. 146, no. 2, pp. 682-693", "authors": ["Friesen T", "Zhang Z", "Peter Solomon"]}, {"title": "Signaling-Regulated, Short-Chain Dehydrogenase of Stagonospora nodorum Regulates Asexual Development", "year": "2008", "source": "Eukaryotic Cell, vol. 7, no. 11, pp. 1916-1929", "authors": ["Tan K", "Heazlewood J", "Millar A", "Peter Solomon"]}, {"title": "Decoding the mannitol enigma in filamentous fungi", "year": "2007", "source": "Trends in Microbiology, vol. 15, no. 6, pp. 257-262", "authors": ["Peter Solomon", "Waters O", "Oliver R"]}, {"title": "Dothideomycete-Plant Interactions Illuminated by Genome Sequencing and EST Analysis of the Wheat Pathogen Stagonospora nodorum", "year": "2007", "source": "The Plant Cell, vol. 19, no. 11, pp. 3347-3368", "authors": ["Hane J", "Lowe R", "Peter Solomon"]}, {"title": "Investigating the role of calcium/calmodulin-dependent protein kinases in Stagonospora nodorum", "year": "2006", "source": "Molecular Microbiology, vol. 62, no. 2, pp. 367-381", "authors": ["Peter Solomon", "Rybak K", "Trengrove R"]}, {"title": "Normalization of metabolites in heterogenous systems using genomics", "year": "2006", "source": "Analytical Biochemistry, vol. 350, pp. 156-158", "authors": ["Peter Solomon", "Lowe R", "Trengove R"]}, {"title": "Structural characterisation of the interaction between Triticum aestivum and the dothideomycete pathogen Stagonospora nodorum", "year": "2006", "source": "European Journal of Plant Pathology, vol. 114, pp. 275-286", "authors": ["Peter Solomon", "Greer Wilson T", "Rybak K"]}, {"title": "Stagonospora nodorum: cause of stagonospora nodorum blotch of wheat", "year": "2006", "source": "Molecular Plant Pathology, vol. 7, no. 3, pp. 147-156", "authors": ["Peter Solomon", "Lowe R", "Tan K"]}, {"title": "Emergence of a new disease as a result of interspecific virulence gene transfer", "year": "2006", "source": "Nature Genetics, vol. 38, no. 8, pp. 953-956", "authors": ["Friesen T", "stukenbrock E", "Liu Z", "Peter Solomon"]}, {"title": "Mannitol is required for asexual sporulation in the wheat pathogen Stagonospora nodorum (glume blotch)", "year": "2006", "source": "Biochemical Journal, vol. 399, no. 2, pp. 231-239", "authors": ["Peter Solomon", "Waters O", "JÃ¶rgens C"]}, {"title": "Î´-Aminolevulinic acid synthesis is required for virulence of the wheat pathogen Stagonospora nodorum", "year": "2006", "source": "Microbiology (UK), vol. 152, pp. 1533-1538", "authors": ["Peter Solomon", "Joergens C", "Oliver R"]}, {"title": "The Mak2 MAP kinase signal transduction pathway is required for pathogenicity in Stagonospora nodorum", "year": "2005", "source": "Current Genetics, vol. 48, pp. 60-68", "authors": ["Peter Solomon", "Waters O", "Simmonds J"]}, {"title": "Mannitol 1-Phosphate Metabolism Is Required for sporulation in Planta of the Wheat Pathogen Stagonospora nodorum", "year": "2005", "source": "Molecular Plant-Microbe Interactions (MPMI), vol. 18, no. 2, pp. 110-115", "authors": ["Peter Solomon", "Tan K", "Oliver R"]}, {"title": "The disruption of a G-alpha subunit sheds new light on the pathogenicity of Stagonospora nodorum on wheat.", "year": "2004", "source": "Molecular Plant-Microbe Interactions (MPMI), vol. 5, pp. 456-466", "authors": ["Peter Solomon", "Tan K", "Sanches P"]}, {"title": "Functional characterisation of glyoxalase I from the fungal wheat pathogen Stagonospora nodorum", "year": "2004", "source": "Current Genetics, vol. 46, pp. 115-121", "authors": ["Peter Solomon", "Oliver R"]}, {"title": "Does the oxidative stress used by plants for defence provide a source of nutrients for pathogenic fungi?", "year": "2004", "source": "Trends in Plant Science, vol. 9, no. 10, pp. 472-473", "authors": ["Oliver R", "Peter Solomon"]}, {"title": "Both mating types of Phaeosphaeria (anamorph tagonospora) nodorum are present in Western Australia", "year": "2004", "source": "European Journal of Plant Pathology, vol. 110, pp. 763-766", "authors": ["Peter Solomon", "Parker K", "Loughman R"]}, {"title": "Pathogenicity of Stagonospora nodorum requires malate synthase", "year": "2004", "source": "Molecular Microbiology, vol. 53, no. 4, pp. 1065-1073", "authors": ["Peter Solomon", "Lee R", "Greer Wilson T"]}, {"title": "The nutrient supply of pathogenic fungi: a fertile field for study", "year": "2003", "source": "Molecular Plant Pathology, vol. 4, no. 3, pp. 203-210", "authors": ["Peter Solomon", "Tan K", "Oliver R"]}, {"title": "The utilisation of di/tripeptides by Stagonospora nodorum is dispensable for wheat infection", "year": "2003", "source": "Physiological and Molecular Plant Pathology, vol. 63, no. 4, pp. 191-199", "authors": ["Peter Solomon", "Thomas S", "Spanu P"]}]}, "Microsoft-Academic": [{"title": "educational teaching system and method utilizing interactive avatars with learning manager and authoring manager functions", "year": 2017, "source": "", "authors": [{"name": "peter solomon"}, {"name": "brian weinberg"}, {"name": "arthur michael mcintosh"}, {"name": "igor senderovich"}]}, {"title": "shock resistant and or waterproof mobile device jacket", "year": 2014, "source": "", "authors": [{"name": "chanseol chung"}, {"name": "edward martin"}, {"name": "peter solomon"}]}, {"title": "tablet computer cover and stand", "year": 2013, "source": "", "authors": [{"name": "chanseol chung"}, {"name": "peter solomon"}]}, {"title": "method and apparatus for technology enhanced science education", "year": 2008, "source": "", "authors": [{"name": "peter solomon"}]}, {"title": "headphones with removable headband pad", "year": 2014, "source": "", "authors": [{"name": "peter solomon"}, {"name": "christopher piedra"}, {"name": "juan galindo"}, {"name": "edward martin"}]}, {"title": "headphones with a foam material body", "year": 2015, "source": "", "authors": [{"name": "peter solomon"}, {"name": "christopher piedra"}, {"name": "juan galindo"}, {"name": "edward martin"}]}, {"title": "slap wrist bracelet and stylus", "year": 2015, "source": "", "authors": [{"name": "jacqueline n miller"}, {"name": "peter solomon"}]}, {"title": "molded case for an electronic device", "year": 2014, "source": "", "authors": [{"name": "gary domke"}, {"name": "peter solomon"}]}, {"title": "universal interchangeable plate system for tool head assemblies", "year": 2020, "source": "", "authors": [{"name": "peter solomon"}, {"name": "james c tongue"}]}, {"title": "people are the key to safety excellence the benefits of a strong safety culture", "year": 2000, "source": "", "authors": [{"name": "peter solomon", "affiliation": "dupont"}]}], "ANDS-Grants": [{"description": "This project aims to identify the role of pathogenicity-related-1 proteins in plants and characterise a new disease resistance pathway. By focusing on the interaction between key plant and pathogen proteins, this proposal seeks to advance the understanding of how the pathogen causes disease. The expected outcomes from these advances include the generation of new tools to manage plant diseases whilst building strong international collaborations. This project should provide significant benefits for generating new leads for plant disease management leading to enhanced food security.", "title": "Discovery Projects - Grant ID: DP180102355", "id": "1316521", "key": "http://purl.org/au-research/grants/arc/DP180102355", "researchers": ["A/Prof Peter Solomon"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 363164, "fundingScheme": "Discovery Projects", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:42Z", "dateTimeCreated": "2018-03-06T23:37:34Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP180102355", "identifiers": ["http://purl.org/au-research/grants/arc/DP180102355", "DP180102355"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1316521"}]}, {"description": "This project aims to investigate how a fungal plant pathogen makes and uses small bioactive molecules to facilitate infection. It will characterise the function of the genes and enzymes involved in the biosynthesis of a light-activated phytotoxic molecule and a potential anti-plant defence molecule found in the pathogenic wheat fungus Parastagonospora nodorum, and investigate their contribution to disease development. Expected outcomes include better understanding of plant-microbe interactions, disease management strategies, technologies for identifying biosynthetic pathways in other fungi, and enzyme technology for synthesising molecules. This could lead to new herbicides, biopesticides and drugs.", "title": "Discovery Projects - Grant ID: DP170100228", "id": "942988", "institutions": ["University of Western Australia"], "key": "http://purl.org/au-research/grants/arc/DP170100228", "researchers": ["Dr Yit-Heng Chooi", "A/Prof Peter Solomon", "Prof Yi Tang"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 428000, "fundingScheme": "Discovery Projects", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:35Z", "dateTimeCreated": "2017-07-04T23:44:59Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Western Australia"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP170100228", "identifiers": ["http://purl.org/au-research/grants/arc/DP170100228", "DP170100228"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/942988"}]}]}