{"ANU": {"name": "Philip Batterham", "link": "https://researchers.anu.edu.au/researchers/batterham-pj", "colleges": "College of Health & Medicine", "email": "philip.batterham@anu.edu.au", "phone": "", "expertise": ["Mental Health", "Biostatistics", "Psychological Methodology Design And Analysis", "Epidemiology"], "interest": ["Assessment and epidemiology of mental illnessSuicide preventionResearch methodsPsychiatric rating scalesE-mental healthImplementation scienceRural mental health"], "biography": "Phil Batterham is a Professor at the Centre for Mental Health Research, in the Research School of Population Health. He was awarded an Early Career Fellowship in 2011, a Career Development Fellowship-1 in 2014 and a Career Development Fellowship-2 in 2018 from the National Health and Medical Research Council (NHMRC). He is a Chief Investigator for the NHMRC Centre of Research Excellence in Suicide Prevention and for seven NHMRC project grants. His research interests include implementing digital tools to prevent mental disorders, reducing risk of suicide, assessing mental health in the population, and reducing the stigma of mental illness.", "project": [], "publication": [{"title": "Measures of mental, physical, and social wellbeing and their association with death by suicide and self-harm in a cohort of 266,324 persons aged 45 years and over", "year": "2020", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. Online , pp. 1-9", "authors": ["Erlangsen A", "Banks E", "Joshy G", "Philip Batterham"]}, {"title": "The Effect of COVID-19 on Mental Health and Wellbeing in a Representative Sample of Australian Adults", "year": "2020", "source": "Frontiers in Psychiatry, vol. 11, pp. 1-8", "authors": ["Dawel A", "Shou Y", "Smithson M", "Philip Batterham"]}, {"title": "Protocol for a stepped-wedge, cluster randomized controlled trial of the LifeSpan suicide prevention trial in four communities in New South Wales, Australia", "year": "2020", "source": "Trials, vol. 21, no. 332, pp. 1-10", "authors": ["Shand F", "Torok M", "Cockayne N", "Philip Batterham"]}, {"title": "Consumer-Guided Development of an Engagement-Facilitation Intervention for Increasing Uptake and Adherence for Self-Guided Web-Based Mental Health Programs: Focus Groups and Online Evaluation Survey", "year": "2020", "source": "JMIR Formative Research, vol. 4, no. 10, pp. 1-15", "authors": ["Gulliver A", "Calear A", "Sunderland M", "Philip Batterham"]}, {"title": "randomised controlled trial of a relationship-focussed mobile phone application for improving adolescents", "year": "2020", "source": "mental health'Journal of Child Psychology and Psychiatry, vol. 61, no. 8, pp. 899-913", "authors": ["O'Dea B", "Han J", "Philip Batterham"]}, {"title": "Suicidal thoughts, suicidal behaviours and self-harm in daily life: A systematic review of ecological momentary assessment studies", "year": "2020", "source": "Digital Health, vol. 6, pp. 1-38", "authors": ["Loo Gee B", "Han J", "Benassi H", "Philip Batterham"]}, {"title": "ssessing psychological adjustment and cultural reintegration after military service: development and psychometric evaluation of the post-separation Military-Civilian Adjustment and Reintegration Measure (M-CARM)", "year": "2020", "source": "BMC Psychiatry, vol. 20, no. 531, pp. 1-17", "authors": ["Romaniuk M", "Fisher  G", "Kidd  C", "Philip Batterham"]}, {"title": "Rates and Predictors of Deterioration in a Trial of Internet-Delivered Cognitive Behavioral Therapy for Reducing Suicidal Thoughts [IN PRESS]", "year": "2020", "source": "Archives of Suicide Research, vol. Online", "authors": ["Philip Batterham", "Christensen H", "Calear A"]}, {"title": "Factors associated with engagement in online self-help programs among people with suicidal thoughts", "year": "2020", "source": "Journal of Affective Disorders, vol. 265, pp. 402-409", "authors": ["Philip Batterham", "Han J", "Mackinnon A"]}, {"title": "Suicide prevention among young people: A study protocol for evaluating Youth Aware of Mental Health in Australian secondary schools", "year": "2020", "source": "Mental Health & Prevention, vol. 17, no. 200178, pp. 1-8", "authors": ["McGillivray L", "Torok M", "Calear A", "Philip Batterham"]}, {"title": "trial protocol for the effectiveness of digital interventions for preventing depression in adolescents: The Future Proofing Study", "year": "2020", "source": "Trials, vol. 21, no. 2, pp. 1-21", "authors": ["Werner-Seidler A", "Huckvale K", "Larsen M", "Philip Batterham"]}, {"title": "Development and Validation of Static and Adaptive Screeners to Assess Suicidal Thoughts and Behavior", "year": "2020", "source": "Suicide and Life-Threatening Behavior, vol. 50, no. 1, pp. 189-200", "authors": ["Calear A", "Philip Batterham", "Sunderland M"]}, {"title": "The role of maladaptive personality domains across multiple levels of the HiTOP structure", "year": "2020", "source": "Personality and Mental Health, vol. 14, no. 1, pp. 30-50", "authors": ["Selbom M", "Carragher N", "Sunderland M", "Philip Batterham"]}, {"title": "Suicide, mental and physical health condition stigma in medical students", "year": "2020", "source": "Death Studies, vol. 44, no. 4, pp. 230-236", "authors": ["Cryer R", "Calear A", "Philip Batterham"]}, {"title": "Workplace bullying and suicidal ideation: Findings from an australian longitudinal cohort study of mid-aged workers", "year": "2020", "source": "International Journal of Environmental Research and Public Health, vol. 17, no. 1448, pp. 1-12", "authors": ["Leach L", "Too L", "Philip Batterham"]}, {"title": "Help-seeking attitudes and intentions for generalised anxiety disorder in adolescents: the role of anxiety literacy and stigma [IN PRESS]", "year": "2020", "source": "European Child and Adolescent Psychiatry, vol. online", "authors": ["Calear A", "Philip Batterham", "Torok M"]}, {"title": "The structure of psychopathology and association with poor sleep, self-harm, suicidality, risky sexual behaviour, and low self-esteem in a population sample of adolescents [IN PRESS]", "year": "2020", "source": "Development and Psychopathology, pp. 1-12", "authors": ["Sunderland M", "Forbes M", "Mewton L", "Philip Batterham"]}, {"title": "Self-reported disability and quality of life in an online Australian community sample with suicidal thoughts", "year": "2020", "source": "Journal of Affective Disorders, vol. 263, pp. 707-714", "authors": ["van Spijker B", "Philip Batterham", "Calear A"]}, {"title": "Identifying subgroups within a sample of adults with a suicide attempt history using the Interpersonal Psychological Theory of Suicide", "year": "2020", "source": "Psychiatry Research, vol. 293, no. November 2020, pp. 1-9", "authors": ["Wong Q", "Torok M", "van Spijker B", "Philip Batterham"]}, {"title": "Ethical issues and practical barriers in internet-based suicide prevention research: a review and investigator survey", "year": "2020", "source": "BMC Medical Ethics, vol. 21, no. 37, pp. 1-16", "authors": ["Bailey E", "Mühlmann C", "Rice S", "Philip Batterham"]}, {"title": "Tailored implementation of internet-basedcognitive behavioural therapy in themultinational context of the ImpleMentAllproject: a study protocol for a steppedwedge cluster randomized trial", "year": "2020", "source": "Trials, vol. 21, no. 893, pp. 1-15", "authors": ["Bührmann L", "Schuurmans J", "Ruwaard J", "Philip Batterham"]}, {"title": "Sociocultural factors associated with attitudes toward suicide in Australia [IN PRESS]", "year": "2019", "source": "Death Studies, vol. online", "authors": ["Money T", "Philip Batterham"]}, {"title": "Differences in mental health service use between urban and rural areas of Australia [IN PRESS]", "year": "2019", "source": "Australian Psychologist, vol. Online", "authors": ["Philip Batterham", "Kazan D", "Banfield M"]}, {"title": "novel multi-component online intervention to improve the mental health of university students: Randomised controlled trial of the Uni Virtual Clinic", "year": "2019", "source": "Internet Interventions, vol. 18, no. 0", "authors": ["Farrer L", "Gulliver A", "Katruss N", "Philip Batterham"]}, {"title": "blended face-to-face and smartphone intervention for suicide prevention in the construction industry: Protocol for a randomized controlled trial with MATES in Construction", "year": "2019", "source": "BMC Psychiatry, vol. 19, no. 146, pp. -", "authors": ["Milner A", "King T", "Scovelle A", "Philip Batterham"]}, {"title": "Stakeholder perspectives on evidence for digital mental health interventions: Implications for accreditation systems", "year": "2019", "source": "Digital Health, vol. 5, pp. 1-7", "authors": ["Philip Batterham", "Calear A", "Oï¿½Dea B"]}, {"title": "ssociations of fatigue and sleep disturbance with nine common mental disorders", "year": "2019", "source": "Journal of Psychosomatic Research, vol. 123, no. August 2019", "authors": ["McCallum S", "Philip Batterham", "Calear A"]}, {"title": "Suicidal ideation disclosure: Patterns, correlates and outcome", "year": "2019", "source": "Psychiatry Research, vol. 278, no. -, pp. 1-6", "authors": ["Calear A", "Philip Batterham"]}, {"title": "ntidepressant use and its relationship with current symptoms in a population-based sample of older Australians", "year": "2019", "source": "Journal of Affective Disorders, vol. 258, pp. 83-88", "authors": ["Chitty K", "Butterworth P", "Philip Batterham"]}, {"title": "Suicide Risk across Latent Class Subgroups: A Test of the Generalizability of the Interpersonal Psychological Theory of Suicide", "year": "2019", "source": "Suicide and Life-Threatening Behavior, vol. 49, no. 1, pp. 137-154pp", "authors": ["Ma J", "Philip Batterham", "Calear A"]}, {"title": "re Young Men Getting the Message? Age Differences in Suicide Prevention Literacy among Male Construction Workers", "year": "2019", "source": "International Journal of Environmental Research and Public Health, vol. 16, no. 3", "authors": ["King T", "Philip Batterham", "Lingard H"]}, {"title": "The Development and Validation of the Thwarted Belongingness Scale (TBS) for Interpersonal Suicide Risk", "year": "2019", "source": "Journal of Psychopathology and Behavioral Assessment, vol. 41, no. 3, pp. 456-469", "authors": ["Ma J", "Philip Batterham", "Calear A"]}, {"title": "brief intervention to increase uptake and adherence of an online program for depression and anxiety: Protocol for the Enhancing Engagement with Psychosocial Interventions (EEPI) Randomized Controlled Trial", "year": "2019", "source": "Contemporary Clinical Trials, vol. 78, no. March 2019, pp. 107-115", "authors": ["Philip Batterham", "Calear A", "Sunderland M"]}, {"title": "The Self-Hate Scale: Development and validation of a brief measure and its relationship to suicidal ideation", "year": "2019", "source": "Journal of Affective Disorders, vol. 245, pp. 779-787pp", "authors": ["Turnell A", "Fassnacht D", "Philip Batterham"]}, {"title": "Efficacy of a transdiagnostic, video-based online program for reducing depression, anxiety, and suicidal ideation in adults: Protocol for a randomised controlled trial", "year": "2019", "source": "Contemporary Clinical Trials Communications, vol. 14", "authors": ["Philip Batterham", "Calear A", "Gulliver A"]}, {"title": "Comparing Scores From Full Length, Short Form, and Adaptive Tests of the Social Interaction Anxiety and Social Phobia Scales [IN PRESS]", "year": "2019", "source": "Assessment, vol. Online, pp. 1-15pp", "authors": ["Sunderland M", "Afzali M", "Philip Batterham"]}, {"title": "Suicide Stigma and Suicide Literacy in a Clinical Sample", "year": "2018", "source": "Suicide and Life-Threatening Behavior, vol. 49, no. 4, pp. 1136-1147", "authors": ["Philip Batterham", "Han J", "Calear A"]}, {"title": "Development and pilot evaluation of an online psychoeducational program for suicide prevention among university students: A randomised controlled trial", "year": "2018", "source": "Internet Interventions, vol. 12, pp. 111-120pp", "authors": ["Han J", "Philip Batterham", "Calear A"]}, {"title": "Long-term Associations Between Physical Frailty and Performance in Specific Cognitive Domains", "year": "2018", "source": "Journals of Gerontology Series B: Psychological Sciences and Social Sciences, vol. Online", "authors": ["Bunce D", "Philip Batterham", "Mackinnon A"]}, {"title": "dolescents", "year": "2018", "source": "perspectives on a mobile app for relationships: implications for the design and delivery of help-seeking interventions'Journal of Medical Internet Research, vol. 6, no. 3, p. 79", "authors": ["O'Dea B", "Achilles M", "Werner-Seidler A", "Philip Batterham"]}, {"title": "Characterizing Depression Issues on Sina Weibo", "year": "2018", "source": "International Journal of Environmental Research and Public Health, vol. 15, no. 764, pp. 11pp", "authors": ["Tian X", "Philip Batterham", "Song S"]}, {"title": "High agreement was obtained across scores from multiple equated scales for social anxiety disorder using item response theory", "year": "2018", "source": "Journal of Clinical Epidemiology, vol. 99, pp. 132-143pp", "authors": ["Sunderland M", "Philip Batterham", "Calear A"]}, {"title": "Online insomnia treatment and the reduction of anxiety symptoms as a secondary outcome in a randomised controlled trial: The role of cognitive-behavioural factors", "year": "2018", "source": "Australian and New Zealand Journal of Psychiatry, vol. 52, no. 12, pp. 1183-1193pp", "authors": ["Gosling J", "Philip Batterham", "Ritterband L"]}, {"title": "Validity of the PROMIS depression and anxiety common metrics in an online sample of Australian adults", "year": "2018", "source": "Quality of Life Research, vol. 27, no. 9, pp. 2453-2458pp", "authors": ["Sunderland M", "Philip Batterham", "Calear A"]}, {"title": "The rate of reply and nature of responses to suicide-related posts on Twitter", "year": "2018", "source": "Internet Interventions, vol. 13, pp. 105-107pp", "authors": ["O'Dea B", "Achilles M", "Larsen M", "Philip Batterham"]}, {"title": "Improving the cardiometabolic health of people with psychosis: A protocol for a randomised controlled trial of the Physical Health Nurse Consultant service", "year": "2018", "source": "Contemporary Clinical Trials, vol. 73, pp. 75-80", "authors": ["Happell B", "Curtis J", "Banfield M", "Philip Batterham"]}, {"title": "Shifting beliefs about suicide: Pre-post evaluation of the effectiveness of a program for workers in the construction industry", "year": "2018", "source": "International Journal of Environmental Research and Public Health, vol. 15, no. 10, p. 13", "authors": ["King T", "Gullestrup J", "Philip Batterham"]}, {"title": "ssessing distress in the community: psychometric properties and crosswalk comparison of eight measures of psychological distress", "year": "2018", "source": "Psychological Medicine, vol. 48, no. 8, pp. 1316-1324pp", "authors": ["Philip Batterham", "Sunderland M", "Slade T"]}, {"title": "Reductions in quality of life and increased economic burden associated with mental disorders in an Australian adult sample", "year": "2018", "source": "Australian Health Review, vol. 43, no. 6, pp. 644-652", "authors": ["McCallum S", "Philip Batterham", "Calear A"]}, {"title": "FitMindKit: Randomised controlled trial of an automatically tailored online program for mood, anxiety, substance use and suicidality", "year": "2018", "source": "Internet Interventions, vol. 12, pp. 91-99pp", "authors": ["Philip Batterham", "Calear A", "Farrer L"]}, {"title": "longitudinal test of the predictions of the interpersonal-psychological theory of suicidal behaviour for passive and active suicidal ideation in a large community-based cohort", "year": "2018", "source": "Journal of Affective Disorders, vol. 227, pp. 97-102", "authors": ["Philip Batterham", "Walker J", "Leach L"]}, {"title": "Experience of Health Care Services After a Suicide Attempt: Results from an Online Survey", "year": "2017", "source": "Suicide and Life-Threatening Behavior, pp. 1-9", "authors": ["Shand F", "Philip Batterham", "Chan J"]}, {"title": "Factors Influencing Professional Help-Seeking for Suicidality: A Systematic Review", "year": "2017", "source": "Crisis: The Journal of Crisis Intervention and Suicide Prevention\r\n, vol. 39, no. 3, pp. 175-196", "authors": ["Han J", "Philip Batterham", "Calear A"]}, {"title": "n analysis of anxiety-related postings on sina weibo", "year": "2017", "source": "International Journal of Environmental Research and Public Health, vol. 14, no. 7, pp. 10pp", "authors": ["Tian X", "He F", "Philip Batterham"]}, {"title": "Personality predicts mortality risk: An integrative data analysis of 15 international longitudinal studies", "year": "2017", "source": "Journal of Research in Personality, vol. 70, pp. 174-186pp.", "authors": ["Graham E", "Rutsohn J", "Turiano N", "Philip Batterham"]}, {"title": "Independent Effects of Mental Disorders on Suicidal Behavior in the Community", "year": "2017", "source": "Suicide and Life-Threatening Behavior, vol. Online, pp. 10pp.", "authors": ["Philip Batterham", "Calear A", "Christensen H"]}, {"title": "Preventing Depression in Final Year Secondary Students: School-Based Randomized Controlled Trial", "year": "2017", "source": "Journal of Medical Internet Research, vol. 19, no. 11, pp. e369 (11pp)", "authors": ["Perry Y", "Werner-Seidler A", "Calear A", "Philip Batterham"]}, {"title": "Mobile Text Message Intervention to Reduce Repeat Suicidal Episodes: Design and Development of Reconnecting After a Suicide Attempt (RAFT)", "year": "2017", "source": "JMIR Mental Health, vol. 4, no. 4, pp. e56", "authors": ["Larsen M", "Shand F", "Morley K", "Philip Batterham"]}, {"title": "Spatial clustering of fatal, and non-fatal, suicide in new South Wales, Australia: Implications for evidence-based prevention", "year": "2017", "source": "BMC Psychiatry, vol. 17, no. 339, pp. 1-10", "authors": ["Torok M", "Konings P", "Philip Batterham"]}, {"title": "Prevalence and predictors of distress associated with completion of an online survey assessing mental health and suicidality in the community", "year": "2017", "source": "Psychiatry Research, vol. 262, pp. 348-350pp", "authors": ["Philip Batterham", "Calear A", "Carragher N"]}, {"title": "Silence is deadly: a cluster-randomised controlled trial of a mental health help-seeking intervention for young men", "year": "2017", "source": "BMC Public Health, vol. 17, no. 834, pp. 1-8", "authors": ["Calear A", "Banfield M", "Philip Batterham"]}, {"title": "Network approach to the symptom-level association between alcohol use disorder and posttraumatic stress disorder", "year": "2017", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 52, no. 3, pp. 329-339pp", "authors": ["Afzali M", "Sunderland M", "Philip Batterham"]}, {"title": "Linguistic Analysis of Suicide-Related Twitter Posts", "year": "2017", "source": "Crisis: The Journal of Crisis Intervention and Suicide Prevention\r\n, vol. Advance online publication, pp. 1-11", "authors": ["O'Dea B", "Larsen M", "Philip Batterham"]}, {"title": "Systematic Review of Controlled Trials Evaluating Interventions Following Non-Marital Relationship Separation", "year": "2017", "source": "Journal of Relationships Research, vol. 8, no. e6, pp. 1-11", "authors": ["Kazan D", "Calear A", "Philip Batterham"]}, {"title": "Preventing mental health symptoms in adolescents using dialectical behaviour therapy skills group: a feasibility study", "year": "2017", "source": "International Journal of Adolescence and Youth, vol. Online, pp. 17pp", "authors": ["Burckhardt R", "Manicavasagar V", "Shaw F", "Philip Batterham"]}, {"title": "Issues for eHealth in psychiatry: Results of an expert survey", "year": "2017", "source": "Journal of Medical Internet Research, vol. 19, no. 2, pp. e55-e55", "authors": ["Nicholas J", "Huckvale K", "Larsen M", "Philip Batterham"]}, {"title": "Psychometric Properties of 7- and 30-Day Versions of the PROMIS Emotional Distress Item Banks in an Australian Adult Sample", "year": "2017", "source": "Assessment, vol. Early Online, pp. 1073191116685800-1073191116685800", "authors": ["Philip Batterham", "Sunderland M", "Carragher N"]}, {"title": "Online Recruitment: Feasibility, Cost, and Representativeness in a Study of Postpartum Women", "year": "2017", "source": "Journal of Medical Internet Research, vol. 19, no. 3, pp. 5pps", "authors": ["Leach L", "Butterworth P", "Poyser C", "Philip Batterham"]}, {"title": "The development and validation of static and adaptive screeners to measure the severity of panic disorder, social anxiety disorder, and obsessive compulsive disorder", "year": "2017", "source": "International Journal of Methods in Psychiatric Research, vol. online, pp. 1-9pp", "authors": ["Sunderland M", "Philip Batterham", "Calear A"]}, {"title": "Help seeking for social anxiety: A pilot randomised controlled trial", "year": "2017", "source": "Digital Health, vol. 3, no. -, pp. 1-12pp", "authors": ["Griffiths K", "Walker J", "Philip Batterham"]}, {"title": "Developing and Validating a Computerized Adaptive Test to Measure Broad and Specific Factors of Internalizing in a Community Sample", "year": "2017", "source": "Assessment, vol. Online, pp. 1073191117707810-1073191117707810", "authors": ["Sunderland M", "Philip Batterham", "Carragher N"]}, {"title": "Preferences for Internet-Based Mental Health Interventions in an Adult Online Sample: Findings From an Online Community Survey", "year": "2017", "source": "JMIR Mental Health, vol. 4, no. 2, pp. e26-e26", "authors": ["Philip Batterham", "Calear A"]}, {"title": "Commentary on Snowdon: \"The Journal", "year": "2017", "source": "s concerns about suicide\"Australian and New Zealand Journal of Psychiatry, vol. 51, no. 8, pp. 842-843pp", "authors": ["Philip Batterham"]}, {"title": "Generalized Anxiety Disorder Stigma in Adolescents: Personal and Perceived Stigma Levels and Predictors", "year": "2016", "source": "Stigma and Health, pp. 1-8", "authors": ["Calear A", "Philip Batterham", "Griffiths K"]}, {"title": "Trauma characteristics, post-traumatic symptoms, psychiatric disorders and suicidal behaviours: Results from the 2007 Australian National Survey of Mental Health and Wellbeing", "year": "2017", "source": "Australian and New Zealand Journal of Psychiatry, vol. 51, no. 11, pp. 1142-1151", "authors": ["Afzali M", "Sunderland M", "Philip Batterham"]}, {"title": "Best strategies for reducing the suicide rate in Australia: response to Pirkis", "year": "2016", "source": "Australian and New Zealand Journal of Psychiatry, vol. 50, no. 4, pp. 386-386", "authors": ["Philip Batterham", "Torok M", "Krysinska K"]}, {"title": "Translation and validation of the Chinese versions of the Suicidal Ideation Attributes Scale, Stigma of Suicide Scale, and Literacy of Suicide Scale", "year": "2017", "source": "Death Studies, vol. 41, no. 3, pp. 173-179", "authors": ["Han J", "Philip Batterham", "Calear A"]}, {"title": "NHMRC funding of mental health research A case for better alignment of research funding with burden of disease", "year": "2016", "source": "Medical Journal of Australia, vol. 205, no. 8, pp. 348-349", "authors": ["Philip Batterham", "McGrath J", "McGorry P"]}, {"title": "NHMRC funding of mental health research A case for better alignment of research funding with burden of disease", "year": "2016", "source": "Medical Journal of Australia, vol. 205, no. 8, pp. 348-349", "authors": ["Philip Batterham", "McGrath J", "McGorry P"]}, {"title": "Discriminant validity and gender differences in DSM-5 posttraumatic stress disorder symptoms", "year": "2016", "source": "Journal of Affective Disorders, vol. 190, pp. 56-67", "authors": ["Carragher N", "Sunderland M", "Philip Batterham"]}, {"title": "The impact of intimate partner relationships on suicidal thoughts and behaviours: A systematic review", "year": "2016", "source": "Journal of Affective Disorders, vol. 190, pp. 585-598", "authors": ["Kazan D", "Calear A", "Philip Batterham"]}, {"title": "Best strategies for reducing the suicide rate in Australia", "year": "2016", "source": "Australian and New Zealand Journal of Psychiatry, vol. 50, no. 2, pp. 115-118pp", "authors": ["Krysinska K", "Philip Batterham", "Tye M"]}, {"title": "Online screening and feedback to increase help-seeking for mental health problems: population-based randomised controlled trial", "year": "2016", "source": "British Journal of Psychiatry Open, vol. 2, no. 1, pp. 67-73", "authors": ["Philip Batterham", "Calear A", "Sunderland M"]}, {"title": "The Distress Questionnaire-5: Population screener for psychological distress was more accurate than the K6/K10", "year": "2016", "source": "Journal of Clinical Epidemiology, vol. 71, pp. 35-42", "authors": ["Philip Batterham", "Sunderland M", "Carragher N"]}, {"title": "Cluster randomised controlled trial of the e-couch Anxiety and Worry program in schools", "year": "2016", "source": "Journal of Affective Disorders, vol. 196, pp. 210-217", "authors": ["Calear A", "Philip Batterham", "Poyser C"]}, {"title": "Community-Based Validation of the Social Phobia Screener (SOPHS)", "year": "2017", "source": "Assessment, vol. 24, no. 7, pp. 958-969", "authors": ["Philip Batterham", "Mackinnon A", "Christensen H"]}, {"title": "Effectiveness of an online insomnia program (SHUTi) for prevention of depressive episodes (the GoodNight Study): a randomised controlled trial", "year": "2016", "source": "The Lancet Psychiatry, vol. 3, no. 4, pp. 333-341", "authors": ["Christensen H", "Philip Batterham", "Gosling J"]}, {"title": "systematic review of the predictions of the Interpersonal-Psychological Theory of Suicidal Behavior", "year": "2016", "source": "Clinical Psychology Review, vol. 46, pp. 34-45", "authors": ["Ma J", "Philip Batterham", "Calear A"]}, {"title": "Recruiting for health, medical or psychosocial research using Facebook: Systematic review", "year": "2016", "source": "Internet Interventions, vol. 4, no. Part 1, pp. 72-81", "authors": ["Thornton L", "Philip Batterham", "Fassnacht D"]}, {"title": "Predictors of Comfort and Confidence Among Medical Students in Providing Care to Patients at Risk of Suicide", "year": "2016", "source": "Academic Psychiatry, vol. 40, no. 6, pp. 919-922pp", "authors": ["Patel S", "Philip Batterham", "Calear A"]}, {"title": "The Sources of Strength Australia Project: study protocol for a cluster randomised controlled trial", "year": "2016", "source": "Trials, vol. 17, no. 1, pp. 349-349", "authors": ["Calear A", "Brewer J", "Philip Batterham"]}, {"title": "Differences in the Effectiveness of Psychosocial Interventions for Suicidal Ideation and Behaviour in Women and Men: A Systematic Review of Randomised Controlled Trials", "year": "2017", "source": "Archives of Suicide Research, vol. 21, no. 1, pp. 12-32pp", "authors": ["Krysinska K", "Philip Batterham", "Christensen H"]}, {"title": "Development and community-based validation of eight item banks to assess mental health", "year": "2016", "source": "Psychiatry Research, vol. 243, pp. 453-462pp", "authors": ["Philip Batterham", "Sunderland M", "Carragher N"]}, {"title": "Predictors of personal, perceived and self-stigma towards anxiety and depression", "year": "2016", "source": "Epidemiology and Psychiatric Sciences, vol. 25, no. 3, pp. 247-254pp", "authors": ["Busby Grant J", "Bruce C", "Philip Batterham"]}, {"title": "The panic disorder screener (PADIS): Development of an accurate and brief population screening tool", "year": "2015", "source": "Psychiatry Research, vol. 228, no. 1, pp. 72-76pp", "authors": ["Philip Batterham", "Mackinnon A", "Christensen H"]}, {"title": "Developing a roadmap for the translation of e-mental health services for depression", "year": "2015", "source": "Australian and New Zealand Journal of Psychiatry, vol. 49, no. 9, pp. 776-784", "authors": ["Philip Batterham", "Sunderland M", "Calear A"]}, {"title": "systematic review and evaluation of measures for suicidal ideation and behaviors in population-based research", "year": "2015", "source": "Psychological Assessment, vol. 27, no. 2, pp. 501-512", "authors": ["Philip Batterham", "Ftanou M", "Pirkis J"]}, {"title": "Systematic item selection process applied to developing item pools for assessing multiple mental health problems", "year": "2015", "source": "Journal of Clinical Epidemiology, vol. 68, no. 8, pp. 913-919", "authors": ["Philip Batterham", "Brewer J", "Tjhin A"]}, {"title": "The Specificity of the Interpersonal-Psychological Theory of Suicidal Behavior for Identifying Suicidal Ideation in an Online Sample", "year": "2015", "source": "Suicide and Life-Threatening Behavior, vol. 45, no. 4, pp. 448-460", "authors": ["Philip Batterham", "Calear A", "van Spijker B"]}, {"title": "We Feel: Mapping Emotion on Twitter", "year": "2015", "source": "IEEE Journal of Biomedical and Health Informatics, vol. 19, no. 4, pp. 1246-1252", "authors": ["Larsen M", "Boonstra T", "Philip Batterham"]}, {"title": "Investigating Factors that Bias the Reporting of Depression Symptomatology Among Older Australian Adults", "year": "2015", "source": "American Journal of Geriatric Psychiatry, vol. 23, no. 10, pp. 1046-1055", "authors": ["Buchan H", "Sunderland M", "Carragher N", "Philip Batterham"]}, {"title": "Trial for the Prevention of Depression (TriPoD) in final-year secondary students: Study protocol for a cluster randomised controlled trial", "year": "2015", "source": "Trials, vol. 16, no. 1, p. 17", "authors": ["Perry Y", "Calear A", "Mackinnon A", "Philip Batterham"]}, {"title": "The mental health of Australian elite athletes", "year": "2015", "source": "Journal of Science and Medicine in Sport, vol. 18, no. 3, pp. 255-261", "authors": ["Gulliver A", "Griffiths K", "Mackinnon A", "Philip Batterham"]}, {"title": "ssessing the risk of imminent aggression in mentally ill young offenders", "year": "2015", "source": "Australasian Psychiatry, vol. 23, no. 1, pp. 44-48", "authors": ["Kasinathan J", "Marsland C", "Philip Batterham"]}, {"title": "Exploring Emotions in Social Media", "year": "2015", "source": "IEEE International Conference on Collaboration and Internet Computing, CIC 2015, IEEE, TBC, pp. 54-61", "authors": ["Paris C", "Christensen H", "Philip Batterham"]}, {"title": "The DASA:YV assists the appraisal of imminent aggression risk in young patients", "year": "2015", "source": "Australasian Psychiatry, vol. 23, no. 3, pp. 314-315", "authors": ["Kasinathan J", "Marsland C", "Philip Batterham"]}, {"title": "The need for nuanced stigma-reduction programmes to improve help seeking for mental health problems", "year": "2015", "source": "Evidence-Based Mental Health, vol. 18, no. 4, pp. 121-121", "authors": ["Philip Batterham"]}, {"title": "Reducing suicidal thoughts in the Australian general population through web-based self-help: Study protocol for a randomized controlled trial", "year": "2015", "source": "Trials, vol. 16, no. 62, pp. 1-10pp", "authors": ["Van Spijker B", "Calear A", "Philip Batterham"]}, {"title": "Detecting suicidality on Twitter", "year": "2015", "source": "Internet Interventions, vol. 2, no. 2, pp. 183-188", "authors": ["O'Dea B", "Wan S", "Philip Batterham"]}, {"title": "Causal Associations Between Depression Symptoms and Cognition in a Community-Based Cohort of Older Adults", "year": "2014", "source": "American Journal of Geriatric Psychiatry, vol. 22, no. 12, pp. 1583-1591", "authors": ["Bunce D", "Philip Batterham", "Christensen H"]}, {"title": "The influence of job stress, social support and health status on intermittent and chronic sleep disturbance: An 8-year longitudinal analysis", "year": "2014", "source": "Sleep Medicine, vol. 15, no. 8, pp. 979-985", "authors": ["Gosling J", "Philip Batterham", "Glozier N"]}, {"title": "GENDER DIFFERENCES IN RISK FACTORS FOR SUICIDAL BEHAVIOUR IDENTIFIED BY PERCEIVED BURDENSOMENESS THWARTED BELONGINGNESS AND ACQUIRED CAPABILITY CROSS SECTIONAL ANALYSIS FROM A LONGITUDINAL COHORT STUDY", "year": "2014", "source": "BMC Psychology, vol. 2, no. 1, pp. 20-20", "authors": ["Donker T", "Philip Batterham", "Van Orden K"]}, {"title": "Predictors of Adherence and Outcome in Internet-Based Cognitive Behavior Therapy Delivered in a Telephone Counseling Setting", "year": "2014", "source": "Cognitive Therapy and Research, vol. 38, no. 3, pp. 358-367", "authors": ["Farrer L", "Griffiths K", "Christensen H", "Philip Batterham"]}, {"title": "Comparing profiles of mental disorder across birth cohorts: Results from the 2007 Australian National Survey of Mental Health and Wellbeing", "year": "2014", "source": "Australian and New Zealand Journal of Psychiatry, vol. 48, no. 5, pp. 452-463", "authors": ["Sunderland M", "Carragher N", "Buchan H", "Philip Batterham"]}, {"title": "Investigating age-related differences in responses to screening items for internalising disorders in three national surveys", "year": "2014", "source": "Journal of Affective Disorders, vol. 152, pp. 229-236", "authors": ["Buchan H", "Sunderland M", "Carragher N", "Philip Batterham"]}, {"title": "Intra-individual reaction time variability and all-cause mortality over 17 years: A community-based cohort study", "year": "2014", "source": "Age and Ageing, vol. 43, no. 1, pp. 84-90", "authors": ["Philip Batterham", "Bunce D", "Mackinnon A"]}, {"title": "Online interventions for anxiety disorders", "year": "2014", "source": "Current Opinion In Psychiatry, vol. 27, no. 1, pp. 7-13", "authors": ["Christensen H", "Philip Batterham", "Calear A"]}, {"title": "Recruitment of mental health survey participants using Internet advertising: content, characteristics and cost effectiveness", "year": "2014", "source": "International Journal of Methods in Psychiatric Research, vol. 23, no. 2, pp. 184-191", "authors": ["Philip Batterham"]}, {"title": "Suicide literacy, suicide stigma and help-seeking intentions in Australian medical students", "year": "2014", "source": "Australasian Psychiatry, vol. 22, no. 2, pp. 132-139", "authors": ["Chan W", "Philip Batterham", "Christensen H"]}, {"title": "The Suicidal Ideation Attributes Scale (SIDAS): Community-Based Validation Study of a New Scale for the Measurement of Suicidal Ideation", "year": "2014", "source": "Suicide and Life-Threatening Behavior, vol. 44, no. 4, pp. 408-419", "authors": ["Van Spijker B", "Philip Batterham", "Calear A"]}, {"title": "Predictors of help-seeking for suicidal ideation in the community: Risks and opportunities for public suicide prevention campaigns", "year": "2014", "source": "Psychiatry Research, vol. 219, no. 3, pp. 525-530", "authors": ["Calear A", "Philip Batterham", "Christensen H"]}, {"title": "Evaluation of an online psychoeducation intervention to promote mental health help seeking attitudes and intentions among young adults: Randomised Controlled Trial", "year": "2014", "source": "Journal of Affective Disorders, vol. 168, no. 2014, pp. 65-71", "authors": ["Taylor-Rodgers E", "Philip Batterham"]}, {"title": "State-based output in Australian mental health research", "year": "2014", "source": "Australasian Psychiatry, 22, 266-271", "authors": ["Philip Batterham", "Christensen H", "Griffiths K"]}, {"title": "E-Health Interventions for Suicide Prevention", "year": "2014", "source": "International Journal of Environmental Research and Public Health, vol. 11, pp. 8193-8212", "authors": ["Christensen H", "Philip Batterham", "O'Dea B"]}, {"title": "Technology-based interventions for mental health in tertiary students: Systematic review", "year": "2013", "source": "Journal of Medical Internet Research, vol. 15, no. 5, pp. e101-e101", "authors": ["Farrer L", "Gulliver A", "Chan J", "Philip Batterham"]}, {"title": "The Stigma of Suicide Scale Psychometric Properties and Correlates of the Stigma of Suicide", "year": "2013", "source": "Crisis: The Journal of Crisis Intervention and Suicide Prevention\r\n, vol. 34, no. 1, pp. 13-21", "authors": ["Philip Batterham", "Calear A", "Christensen H"]}, {"title": "The effect of a web-based depression intervention on suicide ideation: Secondary outcome from a randomised controlled trial in a helpline", "year": "2013", "source": "BMJ Open, vol. 3, no. 6", "authors": ["Christensen H", "Farrer L", "Philip Batterham"]}, {"title": "The Getting of Wisdom: Fluid Intelligence Does Not Drive Knowledge Acquisition", "year": "2013", "source": "Journal of Cognition and Development, vol. 14, no. 2, pp. 321-331", "authors": ["Christensen H", "Philip Batterham", "Mackinnon A"]}, {"title": "POE Genotype and Cognitive Change in Young, Middle-Aged, and Older Adults Living in the Community", "year": "2014", "source": "Journals of Gerontology Series A: Biological Sciences and Medical Sciences, vol. 69, no. 4, pp. 379-386", "authors": ["Bunce D", "Bielak A", "Anstey K", "Philip Batterham"]}, {"title": "Utility of Intraindividual Reaction Time Variability to Predict White Matter Hyperintensities: A Potential Assessment Tool for Clinical Contexts?", "year": "2013", "source": "Journal of International Neuropsychological Society, vol. 19, no. 9, pp. 971-976", "authors": ["Bunce D", "Bielak A", "Cherbuin N", "Philip Batterham"]}, {"title": "polipoprotein E Îµ4 and later-life decline in cognitive function and grip strength", "year": "2013", "source": "American Journal of Geriatric Psychiatry, vol. 21, no. 10, pp. 1010-1019", "authors": ["Philip Batterham", "Bunce D", "Cherbuin N"]}, {"title": "Predictors of Generalized Anxiety Disorder stigma", "year": "2013", "source": "Psychiatry Research, vol. 206, no. 2-3, pp. 282-286", "authors": ["Philip Batterham", "Griffiths K", "Barney L"]}, {"title": "nxiety symptoms as precursors of major depression and suicidal ideation", "year": "2013", "source": "Depression and Anxiety, vol. 30, no. 10, pp. 908-916", "authors": ["Philip Batterham", "Christensen H", "Calear A"]}, {"title": "The association between suicidal ideation and increased mortality from natural causes", "year": "2013", "source": "Journal of Affective Disorders, vol. 150, no. 3, pp. 855-860", "authors": ["Philip Batterham", "Calear A", "Mackinnon A"]}, {"title": "Predictors and moderators of response to internet-delivered Interpersonal Psychotherapy and Cognitive Behavior Therapy for depression", "year": "2013", "source": "Journal of Affective Disorders, vol. 151, no. 1, pp. 343-351", "authors": ["Donker T", "Philip Batterham", "Warmerdam L"]}, {"title": "Hierarchical screening for multiple mental disorders", "year": "2013", "source": "Journal of Affective Disorders, vol. 151, no. 1, pp. 229-236", "authors": ["Philip Batterham", "Calear A", "Sunderland M"]}, {"title": "ge-related differences in internalizing psychopathology amongst the australian general population", "year": "2013", "source": "Journal of Abnormal Psychology, vol. 122, no. 4, pp. 1010-1020", "authors": ["Sunderland M", "Slade T", "Carragher N", "Philip Batterham"]}, {"title": "Correlates of suicide stigma and suicide literacy in the community", "year": "2013", "source": "Suicide and Life-Threatening Behavior, vol. 43, no. 4, pp. 406-417", "authors": ["Philip Batterham", "Calear A", "Christensen H"]}, {"title": "Mental health symptoms associated with morbidity, not mortality, in an elderly community sample", "year": "2012", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 47, no. 1, pp. 79-85", "authors": ["Philip Batterham", "Christensen H", "Mackinnon A"]}, {"title": "The association between change in cognitive ability and cause-specific mortality in a community sample of older adults", "year": "2012", "source": "Psychology and Aging, vol. 27, no. 1, pp. 229-236", "authors": ["Philip Batterham", "Mackinnon A", "Christensen H"]}, {"title": "Internet-based interventions to promote mental health help-seeking in elite athletes: an exploratory randomized controlled trial.", "year": "2012", "source": "Journal of Medical Internet Research, vol. 14, no. 3, pp. e69-e69", "authors": ["Gulliver A", "Griffiths K", "Christensen H", "Philip Batterham"]}, {"title": "Depression, anxiety and cognition in community-dwelling adults aged 70 years and over", "year": "2012", "source": "Journal of Psychiatric Research, vol. 46, no. 12, pp. 1662-1666", "authors": ["Bunce D", "Philip Batterham", "Mackinnon A"]}, {"title": "Longitudinal risk profiling for suicidal thoughts and behaviours in a community cohort using decision trees", "year": "2012", "source": "Journal of Affective Disorders, vol. 142, no. 1-3, pp. 306-314", "authors": ["Philip Batterham", "Christensen H"]}, {"title": "test of the Interpersonal Theory of Suicide in a large community-based cohort", "year": "2013", "source": "Journal of Affective Disorders, vol. 144, no. 3, pp. 225-234", "authors": ["Christensen H", "Philip Batterham", "Soubelet A"]}, {"title": "Cognitive-behavioural factors that predict sleep disturbance 4 years later", "year": "2012", "source": "Journal of Psychosomatic Research, vol. 73, no. 6, pp. 424-429", "authors": ["Gosling J", "Philip Batterham", "Christensen H"]}, {"title": "Sleep disturbance, personality and the onset of depression and anxiety: Prospective cohort study", "year": "2012", "source": "Australian and New Zealand Journal of Psychiatry, vol. 46, no. 11, pp. 1089-1098", "authors": ["Philip Batterham", "Glozier N", "Christensen H"]}, {"title": "Oral folic acid and vitamin B-12 supplementation to prevent cognitive decline in community-dwelling older adults with depressive symptoms-the Beyond Ageing Project: a randomized controlled trial", "year": "2012", "source": "American Journal of Clinical Nutrition, vol. 95, no. 1, pp. 194-203", "authors": ["Walker J", "Philip Batterham", "Mackinnon A"]}, {"title": "Funding for mental health research: the gap remains", "year": "2011", "source": "Medical Journal of Australia, vol. 195, no. 11-12, pp. 681-684", "authors": ["Christensen H", "Philip Batterham", "Hickie I"]}, {"title": "Comparison of age and time-to-death in the dedifferentiation of late-life cognitive abilities", "year": "2011", "source": "Psychology and Aging, vol. 26, no. 4, pp. 844-851", "authors": ["Philip Batterham", "Christensen H", "Mackinnon A"]}, {"title": "The Effect of Education on the Onset and Rate of Terminal Decline", "year": "2011", "source": "Psychology and Aging, vol. 26, no. 2, pp. 339-350", "authors": ["Christensen H", "Philip Batterham", "Mackinnon A"]}, {"title": "The generalised anxiety stigma scale (GASS): psychometric properties in a community sample", "year": "2011", "source": "BMC Psychiatry, vol. 11, pp. 184-184", "authors": ["Griffiths K", "Philip Batterham", "Barney L"]}, {"title": "No clear potentiation of antidepressant medication effects by folic acid + vitamin B12 in a large community sample", "year": "2011", "source": "Journal of Affective Disorders, vol. 130, no. 1-2, pp. 37-45", "authors": ["Christensen H", "Aiken A", "Philip Batterham"]}, {"title": "Discrimination and mental health problems among homeless minority young people", "year": "2010", "source": "Public Health Reports, vol. 125, no. 1, pp. 61-67", "authors": ["Milburn N", "Philip Batterham", "Ayala G"]}, {"title": "Mental health literacy, folic acid and vitamin B12, and physical activity for the prevention of depression in older adults: Randomised controlled trial", "year": "2010", "source": "British Journal of Psychiatry, vol. 197, no. 1, pp. 45-54", "authors": ["Walker J", "Mackinnon A", "Philip Batterham"]}, {"title": "dolescents exiting homelessness over two years: the risk amplification and abatement model", "year": "2009", "source": "Journal of Research on Adolescence, vol. 19, no. 4, pp. 762-785", "authors": ["Milburn N", "Rice E", "Rotheram-Borus M", "Philip Batterham"]}, {"title": "Modifiable risk factors predicting major depressive disorder at four year follow-up; A decision tree approach", "year": "2009", "source": "BMC Psychiatry, vol. 9, p. 75", "authors": ["Philip Batterham", "Christensen H", "Mackinnon A"]}, {"title": "Predictors of adherence by adolescents to a cognitive behaviour therapy website in school and community-based settings", "year": "2009", "source": "Journal of Medical Internet Research, vol. 11, no. 1, pp. e6", "authors": ["Calear A", "Philip Batterham", "Christensen H"]}, {"title": "Health e-cards as a means of encouraging help seeking for depression among young adults: Randomised Controlled Trial", "year": "2009", "source": "Journal of Medical Internet Research, vol. 11, no. 4, pp. e42", "authors": ["Costin D", "Mackinnon A", "Griffiths K", "Philip Batterham"]}, {"title": "Fluid intelligence is independently associated with all-cause mortality over 17 years in an elderly community sample: An investigation of potential mechanisms", "year": "2009", "source": "Intelligence, vol. 37, no. 6, pp. 551-550", "authors": ["Philip Batterham", "Christensen H", "Mackinnon A"]}, {"title": "Predictors of Adherence among community users of a Cognitive Behaviour Therapy Website", "year": "2008", "source": "Patient Preference and Adherence, vol. 2, pp. 97-105", "authors": ["Philip Batterham", "Calear A", "Bennett K"]}, {"title": "Measuring Sexual Risk Using Audio Computer-Assisted Self-Interviewing (ACASI) vs. Computer-Assisted Personal Interview (CAPI) in China", "year": "2007", "source": "International Journal of Sexual Health, vol. 19, no. 1, pp. 25-30", "authors": ["Li L", "Wu Z", "Rotheram-Borus M", "Philip Batterham"]}, {"title": "Unprotected sex among youth living with HIV before and after the advent of highly active antiretroviral therapy", "year": "2006", "source": "Perspectives on Sexual and Reproductive Health, vol. 38, no. 3, pp. 162-167", "authors": ["Rice E", "Philip Batterham", "Rotheram-Borus M"]}, {"title": "Discrimination and exiting homelessness among homeless adolescents", "year": "2006", "source": "Cultural Diversity and Ethnic Minority Psychology, vol. 12, no. 4, pp. 658-672", "authors": ["Milburn N", "Ayala G", "Rice E", "Philip Batterham"]}, {"title": "Finding Homeless Youth: Patterns Based on Geographical Area and Number of Homeless Episodes", "year": "2005", "source": "Youth and Society, vol. 37, no. 1, pp. 62-84", "authors": ["Witkin A", "Milburn N", "Rotheram-Borus M", "Philip Batterham"]}, {"title": "Predictors of Serostatus Disclosure to Partners Among Young People Living with HIV in the Pre- and Post-HAART Eras", "year": "2005", "source": "AIDS and Behavior, vol. 9, no. 3, pp. 281-287", "authors": ["Philip Batterham", "Rice E", "Rotheram-Borus M"]}]}, "Microsoft-Academic": [{"title": "the relationship between cognition and mortality in a community sample of older adults", "year": 2011, "source": "", "authors": [{"name": "philip batterham"}]}], "ANDS-Grants": [{"description": "A large proportion of people with depression, anxiety or suicidality do not seek help. Existing methods to screen for these conditions are not sufficiently effective and are not well incorporated into health care systems. This study will develop new, individually tailored ways to screen for mental health conditions. The study will test the implementation of these screening tools into a tailored service that combines online and primary care services.", "title": "Adaptive screening for depression, anxiety and suicidality for online interventions and primary care", "id": "110960", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1035262", "researchers": ["Dr Philip Batterham"], "status": "closed", "fundingAmount": 307946.16, "fundingScheme": "Early Career Fellowships", "startDate": 2012, "endDate": 2015, "dateTimeModified": "2015-04-12T08:12:02Z", "dateTimeCreated": "2013-05-15T07:21:38Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Philip Batterham"], "purl": "http://purl.org/au-research/grants/nhmrc/1035262", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1035262", "1035262"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "depressive disorder", "anxiety disorders", "suicide risk", "screening", "biostatistics", "internet service delivery", "primary care"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/110960"}]}, {"description": "The proposed research will develop a personalised mental health program designed to address multiple mental health problems: major depression, anxiety disorders and substance use disorders, and suicidality. The program will increase efficiency and user engagement by tailoring content based on individual needs, context and preferences. Ongoing monitoring using new methods of assessment will allow a responsive and flexible approach to care.", "title": "Improving online mental health programs: Tailored assessment meets tailored therapy", "id": "518927", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1083311", "researchers": ["Dr Philip Batterham"], "status": "active", "fundingAmount": 478065.06, "fundingScheme": "Career Development Fellowships", "startDate": 2015, "endDate": 2018, "dateTimeModified": "2018-03-07T07:53:00Z", "dateTimeCreated": "2015-04-12T08:18:11Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Philip Batterham"], "purl": "http://purl.org/au-research/grants/nhmrc/1083311", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1083311", "1083311"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "mental health", "depression", "anxiety disorders", "substance use", "prevention"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518927"}]}, {"description": "This project aims to study receptors that translate chemical signals into electrical signals in animal brains. These receptors are targeted by insecticides used to control the major pests that afflict agriculture and domestic pets. The project aims to establish the functions of nicotinic acetylcholine receptors in several behaviours and in insecticide responsiveness in the model insect, Drosophila melanogaster, using mutations that knock out the function of receptor subunits. Prior research has pointed to plasticity in the expression and transport of these receptors in response to genetic and environmental change. This project aims to identify the underlying mechanisms that provide the insect with resilience, to provide better options for pest control.", "title": "Discovery Projects - Grant ID: DP160100333", "id": "663773", "institutions": ["University of Melbourne"], "key": "http://purl.org/au-research/grants/arc/DP160100333", "researchers": ["Prof Philip Batterham"], "status": "active", "fundingAmount": 369600, "fundingScheme": "Discovery Projects", "startDate": 2016, "endDate": 2020, "dateTimeModified": "2018-10-02T04:21:33Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Melbourne"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP160100333", "identifiers": ["http://purl.org/au-research/grants/arc/DP160100333", "DP160100333"], "subjects": ["GENETICS", "BIOLOGICAL SCIENCES"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/663773"}]}, {"description": "The proposed research will develop a personalised mental health program designed to address multiple mental health problems: major depression, anxiety disorders and substance use disorders, and suicidality. The program will increase efficiency and user engagement by tailoring content based on individual needs, context and preferences. Ongoing monitoring using new methods of assessment will allow a responsive and flexible approach to care.", "title": "Improving online mental health programs: Tailored assessment meets tailored therapy", "id": "1345501", "key": "http://purl.org/au-research/grants/nhmrc/GNT1083311", "researchers": ["A/Pr Philip Batterham"], "institutions": null, "status": "active", "fundingAmount": 411768, "fundingScheme": "Career Development Fellowships", "startDate": 2015, "endDate": null, "dateTimeModified": "2019-06-03T04:23:18Z", "dateTimeCreated": "2018-10-03T01:49:35Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["A/Pr Philip Batterham"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1083311", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1083311", "GNT1083311"], "subjects": ["Public Health", "mental health | depression | anxiety disorders | substance use | prevention"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1345501"}]}, {"description": "There are many effective psychosocial interventions to prevent and treat common mental health problems. The impact of these interventions is limited by insufficient focus on using research evidence to promote public delivery of services. This program of research will investigate the barriers and facilitators to the public use of evidence-based interventions by identifying optimal ways to deliver internet interventions and testing new methods to encourage the use of evidence-based interventions.", "title": "Bridging the implementation gap for evidence-based psychosocial interventions", "id": "1349271", "key": "http://purl.org/au-research/grants/nhmrc/GNT1158707", "researchers": ["A/Pr Philip Batterham"], "institutions": null, "status": "active", "fundingAmount": 483404, "fundingScheme": "Career Development Fellowships", "startDate": 2019, "endDate": null, "dateTimeModified": "2019-06-03T04:23:51Z", "dateTimeCreated": "2018-10-03T01:50:13Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["A/Pr Philip Batterham"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1158707", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1158707", "GNT1158707"], "subjects": ["Public Health", "mental health | internet service delivery | translational research | depression | anxiety"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1349271"}]}, {"description": "Receptors in the nervous system relay signals required for nerve function. Insecticides targeting these receptors provide insect pest control. Better insecticides could be designed if the proteins involved in receptor assembly function were known. In identifying these proteins this project will improve options for safe and effective pest control.", "title": "Discovery Projects - Grant ID: DP130102415", "id": "535107", "institutions": ["University of Melbourne"], "key": "http://purl.org/au-research/grants/arc/DP130102415", "researchers": ["Prof Philip Batterham", "Prof David Sattelle"], "status": "closed", "fundingAmount": 420000, "fundingScheme": "Discovery Projects", "startDate": 2013, "endDate": 2015, "dateTimeModified": "2015-09-14T03:01:19Z", "dateTimeCreated": "2015-04-15T05:10:15Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Melbourne"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP130102415", "identifiers": ["http://purl.org/au-research/grants/arc/DP130102415", "DP130102415"], "subjects": ["GENETICS", "BIOLOGICAL SCIENCES", "drosophila melanogaster", "insecticide resistance", "neurogenetics"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/535107"}]}, {"description": "Suicide is the leading cause of death in Australians aged 15-24 years. This project will investigate the effectiveness of an intervention to promote help-seeking for suicidal behaviours in adolescence. Taking a whole school approach, peer leaders in 16 Australian high schools will receive training in the Sources of Strength program. The primary aim of the project is to determine whether peer leadership training and messaging improves help-seeking attitudes, intentions and behaviour for suicide.", "title": "Suicide prevention in schools: A social connectedness approach", "id": "518896", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1082914", "researchers": ["Dr Philip Batterham", "Dr Alison Calear", "Prof Helen Christensen"], "status": "active", "fundingAmount": 825989.25, "fundingScheme": "Project Grants", "startDate": 2015, "endDate": 2019, "dateTimeModified": "2018-03-07T07:52:59Z", "dateTimeCreated": "2015-04-12T08:18:08Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Alison Calear"], "purl": "http://purl.org/au-research/grants/nhmrc/1082914", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1082914", "1082914"], "subjects": ["Mental Health", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "suicide prevention", "adolescent", "school-based intervention", "social networks", "mental health"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518896"}]}]}