{"ANU": {"name": "Pia van Gelder PhD", "link": "https://researchers.anu.edu.au/researchers/van-gelder-p", "colleges": "College of Arts and Social Sciences", "email": "Pia.vanGelder@anu.edu.au", "phone": "", "expertise": [], "interest": ["art history, design history, media art history, music history, musicology, transdisciplinary art, speculative design, digital humanities, esotericism, energies, history of technology, history of medicine, history of science, anthropocene studies, theosophy, anthroposophy, divination, religion and technology, alternative therapies, subtle bodies, environmental humanities, feminism, gender studies, queer & anti-colonial methodologies, practice led research, hacking, intentional communities, artist communities"], "biography": "Her writing has been recently published in the Journal of Sonic Studies (16, Materials of Sound). With Caleb Kelly, she has co-authored a chapter of the forthcoming 3rd edition of Nicolas Collins, Handmade Electronic Music: The Art of Hardware Hacking (Routledge) and coedited a forthcoming collection Feminist, Queer, Anticolonial Propositions for Hacking the Anthropocene: Archive (Open Humanities Press), with Jennifer Mae Hamilton, Sue Reid, and Astrida Neimanis.", "project": ["PUBLICATIONS:", "Ed. Jennifer Mae Hamilton, Sue Reid, Pia van Gelder and Astrida Neimanis, Feminist, Queer, Anticolonial Propositions for Hacking the Anthropocene: Archive, Open Humanities Press, Forthcoming", "Caleb Kelly and Pia van Gelder, “Livening Things Up: Australian Hand Built Electronic Instruments,” ed. Nicolas Collins, Handmade Electronic Music: The Art of Hardware Hacking, 3rd Edition, Routledge, 2020", "Pia van Gelder, “Bodies and Energy, Circuits and Sound: Rethinking and Listening to Leon Ernest Eeman’s Relaxation Circuit with a Biosynthesiser,” Journal of Sonic Studies 16 Materials of Sound, https://www.researchcatalogue.net/view/459050/459051", "Tali Hinkis, Karl Lapidas and Pia van Gelder, “True Colours: A Video Endoscopy,” Das Superpaper Vol 33, (Sydney: Rococco, 2014), 50 - 55", "Pia van Gelder, “Psychic Waves: On Meeting a Friend,” Psychic Synth, (Sydney: Performance Space, 2013), 10-14", "Pia van Gelder, “My Machine Vision,” Firstdraft - Inside the Studio - Stories from the Emerging Artists Studio Program 1, Blood & Thunder Press: 2010", "", "SELECTED EXHIBITIONS & PERFORMANCES:", "“Soft Synth No. 2,” Material Sound, Black Mountain College Museum, 06.19", "“Psychic Synth No. 2,” McClelland Sculpture Gallery, Victoria, 04.19", "“MOS,” “Noble Wave,” The Instrument Builders Project, Kyoto Art Centre, Kyoto, Japan, 09.18", "“Soft Synth No.1,” Material Sound, Murray Art Museum Albury, 04-06.18", "“Iron Star,” Sounding the Future, UTS Gallery, Sydney, 08-09.17", "“Recumbent Circuit,” Primavera 2016 (group), Museum of Contemporary Art, Sydney, 09-12.16", "“Relaxation Circuit” (solo), Underbelly Festival, Cockatoo Island, and Westspace, Melbourne, 08.15", "“MOS,” “Noble Wave,” Instrument Builders Project (group), National Gallery Victoria, Melb., 11.14", "Psychic Synth (solo), Performance Space, Sydney Australia, 08-09.2014", "Television Behaviour Experiments (solo), TV broadcast & Performance Space, Sydney, 11.2013", "“Eyes Without a Face,” NSW Visual Arts Fellowship for Emerging Artists (group), Artspace, 10.2013", "“You or Me?,” Sydney Contemporary Art Fair (solo), Firstdraft Gallery, Carriageworks, 09.2013 Audio Visionaries, SCA Gallery (solo), Sydney Australia, 07.2012", "“AV Synth” (solo performance), SDLX 10th Anniversary, SuperDeluxe, Tokyo, Japan, 09.2012", "“AV Harp” (solo performance), Liquid Architecture (solo performance), ABC Studios, Sydney, 10.2011"], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}