{"ANU": {"name": "Prasanga Samarasinghe", "link": "https://researchers.anu.edu.au/researchers/samarasinghe-p", "colleges": "College of Engineering & Computer Science", "email": "prasanga.samarasinghe@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "", "project": [], "publication": [{"title": "ctive Noise Control over Space: A Subspace Method for Performance Analysis", "year": "2019", "source": "Applied Sciences, vol. 9, no. 1250, pp. 1-20", "authors": ["Zhang J", "Abhayapala T", "Zhang W", "Prasanga Samarasinghe"]}, {"title": "Spatial sound intensity vectors in spherical harmonic domain", "year": "2019", "source": "Journal of the Acoustical Society of America, vol. 145, no. 2, pp. 149-155", "authors": ["Zuo H", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "ctive Noise Control over Space: A Wave Domain Approach", "year": "2018", "source": "IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 26, no. 4, pp. 774-786", "authors": ["Zhang J", "Abhayapala T", "Zhang W", "Prasanga Samarasinghe"]}, {"title": "planar microphone array for spatial coherence-based source separation", "year": "2018", "source": "20th IEEE International Workshop on Multimedia Signal Processing, MMSP 2018, IEEE, USA, pp. 6pp", "authors": ["Fahim A", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Single-channel speech dereverberation in noisy environment for non-orthogonal signals", "year": "2018", "source": "Acta Acustica united with Acustica, vol. 104, no. 6, pp. 1041-1055pp", "authors": ["Fahim A", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Spherical harmonics based generalized image source method for simulating room acoustics", "year": "2018", "source": "Journal of the Acoustical Society of America, vol. 144, no. 3, pp. 1381-1391", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Chen H"]}, {"title": "Exterior-interior 3D sound field separation using a planar array of differential microphones", "year": "2018", "source": "16th International Workshop on Acoustic Signal Enhancement, IWAENC 2018, IEEE, United States, pp. 216-220pp", "authors": ["Zuo H", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Surround by Sound: A Review of Spatial Audio Recording and Reproduction", "year": "2017", "source": "Applied Sciences, vol. 7, no. 5, pp. 19pp", "authors": ["Zhang W", "Prasanga Samarasinghe", "Chen H"]}, {"title": "Estimating the Direct-To-Reverberant Energy Ratio Using a Spherical Harmonics-Based Spatial Correlation Model", "year": "2017", "source": "IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 25, no. 2, pp. 310-319pp", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Chen H"]}, {"title": "Direct-To-Reverberant Energy Ratio Estimation Using a First-Order Microphone", "year": "2017", "source": "IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 25, no. 2, pp. 226-237", "authors": ["Chen H", "Abhayapala T", "Prasanga Samarasinghe"]}, {"title": "Blind estimation of directional properties of room reverberation using a spherical microphone array", "year": "2017", "source": "2017 IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2017, IEEE Xplore, TBC, pp. 351-355", "authors": ["Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "coustic reciprocity: An extension to spherical harmonics domain", "year": "2017", "source": "Journal of the Acoustical Society of America, vol. 142, no. 4, pp. EL337-EL343", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Kellermann W"]}, {"title": "Performance analysis of a planar microphone array for three dimensional soundfield analysis", "year": "2017", "source": "2017 IEEE Workshop on Applications of Signal Processing to Audio and Acoustics, WASPAA 2017, IEEE, TBC, pp. 249-253", "authors": ["Prasanga Samarasinghe", "Chen H", "Fahim A"]}, {"title": "PSD estimation of multiple sound sources in a reverberant room using a spherical microphone array", "year": "2017", "source": "2017 IEEE Workshop on Applications of Signal Processing to Audio and Acoustics, WASPAA 2017, IEEE, TBC, pp. 76-80", "authors": ["Fahim A", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Sound field separation in a mixed acoustic environment using a sparse array of higher order spherical microphones", "year": "2017", "source": "Hands-Free Speech Communications and Microphone Arrays, HSCMA 2017, Institute of Electrical and Electronics Engineers (IEEE Inc), Piscataway, New Jersey, US, pp. 151-155pp", "authors": ["Fahim A", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Recent Advances in Active Noise Control Inside Automobile Cabins Toward quieter cars", "year": "2016", "source": "IEEE Signal Processing Magazine, vol. 33, no. 6, pp. 61-73pp", "authors": ["Prasanga Samarasinghe", "Zhang W", "Abhayapala T"]}, {"title": "Multichannel active noise control for spatially sparse noise fields", "year": "2016", "source": "Journal of the Acoustical Society of America, vol. 140, no. 6, pp. EL510-EL516pp", "authors": ["ZHANG J", "Abhayapala T", "Prasanga Samarasinghe"]}, {"title": "ROOM TRANSFER FUNCTION MEASUREMENT FROM A DIRECTIONAL LOUDSPEAKER", "year": "2016", "source": "15th International Workshop on Acoustic Signal Enhancement, IWAENC 2016, IEEE, Online, pp. 5pp", "authors": ["Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Validation of sound field duplication for device testing", "year": "2016", "source": "2nd Audio Engineering Society International Conference on Sound Field Control, AES 2016, ed. R Mason, J-W Choi & S Bech, Audio Engineering Society, TBC, pp. -", "authors": ["Dickins G", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "EXTRACTION OF EXTERIOR FIELD FROM A MIXED SOUND FIELD FOR 2D HEIGHT-INVARIANT SOUND PROPAGATION", "year": "2016", "source": "15th International Workshop on Acoustic Signal Enhancement, IWAENC 2016, IEEE, Online, pp. 5pp", "authors": ["Fahim A", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Sparse complex FxLMS for active noise cancellation over spatial regions", "year": "2016", "source": "IEEE International Conference on Acoustics, Speech and Signal Processing, ICASSP 2016, IEEE, Shanghai, China, pp. 524-528", "authors": ["ZHANG J", "Abhayapala T", "Prasanga Samarasinghe"]}, {"title": "In-car Noise Field Analysis and Multi-zone Noise Cancellation Quality Estimation", "year": "2015", "source": "Asia-Pacific Signal and Information Processing Association Annual Summit and Conference APSIPA 2015, IEEE, APSIPA, Asia-Pacific, pp. 773-778", "authors": ["Chen H", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Estimation of the Direct-to-Reverberant Energy Ratio using a Spherical Microphone Array", "year": "2015", "source": "IEEE Workshop on Applications of Signal Processing to Audio and Acoustics, WASPAA 2015, IEEE, TBC", "authors": ["Chen H", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "Spatial noise cancellation inside cars: Performance analysis and experimental results", "year": "2015", "source": "IEEE Workshop on Applications of Signal Processing to Audio and Acoustics, WASPAA 2015, IEEE, TBC, pp. 1-5", "authors": ["Chen H", "Prasanga Samarasinghe", "Abhayapala T"]}, {"title": "nalysis and performance of CMA blind deconvolution for image restoration", "year": "2015", "source": "International Journal of Adaptive Control and Signal Processing, vol. 29, no. 9, pp. 1135-1151", "authors": ["Kennedy R", "Prasanga Samarasinghe"]}, {"title": "Wavefield Analysis Over Large Areas Using Distributed Higher Order Microphones", "year": "2014", "source": "IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 22, no. 3, pp. 647-658", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Poletti M"]}, {"title": "On room impulse response between arbitrary points: An efficient parameterization", "year": "2014", "source": "6th IEEE International Symposium on Communications, Control and Signal Processing, ISCCSP 2014, IEEE Computer Society, Athens Greece, pp. 153-156", "authors": ["Prasanga Samarasinghe", "Betlehem T", "Poletti M"]}, {"title": "Room reflections assisted spatial sound field reproduction", "year": "2014", "source": "European Signal Processing Conference, EUSIPCO 2014, IEEE, TBC, pp. 1352-1356", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Poletti M"]}, {"title": "Synthesis of room transfer function over a region of space by multiple measurements using a higher-order directional microphone", "year": "2014", "source": "IEEE China Summit & International Conference on Signal and Information Processing ChinaSIP 2014, IEEE, Piscataway, NJ 08854 08854 USA, pp. 6-10", "authors": ["Prasanga Samarasinghe", "Abhayapala T", "Poletti M"]}, {"title": "D Spatial Soundfield Recording over Large Regions", "year": "2012", "source": "International Workshop on Acoustic Signal Enhancement 2012, IEEE Signal Processing Society, Unknown, pp. 1-4", "authors": ["Prasanga Samarasinghe", "Abhayapala P", "Poletti M"]}, {"title": "Interior and exterior sound field control using two dimensional higher-order variable-directivity sources", "year": "2012", "source": "Journal of the Acoustical Society of America, vol. 131, no. 5, pp. 3814-3823", "authors": ["Poletti M", "Abhayapala P", "Prasanga Samarasinghe"]}, {"title": "Spatial soundfield recording over a large area using distributed higher order microphones", "year": "2011", "source": "IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (WASPAA 2011), IEEE Signal Processing Society, USA, pp. 221 - 224", "authors": ["Prasanga Samarasinghe", "Abhayapala P", "Poletti M"]}]}, "Microsoft-Academic": [{"title": "modal based solutions for the acquisition and rendering of large spatial soundfields", "year": 2015, "source": "", "authors": [{"name": "prasanga samarasinghe"}]}], "ANDS-Grants": [{"description": "This project aims to advance fundamental research in active noise control over spatial regions. It has a broad range of industry applications, such as eliminating road and engine noise for multiple passengers inside car/airplane cabins, and creating individual quiet zones in a public environment. It will focus on developing new theories and techniques to generate multiple quiet zones in indoor/outdoor noisy environments with performance prediction, robust control, and effective implementation. In many practical applications, especially in consumer electronics and medical instruments, the creation of quiet zones is desirable so that in a shared environment people can have their own audio space without physical isolation or using headphones, creating a healthy living and working environment.", "title": "Discovery Projects - Grant ID: DP180102375", "id": "1316536", "key": "http://purl.org/au-research/grants/arc/DP180102375", "researchers": ["Prof Thushara Abhayapala", "Dr Wen Zhang", "Dr Prasanga Samarasinghe"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 420055, "fundingScheme": "Discovery Projects", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:42Z", "dateTimeCreated": "2018-03-06T23:37:34Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP180102375", "identifiers": ["http://purl.org/au-research/grants/arc/DP180102375", "DP180102375"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1316536"}]}]}