{"ANU": {"name": "Ray Lovett", "link": "https://researchers.anu.edu.au/researchers/lovett-rw", "colleges": "College of Health & Medicine", "email": "raymond.lovett@anu.edu.au", "phone": "02 6125 5619", "expertise": ["Aboriginal And Torres Strait Islander Health", "Primary Health Care", "Clinical Nursing Primary Preventative", "Epidemiology", "Health And Community Services", "Public Health And Health Services Not Elsewhere Classified"], "interest": ["Cohort StudiesSocial EpidemiologyCultural determinants of health and wellbeingPsychometricsData Sovereignty and Governance"], "biography": "Dr Raymond Lovett BN, RN, BHSc, MAE, PhD is a Senior Research Fellow with the Epidemiology for Policy and Practice group at the National Centre for Epidemiology and Population Health, The Australian National University. He also holds an adjunct Fellowship at the Australian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS) in the Indigenous Social and Cultural Wellbeing group. Ray is an Aboriginal (Ngiyampaa/Wongaibon) epidemiologist with extensive experience in health services research, large scale data analysis for public health policy development and evaluation.", "project": ["Mayi Kuwayu: The National Study of Aborginal and Torres Strait Islander Wellbeing.", ""], "publication": [{"title": "Tobacco smoking and mortality among Aboriginal and Torres Strait Islander adults in Australia", "year": "2021", "source": "International Journal of Epidemiology, vol. Online", "authors": ["Thurber K", "Banks E", "Joshy G", "Ray Lovett"]}, {"title": "Developing and validating measures of self-reported everyday and healthcare discrimination for Aboriginal and Torres Strait Islander adults", "year": "2021", "source": "International Journal for Equity in Health, vol. 20, no. 14", "authors": ["Thurber K", "Walker J", "Batterham P", "Ray Lovett"]}, {"title": "The answers were there before white man come in", "year": "2020", "source": ": stories of strength and resilience for responding to violence in Aboriginal and Torres Strait Islander communities - Family Community Safety for Aboriginal and Torres Strait Islander Peoples Study Report", "authors": ["Guthrie J", "Thurber K", "Ray Lovett"]}, {"title": "Foundation for a Smoke-Free World and healthy Indigenous futures: an oxymoron?", "year": "2020", "source": "Tobacco Control, vol. 29, no. 2, pp. 237-240", "authors": ["Waa A", "Robson B", "Gifford H", "Ray Lovett"]}, {"title": "Rights, interests and expectations: Indigenous perspectives on unrestricted access to genomic data", "year": "2020", "source": "Nature Reviews: Genetics, vol. 21, pp. 377-384", "authors": ["Hudson M", "Garrison N", "Sterling R", "Ray Lovett"]}, {"title": "Cardiovascular disease risk assessment for Aboriginal and Torres Strait Islander adults aged under 35 years: a consensus statement", "year": "2020", "source": "Medical Journal of Australia, vol. 212, no. 9, pp. 422-427", "authors": ["Agostino J", "Wong D", "Paige E", "Ray Lovett"]}, {"title": "Strengths-based approaches for quantitative data analysis: A case study using the australian Longitudinal Study of Indigenous Children", "year": "2020", "source": "Social Science and Medicine, vol. 12", "authors": ["Thurber K", "Thandrayen J", "Banks E", "Ray Lovett"]}, {"title": "Who responds? An examination of response rates to a national postal survey of Aboriginal and Torres Strait Islander adults, 2018-2019", "year": "2020", "source": "BMC Medical Research Methodology, vol. 20, no. 1, pp. -", "authors": ["Wright A", "Thurber K", "Yap M", "Ray Lovett"]}, {"title": "unified call to action from Australian nursing and midwifery leaders: ensuring that Black lives matter [IN PRESS]", "year": "2020", "source": "Contemporary Nurse, vol. Online", "authors": ["Geia L", "Baird K", "Bail K", "Ray Lovett"]}, {"title": "Review of tobacco use among Aboriginal and Torres Strait Islander peoples", "year": "2020", "source": "Australian Indigenous Health Bulletin, vol. 20, no. 2, pp. 1-62", "authors": ["Colonna E", "Maddox R", "Cohen R", "Ray Lovett"]}, {"title": "Evaluating impacts of a One Health approach to companion animal health and management in a remote Aboriginal community in the Northern Territory, Australia", "year": "2020", "source": "Animals, vol. 10, no. 10, pp. 1-12", "authors": ["Riley T", "Ray Lovett", "Thandrayen J"]}, {"title": "ssessing research impact: Australian Research Council criteria and the case of Family Wellbeing research", "year": "2019", "source": "Evaluation and Program Planning, vol. 73, pp. 176-186", "authors": ["Tsey K", "Onnis L", "Whiteside M", "Ray Lovett"]}, {"title": "national profile of Aboriginal and Torres Strait Islander Health Workers, 2006-2016", "year": "2019", "source": "Australian and New Zealand Journal of Public Health, vol. 43, no. 1, pp. 24-26", "authors": ["Wright A", "Briscoe K", "Ray Lovett"]}, {"title": "Commercial tobacco and indigenous peoples: a stock take on Framework Convention on Tobacco Control progress", "year": "2019", "source": "Tobacco Control, vol. 28, no. 5, pp. 574-581", "authors": ["Maddox R", "Waa A", "Lee K", "Ray Lovett"]}, {"title": "Sugar-sweetened beverage consumption among Aboriginal and Torres Strait Islander children aged 0-3 years, and association with sociodemographic, life circumstances, and health factors [IN PRESS]", "year": "2019", "source": "Public Health Nutrition, vol. Online", "authors": ["Thurber K", "Long J", "Salmon M", "Ray Lovett"]}, {"title": "ustralian researchers oppose funding from the Foundation for a Smoke-Free World", "year": "2018", "source": "Australian and New Zealand Journal of Public Health, vol. 42, no. 6, pp. 506-507", "authors": ["Thomas D", "Hefler M", "Bonevski B", "Ray Lovett"]}, {"title": "Evidence review of Indigenous culture for health and wellbeing", "year": "2018", "source": "The International Journal of Health, Wellness, and Society, vol. 8, no. 4, pp. 11-27pp", "authors": ["Bourke S", "Wright A", "Guthrie J", "Ray Lovett"]}, {"title": "Reply to: Absolute cardiovascular disease risk and lipid-lowering therapy among Aboriginal and Torres Strait Islander Australians", "year": "2018", "source": "The Medical Journal of Australia (Online), vol. 209, no. 8, pp. 368-370pp", "authors": ["Ray Lovett"]}, {"title": "ssociations between participation in a ranger program and health and wellbeing outcomes among Aboriginal and Torres Strait Islander people in central Australia: A proof of concept study", "year": "2018", "source": "International Journal of Environmental Research and Public Health, vol. 15, no. 7, pp. 1-13", "authors": ["Jones R", "Thurber K", "Wright A", "Ray Lovett"]}, {"title": "Telling our story. Creating our own history", "year": "2018", "source": ": Caregivers' reasons for participating in an Australian longitudinal study of Indigenous childrenInternational Journal for Equity in Health, vol. 17, no. 143, pp. 15pp", "authors": ["Thurber K", "Olsen PhD A", "Guthrie J", "Ray Lovett"]}, {"title": "nalysing aggregate clinical data to support evaluation of the Tackling Indigenous Smoking program", "year": "2018", "source": "Australian Health Reviewno. August 2018, pp. 1-7", "authors": ["Wright A", "Cameron H", "Roe Y", "Ray Lovett"]}, {"title": "Indigenous health program evaluation design and methods in Australia: a systematic review of the evidence", "year": "2017", "source": "Australian and New Zealand Journal of Public Health, vol. 41, no. 5, pp. 480-482", "authors": ["Lokuge K", "Thurber K", "Calabria B", "Ray Lovett"]}, {"title": "bsolute cardiovascular disease risk and lipid-lowering therapy among Aboriginal and Torres Strait Islander Australians", "year": "2018", "source": "Medical Journal of Australia, vol. 209, no. 1, pp. 35-41pp", "authors": ["Calabria B", "Korda R", "Ray Lovett"]}, {"title": "Study protocol: Our Cultures Count, the Mayi Kuwayu Study, a national longitudinal study of Aboriginal and Torres Strait Islander wellbeing", "year": "2018", "source": "BMJ Open, vol. 8, no. 6, pp. 1-7", "authors": ["Jones R", "Thurber K", "Chapman J", "Ray Lovett"]}, {"title": "Intergenerational and early life influences on the well-being of Australian Aboriginal and Torres Strait Islander children: overview and selected findings from Footprints in Time, the Longitudinal Study of Indigenous Children", "year": "2018", "source": "Journal of Developmental Origins of Health and Disease, vol. 10, pp. 17-23", "authors": ["Salmon M", "Skelton F", "Thurber K", "Ray Lovett"]}, {"title": "Understanding barriers to fruit and vegetable intake in the Australian Longitudinal Study of Indigenous Children: a mixed-methods approach", "year": "2017", "source": "Public Health Nutrition, vol. 20, no. 5, pp. 832-847", "authors": ["Thurber K", "Banwell C", "Neeman T", "Ray Lovett"]}, {"title": "Deadly progress: changes in Aboriginal and Torres Strait Islander smoking prevalence", "year": "2017", "source": "Public Health Research & Practice, vol. 27, no. 4, pp. e2741733", "authors": ["Ray Lovett", "Thurber K", "Maddox R"]}, {"title": "Enhancing national data to align with policy objectives: Aboriginal and Torres Strait Islander smoking prevalence at finer geographic levels.", "year": "2017", "source": "Australian Health Review, vol. Online, pp. 8pp", "authors": ["Wright A", "Ray Lovett", "Roe Y"]}, {"title": "The Aboriginal and Torres Strait Islander smoking epidemic: what stage are we at, and what does it mean?", "year": "2017", "source": "Public Health Research & Practice, vol. 27, no. 4, pp. e2741733 (6pp)", "authors": ["Ray Lovett", "Thurber K", "Maddox R"]}, {"title": "Indigenous health data and the path to healing", "year": "2017", "source": "Lancet, The (UK edition), vol. 390, no. 10107, pp. 2022-2023pp", "authors": ["Walker J", "Ray Lovett", "Kukutai T"]}, {"title": "Health Conditions and Health Service Utilisation among Children in LSIC", "year": "2017", "source": "in Maggie Walter, Karen L. Martin, Gawaian Bodkin-Andrews (ed.), Indigenous Children Growing Up Strong: A Longitudinal Study of Aboriginal and Torres Strait Islander Families, Palgrave Macmillan Ltd, UK, pp. 209-231pp", "authors": ["Ray Lovett", "Thurber K"]}, {"title": "Indigenous Children", "year": "2017", "source": "s Resilience: The Role of DemographicsRelationships, Achievement and Culture', in Maggie Walter, Karen L. Martin, Gawaian Bodkin-Andrews (ed.), Indigenous Children Growing Up Strong: A Longitudinal Study of Aboriginal and Torres Strait Islander Families, Palgrave Macmillan Ltd, UK, pp. 287-308pp", "authors": ["Ray Lovett"]}, {"title": "Plain packaging implementation: perceptions of risk and prestige of cigarette brands among Aboriginal and Torres Strait Islander people", "year": "2016", "source": "Australian and New Zealand Journal of Public Health, vol. 40, no. 3, pp. 221-225", "authors": ["Maddox R", "Durkin S", "Ray Lovett"]}, {"title": "Existing knowledge", "year": "2016", "source": "practice and responses to violence against women in Australian Indigenous communities: State of knowledge paper", "authors": ["Olsen PhD A", "Ray Lovett"]}, {"title": "Existing knowledge", "year": "2016", "source": "practice and responses to violence against women in Australian Indigenous communities: Key findings and future directions. Australia’s National Research Organisation for Women’s Safety: SydneyNew South Wales.", "authors": ["Ray Lovett"]}, {"title": "re Indigenous mortality gaps closing: how to tell, and when?", "year": "2016", "source": "The Medical Journal of Australia, vol. 205, no. 1, p. 11", "authors": ["Ring I", "Dixon T", "Ray Lovett"]}, {"title": "SYSTEMATIC REVIEW PROTOCOL SOCIAL NETWORK ANALYSIS OF TOBACCO USE", "year": "2014", "source": "Systematic Reviews, vol. 3, no. 85, pp. 85-85", "authors": ["Maddox R", "Davey R", "Ray Lovett"]}, {"title": "Walan Girri: developing a culturally mediated case management model for problematic alcohol use among urban Indigenous people", "year": "2014", "source": "Australian Health Review, vol. 38, no. 4, pp. 440-446", "authors": ["Ray Lovett", "Dance P", "Guthrie J"]}, {"title": "Study protocol - Indigenous Australian social networks and the impact on smoking policy and programs in Australia: Protocol for a mixed-method prospective study", "year": "2013", "source": "BMC Public Health, vol. 13, no. 1", "authors": ["Maddox R", "Davey R", "Cochrane T", "Ray Lovett"]}, {"title": "", "year": "2012", "source": "Review of the need to expand drug and alcohol rehabilitation services in the ACT: Consumer feedback study", "authors": ["MacQueen R", "Biven A", "Ray Lovett"]}, {"title": "Where", "year": "2010", "source": "s your country? New approaches for working with problematic alcohol use among Indigenous Australians in an urban setting'Australian Aboriginal Studies Journal, no. 1, pp. 100-107", "authors": ["Guthrie J", "Ray Lovett", "Dance P"]}, {"title": "Health service attendance patterns in an urban Aboriginal health service", "year": "2010", "source": "Medical Journal of Australia, vol. 193, no. 3, pp. 146-148", "authors": ["Flegg K", "Phillips C", "Collins A", "Ray Lovett"]}, {"title": "boriginal and Torres Strait Islander health assessments - Barriers to improving uptake", "year": "2008", "source": "Australian Family Physician, vol. 37, no. 12, pp. 1033-1038", "authors": ["Kehoe H", "Ray Lovett"]}]}, "Microsoft-Academic": [{"title": "lettersthings fall apart", "year": 2012, "source": "", "authors": [{"name": "ray lovett"}]}], "ANDS-Grants": []}