{"ANU": {"name": "Rebecca Monson", "link": "https://researchers.anu.edu.au/researchers/monson-rj", "colleges": "ANU College of Law", "email": "rebecca.monson@anu.edu.au", "phone": "(02) 6125 8271", "expertise": ["Access To Justice", "Environmental And Natural Resources Law", "Law And Society", "Social And Cultural Geography", "Social And Cultural Anthropology", "Pacific History Excl. New Zealand And Maori", "Anthropology Of Development"], "interest": [], "biography": "Rebecca received her PhD from the ANU in 2012, for a thesis examining transformations in gendered land relations associated with colonisation, missionisation and the commodification of natural resources in Solomon Islands. She undertook her undergraduate studies at Monash University, where she  graduated with first class honours in Law, the Supreme Court Prize for Best Honours Thesis, and first class honours in Geography and Environmental Science. Rebecca has two young children and works part time.", "project": ["Rebecca has published in the field of housing, land and property  rights;  natural resource management; disaster and emergency management;  and the  intersection of local and state-based forms of dispute  resolution.", "Rebecca is currently working on a book manuscript, under contract with Cambridge University Press, examining transformations in gender relations and land relations in Solomon Islands, and the ways in which local contests over the 'ownership' of land are entwined with state formation. She is also working on an edited volume publishing the results of research examining the capacity of customary tenure systems to respond to climate-induced displacement.", "", ""], "publication": [{"title": "", "year": "2018", "source": "The rush for Oceania: critical perspectives on contemporary oceans governance and stewardship", "authors": ["Allen M", "Teaiwa K", "Koya-Vaka'uta C", "Rebecca Monson"]}, {"title": "The Politics of Property: Gender, Land and Political Authority in Solomon Islands", "year": "2017", "source": "in Siobhan McDonnell, Matthew G. Allen, Colin Filer (ed.), Kastom, Property and Ideology: Land Transformations in Melanesia, ANU ePress, Canberra, pp. 383-404", "authors": ["Rebecca Monson"]}, {"title": "Negotiating relocation in a weak state: land tenure and adaptation to sea-level rise in Solomon Islands", "year": "2016", "source": "in S Price, J Singer (ed.), Global Implications of Development, Disasters and Climate Change: Responses to Displacement from Asia Pacific, Routledge, Abingdon and New York, pp. 240-255", "authors": ["Rebecca Monson", "Fitzpatrick D"]}, {"title": "From Taovia to Trustee: Urbanisation, Land Disputes and Social Differentiation in Kakabona", "year": "2015", "source": "Journal of Pacific History, vol. 50, no. 4, pp. 437-449", "authors": ["Rebecca Monson"]}, {"title": "Land law and natural disasters in the South Pacific", "year": "2015", "source": "Alternative Law Journal, vol. 40, no. 3, pp. 195-198", "authors": ["Fitzpatrick D", "Rebecca Monson"]}, {"title": "Em)placing law: migration, belonging and place in Solomon Islands", "year": "2015", "source": "in Fiona Jenkins, Mark Nolan, Kim Rubenstein (ed.), Allegiance and Identity in a Globalised World, Cambridge University Press, Cambridge, United Kingdom, pp. 117-141", "authors": ["Rebecca Monson", "Hoa'au G"]}, {"title": "Climate-related displacement and options for resettlement in Solomon Islands", "year": "2014", "source": "in Scott Leckie (ed.), Land Solutions for Climate Displacement, Routledge, London, UK, pp. 291-316", "authors": ["Rebecca Monson", "Foukona J"]}, {"title": "Unsettled Explorations of Law", "year": "2014", "source": "s Archives: The Allure and Anxiety of Solomon Islands' Court Records'The Australian Feminist Law Journal, vol. 40, no. 1, pp. 35-50", "authors": ["Rebecca Monson"]}, {"title": "Land and Conflict in Papua New Guinea: The Role of Land Mediation", "year": "2014", "source": "Security Challenges, vol. 10, no. 2, pp. 1-14", "authors": ["Allen M", "Rebecca Monson"]}, {"title": "Climate Change and the Legal Framework for Settlement Relocation in the South Pacific", "year": "2013", "source": "2013 FIG Pacific Small Island Developing States Symposium: Policies and Practices for Responsible Government, ed. To be checked, International Federation of Surveyors, Fiji", "authors": ["Fitzpatrick D", "Rebecca Monson"]}, {"title": "From Taovia to Trustees: male spokespersons and", "year": "2013", "source": "dangerous' land disputes in Kakabona'Solomon Islands in Transition Workshop, Australian National University, Canberra, Australia., pp. 1pp", "authors": ["Rebecca Monson"]}, {"title": "Vernacularising Political Participation: Strategies of Women Peace-builders in Solomon Islands", "year": "2013", "source": "Intersections: Gender and Sexuality in Asia and the Pacific, no. 33, p. 12", "authors": ["Rebecca Monson"]}, {"title": "From Adam", "year": "2013", "source": "s rib': land disputessocial differentiation and state formation in postcolonial Solomon Islands', Property and Citizenship in Developing Countries, ProCit research group, Copenhagen, pp. 6pp", "authors": ["Rebecca Monson"]}, {"title": "Outsider engagement in debates about constitutional reform", "year": "2013", "source": "IGLP: The Workshop, ed. Institute of Global Law and Policy, Harvard Law School, Harvard Law School, Massachusetts, pp. 1pp", "authors": ["Rebecca Monson"]}, {"title": "Justice Delivered Locally\r\nSystems", "year": "2013", "source": "Challenges and Innovations in Solomon Islands. Washington DC: World BankJustice Delivered Locally, Research Report, August 2013, pp 1-92", "authors": ["Allen M", "Dinnen S", "Evans D", "Rebecca Monson"]}, {"title": "The problem of property: Knowing and speaking about land in Solomon Islands", "year": "2012", "source": "Innovation, Development, Creativity and Access in Knowledge in Pacific Island Countries, ANU College of Asia and the Pacific, Canberra, pp. 2pp", "authors": ["Rebecca Monson"]}, {"title": "Negotiating Land Tenure: Women, Men and the Transformation of Land Tenure in Solomon Islands", "year": "2011", "source": "in Janine Ubink (ed.), Customary Justice: Perspectives on Legal Empowerment, International Development Law Organization in conjuction with Van Vollenhoven Institute, University of Leiden, Rome, pp. 169-185", "authors": ["Rebecca Monson"]}, {"title": "Negotiating Land Tenure: Women, Men and the Transformation of Land Tenure in Solomon Islands", "year": "2011", "source": "in Janine Ubink (ed.) Customary Justice: Perspectives on Legal EmpowermentInternational Development Law Organisation and Van Vollenhoven Institute for Law, Governance and Development, Rome, Italy, pp 169-18", "authors": ["Rebecca Monson", ""]}, {"title": "sia-Pacific: Haitians must determine the future of Haiti", "year": "2010", "source": "Alternative Law Journal, vol. 35, no. 1, pp. 41-42", "authors": ["Fitzpatrick D", "Rebecca Monson"]}, {"title": "Participatory research on land issues in Solomon Islands", "year": "2010", "source": "Pacific Currents Issues 1.2 and 2.", "authors": ["Rebecca Monson"]}, {"title": "Women, State Law and Land in Peri-Urban Settlements on Guadalcanal, Solomon Islands", "year": "2010", "source": "World Bank Justice for the Poor Briefing Note 4(3", "authors": ["Rebecca Monson"]}, {"title": "Balancing Rights and Norms: Property Programming in East Timor, the Solomon Islands, and Bougainville", "year": "2009", "source": "in Scott Leckie (ed.), Housing, Land, and Property Rights in Post-Conflict United Nations and Other Peace Operations: A comparative survey and proposal for reform, Cambridge University Press, New York, pp. 103-135", "authors": ["Fitzpatrick D", "Rebecca Monson"]}, {"title": "Does a Rights Based Approach Make a Difference? The Role of Public Law in Vulnerability Reduction", "year": "2004", "source": "International Journal of Mass Emergencies and Disasters22(3): 43-59", "authors": ["Rebecca Monson"]}, {"title": "The 1998 Floods in the Tambo Valley", "year": "2004", "source": "International Journal of Mass Emergencies and Disasters 22 (3):61-8", "authors": ["Rebecca Monson"]}]}, "Microsoft-Academic": [{"title": "justice delivered locally systems challenges and innovations in solomon islands", "year": 2013, "source": "", "authors": [{"name": "matthew allen"}, {"name": "sinclair dinnen"}, {"name": "daniel evans", "affiliation": "world bank"}, {"name": "rebecca monson"}]}, {"title": "hospitalist orthopedic co management of high risk patients undergoing lower extremity reconstruction surgery", "year": 2009, "source": "orthopedics", "authors": [{"name": "michael s pinzur", "affiliation": "loyola university medical center"}, {"name": "edward gurza"}, {"name": "theresa kristopaitis"}, {"name": "rebecca monson"}, {"name": "michael j wall"}, {"name": "anne porter"}, {"name": "victoria davidsonbell"}, {"name": "timothy rapp"}], "id": 157799717}, {"title": "balancing rights and norms property programming in east timor the solomon islands and bougainville", "year": 2008, "source": "", "authors": [{"name": "daniel fitzpatrick", "affiliation": "australian national university"}, {"name": "rebecca monson"}]}, {"title": "land and conflict in papua new guinea the role of land mediation", "year": 2014, "source": "security challenges", "authors": [{"name": "matthew allen"}, {"name": "rebecca monson"}], "id": 2764921500}, {"title": "from taovia to trustee urbanisation land disputes and social differentiation in kakabona", "year": 2015, "source": "journal of pacific history", "authors": [{"name": "rebecca monson", "affiliation": "australian national university"}], "id": 149151609}, {"title": "does a rights based approach make a difference the role of public law in vulnerability reduction", "year": 2004, "source": "international journal of mass emergencies and disasters", "authors": [{"name": "john handmer"}, {"name": "rebecca monson"}], "id": 2764510807}, {"title": "negotiating relocation in a weak state land tenure and adaptation to sea level rise in solomon islands", "year": 2016, "source": "", "authors": [{"name": "rebecca monson", "affiliation": "australian national university"}, {"name": "daniel fitzpatrick", "affiliation": "australian national university"}]}, {"title": "property rights and climate migration adaptive governance in the south pacific", "year": 2020, "source": "regulation & governance", "authors": [{"name": "daniel fitzpatrick", "affiliation": "monash university"}, {"name": "rebecca monson", "affiliation": "australian national university"}], "id": 108218269}, {"title": "gender and law", "year": 2018, "source": "", "authors": [{"name": "rebecca monson", "affiliation": "australian national university"}]}, {"title": "the politics of property gender land and political authority in solomon islands", "year": 2017, "source": "", "authors": [{"name": "rebecca monson"}]}], "ANDS-Grants": [{"description": "This project analyses local relocations caused by rising sea levels in Solomon Islands, in order to support sustainable and inclusive resettlement of displaced persons in their home environments.", "title": "Discovery Projects - Grant ID: DP130104802", "id": "534794", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP130104802", "researchers": ["A/Prof Daniel Fitzpatrick", "Ms Rebecca Monson"], "status": "closed", "fundingAmount": 250000, "fundingScheme": "Discovery Projects", "startDate": 2013, "endDate": 2015, "dateTimeModified": "2015-09-14T03:02:04Z", "dateTimeCreated": "2015-04-15T05:09:53Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP130104802", "identifiers": ["http://purl.org/au-research/grants/arc/DP130104802", "DP130104802"], "subjects": ["LAW", "LAW AND LEGAL STUDIES", "climate change law", "property law"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/534794"}]}]}