{"ANU": {"name": "Rebekah (Beck) Davis", "link": "https://researchers.anu.edu.au/researchers/davis-r", "colleges": "College of Arts and Social Sciences", "email": "beck.davis@anu.edu.au", "phone": "0408 153 738", "expertise": ["Design Innovation", "Industrial Design", "Design Management And Studio And Professional Practice", "Curriculum And Pedagogy"], "interest": ["Design studies / design process / design thinking / social innovation / design futures / analysing collaborative design activity and complex problem solving"], "biography": "Beck is a Senior Lecturer in the ANU School of Art and Design. Her research focuses on design studies, examining design teams and how they collaborate and respond to complex problems. This includes the analysis of non-verbal, gestural interactions as well as the use of metaphors and analogies during the creative process. She also engages in cross-cultural and cross-disciplinary teaching and research collaborations. She currently serves on the Board of Directors for the Design Institute of Australia where she contributes to the National Advisory Committee serving on both the DIA NAC Policy Committee, and DIA NAC Education Committee. She is also a Board member of Art Monthly Australasia.", "project": ["2021 - 2023 The Data Imaginary: Fears and Fantasies, touring exhibition", "2016 Climatic: Post Normal Design, Miller Gallery, Carnegie Mellon University", "2015 Experimental Thinking/Design Practices, Griffith University Art Museum", "2015 Wear Next_ An Exploration into the Future of Wearable Technology, Artisan Gallery", "", "Selected Exhibitions - Group", "2017 Digital Futures Lab, State Library, Brisbane", "2017 Dispositive Environments, Hunt Gallery, St Louis", "2016 Wear Next_ Academy of Visual Arts, Hong Kong Baptist University Gallery, Hong Kong", "2016 The Body in Translation, Tangible, Embedded, and Embodied Interaction (TEI'16), The Netherlands", "2015 EXCHANGE, Crane Arts, Philadelphia", "2014 Design in Flux, Crane Arts, Philadelphia"], "publication": [{"title": "The BIOdress: A Body-worn Interface for Environmental Embodiment", "year": "2016", "source": "Tenth International Conference on Tangible, Embedded and Embodied Interaction, ACM, New York, NY, USA, pp. 627-634", "authors": ["Adhitya S", "Rebekah (Beck) Davis", "Frankjaer R ("]}, {"title": "Gesture, Creativity and Design", "year": "2016", "source": "The Fourth International Conference on Design Creativity, ed. Julie, Linsey; Maria, Yang; Yukari, Nagai, Georgia Institute of Technology, Atlanta, p. 13", "authors": ["Rebekah (Beck) Davis"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}