{"ANU": {"name": "Rhys Murphy", "link": "https://researchers.anu.edu.au/researchers/murphy-r", "colleges": "College of Science", "email": "Rhys.Murphy@anu.edu.au", "phone": "+61 2 6125 4039, Building 138, Level 3, Room 3.110", "expertise": ["Organic Chemistry", "Organic Chemical Synthesis", "Nanochemistry And Supramolecular Chemistry", "Medicinal And Biomolecular Chemistry", "Analytical Chemistry", "Physical Organic Chemistry", "Instrumental Methods Excl. Immunological And Bioassay Methods", "Immunological And Bioassay Methods"], "interest": ["Synthetic Organic ChemistrySupramolecular and      host-guest chemistry (molecular tweezers).Porphyrins and polycyclic      (polynorbornyl) compounds.Medicinal and biomolecular      chemistry; small molecule enzyme inhibitors, amino acid derivatives, diagnostic      medical imaging agents/radiotracers (stable isotope analogues of PET scan      drugs).Deuterium-labelling      chemistry and labelled compound characterisation, including hydrothermal      exchange reactions under metal catalysis on D2O at high      pressure and temperature, as well as by multi-step synthesis.Microwave reactor and Parr      reactor organic synthesis, including high pressure and high temperature.Spectroscopic      characterisation techniques including NMR and UV-Vis (both at variable      temperature, host-guest titrations).Determination of host-guest binding      models and calculation of binding constants from spectral data. Molecular modelling.Mass Spectrometry.in vitro metabolic assays.Nanotechnology      (organic chemistry and surface chemistry)."], "biography": "Rhys completed his PhD in supramolecular and synthetic organic chemistry in 2016 at Flinders University with Assoc Prof Martin Johnston. This involved the design and synthesis of molecular tweezers utilising bis-porphyrin receptors with rigid polycyclic/polynorbornyl backbones, and examination of their host-guest chemistry with diamino ligands by curve fitting of NMR and UV-Vis spectroscopic titration data to determine speciation and calculate binding constants. This included analysis of a unique two binding site tweezer which exhibited a rarely observed type of cooperativity in artificial receptors known as interannular cooperativity.", "project": [], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}