{"ANU": {"name": "Riccardo Natoli Natoli", "link": "https://researchers.anu.edu.au/researchers/natoli-rc", "colleges": "College of Health & Medicine", "email": "riccardo.natoli@anu.edu.au", "phone": "+61 2 6125 8559", "expertise": ["Vision Science", "Cell Physiology", "Central Nervous System", "Cell Metabolism", "Sensory Systems", "Ophthalmology", "Cell Development Proliferation And Death"], "interest": ["If you were asked, what was the one sense that you couldn't live   without, most of you would have immediately thought of your sight. That   is because our vision plays an integral role into how we perceive the   world around us. Without research into the prevention of vision loss   from retinal degenerations it is guaranteed that 1 in 7 people will lose   the sense of sight. - Joshua Chu-Tan (3MT Winner, 2016).Our main research interest is to understand the factors that cause photoreceptors, the light sensing cells of the retina, to die with age and devising novel strategies to prevent degeneration. The main disease we focus on is Age-Related Macular Degeneration (AMD) specifically trying to understand the oxidative stress and inflammation facets of the disease."], "biography": "My vision is to lead an internationally competitive research program to reduce the severity and progression of Age-Related Macular Degeneration (AMD). My strategy to achieve this is to develop innovative diagnostic and treatment strategies using microRNA. My ground-breaking work into understanding and treating this disease is funded by competitive funding agencies, industry partnerships, and a prestigious ANU Translational Fellowship, all contributing to achieving my aim to address this major global health issue. My research achievements are evidenced in my contributions to 55 publications, and an investment of $4.5 million in research funding by commercial and competitive funding agencies. In 2019 I received a Tall Poppy Award in recognition of my scientific excellence and achievements in the fields of vision sciences. I established Clear Vision Research 2017 (www.clearvisionresearch.com) to provide a framework for supporting ECRs and provide pathways for the community to engage in our research. Through Clear Vision Research I developed a school outreach program called the ‘Young Visionaries’ to promote the importance of science to school children and educate parents and teachers on the importance of eye health. I have featured in national and local media both for my research on AMD and for my promotion of the importance of donating one’s body to medical research. My research has been featured on National Nine News, Win Local News, and SBSs The Feed, as well as ABC Radio, Radio National and various print and online media.", "project": ["1. MicroRNA as diagnostics and therapeutics for retinal degenerations", "MicroRNA (miRNA) are small, endogenous, non-coding molecules that are powerful regulators of genetic information. Despite only being discovered as recently as the turn of this century, miRNAs are already used in clinical trials as therapeutic candidates for complex diseases such as cancer. This rapid bench-to-bedside transition demonstrates the therapeutic potential of miRNAs, particularly for multi-faceted diseases. In fact, miRNAs have already been implicated in the pathogenesis of complex neurodegenerative disorders such as Parkinson’s, Alzheimer’s, and Age-related Macular Degeneration (AMD). At the Clear Vision Research Lab, we believe that we can use miRNAs for two key areas currently lacking in the clinical landscape for AMD:", "Diagnostic biomarkers", "The Clear Vision Research Lab is currently undertaking a project in which we are investigating the use of miRNA as biomarkers for retinal degenerations. MiRNA demonstrate relatively high stability and abundance in biofluids such as tears, saliva, urine and blood, making them a promising target for prognostic research. Current investigations exploiting biofluid miRNAs for AMD diagnosis has yielded inconsistent results due to the multifaceted nature of disease progression and existing co-morbidities. Our research aims to identify specific miRNAs indicative for different stages in retinal disease and develop a method of disease grading based on their expression in biofluids. We further aim to determine if this panel of miRNAs can also be used as an indicator of therapeutic efficacy.", "Therapeutic candidates", "We currently have a number of ongoing projects where we are attempting to harness the regulatory capabilities of miRNAs to use as therapeutics for AMD. A single miRNA has the ability to control multiple different mRNA, often within the same molecular pathway (e.g. inflammation). This ability makes miRNAs promising therapeutic molecules to target multiple players in a single pathway. Due to the complex nature of AMD, we believe that this approach may prove fruitful in ameliorating key pathways known to lead to retinal degeneration, such as inflammation and oxidative stress. Our", "research aims to characterise key miRNAs in the retina and, by understanding their dynamic activity under retinal stress, exploit those as therapeutic molecules in the retina.", "2. Exosomes in retinal degenerations", "Exosomes are small membrane-enclosed delivery vehicles (40-150nm in diameter), which selectively package and transport molecules from host to target cells. Exosome-packaged molecules can be proteins, RNAs and non-coding RNAs such as microRNAs (miRNAs). MiRNAs are endogenous ‘master-regulators’ of gene expression and a single miRNA can control multiple different mRNAs, often found within similar biological pathways. The exosomal transfer of these molecules, particularly miRNAs, can therefore functionally alter the environment of target cells. Exosomes are paramount to the pathogenesis of a plethora of neurodegenerative diseases but their role in retinal degenerations remains largely unknown. At the Clear Vision Research Lab we study exosomes using several miRNA-centered approaches:", "i) We are characterising the molecular cargo of retinal exosomes, in particular their miRNA signature, to understand the relevance of these in the establishment and development of retinal degenerations.", "ii) Exosomes are known to be efficient at delivering their molecular contents, including miRNA, to recipient cells. To utilize this high delivery efficiency, we are developing ways to enrich retinal exosomes with specific miRNAs of therapeutic potential in an effort to deliver these directly into the degenerating retina.", "iii) Exosome-packaged molecules have high diagnostic potential. Exosomes also have the capacity to travel from their organ of origin, such as the retina, via biofluids such as blood. We are working towards uncovering the signature imprinted on blood-derived exosomes with the goal of establishing a panel of exosome-based biomarkers of retinal degenerations. This will aid the development of an objective and precise diagnostic kit for retinal degenerations.", "3. The benefits of exercise for retinal health and reducing retinal degenerations", "The benefits of exercise to the human body have long been known. Particularly in the central nervous system (CNS), regular exercise has been shown to improve memory, reduce inflammation and stimulate growth factors in the brain, and even prevent neuronal death. Exercise has also been shown to be an effective non-invasive therapy against neurodegenerative diseases such as Alzheimer’s and Parkinson’s. However, little is known if such benefits extend to another part of the CNS – the retina. At the Clear Vision Research Lab, we investigate the neuro-protective benefits of different forms of exercise to retinal health and aim to understand what molecular processes mediate this. Our ongoing projects aim to determine whether or not these benefits can be translated into therapeutic approaches for retinal diseases such as AMD.", "4. Development of new animal models for retinal degenerations", "The Clear Vision Research Lab has developed and incorporated a range of rodent models of retinal degenerations. While there is no perfect model to simulate all the pathologies associated with human AMD, we use a growing number of approaches to", "better understand the progression of AMD and retinal degenerations in general. These models also serve to test the efficacy of novel AMD therapeutic and diagnostic pipelines, with a view towards commercialisation and R&D avenues.", "Light Damage", "The Clear Vision Research Lab light-damage model, otherwise known as photo-oxidative damage (PD), was developed in-house (Natoli et al. 2016) as a means to induce AMD-like disease in pigmented rodents. In this model rodents are exposed to a high intensity of light with the key benefits that both the oxidative stress and inflammation arms of AMD progression are targeted. The light-damage model has been recognised for its uniqueness and has fostered industry collaborations that have led to the model’s commercialisation and distribution around the world.", "Transgenic Mouse Models", "The Clear Vision Research Lab has access to the Australian Phenomics Facility (APF), which is a nationally funded facility dedicated to the development, characterisation and archiving of mouse models of human disease. This facility has experts in place to identify genetic traits that lead to a particular disease. Through the APF, we have the capacity to import and generate transgenic mouse lines to mimic various retinal degenerations in vivo. We currently have transgenic mouse lines that mimic retinal pigment epithelium (RPE) dystrophy, which leads to photoreceptor loss in the retina. The benefit of transgenic mouse models is that retinal degeneration often progresses slowly, which parallels the progression of human AMD. The protracted nature of retinal degeneration provides a unique view toward early diagnostic markers of AMD and long-term efficacy of novel treatment strategies.", "Sodium Iodate", "The sodium iodate model of retinal degeneration is widely used in the research space and one that we have recently begun to use. In this model, mice receive a single dose of sodium iodate which selectively induces RPE cell death, in turn leading to AMD-like pathologies. The simplicity of this model makes it a useful tool for initial screens of novel therapeutics agents that may promote photoreceptor survival.", "Choroidal Neovascularisation", "The Phoenix MICRON IV™ system (Phoenix Technology Group) is a specialized rodent optical coherence tomography (OCT) and fundus imager that can deliver laser-mediated photocoagulation. This process results in a localized choroidal neovascularisation (CNV) response in rodent retinas that mimics pathologies associated with wet AMD. The MICRON IV™ allows the us to monitor the development of a CNV response in vivo and in real time and directly observe the efficacy of potential therapeutic agents.", "Oxygen-Induced Retinopathy", "The oxygen-induced retinopathy (ROP) model is a useful model to study the effects of neovascular diseases of the eye, such as retinopathy of prematurity (ROP) and wet AMD. Neonatal animals present with normal retinal vascularisation ex utero, rather than the abnormal retinal vascular development observed in premature infants. The", "ROP model takes advantage of the fact that by simply manipulating the environmental oxygen concentration, neovascularisation resembling that of premature infants can be induced and tightly controlled. This model provides us with a crucial tool to better understand ROP and test potential therapeutics together with the development of new medical devices.", "5. Novel therapeutics to reduce the progression of retinal degenerations", "In recent years, ophthalmic drugs have enjoyed a relatively high probability of success in progressing from Phase I clinical trials to market, estimated in 2015 at ~30%. This clinical success is driven by good preclinical models, especially for wet AMD. In 2016 we developed a mouse model for mimicking the oxidative stress, inflammation and cell death characteristics of the more prevalent form of AMD – dry AMD. This model has opened up both fundamental science and commercial opportunities to better understand and develop new strategies for combating dry AMD. In the Clear Vision Research Lab we are exploring a number of therapeutic options, developed at ANU and by commercial partners, which include gene-based therapies, non-invasive therapeutics (including the use of low-level laser therapy using red light) and novel compounds. We are actively engaging with commercial partners to help develop strategies to slow the progression of retinal degenerations, by targeting inflammation and oxidative stress processes."], "publication": [{"title": "The role of melanocytes in the human choroidal microenvironment and inflammation: Insights from the transcriptome", "year": "2021", "source": "Pigment Cell and Melanoma Research", "authors": ["Cioanca V", "Wu C", "Riccardo Natoli Natoli"]}, {"title": "MicroRNA-223 Regulates Retinal Function and Inflammation in the Healthy and Degenerating Retina", "year": "2020", "source": "Frontiers in Cell and Developmental Biology, vol. 8, pp. 1-18", "authors": ["Fernando N", "Wong H", "Das S", "Riccardo Natoli Natoli"]}, {"title": "method for gene knockdown in the retina using a lipid-based carrier", "year": "2020", "source": "Molecular Vision, vol. 26, pp. 48-63", "authors": ["Chu-Tan J", "Fernando N", "Aggio-Bruce R", "Riccardo Natoli Natoli"]}, {"title": "Caspase-1-dependent inflammasomes mediate photoreceptor cell death in photo-oxidative damage-induced retinal degeneration", "year": "2020", "source": "Scientific Reports, vol. 10", "authors": ["Wooff Y", "Fernando N", "Wong H", "Riccardo Natoli Natoli"]}, {"title": "blation of C3 modulates macrophage reactivity in the outer retina during photo-oxidative damage", "year": "2020", "source": "Molecular Vision, vol. 26, pp. 679-690", "authors": ["Jiao H", "Provis J", "Riccardo Natoli Natoli"]}, {"title": "MicroRNA-124 Dysregulation is Associated With Retinal Inflammation and Photoreceptor Death in the Degenerating Retina", "year": "2018", "source": "Investigative Ophthalmology and Visual Science, vol. 59, no. 10, pp. 4094-4105", "authors": ["Chu-Tan J", "Rutar M", "Saxena K", "Riccardo Natoli Natoli"]}, {"title": "Subretinal macrophages produce classical complement activator C1q leading to the progression of focal retinal degeneration", "year": "2018", "source": "Molecular Neurodegeneration, vol. 13, no. 45, pp. 18pp", "authors": ["Jiao H", "Rutar M", "Fernando N", "Riccardo Natoli Natoli"]}, {"title": "Photoreceptor survival is regulated by GSTO1-1 in the degenerating retina", "year": "2018", "source": "Investigative Ophthalmology and Visual Science, vol. 59, no. 11, pp. 4362-4374pp", "authors": ["Fernando N", "Wooff Y", "Aggio-Bruce R", "Riccardo Natoli Natoli"]}, {"title": "The use of the vaccinia virus complement control protein (VCP) in the rat retina", "year": "2018", "source": "PLOS ONE (Public Library of Science), vol. 13, no. 3, pp. 1-15pp", "authors": ["Fernando N", "Riccardo Natoli Natoli", "Racic T"]}, {"title": "Obesity-induced metabolic disturbance drives oxidative stress and complement activation in the retinal environment", "year": "2018", "source": "Molecular Vision, vol. 24, pp. 201-217", "authors": ["Riccardo Natoli Natoli", "Fernando N", "Dahlenburg T"]}, {"title": "nm light treatment following retinal injury modulates Muller cell gliosis: Evidence from in vivo and in vitro stress models", "year": "2018", "source": "Experimental Eye Research, vol. 169, pp. 1-12pp", "authors": ["Lu Y", "Fernando N", "Riccardo Natoli Natoli"]}, {"title": "MicroRNA as Therapeutics for Age-Related Macular Degeneration", "year": "2018", "source": "in JD Ash, RE Anderson, M LaVail, C Bowes Rickman, JG Hollyfield, C Grimm (ed.), Advances in Experimental Medicine and Biology, Springer Singapore, Singapore, pp. 37-43", "authors": ["Riccardo Natoli Natoli", "Fernando N"]}, {"title": "Retinal monocyte-derived complement, not systemically derived complement contributes to the early onset of focal retinal degeneration", "year": "2017", "source": "Annual Meeting of the Association-for-Research-in-Vision-and-Ophthalmology (ARVO) 2017, ASSOC RESEARCH VISION OPHTHALMOLOGY INC, Rockville, Maryland, United States, pp. 1-2", "authors": ["Jiao H", "Riccardo Natoli Natoli", "Fernando N"]}, {"title": "Retinal Macrophages Synthesize C3 and Activate Complement in AMD and in Models of Focal Retinal Degeneration", "year": "2017", "source": "Investigative Ophthalmology and Visual Science, vol. 58, no. 7, pp. 2977-2990pp", "authors": ["Riccardo Natoli Natoli", "Fernando N", "Jiao H"]}, {"title": "Photobiomodulation with 670 nm light ameliorates Müller cell-mediated activation of microglia and macrophages in retinal degeneration", "year": "2017", "source": "Experimental Eye Research, vol. 165, pp. 78-89", "authors": ["Lu Y", "Riccardo Natoli Natoli", "Madigan M"]}, {"title": "Microglia-derived IL-1ß promotes chemokine expression by Müller cells and RPE in focal retinal degeneration", "year": "2017", "source": "Molecular Neurodegeneration, vol. 12, no. 31, pp. 1-11pp", "authors": ["Riccardo Natoli Natoli", "Fernando N", "Madigan M"]}, {"title": "Evolution of Vertebrate Phototransduction: Cascade Activation", "year": "2016", "source": "Molecular Biology and Evolution, vol. 33, no. 8, pp. 2064-2087", "authors": ["Lamb T", "Patel H", "Chuah A", "Riccardo Natoli Natoli"]}, {"title": "model of progressive photo-oxidative degeneration and inflammation in the pigmented C57BL/6J mouse retina", "year": "2016", "source": "Experimental Eye Research, vol. 147, pp. 114-127", "authors": ["Riccardo Natoli Natoli", "Jiao H", "Barnett N"]}, {"title": "Efficacy of 670 nm Light Therapy to Protect against Photoreceptor Cell Death Is Dependent on the Severity of Damage", "year": "2016", "source": "International Journal of Photoenergy, vol. 2016, pp. 1-13", "authors": ["Chu-Tan J", "Rutar M", "Saxena K", "Riccardo Natoli Natoli"]}, {"title": "The broad-spectrum chemokine inhibitor NR58-3.14.3 modulates macrophage-mediated inflammation in the diseased retina", "year": "2016", "source": "Journal of Neuroinflammation, vol. 13, pp. -", "authors": ["Fernando N", "Riccardo Natoli Natoli", "Valter K"]}, {"title": "The Role of Pyruvate in Protecting 661W Photoreceptor-Like Cells Against Light-Induced Cell Death", "year": "2016", "source": "Current Eye Research, vol. Published online: 23 May 2016", "authors": ["Riccardo Natoli Natoli", "Rutar M", "Lu Y"]}, {"title": "Identification of miRNAs in a model of retinal degenerations", "year": "2015", "source": "Investigative Ophthalmology and Visual Science, vol. 56, no. 3, pp. 1820-1829", "authors": ["Saxena K", "Rutar M", "Provis J", "Riccardo Natoli Natoli"]}, {"title": "safety and feasibility study of the use of 670 nm red light in premature neonates", "year": "2015", "source": "Journal of Perinatology, vol. 35, no. 7, pp. 493-496pp", "authors": ["Kent A", "Broom M", "Parr V", "Riccardo Natoli Natoli"]}, {"title": "Spatiotemporal cadence of macrophage polarisation in a model of light-induced retinal degeneration", "year": "2015", "source": "PLOS ONE (Public Library of Science), vol. 10, no. 12, pp. -", "authors": ["Jiao H", "Riccardo Natoli Natoli", "Valter K"]}, {"title": "Chemokine-mediated inflammation in the degenerating retina is coordinated by Müller cells, activated microglia, and retinal pigment epithelium", "year": "2015", "source": "Journal of Neuroinflammation, vol. 12, no. 8, pp. 1-15", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Chia R"]}, {"title": "Differential Effects of 670 and 830 nm Red near Infrared Irradiation Therapy: A Comparative Study of Optic Nerve Injury, Retinal Degeneration, Traumatic Brain and Spinal Cord Injury", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 8, pp. e104565-e104565", "authors": ["Giacci M", "Wheeler L", "Lovett S", "Riccardo Natoli Natoli"]}, {"title": "Integral-geometry characterization of photobiomodulation effects on retinal vessel morphology", "year": "2014", "source": "Biomedical Optics Express, vol. 5, no. 7, pp. 2317-2332", "authors": ["Riccardo Natoli Natoli", "Valter K"]}, {"title": "Synthesis and propagation of complement C3 by microglia/monocytes in the aging retina", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 4, pp. 1-10", "authors": ["Rutar M", "Valter K", "Riccardo Natoli Natoli"]}, {"title": "nm - A stop sign for retinal degenerations?", "year": "2014", "source": "2014 WALT Biennial Congress and NAALT Annual Conference, ed. Laakso E.-L., Conference Organising Committee, TBC, pp. 33-38", "authors": ["Valter K", "Albarracin R", "Riccardo Natoli Natoli"]}, {"title": "nm light mitigates oxygen-induced degeneration in C57BL/6J mouse retina", "year": "2013", "source": "BMC Neuroscience, vol. 14, pp. -", "authors": ["Albarracin R", "Riccardo Natoli Natoli", "Rutar M"]}, {"title": "nm Photobiomodulation as a Novel Protection against Retinopathy of Prematurity: Evidence from Oxygen Induced Retinopathy Models", "year": "2013", "source": "PLOS ONE, vol. 8, no. 8, pp. e72135", "authors": ["Riccardo Natoli Natoli", "Valter K", "Barbosa MS"]}, {"title": "Microarray analysis of gene expression in West Nile virus-infected human retinal pigment epithelium", "year": "2012", "source": "Molecular Vision, vol. 18, no. 78, pp. 730-743", "authors": ["Munoz-Erazo L", "Riccardo Natoli Natoli", "Provis J"]}, {"title": "Small interfering RNA-mediated suppression of Ccl2 in MÃ¼ller cells attenuates microglial recruitment and photoreceptor death following retinal degeneration", "year": "2012", "source": "Journal of Neuroinflammation, vol. 9", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Provis J"]}, {"title": "NM Red Light: Protection Against Retinopathy of Prematurity", "year": "2012", "source": "43rd Annual Scientific Congress - Sharing the Vision, Wiley Online Library\r\n, Brisbane / online, p. 87", "authors": ["Riccardo Natoli Natoli", "Provis J", "Valter K"]}, {"title": "Can 670Nm Red Light Protect Against Retinopathy of Prematurity and Reduce Lung Injury in a Neonatal Animal Model?", "year": "2015", "source": "European Academy of Paediatric Societies (EAPS 2012), BMJ Publishing Group, United Kingdom", "authors": ["Riccardo Natoli Natoli", "Valter K", "Soares Barbosa M"]}, {"title": "nm light treatment reduces complement propagation following retinal degeneration", "year": "2012", "source": "Journal of Neuroinflammation, vol. 9, no. 257, pp. -", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Albarracin R"]}, {"title": "Complement activation in retinal degeneration", "year": "2012", "source": "in Matthew M. LaVail, John D. Ash Robert E. Anderson, Joe G. Hollyfi eld Christia (ed.), Retinal Degenerative Diseases, Springer, United States, pp. 31-36", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Provis J"]}, {"title": "Morphological, functional and gene expression analysis of the hyperoxic mouse retina", "year": "2010", "source": "Experimental Eye Research, vol. 92, pp. 306-314", "authors": ["Riccardo Natoli Natoli", "Valter K", "Chrysostomou V"]}, {"title": "nalysis of complement expression in light-induced retinal degeneration: Synthesis and deposition of C3 by microglia/macrophages is associated with focal photoreceptor degeneration", "year": "2011", "source": "Investigative Ophthalmology and Visual Science, vol. 52, no. 8, pp. 5347-5358", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Kozulin P"]}, {"title": "Early focal expression of the chemokine Ccl2 by Muller cells during exposure to damage-inducing bright continuous light", "year": "2011", "source": "Investigative Ophthalmology and Visual Science, vol. 52, no. 5, pp. 2379-2388", "authors": ["Rutar M", "Riccardo Natoli Natoli", "Valter K"]}, {"title": "Diversity of Color Vision: Not All Australian Marsupials Are Trichromatic", "year": "2010", "source": "PLOS ONE (Public Library of Science), vol. 5, no. 12, pp. e14231-e14231", "authors": ["Ebeling W", "Riccardo Natoli Natoli", "Hemmi J"]}, {"title": "The cellular expression of anti-angiogenic factors in fetal primate retina", "year": "2010", "source": "Investigative Ophthalmology & Visual Science, vol. 51, no. 8, pp. 4298-4306", "authors": ["Kozulin P", "Riccardo Natoli Natoli", "Bumsted O'Brien K"]}, {"title": "Gene and noncoding RNA regulation underlying photoreceptor protection: microarray study of dietary antioxidant saffron and photobiomodulation in rat retina", "year": "2010", "source": "Molecular Vision, vol. 16, pp. 1801-1822", "authors": ["Riccardo Natoli Natoli", "Zhu Y", "Valter K"]}, {"title": "Differential gene expression in mouse retina related to regional differences in vulnerability to hyperoxia", "year": "2010", "source": "Molecular Vision, vol. 16, pp. 740-755", "authors": ["Zhu Y", "Riccardo Natoli Natoli", "Valter K"]}, {"title": "Microarray Analysis of Hyperoxia Stressed Mouse Retina: Differential Gene Expression in the Inferior and Superior Region", "year": "2010", "source": "in Robert E Anderson, Joe G Hollyfield & Matthew M LaVail (ed.), Retinal Degenerative Diseases: Laboratory and Therapeutic Investigations, Landes Bioscience/Springer Science+Business Media, Berlin, pp. 217-222", "authors": ["Zhu Y", "Riccardo Natoli Natoli", "Valter K"]}, {"title": "Gradients of Eph-A6 expression in primate retina suggest roles in both vascular and axon guidance", "year": "2009", "source": "Molecular Vision, vol. 15, pp. 2649-2662", "authors": ["Kozulin P", "Riccardo Natoli Natoli", "Madigan M"]}, {"title": "Cone Degeneration in Aging and Age-Related Macular Degeneration", "year": "2009", "source": "Archives of Ophthalmology, vol. 127, no. 4, pp. 483-492", "authors": ["Shelley E", "Madigan M", "Penfold P", "Riccardo Natoli Natoli"]}, {"title": "Differential expression of anti-angiogenic factors and guidance genes in the developing macula", "year": "2009", "source": "Molecular Vision, vol. 15, pp. 45-59", "authors": ["Kozulin P", "Riccardo Natoli Natoli", "Bumsted O'Brien K"]}, {"title": "Expression and role of the early-response gene Oxr1 in the hyperoxia-challenged mouse retina", "year": "2008", "source": "Investigative Ophthalmology and Visual Science, vol. 49, no. 10, pp. 4561-4567", "authors": ["Riccardo Natoli Natoli", "Provis J", "Valter K"]}, {"title": "Gene regulation induced in the C57BL/6J mouse retina by hyperoxia: a temporal microarray study", "year": "2008", "source": "Molecular Vision, vol. 14, pp. 1983-1994", "authors": ["Riccardo Natoli Natoli", "Provis J", "Valter K"]}, {"title": "Expression of EPH receptors and ephrins in developing primate retina", "year": "2006", "source": "International Congress of Eye Research 2006, Conference Organising Committee, na, p. 1", "authors": ["Kozulin P", "Riccardo Natoli Natoli", "Provis J"]}, {"title": "Microarray analysis of gene expression in the developing Fovea", "year": "2006", "source": "Australasian Ophthalmic & Viual Sciences Meeting 2006, ed. Ophthalmic Research Institute of Australia, Conference Organising Committee, ANU Canberra, p. 1", "authors": ["Kozulin P", "Ohms S", "Riccardo Natoli Natoli"]}, {"title": "OXR-1 in the Hyperoxic C57BL/6J Mouse Retina", "year": "2006", "source": "Australasian Ophthalmic & Viual Sciences Meeting 2006, ed. Ophthalmic Research Institute of Australia, Conference Organising Committee, ANU Canberra, p. 40", "authors": ["Riccardo Natoli Natoli", "Provis J", "Stone J"]}, {"title": "Gradients of cone differentiation and FGF expression during development of the foveal depression in macaque retina", "year": "2005", "source": "Visual Neuroscience, vol. 22, pp. 447-459", "authors": ["Cornish E", "Madigan M", "Riccardo Natoli Natoli"]}, {"title": "Differential distribution of fibroblast growth factor receptors (FGFRs) on foveal cones: FGFR-4 is an early marker of cone photoreceptors", "year": "2004", "source": "Molecular Vision, vol. 10, pp. 1-14", "authors": ["Cornish E", "Riccardo Natoli Natoli", "Hendrickson A"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}