{"ANU": {"name": "Richard O'Kearney", "link": "https://researchers.anu.edu.au/researchers/o-kearney-rt", "colleges": "College of Health & Medicine", "email": "richard.okearney@anu.edu.au", "phone": "", "expertise": ["Mental Health", "Health Clinical And Counselling Psychology", "Psychiatry Incl. Psychotherapy", "Paediatrics"], "interest": [], "biography": "", "project": [], "publication": [{"title": "Exposure‐Based Writing Therapies for Subthreshold and Clinical Posttraumatic Stress Disorder: A Systematic Review and Meta‐Analysis [IN PRESS]", "year": "2020", "source": "Journal of Traumatic Stress, vol. Online", "authors": ["Dawson R", "Calear A", "McCallum S", "Richard O'Kearney"]}, {"title": "Reduced willingness to approach genuine smilers in social anxiety explained by potential for social evaluation, not misperception of smile authenticity", "year": "2019", "source": "Cognition and Emotion, vol. 33, no. 7, pp. 1342-1355", "authors": ["Dawel A", "Dumbleton R", "Richard O'Kearney"]}, {"title": "re claims of non-inferiority of Internet and computer-based cognitive-behavioural therapy compared with in-person cognitive-behavioural therapy for adults with anxiety disorders supported by the evidence from head-to-head randomised controlled trials? A s", "year": "2019", "source": "Australian and New Zealand Journal of Psychiatry, vol. 53, no. 9, pp. 851-865", "authors": ["Richard O'Kearney", "Kim S", "Dawson R"]}, {"title": "Moderators and predictors of response to cognitive behaviour therapy for pediatric obsessive-compulsive disorder: A systematic review", "year": "2018", "source": "Psychiatry Research, vol. 261, pp. 50-60pp", "authors": ["Turner C", "O'Gorman B", "Richard O'Kearney"]}, {"title": "Language Difficulty at School Entry and the Trajectories of Hyperactivity-Inattention Problems from Ages 4 to 11: Evidence from a Population-Representative Cohort Study", "year": "2017", "source": "Journal of Abnormal Child Psychology, vol. 45, no. 6, pp. 1105-1118", "authors": ["Goh S", "Richard O'Kearney"]}, {"title": "Social and attention-to-detail subclusters of autistic traits differentially predict looking at eyes and face identity recognition ability", "year": "2017", "source": "British Journal of Psychology, vol. 108, no. 1, pp. 191-219pp", "authors": ["Davis J", "McKone E", "Zirnsak M", "Richard O'Kearney"]}, {"title": "Perceived emotion genuineness: normative ratings for popular facial expression stimuli and the development of perceived-as-genuine and perceived-as-fake sets", "year": "2017", "source": "Behavior Research Methods, vol. 49, no. 4, pp. 1539-1562", "authors": ["Dawel A", "Wright L", "Irons J", "Richard O'Kearney"]}, {"title": "Emotional Abilities in Children with Oppositional Defiant Disorder (ODD): Impairments in Perspective-Taking and Understanding Mixed Emotions are Associated with High Callous-Unemotional Traits", "year": "2016", "source": "Child Psychiatry and Human Development, vol. Published online: 21 April 2016, pp. 1-12", "authors": ["Richard O'Kearney", "Salmon K", "Liwag M"]}, {"title": "Fearful faces drive gaze-cueing and threat bias effects in children on the lookout for danger", "year": "2015", "source": "Developmental Science, vol. 18, no. 2, pp. 219-231", "authors": ["Dawel A", "Palermo R", "Richard O'Kearney"]}, {"title": "Children can discriminate the authenticity of happy but not sad or fearful facial expressions, and use an immature intensity-only strategy", "year": "2015", "source": "Frontiers in Psychology, vol. 6, no. 462, pp. 1-16", "authors": ["Dawel A", "Palermo R", "Richard O'Kearney"]}, {"title": "Early language impairments and developmental pathways of emotional problems across childhood", "year": "2015", "source": "International Journal of Language and Communication Disorders, vol. 50, no. 3, pp. 358-373", "authors": ["Richard O'Kearney", "Goh S"]}, {"title": "Elevated levels of callous unemotional traits are associated with reduced attentional cueing, with no specificity for fear or eyes", "year": "2015", "source": "Personality Disorders: Theory, Research and Treatment, vol. 6, no. 3, pp. 216-228", "authors": ["Dawel A", "McKone E", "Richard O'Kearney"]}, {"title": "The Role of Early Language Difficulties in the Trajectories of Conduct Problems Across Childhood", "year": "2015", "source": "Journal of Abnormal Child Psychology, vol. 43, no. 8, pp. 1515-1527", "authors": ["Goh S", "Richard O'Kearney"]}, {"title": "comparison of the quality of intrusive memories in post-traumatic stress disorder and depression", "year": "2014", "source": "Memory, vol. 22, no. 4, pp. 408-425", "authors": ["Parry L", "Richard O'Kearney"]}, {"title": "General and sleep-specific worry in insomnia", "year": "2014", "source": "Sleep and Biological Rhythms, vol. 12, no. 3, pp. 212-215", "authors": ["Richard O'Kearney", "Chapman M"]}, {"title": "Emotional Memory, Psychopathology, and Well-being", "year": "2014", "source": "in Patricia J Bauer & Robyn Fivush (ed.), The Wiley Handbook on the Development of Children's Memory, Wiley Blackwell, Malden, MA, USA and Oxford and Chichester, UK, pp. 743-773", "authors": ["Salmon K", "Richard O'Kearney"]}, {"title": "Comparative physiological reactivity during script-driven recall in depression and posttraumatic stress disorder", "year": "2014", "source": "Journal of Abnormal Psychology, vol. 123, no. 3, pp. 523-532", "authors": ["Richard O'Kearney", "Parry L"]}, {"title": "Look out! Gaze-cueing is greater from fearful faces in a dangerous context for children and adults", "year": "2013", "source": "Vision Sciences Society Annual Meeting, ed. Dennis M Levi, Vision Sciences Society, Florida, pp. 147pp", "authors": ["Dawel A", "McKone E", "Irons J", "Richard O'Kearney"]}, {"title": "Randomized controlled Trial of Problem-Solving Therapy compared to cognitive therapy for the Treatment of insomnia in Adults", "year": "2013", "source": "Sleep, vol. 36, no. 5, pp. 739-749", "authors": ["Chapman M", "Richard O'Kearney"]}, {"title": "Emotional and behavioural outcomes later in childhood and adolescence for children with specific language impairments: meta-analyses of controlled prospective studies", "year": "2013", "source": "Journal of Child Psychology and Psychiatry, vol. 54, no. 5, pp. 516-524", "authors": ["Goh S", "Richard O'Kearney"]}, {"title": "Individual differences in emotionality and peri(-)traumatic processing", "year": "2012", "source": "Journal of Behavior Therapy and Experimental Psychiatry, vol. 43, no. 2, pp. 815-822", "authors": ["Logan S", "Richard O'Kearney"]}, {"title": "Not just fear and sadness: Meta-analytic evidence of pervasive emotion recognition deficits for facial and vocal expressions in psychopathy", "year": "2012", "source": "Neuroscience & Biobehavioral Reviews, vol. 36, no. 10, pp. 2288 -2304", "authors": ["Dawel A", "Richard O'Kearney", "McKone E"]}, {"title": "Emotional and behavioural outcome for children with early communication difficulties: evidence from the Longitudinal Study of Australian Children (LSAC)", "year": "2012", "source": "International Association for Child and Adolescent psychiatry and Allied Professions, World Congress, Brain, Mind and Development, Elsevier Masson, Paris France, pp. S166", "authors": ["Richard O'Kearney", "Goh S"]}, {"title": "Individual differences in emotionality and peri-traumatic processing", "year": "2012", "source": ". Journal of Behaviour Therapy and Experimental PsychiatryVol 43, pp 815-822.", "authors": ["Logan S", "Richard O'Kearney"]}, {"title": "dvance agreements for mental health care: An examination of process and outcomes", "year": "2011", "source": "Australian and New Zealand Journal of Psychiatry, vol. 45, no. 4, pp. 281-288", "authors": ["Wauchope B", "Richard O'Kearney", "Bone L"]}, {"title": "Individual Differences in the Ability to Recognise Facial Identity Are Associated with Social Anxiety", "year": "2011", "source": "PLoS ONE (Public Library of Science), vol. 6, no. 12, pp. 1-7", "authors": ["Davis J", "McKone E", "Dennett H", "Richard O'Kearney"]}, {"title": "Integration and organization of trauma memories and posttraumatic symptoms", "year": "2011", "source": "Journal of Traumatic Stress, vol. 24, no. 6, pp. 716-725", "authors": ["Richard O'Kearney", "Hunt A", "Wallace N"]}, {"title": "Mood Disorders", "year": "2011", "source": "in Elizabeth Rieger (ed.), Abnormal Psychology: Leading Researcher Perspectives (2nd ed), McGraw Hill Australia Pty Ltd, North Ryde Australia, pp. 91-132", "authors": ["Ball J", "Manicavasagar V", "Mitchell P", "Richard O'Kearney"]}, {"title": "Prospective Examination of Pre-Existing Cognitive, Emotional and Behavioural vulnerabilities for post-traumatic adjustment", "year": "2011", "source": "Clinical Psychologist, vol. 15, pp. 44-47", "authors": ["Barry M", "Richard O'Kearney"]}, {"title": "The Role of Daily Life Stressors in Mediating the Relationship Between Sleep Disordered Breathing and Mood Disorders (Poster presentation)", "year": "2010", "source": "<>, pp. A32-A33", "authors": ["Abubakar R", "Richard O'Kearney"]}, {"title": "Invited commentary on Storch et al. Family-based cognitive-behavioural therapy for pediatric Obsessive-Compulsive Disorder: Comparison of intensive and weekly approaches", "year": "2008", "source": ". Evidence-Based Mental HealthVol 1", "authors": ["Oâ??Kearney R (", "Richard O'Kearney"]}, {"title": "Behavioural and cognitive behavioural therapy for obsessive compulsive disorder in children and adolescents (review)", "year": "2010", "source": "Cochrane Database of Systematic Reviews (CDSR), vol. 2010, no. 1, pp. 1-49", "authors": ["Richard O'Kearney", "Anstey K", "Von Sanden C"]}, {"title": "The YouthMood Project: A cluster randomized controlled trial of an online cognitive behavioral program with adolescents", "year": "2009", "source": "Journal of Consulting and Clinical Psychology, vol. 77, no. 6, pp. 1021-1032", "authors": ["Calear A", "Christensen H", "Mackinnon A", "Richard O'Kearney"]}, {"title": "Impact of Cultural Differences in Self on Cognitive Appraisals in Posttraumatic Stress Disorder", "year": "2009", "source": "Behavioural and Cognitive Psychotherapy, vol. 37, no. 2009, pp. 249-266", "authors": ["Jobson L", "Richard O'Kearney"]}, {"title": "Better access to psychological treatments through Medicare: Rejoinder to Carey, Rickwood and Baker", "year": "2009", "source": "Clinical Psychologist, vol. 13, no. 3, pp. 80-86", "authors": ["Richard O'Kearney", "Wilmoth D"]}, {"title": "controlled trial of a school-based Internet program for reducing depressive symptoms in adolescent girls", "year": "2009", "source": "Depression and Anxiety (Hoboken), vol. 26, no. 1, pp. 65-72", "authors": ["Richard O'Kearney", "Kang K", "Christensen H"]}, {"title": "Can a Theory of Mind Disruption Help Explain OCD Related Metacognitive Disturbances?", "year": "2008", "source": "Behaviour Change, vol. 25, no. 2, pp. 55-70", "authors": ["Richard O'Kearney", "Nicholson C"]}, {"title": "Cultural Differences in Retrieval of Self-Defining Memories", "year": "2008", "source": "Journal of Cross-Cultural Psychology, vol. 39, no. 1, pp. 75-80", "authors": ["Jobson L", "Richard O'Kearney"]}, {"title": "Cultural differences in personal identity in post-traumatic stress disorder", "year": "2008", "source": "British Journal of Clinical Psychology, vol. 47, no. 1, pp. 95-109", "authors": ["Jobson L", "Richard O'Kearney"]}, {"title": "Implications of neuroscientific evidence for the cognitive models of post-traumatic stress disorder", "year": "2008", "source": "Clinical Psychologist, vol. 12, no. 2, pp. 67-76", "authors": ["Cruwys T", "Richard O'Kearney"]}, {"title": "Intensive family-based CBT similarly effective to weekly CBT for paediatric obsessive compulsive disorder", "year": "2008", "source": "Evidence-Based Mental Health, vol. 11, no. 1, pp. 20 - 20", "authors": ["Richard O'Kearney"]}, {"title": "ttachment dimensions and the identification of at-risk individuals following the loss of a loved one", "year": "2007", "source": "Generation of Relationships and Relationships across Generations, ed. Zoe J. Pearce, Australian Psychological Society, Melbourne, Australia, pp. 68-74", "authors": ["Jerga A", "Wilkinson R", "Richard O'Kearney"]}, {"title": "CBT Internet Program for Depression in Adolescents (MoodGYM): Effects on Depressive Symptoms, Attributional Style, Self-Esteem and Beliefs About Depression", "year": "2007", "source": "in Danielle A. Einstein (ed.), Innovations and Advances in Cognitive Behaviour Therapy, Australian Academic Press Pty Ltd, Australia, pp. 197-204", "authors": ["Richard O'Kearney", "Kang K", "Gibson M"]}, {"title": "Benefits of cognitive-behavioural therapy for children and youth with obsessive-compulsive disorder: re-examination of the evidence", "year": "2007", "source": "Australian and New Zealand Journal of Psychiatry, vol. 41, pp. 199-212", "authors": ["Richard O'Kearney"]}, {"title": "Kapok\" and Post-Traumatic Stress Disorder", "year": "2007", "source": "World Psychiatric Association International Congress 2007, ed. Peter R. Joyce, Taylor & Francis Group, United Kingdom, pp. A246-A247", "authors": ["Citraningtyas T", "Richard O'Kearney", "Raphael B"]}, {"title": "Smoking as a Risk Factor for Dementia and Cognitive Decline : A Meta- Analysis of Prospective Studies", "year": "2007", "source": "American Journal of Epidemiology, vol. 166, no. 4, pp. 367-378", "authors": ["Anstey K", "Von Sanden C", "Salim A", "Richard O'Kearney"]}, {"title": "Effects of a Cognitive-Behavioural Internet Program on Depression, Vulnerability to Depression and Stigma in Adolescent Males: A School-Based Controlled Trial", "year": "2006", "source": "Cognitive Behaviour Therapy, vol. 35, no. 1, pp. 43-54", "authors": ["Richard O'Kearney", "Gibson M", "Christensen H"]}, {"title": "Behavioural and cognitive behavioural therapy for obsessive compulsive disorder in children and adolescents", "year": "2006", "source": "Cochrane Database of Systematic Reviews (CDSR), vol. 2006, no. 4, pp. 1-29", "authors": ["Richard O'Kearney", "Anstey K", "Von Sanden C"]}, {"title": "Trauma Narratives in posttraumatic stress disorder: A review", "year": "2006", "source": "Journal of Traumatic Stress, vol. 19, no. 1, pp. 81-93", "authors": ["Richard O'Kearney", "Perrott K"]}, {"title": "Cultural differences in autobiographical memory of trauma", "year": "2006", "source": "Clinical Psychologist, vol. 10, no. 3, pp. 89-98", "authors": ["Jobson L", "Richard O'Kearney"]}, {"title": "Children", "year": "2006", "source": "s narrative memory for accidents and their post-traumatic distress'Applied Cognitive Psychology, vol. 21, no. 2007, pp. 821-838", "authors": ["Richard O'Kearney", "Speyer J", "Kenardy J"]}, {"title": "Language for emotions in adolescents with externalizing and internalizing disorders", "year": "2005", "source": "Development and Psychopathology, vol. 17, pp. 529-548", "authors": ["Richard O'Kearney", "Dadds M"]}, {"title": "Mental Health first aid training of the public in a rural area: a cluster randomized trial [ISRCTN53887541]", "year": "2004", "source": "BMC Psychiatry, vol. 4, no. 33, pp. 1-17", "authors": ["Jorm A", "Kitchener B", "Richard O'Kearney"]}, {"title": "Developmental and gender differences in the language for emotions across the adolescent years", "year": "2004", "source": "Cognition and Emotion, vol. 18, no. 7, pp. 913-938", "authors": ["Richard O'Kearney", "Dadds M"]}, {"title": "Factors predicting program fidelity and delivery of an early intervention program for first episode psychosis in rural Australia", "year": "2004", "source": "Australian e-Journal for the Advancement of Mental Health, vol. 3, no. 2, pp. 1-9", "authors": ["Richard O'Kearney", "Garland G", "Welch M"]}, {"title": "Motivation and Emotions in the Cognitive Theory of Obesessive-Compulsive Disorder: A reply to Salkovskis and Freeston", "year": "2001", "source": "Australian Journal of Psychology, vol. 53, no. 1, pp. 7-9", "authors": ["Richard O'Kearney"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}