{"ANU": {"name": "Rob McLaughlin", "link": "https://researchers.anu.edu.au/researchers/mclaughlin-rj", "colleges": "ANU College of Law", "email": "rob.mclaughlin@anu.edu.au", "phone": "+61 (0) 2 6125 4218", "expertise": ["International Law Excl. International Trade Law", "Comparative Law", "Criminal Law And Procedure", "Administrative Law"], "interest": ["Law of Armed ConflictNational Security LawMilitary LawOperations LawMaritime Law Enforcement"], "biography": "", "project": [], "publication": [{"title": "Maritime Crime: A manual for Criminal Justice Practitioners", "year": "2017", "source": "in   (ed.), Maritime Crime: A Manual for Criminal Justice Practitioners, UNODC United Nations Office on Drugs and Crime, New York, pp. 1-130pp", "authors": ["Rob McLaughlin"]}, {"title": "Handbook on the Use of Force for Private Security Companies", "year": "2016", "source": "in   (ed.), Oceans Beyond Piracy, Oceans Beyond Piracy, Online, pp. 1-98pp", "authors": ["Rob McLaughlin", "Drew P"]}, {"title": "BLOG - Common Article 2 as a paradigmatically challenging threshold for the application of IHL", "year": "2016", "source": "", "authors": ["Rob McLaughlin"]}, {"title": "Call-Out Powers for the Australian Defence Force in an Age of Terrorism: Some Legal Implications", "year": "2016", "source": "Australian Institute of Administrative Law Forum, vol. 85, no. -, pp. 63-82pp", "authors": ["Letts D", "Rob McLaughlin"]}, {"title": "The Law", "year": "2016", "source": "s Potential to Break-Rather Than Entrench-the South China Sea Deadlock?'Journal of Conflict and Security Law, vol. 21, no. 2, pp. 305-337", "authors": ["Rob McLaughlin", "Nasu H"]}, {"title": "The Role of Information Sharing in Counter-piracy in the Horn of Africa region: A Model for Transnational Criminal Enforcement Operations", "year": "2016", "source": "Journal of International Law and international Relations, vol. 12, no. 1, pp. 82-119pp", "authors": ["Rob McLaughlin", "Paige T"]}, {"title": "Towards a more effective counter-drugs regime in the Indian Ocean", "year": "2016", "source": "Journal of the Indian Ocean Region, vol. 12, no. 1, pp. 24-38", "authors": ["Rob McLaughlin"]}, {"title": "Law of naval warfare", "year": "2016", "source": "in Rain Liivoja and Tim McCormack (ed.), Routledge Handbook of the Law of Armed Conflict, Routledge, London, UK, pp. 264-281", "authors": ["Letts D", "Rob McLaughlin"]}, {"title": "The impact of the", "year": "2016", "source": "civilianisation' of military administrative law on the command power'' Military Justice in The Modern AgeDuxbury, A and Groves, G eds, Cambridge University Press, Cambridge, pp130-15", "authors": ["Rob McLaughlin"]}, {"title": "", "year": "2016", "source": "Path needs to be cleared so Defence Force can respond to terror attacks", "authors": ["Rob McLaughlin", ""]}, {"title": "The Continuing Conundrum of the Somali Territorial Sea and Exclusive Economic Zone", "year": "2015", "source": "The International Journal of Marine and Coastal Law, vol. 30, no. 2, pp. 305-334", "authors": ["Rob McLaughlin"]}, {"title": "Belligerency and Use of Force in NIAC Contexts", "year": "2015", "source": "Non-International Armed Conflicts: Developments and Challenges, Asia Pacific Centre for Military Law, Sydney", "authors": ["Rob McLaughlin"]}, {"title": "International Security in 2014", "year": "2015", "source": "International Law 2014: The Year in Review, Sydney Centre for International Law, Sydney", "authors": ["Rob McLaughlin"]}, {"title": "United Nations Security Council Practice in Relation to Use of Force in No-Fly Zones and Maritime Exclusion Zones", "year": "2015", "source": "in Marc Weller (ed.), The Oxford Handbook of the Use of Force in International Law, Oxford University Press, oxford and New York, pp. 251-271", "authors": ["Rob McLaughlin"]}, {"title": "New Technologies and the Law of Armed Conflict", "year": "2014", "source": "T.M.C. Asser PressThe Hague, The Netherlands", "authors": ["Nasu H", "Rob McLaughlin", "eds"]}, {"title": "The role of information sharing in counter piracy in the Horn of Africa region: a model for transnational criminal enforcement operations", "year": "2014", "source": "American Society of International Law Mid-Year Meeting and Research Forum, American Society of International Law, Chicago", "authors": ["Rob McLaughlin", "Paige T"]}, {"title": "The Strategic Leading Seaman in UN maritime Operations", "year": "2014", "source": "The strategic corporal re-visited: challenges for combatants in twenty-first century warfare, Australian National University, Canberra", "authors": ["Rob McLaughlin"]}, {"title": "Customary International Law on maritime insurgencies as a guide to filling a gap in the modern Law of Armed Conflict", "year": "2014", "source": "International Law Association British Branch Spring Conference, Kings College, London, London", "authors": ["Rob McLaughlin"]}, {"title": "The Rules-Based Order and the South China Sea", "year": "2014", "source": "Strengthening a rule-based order in the Asia Pacific: Perspectives from ASEAN, Japan, and Australia, Council for Security Co-operation in the Asia Pacific, Canberra", "authors": ["Rob McLaughlin"]}, {"title": "Unmanned Naval Vehicles and the Law of Naval Warfare", "year": "2014", "source": "in Hitoshi Nasu, Robert McLaughlin (ed.), New technologies and the law of armed conflict, T.M.C. Asser Press, The Hague, The Netherlands, pp. 229-246", "authors": ["Rob McLaughlin"]}, {"title": "The Emerging Paradigm for Operational Incident Investigation", "year": "2014", "source": "in David W Lovell (ed.), Investigating Operational Incidents in a Military Context: Law, Justice, Politics, Koninklijke Brill, Leiden, The Netherlands, pp. 197-220", "authors": ["Rob McLaughlin"]}, {"title": "International Humanitarian Law in the Maritime Context: Conflict Characterization in Judicial and quasi-Judicial Contexts", "year": "2014", "source": "in D Jinks, J N Maogoto, S Solomon (ed.), Applying International Humanitarian Law in Judicial and Quasi-Judicial Bodies, T.M.C. Asser Press, The Hague, Netherlands, pp. 103-132", "authors": ["Rob McLaughlin", "Stephens D"]}, {"title": "Key Developments in International Humanitarian Law", "year": "2014", "source": "Attorney-General's Department International Law Colloquium: Cross-Cutting Issues in International Law, Attorney-General's Department, Canberra", "authors": ["Rob McLaughlin"]}, {"title": "The Law Applicable to Naval Mine Warfare in a Non-International Armed Conflict", "year": "2014", "source": "International Law Studies, vol. 90, no. 2014, pp. 474-498", "authors": ["Rob McLaughlin"]}, {"title": "Introduction: Conundrum of New Technologies in the Law of Armed Conflict", "year": "2014", "source": "in Hitoshi Nasu, Robert McLaughlin (ed.), New Technologies and the Law of Armed Conflict, T.M.C. Asser Press, The Hague, The Netherlands, pp. 1-17", "authors": ["Rob McLaughlin", "Nasu H"]}, {"title": "Conclusion: Challenges of New Technologies for the Law of Armed Conflict", "year": "2014", "source": "in Hitoshi Nasu, Robert McLaughlin (ed.), New Technologies and the Law of Armed Conflict, T.M.C. Asser Press, The Hague, The Netherlands, pp. 247-25", "authors": ["Nasu H", "Rob McLaughlin"]}, {"title": "Giving", "year": "2012", "source": "Operational Legal Advice: Context and Method'Military Law and the Law of War Review, vol. 50, no. 1-2, pp. 99-125", "authors": ["Rob McLaughlin"]}, {"title": "n Australian Perspective on Non-International Armed Conflict: Afghanistan and East Timor", "year": "2012", "source": "in Kenneth Watkin and Andrew J. Norris (ed.), International Law Studies: Non-International Armed Conflict in the Twenty-first Century, U.S. Government Printing Office, Newport, RI, USA, pp. 293-319", "authors": ["Rob McLaughlin"]}, {"title": "Protecting Civilians in Armed Conflict Through Rules of Engagement", "year": "2012", "source": "in D W Lovell, I Primoratz (ed.), Protecting Civilians During Violent Conflict: Theoretical and Practical Issues for the 21st Century, Ashgate Publishing Ltd, Farnham, pp. 119-140", "authors": ["Rob McLaughlin"]}, {"title": "Legal-Policy Considerations and Conflict Characterisation at the Threshold Between Law Enforcement and Non-International Armed Conflict", "year": "2012", "source": "Melbourne Journal of International Law, vol. 13, no. 1, pp. 94-121", "authors": ["Rob McLaughlin"]}, {"title": "Terrorism", "year": "2012", "source": "as a Central Theme in the Evolution of Maritime Operations Law Since 11 September 2011'Yearbook of International Humanitarian Law, vol. 14, no. 2012, pp. 391-409", "authors": ["Rob McLaughlin"]}, {"title": "Dangerous waters and international law: the Corfu Channel case, warships, and sovereignty irritants", "year": "2012", "source": "in Karine Bannelier, Theodore Christakis and Sarah Heathcote (ed.), The ICJ and the Evolution of International Law: the enduring impact of the Corfu Channel case, Routledge, Taylor & Francis Group, London UK, pp. 164-180", "authors": ["Rob McLaughlin"]}, {"title": "Unmanned Naval Vehicles at Sea: USVs, UUVs, and the Adequacy of the Law", "year": "2011", "source": "Journal of Law, Information and Science, vol. 21, pp. EAP1-EAP16", "authors": ["Rob McLaughlin"]}, {"title": "The Changing Character of Public Legal Scrutiny of Operations", "year": "2011", "source": "in Raul A Pete' Pedrozo and Daria P Wollschlaeger (ed.), International Law and the Changing Character of War, Naval War College Press, Newport, Rhode Island, pp. 415-426", "authors": ["Rob McLaughlin"]}, {"title": "The Law of Armed Conflict and International Human Rights Law: Some Paradigmatic Differences and Operational Implications", "year": "2011", "source": "Yearbook of International Humanitarian Law, vol. 2011, pp. 213-243", "authors": ["Rob McLaughlin"]}, {"title": "International Humanitarian Law, new forms of armed violence and the use of force", "year": "2011", "source": "in Marco Odello and Gian Luca Beruto (ed.), Global Violence: Consequences and Responses, Franco Angeli, Milan, Italy, pp. 115-123", "authors": ["Rob McLaughlin"]}, {"title": "United Nations Naval Peace Operations in the Territorial Sea", "year": "2009", "source": "Martinus Nijhoff PublishersThe Netherlands", "authors": ["Rob McLaughlin"]}, {"title": "ustralian Defence Force Operations", "year": "2009", "source": "New Zealand Armed Forces Law Review, vol. 9, pp. 172-184", "authors": ["Moore C", "Rob McLaughlin"]}, {"title": "Rules of Engagement Handbook", "year": "2009", "source": "International Institute of Humanitarian LawSanremo, USA", "authors": ["Cole A", "Drew P", "Rob McLaughlin", "Mandsager D"]}, {"title": "The Use of Lethal Force by Military Forces on Law Enforcement Operations: Is There a", "year": "2009", "source": "Lawful Authority?'Federal Law Review, vol. 37, no. 3, pp. 441-469", "authors": ["Rob McLaughlin"]}, {"title": "The Legal Regime Applicable to Use of Lethal Force When Operating under a United Nations Security Council Chapter VII Mandate Authorising", "year": "2008", "source": "All Necessary Means''Journal of Conflict and Security Law, vol. 12, no. 3, pp. 389-417", "authors": ["Rob McLaughlin"]}, {"title": "ustralian Defence Force Operations", "year": "2008", "source": "New Zealand Armed Forces Law Review, vol. 8, pp. 147-158", "authors": ["Waddell J", "Rob McLaughlin", "Moore C"]}, {"title": "WILFUL KILLING", "year": "2007", "source": "' DURING ARMED CONFLICT: IS THERE A DEFENCE OF PROPORTIONALITY IN AUSTRALIA?'Criminal Law Forum, vol. 18, no. 1, pp. 1-41", "authors": ["Rob McLaughlin", "Oswald B"]}]}, "Microsoft-Academic": [{"title": "single stream recycling inspires selective fish passage solutions for the connectivity conundrum in aquatic ecosystems", "year": 2020, "source": "bioscience", "authors": [{"name": "daniel p zielinski", "affiliation": "great lakes fishery commission"}, {"name": "rob mclaughlin", "affiliation": "great lakes fishery commission"}, {"name": "thomas c pratt", "affiliation": "fisheries and oceans canada"}, {"name": "r andrew goodwin", "affiliation": "engineer research and development center"}, {"name": "andrew m muir", "affiliation": "great lakes fishery commission"}], "id": 121830084}, {"title": "session d1 towards effective bi directional selective fish passage", "year": 2015, "source": "", "authors": [{"name": "thomas pratt", "affiliation": "university of massachusetts amherst"}, {"name": "rob mclaughlin"}, {"name": "andrew m muir"}]}, {"title": "merging biology and technology to achieve selective bi directional fish passage", "year": 2018, "source": "", "authors": [{"name": "daniel p zielinski"}, {"name": "theodore castrosantos"}, {"name": "andy goodwin"}, {"name": "thomas c pratt"}, {"name": "rob mclaughlin"}, {"name": "andrew d muir"}]}, {"title": "mismatch between sea lamprey behaviour and trap location explains low trapping success", "year": 2017, "source": "", "authors": [{"name": "rob mclaughlin"}, {"name": "andrew m rous"}, {"name": "adrienne r mclean"}, {"name": "gale a bravener"}, {"name": "thomas c pratt"}, {"name": "jess barber"}, {"name": "istvan imre"}, {"name": "christopher m holbrook"}, {"name": "theodore castrosantos"}]}, {"title": "innovations i when enough is enough how the effectiveness of fish passage can influence the recovery of a fish population", "year": 2016, "source": "", "authors": [{"name": "rob mclaughlin"}, {"name": "eric smyth"}, {"name": "marten a koops"}, {"name": "thomas c pratt"}, {"name": "antonio velezespino"}]}, {"title": "fish passage studies i bi directional selective fish passage the complications of fish passage in the laurentian great lakes", "year": 2016, "source": "", "authors": [{"name": "andrew m muir"}, {"name": "rob mclaughlin"}, {"name": "thomas c pratt"}]}, {"title": "video the implications to the forest industry of mpb affected stands and associated volume presentation by rob mclaughlin", "year": 2016, "source": "", "authors": [{"name": "rob mclaughlin"}]}, {"title": "las vegas area wide reuse study", "year": 2001, "source": "", "authors": [{"name": "craig m galuska"}, {"name": "bert anzai"}, {"name": "marinus baadsgaard"}, {"name": "gary k grinnell"}, {"name": "rob mclaughlin"}, {"name": "david mendenhall"}, {"name": "don e pellissier"}, {"name": "dennis b porter"}]}, {"title": "decisions for the dammed in an uncertain world madison wisconsin ballroom", "year": 2014, "source": "", "authors": [{"name": "rob mclaughlin"}]}, {"title": "naval law review volume 51 2005", "year": 2005, "source": "", "authors": [{"name": "joseph romero"}, {"name": "richard d belliss"}, {"name": "tammy p tideswell"}, {"name": "vida m antolinjenkins"}, {"name": "kevin r oneil"}, {"name": "william a wildhack"}, {"name": "rob mclaughlin"}, {"name": "jason a gonzalez"}, {"name": "stephen r sarnoski"}]}], "ANDS-Grants": []}