{"ANU": {"name": "Robert G (Jerry)  Schwab", "link": "https://researchers.anu.edu.au/researchers/schwab-rg", "colleges": "College of Arts and Social Sciences", "email": "Jerry.Schwab@anu.edu.au", "phone": "", "expertise": ["Aboriginal And Torres Strait Islander Education", "Education Assessment And Evaluation", "Education Policy", "Studies Of Aboriginal And Torres Strait Islander Society", "Social And Cultural Anthropology", "Public Policy", "Specialist Studies In Education", "Policy And Administration"], "interest": ["R.G. (Jerry) Schwab is Honary Associate Professor and former Director of  the Centre for Aboriginal Economic Policy Research at The Australian National University where he carries out research related to Indigenous education, literacy and youth policy. He has been involved with educational research and development in Australia and overseas (USA, Canada, United Arab Emirates and Egypt) since the mid-1980s. Since joining CAEPR in 1995, he has carried out primary and secondary research on issues as diverse as Aboriginal community-controlled schools, notions of educational 'failure' and 'success' among Indigenous students, Indigenous workforce development and Indigenous education outcomes at the primary, secondary and post-compulsory levels. He has long standing research interest in the relationship between schools and communities. His recent research has focused on Indigenous youth and new media, learning, philanthropy and Indigenous land and resource management as an avenue for the educational and social re-engagement of Indigenous youth in remote regions."], "biography": "", "project": [], "publication": [{"title": "space to learn: A community-based approach to meaningful adult learning and literacy in remote Indigenous Australia", "year": "2017", "source": "Prospects, vol. online, pp. 13pp", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Land, Learning and Identity: toward a deeper understanding of Indigenous Learning on Country", "year": "2015", "source": "UNESCO Observatory Multi-Disciplinary Journal in the Arts, vol. 4, no. 2, pp. 1-16", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "", "year": "2015", "source": "Business-Related Studies and Indigenous Australian Students", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "You are boss for me!\" A case study of the erosion of Indigenous self-determination in education", "year": "2013", "source": "in R. Craven, A. Dillon and N. Parbury (eds.), In Black & White: Australians All at the Crossroads, Connor Court Publishing, Ballan, pp. 209-228", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Learning Spaces: Youth", "year": "2012", "source": "Literacy and New Media in Remote Indigenous AustraliaANU ePress, Canberra", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Indigenous early school leavers: Failure, risk and high-stakes testing", "year": "2012", "source": "Australian Aboriginal Studies, vol. 2012, no. 1, pp. 3-18", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Indigenous youth engagement in natural resource management in Australia and North America: A review", "year": "2012", "source": "CAEPR Working Papers, vol. 85, pp. 1-28", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Education, land and learning", "year": "2012", "source": "Ngiya: Talk the Law, vol. 4, pp. 98-121", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Indigenous education: Experiential learning and Learning through Country", "year": "2012", "source": "CAEPR Working Paper 80CAEPR, ANU, Canberra", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Indigenous people and vocational education and training", "year": "2010", "source": "in P. Peterson, E. Baker, B. McGaw (ed.), International Encyclopedia of Education, Volume 8 (3rd ed), Elsevier, Oxford, pp. 289-293", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Education and training: The 2002 NATSISS", "year": "2006", "source": "Indigenous Socioeconomic Outcomes: Assessing Recent Evidence, ed. B.H. Hunter, ANU ePress, Canberra, p. 1711181", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Education and training", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Pan Macmillan Publishers Australia, Sydney, Australia, pp. 194-207", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Education and community", "year": "2005", "source": "Aborigines, Culture and Economy: The Past, Present, and Future of Rural and Remote Indigenous Lives, ed. D. Austin-Broos and G. Macdonald, University of Sydney Press, Sydney Australia, pp. 165-174", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Mapping Indigenous educational participation", "year": "2004", "source": "CAEPR Discussion Paper no. 267, CAEPR, ANU, Canberra, pp. vi+29", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Indigenous learning communities: A vehicle for community empowerment and capacity development", "year": "2003", "source": "Learning Communities: International Journal of Learning in Social Contexts, vol. Number 1 2003, pp. 53-70", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Practical reconciliation and continuing disadvantage in Indigenous education", "year": "2003", "source": "Australian Review of Public Affairs, vol. 4, no. 2, pp. 83-98", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Vet-in-school for Indigenous students: success through", "year": "2001", "source": "'cultural fit''Research to Reality: Putting VET Research to Work, Australian Vocational Education and Research Training Association, Adelaide, pp. 1-Oct", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "That school gotta recognise our policy! The appropriation of educational policy in an Australian Aboriginal community", "year": "2001", "source": "in M. Sutton and B. Levinson (ed.), Policy as Practice: Toward a Comparative Sociocultural Analysis of Educational Policy, Ablex Publishing Corporation, Westport, Connecticut, pp. 243-264", "authors": ["Robert G (Jerry)  Schwab"]}, {"title": "Training by doing: Pathways through CDEP", "year": "2001", "source": "The Indigenous Welfare Economy and the CDEP Scheme: Autonomy, Dependence, Self Determination and Mutual Obligation, ed. F. Morphy and W. Sanders, Australian National University, Canberra, pp. 109-122", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Trends in Indigenous educational participation and attainment, 1986-96", "year": "2000", "source": "Australian Journal of Education, vol. 44, no. 2, pp. 101-17", "authors": ["Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab", "Robert G (Jerry)  Schwab"]}, {"title": "Why Only One in Three? The Complex Reasons for Low Indigenous School Retention", "year": "1999", "source": "ANU CAEPR", "authors": ["Robert G (Jerry)  Schwab"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}