{"ANU": {"name": "Rosemary Korda", "link": "https://researchers.anu.edu.au/researchers/korda-rj", "colleges": "College of Health & Medicine", "email": "rosemary.korda@anu.edu.au", "phone": "", "expertise": ["Epidemiology", "Public Health And Health Services"], "interest": ["Variation in health and health careData linkageCardiovascular diseaseChronic diseaseHealth Services ResearchEnvironmental exposures"], "biography": "", "project": [], "publication": [{"title": "Education inequalities in adult all-cause mortality: first national data for Australia using linked census and mortality data. International Journal of Epidemiology", "year": "2020", "source": "Volume 49Issue 2, April 2020, Pages 511–518, https://doi.org/10.1093/ije/dyz191", "authors": ["Rosemary Korda", "Biddle N", "Lynch J"]}, {"title": "Comparison of cardiovascular disease risk factors, assessment and management in men and women, including consideration of absolute risk: A nationally representative cross-sectional study", "year": "2020", "source": "BMJ Open, vol. 10, no. 12", "authors": ["Banks E", "Welsh J", "Joshy G", "Rosemary Korda"]}, {"title": "Education-related variation in coronary procedure rates and the contribution of private health care in Australia: a prospective cohort study", "year": "2020", "source": "International Journal for Equity in Health, vol. 19, no. 139, pp. 1-12", "authors": ["Hughes V", "Paige E", "Welsh J", "Rosemary Korda"]}, {"title": "Cross-sectional survey describing general practitionersï¿½ absolute cardiovascular disease risk assessment practices and their relationship to knowledge, attitudes and beliefs about cardiovascular disease risk in Queensland, Australia", "year": "2020", "source": "BMJ Open, vol. 10, no. 8", "authors": ["Greaves K", "Smith A", "Agostino J", "Rosemary Korda"]}, {"title": "Identifying long-term psychological distress from single measures: evidence from a nationally representative longitudinal survey of the Australian population", "year": "2020", "source": "BMC Medical Research Methodology, vol. 20, no. 1, pp. -", "authors": ["Welsh J", "Rosemary Korda", "Banks E"]}, {"title": "prospective study of health conditions related to alcohol consumption cessation among 72,368 drinkers aged 45 and over in Australia", "year": "2019", "source": "Alcoholism: Clinical and Experimental Research, vol. 43, no. 4, pp. 710-721pp", "authors": ["Sarich P", "Canfell K", "Banks E", "Rosemary Korda"]}, {"title": "Primary Absolute Cardiovascular Disease Risk and Prevention in Relation to Psychological Distress in the Australian Population: A Nationally Representative Cross-Sectional Study", "year": "2019", "source": "Frontiers in Public Health, vol. 7, pp. 1-9", "authors": ["Welsh J", "Rosemary Korda", "Joshy G"]}, {"title": "Tobacco smoking and risk of 36 cardiovascular disease subtypes: Fatal and non-fatal outcomes in a large prospective Australian study", "year": "2019", "source": "BMC Medicine, vol. 17, no. 1, pp. -", "authors": ["Banks E", "Joshy G", "Rosemary Korda"]}, {"title": "Psychological distress and medication use for secondary prevention of cardiovascular events: Evidence from a large-scale population-based cohort study", "year": "2019", "source": "Journal of Psychosomatic Research, vol. 124, no. 109748, pp. 1-7", "authors": ["Welsh J", "Paige E", "Banks E", "Rosemary Korda"]}, {"title": "Variation in cardiovascular disease care: an Australian cohort study on sex differences in receipt of coronary procedures", "year": "2019", "source": "BMJ Open, vol. 9, no. 7, pp. 1-7", "authors": ["Fogg A", "Welsh J", "Banks E", "Rosemary Korda"]}, {"title": "Variation in coronary angiography and revascularisation procedures in relation to psychological distress among patients admitted to hospital with myocardial infarction or angina", "year": "2019", "source": "Journal of Psychosomatic Research, vol. 125, no. 109794, pp. 1-8", "authors": ["Welsh J", "Rosemary Korda", "Joshy G"]}, {"title": "bsolute cardiovascular disease risk and lipid-lowering therapy among Aboriginal and Torres Strait Islander Australians", "year": "2018", "source": "Medical Journal of Australia, vol. 209, no. 1, pp. 35-41pp", "authors": ["Calabria B", "Rosemary Korda", "Lovett R"]}, {"title": "Developing a positive patient experience with nurses in general practice: an integrated model of patient satisfaction and enablement", "year": "2018", "source": "Journal of Advanced Nursing, vol. 74, no. 3, pp. 564-578", "authors": ["Desborough J", "Phillips C", "Mills J", "Rosemary Korda"]}, {"title": "Patient beliefs and attitudes to taking statins: Systematic review of qualitative studies", "year": "2018", "source": "British Journal of General Practice, vol. 68, no. 671, pp. 408-419pp", "authors": ["Ju A", "Hanson C", "Banks E", "Rosemary Korda"]}, {"title": "Socioeconomic variation in absolute cardiovascular disease risk and treatment in the Australian population", "year": "2018", "source": "Preventive Medicine, vol. 114, pp. 217-222pp", "authors": ["Paige E", "Welsh J", "Agostino J", "Rosemary Korda"]}, {"title": "The practical use of the Patient Enablement and Satisfaction Model in nurse-led outpatient cardiac clinics", "year": "2018", "source": "Collegian, vol. 26, pp. 415-421", "authors": ["Desborough J", "Parkinson A", "Rosemary Korda"]}, {"title": "General practitioners", "year": "2018", "source": "perspectives on the prevention of cardiovascular disease: systematic review and thematic synthesis of qualitative studies'BMJ Open, vol. 8, no. 11, pp. 1-17pp", "authors": ["Ju I", "Banks E", "Calabria B", "Rosemary Korda"]}, {"title": "Risk of cancer associated with residential exposure to asbestos insulation: a whole-population cohort study", "year": "2017", "source": "The Lancet Public Health, vol. 2, no. 11, pp. e522-e528", "authors": ["Rosemary Korda", "Clements M", "Armstrong B"]}, {"title": "Obesity and its association with sociodemographic \r\nfactors, health behaviours and health status among \r\nAboriginal and non-Aboriginal adults in New South \r\nWales, Australia", "year": "2018", "source": "Journal of Epidemiology and Community Health, vol. 72, pp. 491-498", "authors": ["Thurber K", "Joshy G", "Rosemary Korda"]}, {"title": "", "year": "2017", "source": "ACT Asbestos Health Study: Data Linkage Study on the Risk of Mesothelioma and Other Cancers in Residents of Affected Properties in the ACT", "authors": ["Rosemary Korda", "Kirk M", "Trevenar S"]}, {"title": "bsolute risk of cardiovascular disease events and blood pressure- and lipid-lowering therapy in Australia: In Reply", "year": "2017", "source": "The Medical Journal of Australia (Online), vol. 206, no. 1, pp. 51-51.e1pp.", "authors": ["Banks E", "Rosemary Korda", "Stavreski B"]}, {"title": "Factors related to receipt of non-cancer related transurethral prostatectomy: Findings from a large prospective study of 106,769 middle aged and older Australian men", "year": "2017", "source": "BMJ Open, vol. 7, no. 2, pp. e013737-e013737", "authors": ["Joshy G", "Soga K", "Rosemary Korda"]}, {"title": "Variation in readmission and mortality following hospitalisation with a diagnosis of heart failure: prospective cohort study using linked data", "year": "2017", "source": "BMC Health Services Research, vol. 17, no. 220, pp. 1-18pp", "authors": ["Rosemary Korda", "Du W", "Day C"]}, {"title": "Burden of Clostridium difficile infection: Associated hospitalization in a cohort of middle-aged and older adults", "year": "2017", "source": "American Journal of Infection Control, vol. 45, no. 5, pp. 508-511pp", "authors": ["Chen Y", "Glass K", "Liu B", "Rosemary Korda"]}, {"title": "Developing a Positive Patient Experience With Nurses in General Practice: An Integrated Model of Patient Satisfaction and Enablement", "year": "2017", "source": "Journal of Advanced Nursing, vol. Online, pp. 38pp", "authors": ["Desborough J", "Phillips C", "Mills J", "Rosemary Korda"]}, {"title": "Psychological distress and ischaemic heart disease: cause or consequence? Evidence from a large prospective cohort study", "year": "2017", "source": "Journal of Epidemiology and Community Health, vol. Online, pp. 7pp.", "authors": ["Welsh J", "Rosemary Korda", "Joshy G"]}, {"title": "Mesothelioma trends in the ACT and comparisons with the rest of Australia", "year": "2016", "source": "Public Health Research & Practice, vol. 26, no. 4, pp. 1-6pp", "authors": ["Rosemary Korda", "Clements M", "Armstrong B"]}, {"title": "Body-mass index and all-cause mortality: individual-participant-data meta-analysis of 239 prospective studies in four continents", "year": "2016", "source": "Lancet, vol. 338, no. 10046, pp. 776-786", "authors": ["The Global BMI Mortality Collaboration", "Rosemary Korda"]}, {"title": "Socioeconomic variation in incidence of primary and secondary major cardiovascular disease events: an Australian population-based prospective cohort study", "year": "2016", "source": "International Journal for Equity in Health, vol. 15, no. 189, pp. 10pp", "authors": ["Rosemary Korda", "Soga K", "Joshy G"]}, {"title": "Is poor oral health a risk marker for incident cardiovascular disease hospitalisation and all-cause mortality? Findings from 172 630 participants from the prospective 45 and Up Study", "year": "2016", "source": "BMJ Open, vol. 6, no. 8", "authors": ["Joshy G", "Arora M", "Rosemary Korda"]}, {"title": "Monday", "year": "2013", "source": "s medical myth: overweight people live longer", "authors": ["Banks E", "Joshy G", "Rosemary Korda"]}, {"title": "population-based longitudinal study of Clostridium difficile infection-related hospitalization in mid-age and older Australians", "year": "2017", "source": "Epidemiology and Infection, vol. 145, no. 3, pp. 575-582", "authors": ["Chen Y", "Glass K", "LIU B", "Rosemary Korda"]}, {"title": "bsolute risk of cardiovascular disease events, and blood pressure-and lipid-lowering therapy in Australia", "year": "2016", "source": "Medical Journal of Australia, vol. 204, no. 8, pp. 320-320", "authors": ["Banks E", "Crouch S", "Rosemary Korda"]}, {"title": "The relationship between body mass index and hospitalisation rates, days in hospital and costs: Findings from a large prospective linked data study", "year": "2015", "source": "PLOS ONE (Public Library of Science), vol. 10, no. 3, pp. e0118599-e0118599", "authors": ["Rosemary Korda", "Joshy G", "Paige E"]}, {"title": "Using Australian Pharmaceutical Benefits Scheme data for pharmacoepidemiological research: challenges and approaches", "year": "2015", "source": "Public Health Research & Practice, vol. 25, no. 4, pp. 1-6", "authors": ["Paige E", "Kemp-Casey A", "Rosemary Korda"]}, {"title": "Not all hours are equal: could time be a social determinant of health?", "year": "2016", "source": "Sociology of Health and Illness, vol. 38, no. 1, pp. 21-42", "authors": ["Strazdins L", "Welsh J", "Rosemary Korda"]}, {"title": "Not all hours are equal: could time be a social determinant of health?", "year": "2016", "source": "Sociology of Health and Illness, vol. 38, no. 1, pp. 21-42", "authors": ["Strazdins L", "Welsh J", "Rosemary Korda"]}, {"title": "record linkage study of antidepressant medication use and weight change in Australian adults", "year": "2015", "source": "Australian and New Zealand Journal of Psychiatry, vol. 49, no. 11, pp. 1029-1039", "authors": ["Paige E", "Rosemary Korda", "Kemp-Casey A"]}, {"title": "Categorising major cardiovascular disease hospitalisations from routinely collected data", "year": "2015", "source": "Public Health Research & Practice, vol. 25, no. 3", "authors": ["Joshy G", "Rosemary Korda", "Abhayaratna W"]}, {"title": "Characteristics of antidepressant medication users in a cohort of mid-age and older Australians", "year": "2015", "source": "Australian and New Zealand Journal of Psychiatry, vol. 49, no. 3, pp. 275-290", "authors": ["Paige E", "Rosemary Korda", "Kemp A"]}, {"title": "Relationship between lifestyle and health factors and severe lower urinary tract symptoms (LUTS) in 106,435 middle-aged and older australian men: Population-based study", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 10, pp. e109278-e109278", "authors": ["Smith D", "Weber M", "Soga K", "Rosemary Korda"]}, {"title": "How weight change is modelled in population studies can affect research findings: empirical results from a large-scale cohort study", "year": "2014", "source": "BMJ Open, vol. 4, no. 6, pp. e004860-e004860", "authors": ["Paige E", "Rosemary Korda", "Banks E"]}, {"title": "Body mass index and incident hospitalisation for cardiovascular disease in 158 546 participants from the 45 and Up Study", "year": "2014", "source": "International Journal of Obesity, vol. 38, no. 6, pp. 848-856", "authors": ["Joshy G", "Rosemary Korda", "Attia J"]}, {"title": "Investigation of Methodological Factors Potentially Underlying the Apparently Paradoxical Findings on Body Mass Index and All-Cause Mortality", "year": "2014", "source": "PLOS ONE (Public Library of Science), vol. 9, no. 2, p. 9", "authors": ["Joshy G", "Rosemary Korda", "van der Ploeg H"]}, {"title": "Income-related inequalities in chronic conditions", "year": "2014", "source": "physical functioning and psychological distress among older people in Australia: cross-sectional findings from the 45 and up study. BMC Public Health. 14(1):741", "authors": ["Rosemary Korda"]}, {"title": "Variation in health inequalities according to measures of socioeconomic status and age", "year": "2014", "source": "Australian and New Zealand Journal of Public Health", "authors": ["Mather T", "Banks E", "Joshy G", "Rosemary Korda"]}, {"title": "Erectile Dysfunction Severity as a Risk Marker for Cardiovascular Disease Hospitalisation and All-Cause Mortality: A Prospective Cohort Study. PLoS Medicine", "year": "2013", "source": "vol. 10no. 1, pp. 1-13", "authors": ["Banks E Joshy G", "Abhayaratna W", "", "Rosemary Korda"]}, {"title": "Inequalities in bariatric surgery in Australia:\r\nfindings from 49 364 obese participants\r\nin a prospective cohort study", "year": "2012", "source": "Medical Journal of Australia 2012, vol 197, pp. 631-636", "authors": ["Rosemary Korda", "Joshy G", "Jorm L"]}, {"title": "Prospective cohort study of body mass index and the risk of hospitalisation: findings from 246 361 participants in the 45 and Up Study", "year": "2013", "source": "International Journal of Obesity, vol. 37, no. 6, pp. 790-799", "authors": ["Rosemary Korda", "Liu B", "Clements M"]}, {"title": "Sitting Time and All-Cause Mortality Risk in 222 497 Australian Adults", "year": "2012", "source": "Archives of Internal Medicine, vol. 172, no. 6, pp. 494-500", "authors": ["Van der Ploeg H", "Chey T", "Rosemary Korda"]}, {"title": "Lower urinary tract symptoms in relation to region of birth in 95,393 men living in Australia: the 45 and Up Study", "year": "2013", "source": "World Journal of Urology, vol. 31, no. 3, pp. 673-682", "authors": ["Latz I", "Weber M", "Rosemary Korda"]}, {"title": "Socioeconomic inequalities in the diffusion of health technology: Uptake of coronary procedures as an example", "year": "2011", "source": "Social Science and Medicine, vol. 72, no. 2, pp. 224-229", "authors": ["Rosemary Korda", "Clements M", "Dixon J"]}, {"title": "Validity of self-reported height and weight and derived body mass index in middle-aged and elderly individuals in Australia", "year": "2011", "source": "Australian and New Zealand Journal of Public Health, vol. 35, no. 6, pp. 557-563", "authors": ["Ng S", "Rosemary Korda", "Clements M"]}, {"title": "Chronic disease management items in general practice: A population-based study of variation in claims by claimant characteristics", "year": "2011", "source": "Medical Journal of Australia, vol. 195, no. 4, pp. 198-202", "authors": ["Douglas K", "Yen L", "Rosemary Korda"]}, {"title": "Time scarcity: Another health inequality?", "year": "2011", "source": "Environment and Planning A, vol. 43, no. 3, pp. 545-559", "authors": ["Strazdins L", "Griffin A", "Broom D", "Rosemary Korda"]}, {"title": "Is inequity undermining Australia", "year": "2009", "source": "s universal' health care system? Socio-economic inequalities in the use of specialist medical and non-medical ambulatory health care'Australian and New Zealand Journal of Public Health, vol. 33, no. 5, pp. 458-465", "authors": ["Rosemary Korda", "Banks E", "Clements M"]}, {"title": "Universal health care no guarantee of equity: Comparison of socioeconomic inequalities in the receipt of coronary procedures in patients with acute myocardial infarction and angina", "year": "2009", "source": "BMC Public Health, vol. 9, no. 460, p. 12", "authors": ["Rosemary Korda", "Clements M", "Kelman C"]}, {"title": "Differential impacts of health care in Australia: trend analysis of socioeconomic inequalities in avoidable mortality", "year": "2007", "source": "International Journal of Epidemiology, vol. 36, no. 1, pp. 157-165", "authors": ["Rosemary Korda", "Butler J", "Clements M"]}, {"title": "Effect of healthcare on mortality: Trends in avoidable mortality in Australia and comparisons with Western Europe", "year": "2006", "source": "Public Health, vol. 120, pp. 95-105", "authors": ["Rosemary Korda", "Butler J"]}, {"title": "Unsociable work? Non standard work schedules, family relationships and children", "year": "2006", "source": "s well-being'Journal of Marriage and the Family, vol. 68, no. 2, pp. 394-410", "authors": ["Strazdins L", "Clements M", "Rosemary Korda"]}, {"title": "round-the-clock: Parent work schedules and childrens", "year": "2004", "source": "well-being in a 24-h economy'Social Science and Medicine, vol. 59, pp. 1517-1527", "authors": ["Strazdins L", "Rosemary Korda", "Lim L"]}, {"title": "The Direct Cost of Managing Patients With Chronic Hepatitis B Infection in Australia", "year": "2004", "source": "Journal of Clinical Gastroenterology, vol. 38, no. 10, pp. S187-92", "authors": ["Butler J", "Pianko S", "Rosemary Korda"]}]}, "Microsoft-Academic": [{"title": "socioeconomic inequalities in health care in australia differential impacts on mortality and inequalities in the use of services", "year": 2008, "source": "", "authors": [{"name": "rosemary korda"}]}], "ANDS-Grants": [{"description": "In partnership with the Australian Bureau of Statistics, Australian Institute of Health and Welfare and Heart Foundation, we will create a whole-of-population linked data platform to inform improvements in health and heath care. We will investigate: socioeconomic variation in disease burden, to identify opportunities to improve population health; preventive cardiovascular disease (CVD) care, to improve treatment; and end-of-life care trajectories, focusing on CVD, to inform improvements in care.", "title": "Whole-of-population linked data: strengthening the evidence to drive improvement in health and health care in Australia", "id": "1318171", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1134707", "researchers": ["Dr Bianca Calabria", "Prof John Lynch", "Prof Walter Abhayaratna", "Prof Louisa Jorm", "Dr Raymond Lovett", "Prof Emily Banks", "Dr Naomi Priest", "Dr Rosemary Korda"], "status": "active", "fundingAmount": 1145640.5, "fundingScheme": "Partnerships", "startDate": 2017, "endDate": 2021, "dateTimeModified": "2018-03-07T07:53:34Z", "dateTimeCreated": "2018-03-07T07:53:34Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Rosemary Korda"], "purl": "http://purl.org/au-research/grants/nhmrc/1134707", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1134707", "1134707"], "subjects": ["Epidemiology", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "burden of disease", "cardiovascular disease", "data linkage", "health care utilisation", "population variation"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1318171"}]}, {"description": "In partnership with the Australian Bureau of Statistics, Australian Institute of Health and Welfare and Heart Foundation, we will create a whole-of-population linked data platform to inform improvements in health and heath care. We will investigate: socioeconomic variation in disease burden, to identify opportunities to improve population health; preventive cardiovascular disease (CVD) care, to improve treatment; and end-of-life care trajectories, focusing on CVD, to inform improvements in care.", "title": "Whole-of-population linked data: strengthening the evidence to drive improvement in health and health care in Australia", "id": "1347953", "key": "http://purl.org/au-research/grants/nhmrc/GNT1134707", "researchers": ["A/Pr Nicholas Biddle", "Prof Louisa Jorm", "Prof Emily Banks", "Dr Raymond Lovett", "Prof John Lynch", "Dr Naomi Priest", "Prof Walter Abhayaratna", "Dr Rosemary Korda", "Dr Bianca Calabria"], "institutions": null, "status": "active", "fundingAmount": 1130376, "fundingScheme": "Partnerships", "startDate": 2017, "endDate": null, "dateTimeModified": "2019-06-03T04:23:38Z", "dateTimeCreated": "2018-10-03T01:50:00Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Dr Rosemary Korda"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1134707", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1134707", "GNT1134707"], "subjects": ["Public Health", "burden of disease | cardiovascular disease | data linkage | health care utilisation | population variation"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1347953"}]}, {"description": "Obesity is an important and rapidly increasing health problem, especially in indigenous communities. The proposed project investigates how obesity affects the risk of hospital admission in Indigenous and non-Indigenous Australians, including providing evidence regarding the nature of the hospitalisation, the cost and whether specific groups are at a higher risk of obesity-related hospitalisation. In doing so it aims to identify targets for intervention to reduce obesity-related hospitalisation", "title": "Obesity, overweight and hospitalisation: Identifying targets for interventions to prevent adverse health outcomes", "id": "96491", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/585402", "researchers": ["Ms Debra Fernando", "Dr Rosemary Korda", "Dr Mark Clements", "Dr James Butler", "Prof Hilary Bambrick", "A/Pr Bette Liu", "Prof Emily Banks", "Prof Adrian Bauman", "Prof Louisa Jorm", "Ms Vicki Wade"], "status": "closed", "fundingAmount": 603755.25, "fundingScheme": "NHMRC Project Grants", "startDate": 2010, "endDate": 2013, "dateTimeModified": "2017-07-17T04:49:48Z", "dateTimeCreated": "2013-05-15T05:57:33Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Emily Banks"], "purl": "http://purl.org/au-research/grants/nhmrc/585402", "identifiers": ["http://purl.org/au-research/grants/nhmrc/585402", "585402"], "subjects": ["Epidemiology", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "cohort studies", "health economics", "health policy and services evaluation", "indigenous", "obesity", "PGP4", "health service utilisation", "hospitalisation", "record linkage"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/96491"}]}, {"description": "This project investigates inequalities in cardiovascular disease risk, incidence, healthcare and outcomes, focussing on socio-economic status, rurality, mental health and Aboriginality. It will work with partner organisations and use a range of data sources - including representative population data, clinical datasets, large scale linked data and qualitative data - to better understand variation in cardiovascular disease, to reduce inequalities and improve outcomes.", "title": "Identifying and prioritising points for intervention to reduce cardiovascular disease inequalities in Australia", "id": "519386", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1092674", "researchers": ["Dr Robert Grenfell", "Prof Peter Butterworth", "Prof Prasuna Reddy", "Dr Ian Mcrae", "Prof David Brieger", "A/Pr Allison Tong", "Prof Sandra Eades", "Prof Emily Banks", "Prof John Chalmers", "Dr Rosemary Korda"], "status": "active", "fundingAmount": 550669.5, "fundingScheme": "Partnerships", "startDate": 2014, "endDate": 2019, "dateTimeModified": "2018-03-07T07:53:05Z", "dateTimeCreated": "2015-04-12T08:18:44Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Prof Emily Banks"], "purl": "http://purl.org/au-research/grants/nhmrc/1092674", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1092674", "1092674"], "subjects": ["Epidemiology", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "cardiovascular disease", "health inequalities", "socioeconomic status", "indigenous health", "mental health"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/519386"}]}, {"description": "This project investigates inequalities in cardiovascular disease risk, incidence, healthcare and outcomes, focussing on socio-economic status, rurality, mental health and Aboriginality. It will work with partner organisations and use a range of data sources - including representative population data, clinical datasets, large scale linked data and qualitative data - to better understand variation in cardiovascular disease, to reduce inequalities and improve outcomes.", "title": "Identifying and prioritising points for intervention to reduce cardiovascular disease inequalities in Australia", "id": "1345889", "key": "http://purl.org/au-research/grants/nhmrc/GNT1092674", "researchers": ["Dr Robert Grenfell", "Prof Emily Banks", "Prof Sandra Eades", "Prof David Brieger", "Prof Peter Butterworth", "Prof John Chalmers", "Prof Prasuna Reddy", "A/Pr Allison Tong", "Dr Rosemary Korda", "Dr Ian McRae"], "institutions": null, "status": "active", "fundingAmount": 527968, "fundingScheme": "Partnerships", "startDate": 2014, "endDate": null, "dateTimeModified": "2019-06-03T04:23:20Z", "dateTimeCreated": "2018-10-03T01:49:39Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": null, "principalInvestigator": ["Prof Emily Banks"], "purl": "http://purl.org/au-research/grants/nhmrc/GNT1092674", "identifiers": ["http://purl.org/au-research/grants/nhmrc/GNT1092674", "GNT1092674"], "subjects": ["Public Health", "cardiovascular disease | health inequalities | socioeconomic status | indigenous health | mental health"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1345889"}]}, {"description": "The globalising economy, financial uncertainties and major democratic changes are all affecting family time. Parent's time is a resource on which children depend, but time scarcity has become a widespread problem for families. Our study helps focus policy attention on this problem. We deliver new methods to assess the experience of time scarcity in families, identifying those who are most likely to experience it, where they live, and how time scarcity affects them. This evidence can help support policy approaches to time, benefiting the twin economic and social policy goals of encouraging workforce participation while supporting the health and wellbeing of families.", "title": "Time scarcity in Australian families: another inequity?", "id": "66544", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP100100106", "researchers": ["Strazdins Dr Lyndall", "Prof Dorothy H Broom", "Mr John D Glover", "Dr Catherine Banwell", "Dr Jane M Dixon", "Dr Amy L Griffin", "Dr Rosemary Korda", "Miss Megan A Shipley", "Dr Francesco Paolucci", "Dr Marian T Esler", "Dr Stephen J Corbett"], "status": "closed", "fundingAmount": 325000, "fundingScheme": "Linkage Projects", "startDate": 2010, "endDate": 2013, "dateTimeModified": "2015-08-13T17:18:48Z", "dateTimeCreated": "2013-05-15T02:06:17Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP100100106", "identifiers": ["http://purl.org/au-research/grants/arc/LP100100106", "LP100100106"], "subjects": ["PUBLIC HEALTH AND HEALTH SERVICES", "MEDICAL AND HEALTH SCIENCES", "family", "health inequity", "time", "wellbeing"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/66544"}]}]}