{"ANU": {"name": "Rowan Conroy", "link": "https://researchers.anu.edu.au/researchers/conroy-rm", "colleges": "College of Arts and Social Sciences", "email": "Rowan.Conroy@anu.edu.au", "phone": "", "expertise": ["Lens Based Practice", "Visual Arts And Crafts Not Elsewhere Classified"], "interest": ["In 2018, Conroy was awarded the Create NSW Regional Artist Fellowship to undertake two periods of artistic interpretation at the Paphos Theatre Archaeological Project excavations in Cyprus, which he undertook in 2018 and 2019. Conroy’s project focused on high resolution mapping of the site using professional drone equipment, resulting in a range of 3D photogrammetry models covering key areas of the site and finds. Rowan also shoots footage of the process of excavation from an artistic perspective, revealing unique and often overlooked aspects of the aesthetics of the methods of field archaeology. Using drone technology and high-end digital imaging platforms, Conroy’s research explores new ways of seeing and perspectives enabled by emerging technologies and software. This research was the subject of the major exhibition Sightseeing at the Goulburn Regional Art Gallery (Jul-Sep 2019).Conroy's work focuses on the use of large format photography to document ancient and modern, rural and urban architecture and detritus as a means to reflect upon the archaeology of the present. He combines the use of traditional large format view cameras with the latest digital technology to produce photographic prints of great detail and clarity. Conroy has combined his interest in archaeology and the visual arts through archaeological illustration and photography, which has been made possible through twenty years of involvement on excavations in Greece and Cyprus, and research journeys in Lebanon, Syria and Turkey. The major focus of Conroy's practice continues to be the melding between the disciplines of art and archaeology and is clearly reflected in his role as Associate Director, Artistic Interpretation at the Paphos Theatre Archaeological Excavations in Cyprus.Theoretical and critical enquiry key areas of interestThe drone in artistic practiceContemporary photographic practicePhotographic archives, museum archives Landscape studies, photography, and the environment Rephotography: Landscape and site photographyArchaeology and the visual arts: Photography as archaeologyArchaeologies of the contemporary past and the archaeology of the presentContemporary ruins, ruin thought, the ruin in photographyThe photobook and artist’s booksMaterials and technology key areas of interestInkjet printing: alternative processes and ink sets, fine art applicationsThe print and the future of still photography: digital and analogue print objects in the age of the retina displayAlternative and hacked printing technologies for artistic outputHigh resolution imagingUnmanned Aerial Vehicles as an area of artistic research3D photogrammetry in the visual arts, heritage, museums and archaeology"], "biography": "Rowan Conroy holds a PhD (2012) and a BVA (Hons I) (2004) from Sydney College of the Arts, the University of Sydney. Conroy's PhD was awarded for his thesis Archaeologies of the Present: Rephotographing the William John Woodhouse Photographic Archive. His doctoral research was the subject of a major exhibition at the Australian Centre for Photography, The Woodhouse Rephotography Project (Aug-Nov 2013).", "project": ["Associate Director, Artistic Interpretation, Paphos Theatre Archaeological Excavations in Cyprus, 2019-present", "Chief Investigator of the Digital Imaging Research Facility, ANU School of Art & Design, 2018-present", "Chief Investigator of the Inkjet Research Facility, ANU School of Art & Design, 2015-present", "Archaeologies of the Present and the Poetics of Detritus, 2008-present", "Weereewa / Bad Water, 2013-2019", "The William J. Woodhouse Rephotography Project, 2009-2013"], "publication": [{"title": "", "year": "2017", "source": "Untitled 5 from the series Weereewa / Bad Water", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2017", "source": "Fencelines #1", "authors": ["Rowan Conroy", "Hunter A"]}, {"title": "Ravens and Winter Lake", "year": "2016", "source": "from the series Weereewa", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2016", "source": "Untitled #1- 3 from the series Weereewa Bad water", "authors": ["Rowan Conroy"]}, {"title": "Driving around bad water", "year": "2016", "source": "pp. 58-63pp", "authors": ["Rowan Conroy"]}, {"title": "Weereewa/Bad Water: Photographic Investigations Into the Palimpsest of Lake George", "year": "2016", "source": "Fusion Journal, no. 10, pp. 67-106pp", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2016", "source": "We who love: the Nolan slates UQ Art Museum (2016)", "authors": ["Rowan Conroy", "McAuliffe C"]}, {"title": "", "year": "2015", "source": "Lin Richardson Square Photos", "authors": ["Rowan Conroy"]}, {"title": "Photographic Materiality in the Age of the Inkjet Print", "year": "2015", "source": "IMPACT 9 International Printmaking Conference 2015, China Academy of Art Press, China, pp. 369-374", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2015", "source": "IMPACT 9 International Printmaking Conference", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2015", "source": "China Pingyao International Photography Festival", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2014", "source": "Untitled # 1 - 16 from the series Natura Naturans", "authors": ["Rowan Conroy"]}, {"title": "The Look down Bungonia After Fan Kuan", "year": "2014", "source": "parts I and II", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2014", "source": "Alice Springs Art Foundation 38th Alice Prize 2014", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2014", "source": "Corpus Vasorum Antiquorum", "authors": ["Rowan Conroy", "Cambitoglou A", "Turner M"]}, {"title": "Natura Naturans", "year": "2014", "source": "", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2013", "source": "The Woodhouse Rephotography Project", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2012", "source": "Josephine Ulrick and Win Schubert Photography Award 2012", "authors": ["Rowan Conroy"]}, {"title": "View of central Athens looking north east from the Acropolis. 5:46 pm 5 June 2010", "year": "2012", "source": "From the William Woodhouse Rephotography Project. 2011", "authors": ["Rowan Conroy"]}, {"title": "Untitled 3", "year": "2012", "source": "Untitled 5Untitled 8 from the Series Athina", "authors": ["Rowan Conroy"]}, {"title": "", "year": "2012", "source": "50 objects 50 Stories: Extraordinary Curiosities from the Nicholson Museum University of Sydney", "authors": ["Rowan Conroy"]}, {"title": "Untitled #1", "year": "2011", "source": "Agora Series 2010 (Statue of Aphrodite from the Stoa of AttalosAthens)", "authors": ["Rowan Conroy"]}]}, "Microsoft-Academic": [{"title": "memory hurts wherever you touch it", "year": 2018, "source": "", "authors": [{"name": "rowan conroy"}]}, {"title": "rowan conroy sightseeing", "year": 2019, "source": "", "authors": [{"name": "rowan conroy"}, {"name": "kate warren"}, {"name": "christopher sainsbury"}]}, {"title": "driving around bad water", "year": 2016, "source": "", "authors": [{"name": "rowan conroy"}]}, {"title": "encountering plant matter through photographic print practices", "year": 2018, "source": "", "authors": [{"name": "rowan conroy"}]}, {"title": "weereewa bad water photographic investigations into the palimpsest of lake george", "year": 2016, "source": "", "authors": [{"name": "rowan conroy"}]}], "ANDS-Grants": []}