{"ANU": {"name": "Salman Durrani", "link": "https://researchers.anu.edu.au/researchers/durrani-s", "colleges": "College of Engineering & Computer Science", "email": "salman.durrani@anu.edu.au", "phone": "+61 2 6125 6573", "expertise": ["Wireless Communications", "Signal Processing", "Communications Technologies"], "interest": ["Wireless power transfer and energy harvestingWireless  sensor, device to device and machine to machine networks Drone (UAV) communicationsSynchronization and channel estimationStochastic geometryDistance distributions and connectivity"], "biography": "Dr. Durrani has co-authored more than 140 publications to date in refereed international journals and conferences. He was a recipient of the 2016 IEEE ComSoc Asia Pacific Outstanding Paper Award. He was the Chair of the ACT Chapter of the IEEE Signal Processing and Communications Societies from 2015 to 2016. He currently serves as an Editor of the IEEE TRANSACTIONS ON COMMUNICATIONS. He was awarded the 2018 ANU VC Award for Excellence in Supervision and the 2012 ANU VC Award for Excellence in Education. He is a Member of Engineers Australia, a Senior Fellow of IEEE, USA and a Senior Fellow of The Higher Education Academy, UK.", "project": [], "publication": [{"title": "Lifetime Maximization Scheme for a Sensor Based MTC Device", "year": "2019", "source": "2018 IEEE Global Communications Conference, GLOBECOM 2018, IEEE, Piscataway, United States, pp. 7pp", "authors": ["Alvi S", "Zhou X", "Salman Durrani"]}, {"title": "Next generation backscatter communication: systems, techniques, and applications", "year": "2019", "source": "EURASIP Journal on Wireless Communications and Networking, vol. 69, no. -", "authors": ["Liu W", "Huang K", "Zhou X", "Salman Durrani"]}, {"title": "Energy Efficiency Maximization for Downlink Cloud Radio Access Networks with Data Sharing and Data Compression", "year": "2018", "source": "IEEE Transactions on Wireless Communications, vol. 17, no. 8, pp. 4955-4970pp", "authors": ["Vu T", "Ngo D", "Dao M", "Salman Durrani"]}, {"title": "Enhancing CRDSA with Transmit Power Diversity for Machine-Type Communication", "year": "2018", "source": "IEEE Transactions on Vehicular Technology, vol. 47, no. 8, pp. 7790-7794", "authors": ["Alvi S", "Salman Durrani", "Zhou X"]}, {"title": "Wireless Power Transfer via mmWave Power Beacons with Directional Beamforming", "year": "2018", "source": "IEEE Wireless Communications Letters, vol. 8, no. 1, pp. 17-20", "authors": ["Guo J", "Zhou X", "Salman Durrani"]}, {"title": "Uplink Coverage Performance of an Underlay Drone Cell for Temporary Events", "year": "2018", "source": "2018 IEEE International Conference on Communications Workshops, ICC Workshops 2018, IEEE, United States, pp. 1-6", "authors": ["Zhou X", "Guo J", "Salman Durrani"]}, {"title": "Spectral and Energy Efficiency Maximization for Content-Centric C-RANs with Edge Caching", "year": "2018", "source": "IEEE Transactions on Communications, vol. 66, no. 12, pp. 6628-6642", "authors": ["Vu T", "Ngo D", "Dao M", "Salman Durrani"]}, {"title": "Design of Non-orthogonal Multiple Access Enhanced Backscatter Communication", "year": "2018", "source": "IEEE Transactions on Wireless Communications, vol. 17, no. 10, pp. 6837-6852", "authors": ["Guo J", "Zhou X", "Salman Durrani"]}, {"title": "Energy-Efficient Design for Downlink Cloud Radio Access Networks", "year": "2018", "source": "2018 IEEE International Conference on Communications Workshops, ICC Workshops 2018, IEEE, United States, pp. 1-6", "authors": ["Vu T", "Ngo D", "Dao M", "Salman Durrani"]}, {"title": "Optimal Compression and Transmission Rate Control for Node-Lifetime Maximization", "year": "2018", "source": "IEEE Transactions on Wireless Communications, vol. 17, no. 11, pp. 7774-7788", "authors": ["Alvi S", "Zhou X", "Salman Durrani"]}, {"title": "Backscatter Communications with NOMA (Invited Paper)", "year": "2018", "source": "15th International Symposium on Wireless Communication Systems, ISWCS 2018, IEEE, United States, pp. 5pp", "authors": ["Guo J", "Zhou X", "Salman Durrani"]}, {"title": "Proposed Network Balance Index for Heterogeneous Networks", "year": "2017", "source": "IEEE Wireless Communications Letters, vol. 6, no. 1, pp. 98-101pp", "authors": ["Huang Y", "Salman Durrani", "Dmochowski P"]}, {"title": "Device-to-device communication underlaying a finite cellular network region", "year": "2017", "source": "IEEE Transactions on Wireless Communications, vol. 16, no. 1, pp. 332-347", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Characterization of Aggregate Received Power from Power Beacons in Millimeter Wave Ad Hoc Networks", "year": "2017", "source": "IEEE International Conference on Communications, ICC 2017, ed. M Debbah, D Gesbert & A Mellouk, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, pp. 7pp", "authors": ["Zhou X", "Salman Durrani", "Guo J"]}, {"title": "Improving the spatial dimensionality of Gauss-Legendre and equiangular sampling schemes on the sphere", "year": "2017", "source": "2017 IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2017, IEEE Xplore, TBC, pp. 4531-4535", "authors": ["Khalid Z", "Kennedy R", "Salman Durrani"]}, {"title": "Full-Duplex Backscatter Interference Networks Based on Time-Hopping Spread Spectrum", "year": "2017", "source": "IEEE Transactions on Wireless Communications, vol. 16, no. 7, pp. 4361-4377", "authors": ["Liu W", "Huang K", "Zhou X", "Salman Durrani"]}, {"title": "Massive Machine Type Communication with Data Aggregation and Resource Scheduling", "year": "2017", "source": "IEEE Transactions on Communications, vol. 65, no. 9, pp. 4012-4026pp", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Novel Receiver Design with Joint Coherent and Non-Coherent Processing", "year": "2017", "source": "IEEE Transactions on Communications, vol. 65, no. 8, pp. 3479-3493", "authors": ["Liu W", "Zhou X", "Salman Durrani"]}, {"title": "Power Beacon-Assisted Millimeter Wave Ad Hoc Networks", "year": "2017", "source": "IEEE Transactions on Communications, vol. 66, no. 2, p. 15", "authors": ["Zhou X", "Guo J", "Salman Durrani"]}, {"title": "Base Station Preference Association with Network Dynamics", "year": "2017", "source": "85th IEEE Vehicular Technology Conference, VTC Spring 2017, IEEE, United States, pp. 5pp", "authors": ["Huang Y", "Salman Durrani", "Zhou X"]}, {"title": "nalytical framework for access class barring in machine type communication", "year": "2017", "source": "28th Annual IEEE International Symposium on Personal, Indoor and Mobile Radio Communications, PIMRC 2017, IEEE, USA, pp. 1-6", "authors": ["Lee J", "Guo J", "Salman Durrani"]}, {"title": "Underlay D2D communication in a finite cellular network with exclusion zone", "year": "2017", "source": "86th IEEE Vehicular Technology Conference, VTC Fall 2017, IEEE, TBC, pp. 1-7", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Joint Optimization of User Association, Data Delivery Rate and Precoding for Cache-Enabled F-RANs", "year": "2017", "source": "2017 IEEE Global Communications Conference, GLOBECOM 2017, IEEE, United States, pp. 1-6", "authors": ["Vu T", "Ngo D", "Ong L", "Salman Durrani"]}, {"title": "Machine-Type Communication with Random Access and Data Aggregation: A Stochastic Geometry Approach", "year": "2017", "source": "2017 IEEE Global Communications Conference, GLOBECOM 2017, IEEE, United States, pp. 1-7", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Time-hopping multiple-access for backscatter interference networks", "year": "2017", "source": "2017 IEEE Global Communications Conference, GLOBECOM 2017, IEEE, United States, pp. 1-7", "authors": ["Liu W", "Huang K", "Zhou X", "Salman Durrani"]}, {"title": "Secure Communication with a Wireless-Powered Friendly Jammer", "year": "2016", "source": "IEEE Transactions on Wireless Communications, vol. 15, no. 1, pp. 401-415", "authors": ["Zhou X", "Salman Durrani", "Liu W"]}, {"title": "Energy Harvesting Wireless Sensor Networks: Delay Analysis Considering Energy Costs of Sensing and Transmission", "year": "2016", "source": "IEEE Transactions on Wireless Communications, vol. 15, no. 7, pp. 4635-4650", "authors": ["Liu W", "Zhou X", "Salman Durrani"]}, {"title": "Timing and carrier synchronization in wireless communication systems: a survey and classification of research in the last 5 years", "year": "2016", "source": "EURASIP Journal on Wireless Communications and Networking, vol. 2016, no. 1, pp. 1-38", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "SWIPT with practical modulation and RF energy harvesting sensitivity", "year": "2016", "source": "2016 IEEE International Conference on Communications, ICC 2016, IEEE, TBC, pp. -", "authors": ["Liu W", "Zhou X", "Salman Durrani"]}, {"title": "Path-Following Algorithms for Beamforming and Signal Splitting in RF Energy Harvesting Networks", "year": "2016", "source": "IEEE Communications Letters, vol. 20, no. 8, pp. 1687-1690", "authors": ["Nasir A", "Tuan H", "Ngo D", "Salman Durrani"]}, {"title": "Mode Selection, Resource Allocation, and Power Control for D2D-Enabled Two-Tier Cellular Network", "year": "2016", "source": "IEEE Transactions on Communications, vol. 64, no. 8, pp. 3534-3547", "authors": ["Huang Y", "Nasir A", "Salman Durrani"]}, {"title": "Path-Following Algorithms for Beamforming and Signal Splitting in RF Energy Harvesting Networks", "year": "2016", "source": "IEEE Communications Letters, vol. 20, no. 8, pp. 1687-1690", "authors": ["Nasir A", "Tuan H", "Ngo D", "Salman Durrani"]}, {"title": "Mode Selection, Resource Allocation, and Power Control for D2D-Enabled Two-Tier Cellular Network", "year": "2016", "source": "IEEE Transactions on Communications, vol. 64, no. 8, pp. 3534-3547", "authors": ["Huang Y", "Nasir A", "Salman Durrani"]}, {"title": "Secure beamforming for max-min SINR in multi-cell SWIPT systems", "year": "2016", "source": "Wireless Communications and Networking Conference Workshops, WCNCW 2016, ed. Ridha Hamila, IEEE, TBC, pp. 404-409", "authors": ["Nasir A", "Ngo D", "Tuan H", "Salman Durrani"]}, {"title": "Non-coherent FSK: An attractive modulation set for millimeter-wave communications", "year": "2016", "source": "Wireless Communications and Networking Conference Workshops, WCNCW 2016, ed. Ridha Hamila, IEEE, TBC, pp. 1-7pp", "authors": ["Nasir A", "Mehrpouyan H", "Matolak D", "Salman Durrani"]}, {"title": "Secure beamforming for max-min SINR in multi-cell SWIPT systems", "year": "2016", "source": "Wireless Communications and Networking Conference Workshops, WCNCW 2016, ed. Ridha Hamila, IEEE, TBC, pp. 404-409", "authors": ["Nasir A", "Ngo D", "Tuan H", "Salman Durrani"]}, {"title": "SER Analysis of Multi-Way Relay Networks with M-QAM Modulation in the Presence of Imperfect Channel Estimation", "year": "2016", "source": "Journal of Communications and Networks, vol. 18, no. 5, pp. 677-687", "authors": ["Islam S", "Salman Durrani", "Sadeghi P"]}, {"title": "Effects of load dependent dynamic biasing and association order for cell range expansion", "year": "2016", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS), ed. Tadeusz A Wysocki & Beata J Wysocki, IEEE, Australia, pp. 1-5pp", "authors": ["Huang Y", "Bell L", "Salman Durrani"]}, {"title": "Outage analysis of underlaid multi-antenna D2D communication in cellular networks", "year": "2016", "source": "10th International Conference on Signal Processing and Communication Systems ICSPCS 2016, IEEE, USA, p. 7", "authors": ["Senadhira N", "Guo J", "Salman Durrani"]}, {"title": "Multi-pair two-way relay networks: Interference management using lattice codes and amplify and compute relaying", "year": "2016", "source": "Australian Communications Theory Workshop, AusCTW 2016, IEEE, Melbourne, pp. 1-6", "authors": ["Islam S", "Salman Durrani", "Sadeghi P"]}, {"title": "Graphical generalization of power control in multiuser interference channels", "year": "2016", "source": "Australian Communications Theory Workshop, AusCTW 2016, IEEE, Melbourne, pp. 136-140", "authors": ["Huang Y", "Nasir A", "Salman Durrani"]}, {"title": "Joint Resource Optimization for Multicell Networks with Wireless Energy Harvesting Relays", "year": "2016", "source": "IEEE Transactions on Vehicular Technology, vol. 65, no. 8, pp. 6168-6183", "authors": ["Nasir A", "Ngo D", "Zhou X", "Salman Durrani"]}, {"title": "Gauss-Legendre Sampling on the Rotation Group", "year": "2016", "source": "IEEE Signal Processing Letters, vol. 23, no. 2, pp. 207-211", "authors": ["Khalid Z", "Salman Durrani", "Kennedy R"]}, {"title": "Interference Suppression Using Generalized Inverse Precoder for Downlink Heterogeneous Networks", "year": "2015", "source": "IEEE Wireless Communications Letters, vol. 4, no. 3, pp. 325-328", "authors": ["Huang Y", "Salman Durrani", "Zhou X"]}, {"title": "novel user pairing scheme for functional decode-and-forward multi-way relay network", "year": "2015", "source": "Physical Communication, vol. 17, pp. 128-148", "authors": ["Islam S", "Salman Durrani", "Sadeghi P"]}, {"title": "Performance Analysis of Arbitrarily-Shaped Underlay Cognitive Networks: Effects of Secondary User Activity Protocols", "year": "2015", "source": "IEEE Transactions on Communications, vol. 63, no. 2, pp. 376-389", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Wireless-powered relays in cooperative communications: Time-switching relaying protocols and throughput analysis", "year": "2015", "source": "IEEE Transactions on Communications, vol. 63, no. 5, pp. 1607-1622", "authors": ["Nasir A", "Zhou X", "Salman Durrani"]}, {"title": "DC programming for power minimization in a multicell network with RF-powered relays", "year": "2015", "source": "International Conference on Telecommunications, ICT 2015, IEEE, Online, pp. 174-179", "authors": ["Nasir A", "Ngo D", "Salman Durrani"]}, {"title": "Call completion probability in heterogeneous networks with energy harvesting base stations", "year": "2015", "source": "International Conference on Telecommunications, ICT 2015, IEEE, Online, pp. 191-197", "authors": ["Wang C", "Salman Durrani", "Guo J"]}, {"title": "Interference Nulling for Offloaded Heterogeneous Users Using Macro Generalized Inverse Precoder", "year": "2015", "source": "International Symposium on Communications and Information Technologies, ISCIT 2015, IEEE, Online, pp. 53-56", "authors": ["Huang Y", "Salman Durrani", "Zhou X"]}, {"title": "Computing Exact Closed-Form Distance Distributions in Arbitrarily-Shaped Polygons with Arbitrary Reference Point", "year": "2015", "source": "The Mathematica Journal, vol. 17, pp. (27pp)", "authors": ["Pure R", "Salman Durrani"]}, {"title": "Iterative Optimization for Max-Min SINR in Dense Small-Cell Multiuser MISO SWIPT System", "year": "2015", "source": "Global Conference on Signal and Information Processing (GlobalSIP 2015), IEEE, USA, pp. 1392-1396", "authors": ["Nasir A", "Ngo D", "Tuan H", "Salman Durrani"]}, {"title": "Wireless-Powered Friendly Jammer for Physical Layer Security", "year": "2015", "source": "International Conference on Wireless Communications & Signal Processing WCSP 2015, IEEE, Nanjing, pp. 1-5", "authors": ["Liu W", "Zhou X", "Salman Durrani"]}, {"title": "Performance of Wireless-Powered Sensor Transmission Considering Energy Cost of Sensing", "year": "2015", "source": "2015 IEEE Global Communications Conference, GLOBECOM 2015, IEEE, Online, pp. 1-7", "authors": ["Liu W", "Zhou X", "Salman Durrani"]}, {"title": "Block-wise time-switching energy harvesting protocol for wireless-powered AF relays", "year": "2015", "source": "IEEE International Conference on Communications, ICC 2015, IEEE, Online, pp. 80-85", "authors": ["Nasir A", "Zhou X", "Salman Durrani"]}, {"title": "Outage Probability of Ad Hoc Networks with Wireless Information and Power Transfer", "year": "2015", "source": "IEEE Wireless Communications Letters, vol. 4, no. 4, pp. 409-412", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Performance comparison of device-to-device mode selection schemes", "year": "2015", "source": "IEEE Annual International Symposium on Personal, Indoor, and Mobile Radio Communications, PIMRC 2015, IEEE, TBC, pp. 1536-1541", "authors": ["Marshall D", "Salman Durrani", "Guo J"]}, {"title": "Sum throughput maximization for heterogeneous multicell networks with RF-powered relays", "year": "2015", "source": "IEEE International Conference on Communications, ICC 2015, IEEE, Online, pp. 2196-2202", "authors": ["Nasir A", "Ngo D", "Zhou X", "Salman Durrani"]}, {"title": "Performance of Maximum Ratio Transmission in Ad Hoc Networks with SWIPT", "year": "2015", "source": "IEEE Wireless Communications Letters, vol. 4, no. 5, pp. 529-532", "authors": ["Zhou X", "Guo J", "Salman Durrani"]}, {"title": "Multi-group multi-way relaying with multi-stage non-regenerative relay stations", "year": "2015", "source": "2015 22nd International Conference on Telecommunications, ICT 2015, IEEE, Sydney, pp. 43-47", "authors": ["Islam S", "Salman Durrani"]}, {"title": "daptive multi-resolution windowing technique for localized spatio-spectral analysis", "year": "2014", "source": "2014 IEEE Workshop on Statistical Signal Processing, SSP 2014, Conference Organising Committee, Gold Coast Australia, pp. 41-44", "authors": ["Khalid Z", "Kennedy R", "Salman Durrani"]}, {"title": "novel pairing scheme to reduce error propagation in an amplify and forward multi-way relay network", "year": "2014", "source": "2014 IEEE Workshop on Statistical Signal Processing, SSP 2014, Conference Organising Committee, Gold Coast Australia, pp. 496-499", "authors": ["Islam S", "Sadeghi P", "Salman Durrani"]}, {"title": "On the choice of window for spatial smoothing of spherical data", "year": "2014", "source": "2014 IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2014, Institute of Electrical and Electronics Engineers Inc., Florence Italy, pp. 2644-2648", "authors": ["Khalid Z", "Kennedy R", "Salman Durrani"]}, {"title": "Throughput and ergodic capacity of wireless energy harvesting based DF relaying network", "year": "2014", "source": "IEEE International Conference on Communications, ICC 2014, IEEE Computer Society, Sydney Australia, pp. 4066-4071", "authors": ["Nasir A", "Zhou X", "Salman Durrani"]}, {"title": "Channel, Phase Noise, and Frequency Offset in OFDM Systems: Joint Estimation, Data Detection, and Hybrid Cramer-Rao Lower Bound", "year": "2014", "source": "IEEE Transactions on Communications, vol. 62, no. 9, pp. 3311-3325", "authors": ["Salim O", "Nasir A", "Mehrpouyan H", "Salman Durrani"]}, {"title": "Training-Based Synchronization and Channel Estimation in AF Two-Way Relaying Networks", "year": "2014", "source": "International Workshop on Signal Processing Advances in Wireless Communications SPAWC 2014, IEEE, USA, pp. 269-273", "authors": ["Nasir A", "Mehrpouyan H", "Salman Durrani"]}, {"title": "Dynamic Fractional Frequency Reuse Method for Self-Organizing Smallcell Network", "year": "2014", "source": "80th IEEE Vehicular Technology Conference, VTC 2014, IEEE, Online, pp. 1-5", "authors": ["Chae D", "Kim N", "Alem Y", "Salman Durrani"]}, {"title": "Characterization of aggregate interference in arbitrarily-shaped underlay cognitive networks", "year": "2014", "source": "2014 IEEE Global Communications Conference, GLOBECOM 2014, IEEE, Online, pp. 961-966", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "Optimum power allocation for sum rate improvement in AF multi-way relay networks", "year": "2014", "source": "8th International Conference on Signal Processing and Communication Systems, ICSPCS 2014, ed. cki B.J.Wysocki T.A., IEEE, Online, pp. 1-7pp", "authors": ["Islam S", "Salman Durrani", "Sadeghi P"]}, {"title": "Outage probability in arbitrarily-shaped finite wireless networks", "year": "2014", "source": "IEEE Transactions on Communications, vol. 62, no. 2, pp. 699-712", "authors": ["Guo J", "Salman Durrani", "Zhou X"]}, {"title": "tractable framework for exact probability of node isolation and minimum node degree distribution in finite multihop networks", "year": "2014", "source": "IEEE Transactions on Vehicular Technology, vol. 63, no. 6, pp. 2836-2847", "authors": ["Khalid Z", "Salman Durrani", "Guo J"]}, {"title": "Relaying protocols for wireless energy harvesting and information processing", "year": "2013", "source": "IEEE Transactions on Wireless Communications, vol. 12, no. 7, pp. 3622-3636", "authors": ["Nasir A", "Zhou X", "Salman Durrani"]}, {"title": "Distance distributions in regular polygons", "year": "2013", "source": "IEEE Transactions on Vehicular Technology, vol. 62, no. 5, pp. 2363-2368", "authors": ["Khalid Z", "Salman Durrani"]}, {"title": "Optimal training sequences for joint timing synchronization and channel estimation in distributed communication networks", "year": "2013", "source": "IEEE Transactions on Communications, vol. 61, no. 7, pp. 3002-3015", "authors": ["Nasir A", "Mehrpouyan H", "Salman Durrani"]}, {"title": "Transceiver design for distributed STBC based AF cooperative networks in the presence of timing and frequency offsets", "year": "2013", "source": "IEEE Transactions on Signal Processing, vol. 61, no. 12, pp. 3143-3158", "authors": ["Nasir A", "Mehrpouyan H", "Salman Durrani"]}, {"title": "Error performance analysis of decode-and-forward and amplify-and-forward multi-way relay networks with binary phase shift keying modulation", "year": "2013", "source": "IET Communications, vol. 7, no. 15, pp. 1605-1616", "authors": ["Islam S", "Sadeghi P", "Salman Durrani"]}, {"title": "Fast directional spatially localized spherical harmonic transform", "year": "2013", "source": "IEEE Transactions on Signal Processing, vol. 61, no. 9, pp. 2192-2203", "authors": ["Khalid Z", "Kennedy R", "Salman Durrani"]}, {"title": "Spatially varying spectral filtering of signals on the unit sphere", "year": "2013", "source": "IEEE Transactions on Signal Processing, vol. 61, no. 3, pp. 530-544", "authors": ["Khalid Z", "Sadeghi P", "Kennedy R", "Salman Durrani"]}, {"title": "Spatio-spectral Analysis on the Sphere Using Spatially Localized Spherical Harmonics Transform", "year": "2012", "source": "IEEE Transactions on Signal Processing, March, 2012", "authors": ["Khalid Z", "Salman Durrani", "Sadeghi P"]}, {"title": "Timing and carrier synchronization with channel estimation in multi-relay cooperative networks", "year": "2012", "source": "IEEE Transactions on Signal Processing, vol. 60, no. 2, pp. 793-811.", "authors": ["Nasir A AMehrpouyan H", "Salman Durrani"]}, {"title": "Particle filters for joint timing and carrier estimation: Improved resampling guidelines and weighted bayesian Cramer-Rao bounds", "year": "2012", "source": "IEEE Transactions on Communications, vol. 60, no. 5, pp. 1407-1419, May 2012", "authors": ["Salman Durrani", "Kennedy R"]}, {"title": "Blind timing and carrier synchronisation in distributed multiple input multiple output communication systems", "year": "2011", "source": "IET Communications, vol. 5, no. 7, pp. 1028-1037", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Two-Way Training: Optimal Power Allocation for Pilot and Data Transmission", "year": "2010", "source": "IEEE Transactions on Wireless Communications, vol. 9, no. 2, pp. 564-569", "authors": ["Zhou X", "Lamahewa T", "Sadeghi P", "Salman Durrani"]}, {"title": "Design Guidelines for Training-Based MIMO Systems With Feedback", "year": "2009", "source": "IEEE Transactions on Signal Processing, vol. 57, no. 10, pp. 4014-4026", "authors": ["Zhou X", "Sadeghi P", "Lamahewa T", "Salman Durrani"]}, {"title": "Smart Antennas for Code Division Multiple Access Systems", "year": "2009", "source": "in Chen Sun, Jun Cheng, Takashi Ohira (ed.), Handbook on Advancements in Smart Antenna Technologies for Wireless Networks, Information Science Reference, Hershey, PA, USA and London, UK, pp. 352 - 373", "authors": ["Salman Durrani", "Bialkowski M"]}, {"title": "Optimizing Antenna Configuration for MIMO Systems with Imperfect Channel Estimation", "year": "2009", "source": "IEEE Transactions on Wireless Communications, vol. 8, no. 3, pp. 1177-1181", "authors": ["Zhou X", "Sadeghi P", "Lamahewa T", "Salman Durrani"]}, {"title": "Connectivity Analysis of Wirelss Ad Hoc Networks with Beamforming", "year": "2009", "source": "IEEE Transactions on Vehicular Technology, vol. 58, no. 9, pp. 5247-5257", "authors": ["Zhou X", "Salman Durrani", "Jones H"]}, {"title": "Effect of mutual coupling on the interference rejection capabilities of linear and circular arrays in CDMA systems", "year": "2004", "source": "IEEE Transactions on Antennas and Propagation, vol. 52, no. 4, pp. 1130-1134", "authors": ["Salman Durrani", "Bialkowski K"]}, {"title": "Interference rejection capabilities of different types of antenna arrays in cellular systems", "year": "2002", "source": "Electronics Letters, vol. 38, no. 13, pp. 617-619", "authors": ["Salman Durrani", "Bialkowski M"]}, {"title": "DSTBC based DF cooperative networks in the presence of timing and frequency offsets", "year": "2013", "source": "2013 IEEE 14th Workshop on Signal Processing Advances in Wireless Communications, SPAWC 2013, IEEE, Darmstadt, pp. 86-90", "authors": ["Nasir A", "Mehrpouyan H", "Salman Durrani"]}, {"title": "Performance study of compressive sampling for ECG signal compression in noisy and varying sparsity acquisition", "year": "2013", "source": "2013 38th IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2013, IEEE, Vancouver, BC, pp. 1306-1309", "authors": ["Chae D", "Alem Y", "Salman Durrani"]}, {"title": "Spatio-spectral formulation and design of spatially-varying filters for signal estimation on the 2-sphere", "year": "2013", "source": "Wavelets and Sparsity XV, SPIE - The International Society for Optical Engineering, San Diego, CA, pp. 1-13", "authors": ["Khalid Z", "Kennedy R", "Sadeghi P", "Salman Durrani"]}, {"title": "Connectivity of three dimensional wireless sensor networks using geometrical probability", "year": "2013", "source": "2013 Australian Communications Theory Workshop, AusCTW 2013, IEEE, Adelaide, SA, pp. 47-51", "authors": ["Khalid Z", "Salman Durrani"]}, {"title": "Conjugate Gradient Algorithm for Extrapolation of Sampled Bandlimited Signals on the 2-Sphere", "year": "2012", "source": "IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2012), IEEE Signal Processing Society, Piscataway USA, pp. 3825-3828", "authors": ["Khalid Z", "Kennedy R", "Salman Durrani"]}, {"title": "Concentration Uncertainty Principles for Signals on the Unit Sphere", "year": "2012", "source": "IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2012), IEEE Signal Processing Society, Piscataway USA, pp. 3717-3720", "authors": ["Khalid Z", "Salman Durrani", "Sadeghi P"]}, {"title": "mbiguity Function and Wigner Distribution on the Sphere", "year": "2012", "source": "IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2012), IEEE Signal Processing Society, Piscataway USA, pp. 3405-3408", "authors": ["Khalid Z", "Salman Durrani", "Sadeghi P"]}, {"title": "Estimation of Synchronization Parameters in AF Cooperative Networks", "year": "2012", "source": "IEEE International Conference on Communications (ICC 2012), IEEE Communications Society, Unknown, pp. 3713-3717", "authors": ["Nasir A", "Mehrpouyan H", "Blostein S", "Salman Durrani"]}, {"title": "n Efficient Energy Curtailment Scheme For Outage Management in Smart Grid", "year": "2012", "source": "IEEE Global Communications Conference (GLOBECOM 2012), IEEE, USA, pp. 3080-3085", "authors": ["Tushar W", "Zhang J", "Smith D", "Salman Durrani"]}, {"title": "Mixture Kalman Filtering for Joint Carrier Recovery and Channel Estimation in Time-selective Rayleigh Fading Channels", "year": "2011", "source": "International Conference on Acoustics, Speech and Signal Processing (ICASSP 2011), IEEE Signal Processing Society, Piscataway USA, pp. 3496-3499", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "On the Construction of Low-pass Filters on the Unit Sphere", "year": "2011", "source": "International Conference on Acoustics, Speech and Signal Processing (ICASSP 2011), IEEE Signal Processing Society, Piscataway USA, pp. 4356-4359", "authors": ["Khalid Z", "Salman Durrani", "Sadeghi P"]}, {"title": "Blind Timing and Carrier Synchronization in Decode and Forward Cooperative Systems", "year": "2011", "source": "IEEE International Conference on Communications (ICC 2011), IEEE Communications Society, Unknown, pp. 1-6", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "chieving Cooperative Diversity with Multiple Frequency Offset Estimation", "year": "2011", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS 2011), IEEE Communications Society, Piscataway USA, pp. 1-5", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Revisiting Slepian concentration problem on the sphere for azimuthally non-symmetric regions", "year": "2011", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS 2011), IEEE Communications Society, Piscataway USA, pp. 1-7", "authors": ["Khalid Z", "Salman Durrani", "Kennedy R"]}, {"title": "Effect of Vehicle Mobility on Connectivity of Vehicular Ad Hoc Networks", "year": "2010", "source": "IEEE Vehicular Technology Conference Fall 2010, ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Piscataway USA, pp. 1-5", "authors": ["Salman Durrani", "Zhou X", "Chandra A"]}, {"title": "Blind Fractionally Spaced Equalization and Timing Synchronization in Wireless Fading Channels", "year": "2010", "source": "International Conference on Future Computer and Communication (ICFCC 2010), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Piscataway USA, pp. 15-19", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Performance of Coarse and Fine Timing Synchronization in OFDM Receivers", "year": "2010", "source": "International Conference on Future Computer and Communication (ICFCC 2010), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Piscataway USA, pp. 412-416", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Modified Constant Modulus Algorithm for Joint blind equalization and synchronization", "year": "2010", "source": "Australian Communications Theory Workshop (AusCTW 2010), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Canberra Australia, pp. 59-64", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Particle Filter for Joint Blind Carrier Frequency Offset Estimation and Data Detection", "year": "2010", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS 2010), ed. Beata J. Wysocki and Tadeusz A. Wysocki, IEEE Communications Society, Piscataway USA, pp. 1-5", "authors": ["Nasir A", "Salman Durrani", "Kennedy R"]}, {"title": "Optimizing Training-based Transmission for Correlated MIMO Systems with Hybrid Feedback", "year": "2009", "source": "IEEE Global Communications Conference, Exhibition & Industry Forum (GLOBECOM 2009), Institute of Electrical and Electronics Engineers (IEEE Inc), USA, pp. 1-6", "authors": ["Zhou X", "Lamahewa T", "Sadeghi P", "Salman Durrani"]}, {"title": "Connectivity of ad hoc Networks: Is Fading Good or Bad?", "year": "2008", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS 2008), Institute of Electrical and Electronics Engineers (IEEE Inc), Gold Coast Australia, p. 5", "authors": ["Zhou X", "Salman Durrani", "Jones H"]}, {"title": "Capacity of MIMO Systems: Impact of Spatial Correlation with Channel Estimation Errors", "year": "2008", "source": "IEEE International Conference on Communication Systems (ICCS 2008), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Singapore, pp. 817 to 822", "authors": ["Zhou X", "Lamahewa T", "Sadeghi P", "Salman Durrani"]}, {"title": "Connectivity of Wireless Ad Hoc Networks with Random Beamforming: An Analytical Approach", "year": "2008", "source": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications PIMRC 2008, ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, p. 5", "authors": ["Salman Durrani", "Zhou X", "Jones H"]}, {"title": "Designing PSAM Schemes: How Optimal are SISO Pilot Parameters for Spatially Correlated SIMO?", "year": "2008", "source": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications PIMRC 2008, ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, p. 6", "authors": ["Zhou X", "Lamahewa T", "Sadeghi P", "Salman Durrani"]}, {"title": "Statistical Properties of a Parametric Channel Model for Multiple Antenna Systems", "year": "2007", "source": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications PIMRC 2007, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, p. 5", "authors": ["Salman Durrani", "Bialkowski M", "Latif S"]}, {"title": "nalytical Study of Connectivity in Wireless Adhoc Networks with Random Beamforming", "year": "2007", "source": "International Conference on Signal Processing and Communication Systems (ICSPCS 2007), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, p. 5", "authors": ["Zhou X", "Salman Durrani", "Jones H"]}, {"title": "Effects of Beamforming on the Connectivity of AdHoc Networks", "year": "2007", "source": "Australian Communications Theory Workshop (AusCTW 2007), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Adelaide Australia, pp. 13-18", "authors": ["Zhou X", "Jones H", "Salman Durrani"]}, {"title": "MIMO Capacity for Spatial Channel Model Scenarios", "year": "2007", "source": "Australian Communications Theory Workshop (AusCTW 2007), ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), Adelaide Australia, pp. 25-29", "authors": ["Pan S", "Salman Durrani", "Bialkowski M"]}, {"title": "Parametric Channel Model for Smart Antennas Incorporating Mobile Station Mobility", "year": "2006", "source": "2006 IEEE 63rd Vehicular Technology Conference, VTC 2006-Spring, ed. Conference Program Committee, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, pp. 1-5", "authors": ["Salman Durrani", "Bialkowski M"]}, {"title": "nalysis of the error performance of adaptive array antennas for CDMA with noncoherent M-ary orthogonal modulation in nakagami fading", "year": "2005", "source": "IEEE Communications Letters, vol. 9, no. 2, pp. 148-150", "authors": ["Salman Durrani", "Bialkowski M"]}, {"title": "simple model for performance evaluation of a smart antenna in a CDMA system", "year": "2004", "source": "International Symposium on Spread Spectrum Techniques and Applications (ISSSTA 2004), ed. Ian Oppermann, Predrag Rapajic, Institute of Electrical and Electronics Engineers (IEEE Inc), USA, pp. 379-383", "authors": ["Salman Durrani", "Bialkowski M"]}]}, "Microsoft-Academic": [{"title": "relaying protocols for wireless energy harvesting and information processing", "year": 2012, "source": "arxiv information theory", "authors": [{"name": "ali a nasir", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "rodney a kennedy", "affiliation": "australian national university"}], "id": 2595047959}, {"title": "relaying protocols for wireless energy harvesting and information processing", "year": 2013, "source": "ieee transactions on wireless communications", "authors": [{"name": "ali a nasir", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "rodney a kennedy", "affiliation": "australian national university"}], "id": 63459445}, {"title": "throughput and ergodic capacity of wireless energy harvesting based df relaying network", "year": 2014, "source": "", "authors": [{"name": "ali a nasir", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "rodney a kennedy", "affiliation": "australian national university"}]}, {"title": "wireless powered relays in cooperative communications time switching relaying protocols and throughput analysis", "year": 2015, "source": "ieee transactions on communications", "authors": [{"name": "ali a nasir", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "rodney a kennedy", "affiliation": "australian national university"}], "id": 196647941}, {"title": "secure communication with a wireless powered friendly jammer", "year": 2016, "source": "ieee transactions on wireless communications", "authors": [{"name": "wanchun liu", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "petar popovski", "affiliation": "aalborg university"}], "id": 63459445}, {"title": "secure communication with a wireless powered friendly jammer", "year": 2014, "source": "arxiv information theory", "authors": [{"name": "wanchun liu", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "petar popovski", "affiliation": "aalborg university"}], "id": 2595047959}, {"title": "mode selection resource allocation and power control for d2d enabled two tier cellular network", "year": 2016, "source": "ieee transactions on communications", "authors": [{"name": "yifei huang", "affiliation": "australian national university"}, {"name": "ali a nasir", "affiliation": "university of the sciences"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}], "id": 196647941}, {"title": "massive machine type communication with data aggregation and resource scheduling", "year": 2017, "source": "ieee transactions on communications", "authors": [{"name": "jing guo", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "halim yanikomeroglu", "affiliation": "carleton university"}], "id": 196647941}, {"title": "massive machine type communication with data aggregation and resource scheduling", "year": 2016, "source": "arxiv information theory", "authors": [{"name": "jing guo", "affiliation": "australian national university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "xiangyun zhou", "affiliation": "australian national university"}, {"name": "halim yanikomeroglu", "affiliation": "carleton university"}], "id": 2595047959}, {"title": "timing and carrier synchronization with channel estimation in multi relay cooperative networks", "year": 2012, "source": "ieee transactions on signal processing", "authors": [{"name": "ali a nasir", "affiliation": "australian national university"}, {"name": "hani mehrpouyan", "affiliation": "chalmers university of technology"}, {"name": "steven d blostein", "affiliation": "queen s university"}, {"name": "salman durrani", "affiliation": "australian national university"}, {"name": "rodney a kennedy", "affiliation": "australian national university"}], "id": 168680287}], "ANDS-Grants": [{"description": "Spherical information underpins many natural phenomena, ranging from the distribution of galaxies in the Universe to the connectivity and neuronal activation in the human brain. Current major investments in scientific and medical instrumentation do not efficiently collect and process the massive amounts of data because they do not properly utilize its inherent spherical geometry. Through harnessing spherical geometry, this project will address the above shortcomings and will provide advances across all these application domains. By collecting and processing data more efficiently, with greater fidelity, and by revealing features currently hidden, the methods developed will see the full benefit from the instrumentation capturing this data.", "title": "Discovery Projects - Grant ID: DP150101011", "id": "617763", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP150101011", "researchers": ["Prof Rodney Kennedy", "Dr Salman Durrani", "Dr Jason McEwen"], "status": "closed", "fundingAmount": 424300, "fundingScheme": "Discovery Projects", "startDate": 2015, "endDate": 2017, "dateTimeModified": "2017-07-05T03:01:57Z", "dateTimeCreated": "1970-01-01T00:00:00Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP150101011", "identifiers": ["http://purl.org/au-research/grants/arc/DP150101011", "DP150101011"], "subjects": ["ELECTRICAL AND ELECTRONIC ENGINEERING", "ENGINEERING", "FAST ALGORITHMS; SIGNAL PROCESSING; TRANSFORM METHODS"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/617763"}]}, {"description": "Wireless networks are undergoing an exciting paradigm shift from carefully planned cellular networks to heterogeneous networks (coexistence of a multitude of base stations of different types), where users may also be equipped with wireless energy harvesting capability. A fundamental requirement of these next generation technologies is the need to achieve synchronisation among the different base stations and mobile users. This project will develop the fundamental theory and advanced synchronisation techniques for future wireless networks. The expected outcomes will enable wireless networks to meet the increasing demand for higher data rates and extend the battery life of mobile users, benefitting the consumers and the Australian economy.", "title": "Discovery Projects - Grant ID: DP140101133", "id": "517958", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP140101133", "researchers": ["Dr Salman Durrani", "Dr Xiangyun Zhou", "Dr Hani Mehrpouyan", "Prof Steven Blostein"], "status": "closed", "fundingAmount": 365000, "fundingScheme": "Discovery Projects", "startDate": 2014, "endDate": 2016, "dateTimeModified": "2016-05-29T08:49:35Z", "dateTimeCreated": "2015-04-12T05:07:09Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP140101133", "identifiers": ["http://purl.org/au-research/grants/arc/DP140101133", "DP140101133"], "subjects": ["ELECTRICAL AND ELECTRONIC ENGINEERING", "ENGINEERING", "signal processing for communications", "synchronization", "wireless communications"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517958"}]}, {"description": "This project aims to develop spectrum sharing and power transfer techniques for machine-to-machine communications in future wireless networks. Current wireless networks have high data rate as a priority but cannot deliver ultra-reliable and extended battery life operation for many low data rate machine-type devices. Through proper design of wireless and autonomous machine-to-machine communications, this project expects to improve quality of life and implement ultra-reliable, intelligent and long lasting machine-type monitoring devices for health, agriculture, mining, wildlife and critical national infrastructure.", "title": "Discovery Projects - Grant ID: DP170100939", "id": "943318", "key": "http://purl.org/au-research/grants/arc/DP170100939", "researchers": ["Dr Salman Durrani", "Dr Xiangyun Zhou", "Dr Duy Ngo", "Prof Halim Yanikomeroglu"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 352000, "fundingScheme": "Discovery Projects", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:36Z", "dateTimeCreated": "2017-07-04T23:45:00Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP170100939", "identifiers": ["http://purl.org/au-research/grants/arc/DP170100939", "DP170100939"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/943318"}]}]}