{"ANU": {"name": "Samantha Bennett", "link": "https://researchers.anu.edu.au/researchers/bennett-sk", "colleges": "College of Arts and Social Sciences", "email": "samantha.bennett@anu.edu.au", "phone": "+61 2 6125 5761", "expertise": [], "interest": ["https://anu-au.academia.edu/SamanthaBennetthttps://orcid.org/0000-0003-2729-4734Books(2018) Modern Records, Maverick Methods: Technology and Process in Popular Music Record Production 1978-2000. New York: Bloomsbury Academic. ISBN: 9781501344091(2018) Peepshow (33 1/3 series edition on the album by Siouxsie and the Banshees) New York: Bloomsbury Academic. ISBN: 9781501321863(2018) Critical Approaches to the Production of Music and Sound. Eds. Bennett, S and Bates, E. New York: Bloomsbury Academic. ISBN: 9781501332050(2018) Popular Music, Stars and Stardom. Eds. Loy, S., Rickwood, J. and Bennett, S. Canberra: ANU Press ISBN: 9781760462123Edited Edition(2016) Perspectives on Popular Music and Sound Recording. Eds. Klein, E. and Bennett, S. iaspm@journal. Vol.i 6, No. 2. ISSN: 2079-3871Published Articles & Book Chapters(2019) 'On the Aesthetics of Punk Recording and Production' In: Eds. Arnold, G. and Mackay, G. The Oxford Handbook of Punk Rock. Oxford: Oxford University Press.(2019) 'Rock Music Engineering and Production.' In: Eds. Moore, A. F. and Carr, P. The Bloomsbury Handbook of Rock Music Research. New York: Bloomsbury Academic.(2018) 'Popular Music, Stars and Stardom: Definitions, Discourses, Interpretations.' [Co-authored with Stephen Loy and Julie Rickwood] In: Popular Music, Stars and Stardom. Eds. Loy, S., Rickwood, J. and Bennett, S. Canberra: ANU Press ISBN: 9781760462123(2017) 'Intermixtuality: Case Studies in Online  Music [Re]Production.' In: Eds. Bennett, S. and Bates, E. Critical  Approaches to the Production of Music and Sound. New York: Bloomsbury  Academic ISBN: HB: 9781501332050(2017) 'The Production of Music and Sound: A  Multidisciplinary Critique.' [Co-authored with Eliot Bates] In: Eds. Bennett, S. and Bates, E. Critical  Approaches to the Production of Music and Sound. New York: Bloomsbury  Academic ISBN: HB: 9781501332050(2017) Songs About Fucking: John Loder's Southern Studios and the Construction of a Subversive Sonic Signature. In: Journal of Popular Music Studies. Vol. 29, Iss. 2. Wiley Periodicals Inc. DOI: 10.1111/jpms.12209(2016) Time-based Signal Processing and Shape in  Alternative Rock Recordings. In: iaspm@journal [online] Vol. 6, Iss. 2  ISSN: 2079-3871(2016) Behind the Magical Mystery Door: History, Mythology and the Aura of Abbey Road Studios. In: Popular Music. Vol. 35, Iss. 3. Cambridge: Cambridge University Press. ISSN: 0261-1430 (2015) Never Mind the Bollocks... A Tech-Processual Analysis. In: Popular Music and Society - Special Edition on the Sex Pistols. Vol. 38, Iss. 5. London: Routledge/ Taylor & Francis. ISSN: 0300-7766(2015) 'Gus Dudgeon's Super Sonic Signature' In: (2015) Eds. Johnson, H. and Chapman, I Global Glam and Popular Music: Style and Spectacle from the 1970s to the 2000s. London & New York: Routledge Studies in Popular Music. ISBN: 978-1-13-882176-7 (2015) ‘The Listener as Remixer: Mix Stems in Online Fan Community and Competition Contexts.’ In: Eds. Rambarran, S. and Whiteley, S. (2015) The Oxford Handbook of Music and Virtuality. New York: Oxford University Press. ISBN: 978-0-19-932128-5 (2015) 'Parallel, Series and Integrated: Models of Tertiary Popular Music Education.' Carfoot, C., Allen, C., Millard, B. and Bennett, S. In: Eds. Brennan, M., Kirkman, P., Moir, Z., Rambarran, S. and Smith, G. The Routledge Research Companion to Popular Music Education. London: Routledge. ISBN: 978-1-4724-6498-9 (2014) An Imaginary Subject? Designing Music and Digital Media for a Post Conservatorium BMus Programme. In: Proceedings of the SEMPRE MET 2014: Researching Music, Education, Technology: Critical Insights. Eds. Himonides, E. and King, A. London: Institute of Education, University of London. pp. 41-44. ISBN: 78-1905351299(2012) ‘Revisiting the ‘Double Production’ Industry: Advertising, Consumption and ‘Technoporn’ surrounding the Music Technology Press.’ Ed. Kärjä, A. V. In: Music, Law and Business Anthology. Vol 5. International Institute for Popular Culture. ISSN: 1797-318X(2012) Endless Analogue: Technological Precursors in Contemporary Recording Practice. In: Journal on the Art of Record Production. Issue #7. ISSN: 1754-9892.(2009) Examining the Emergence and Subsequent Proliferation of Anti Production amongst the Popular Music Producing Elite: An Overview of Doctoral Study. In: Proceedings of the 2nd International PhD Music Students Conference. pp. 165-172.(2009) Revolution Sacrilege! Examining the Technological Divide amongst Record Producers in the 1980s. In: Journal on the Art of Record Production. Issue #3.  ISSN: 1754-9892.Technical Papers(2020) Filimowicz, M. Foundations in Sound Design for Linear Media. [Book Review] Journal of the Audio Engineering Society. Vol. 68, No. 1/2 pp109-110.(2019) The ANU School of Music Post-Production Suites: Design, Technology, Research and Pedagogy. 147th Convention of the Audio Engineering Society. E-Library E-Brief No. 540. Available at: http://www.aes.org/e-lib/browse.cfm?elib=20563(2018) Huber, D. M. Modern Recording Techniques. 9th Ed. [Book Review] Journal of the Audio Engineering Society. Vol. 66, No. 4 pp293-294.(2017) Audio Archive Preservation Challenges and Pedagogical Opportunities: School of Music RePlayed. 143rd Convention of the Audio Engineering Society. E-Library Convention Paper No. 9815. Available at: http://www.aes.org/e-lib/browse.cfm?elib=19212(2017) The ANU School of Music Recording Studios: Design, Technology, Research and Pedagogy. 143rd Convention of the Audio Engineering Society. E-Library E-Brief No. 397. Available at: http://www.aes.org/e-lib/browse.cfm?elib=19345Keynotes(2020) The Large-Scale Studio in 21st Century Recording Practice and Pedagogy: The Case of the ANU School of Music Recording Studios. At: London Calling - IASPM UK/Eire Branch Conference. University of West London. July 21st 2020.(2019) 'Looking for A Sound That's Gonna Drown Out the World': The Tech-Processual Construction of U2's Mofo. At: The U2 Conference. 301 Studios, Sydney. November 21st 2019.(2018) Academia Rocks. At: ANU Student Research Conference. Australian National University. July 20th 2018.(2017) Keynote Interview - Imogen Heap. At: InMusic 17, Innovation in Music Conference. University of Westminster. September 6th-8th 2017.(2016) Southern Studios and the Construction of Punk's Subversive Sonic Signature. At: Keep it Simple, Make it Fast! DIY Cultures, Spaces, Places: Faculdade de Letras da Universidade do Porto, Portugal. July 18th 2016.(2014) Rock, Recording and Rebellion: Technology and Process in 1990s Record Production. At: American Musicological Society/ Rock and Roll Hall of Fame and Museum Lecture Series. At: Rock and Roll Hall of Fame and Museum, Cleveland, Ohio. November 12th 2014.(2014) Production Mayhem: Tech Processual Unorthodoxies in Popular Music Recording. At: Music, Mayhem and Change: Postgraduate Research Symposium. Queensland Conservatorium, Griffith University. 9th – 10th June 2014.Conference Papers and Research Symposia(2020) Bates, Eliot and Bennett, Samantha. From Audio Technologies to Gear Fetishes. At: Audio Engineering Society Convention - Virtual Vienna, Austria. June 2nd - 5th 2020.(2020) Backwards and Forwards: Conflations of Disorient Historical, Filmic and Musical Temporalities in Siouxsie and the Banshees' 'Peek-A-Boo'. Music Studies Colloquium. University of California, Berkeley.(2019) Designing the ANU School of Music Post-production Suites: Technology, Research, Pedagogy. At: Sounds and Silences. ASRA: Australiasian Sound Recordings Association Conference. School of music, Australian National University, Canberra.(2018) Can You Hear the Thunder? The Tech-Processual Construction of Environmental and Emotional Situ in Ghost’s ‘Cirice’.  At: Playing Along: Music, Participation and Everyday Life. Annual Conference of IASPM Australia and New Zealand Branch, Waikato Institute of Technology (Wintec), Hamilton, Aotearoa/New Zealand.(2018) On the Research and Pedagogical Benefits of Technological Precursors in the 21st Century Recording Studio. At: Music, History and Technology. Annual Australiasian Sound Recordings Association Conference. 301 Studios, Sydney.(2018) Intermixtuality: Case Studies in Online Music [Re]Production. At: Crosstown Traffic: Popular Music Theory and Practice. Combined conference of IASPM UK/Ireland and Art of Record Production conference. September 3rd - 5th 2018, University of Huddersfield.(2018) The Sonic Orchestration of a Cinema of Attractions: Siouxsie and the Banshees’ ‘Carousel’. At: Gender, Differences, Identities and DIY Cultures: KISMIF Conference, July 3rd - 7th, Faculdade de Letras da Universidade do Porto, Portugal.(2017) Performing Cinema: Siouxsie and the Banshees' Peepshow. At: Performing History: Combined Conference of the Musicological Society of Australia and the New Zealand Musicological Society, December 8-10, Conference Centre, Faculty of Creative Arts and Industries, the University of Auckland, Aotearoa/New Zealand.(2017) On the Tech-processual Aesthetics of Siouxsie and the Banshees' Peepshow. At: Mixing Pop and Politics: Subversion, Resistance and Reconciliation in Popular Music. IASPM-ANZ 2017 Conference. December 4-6, 2017, Massey University, Wellington, Aotearoa/New Zealand.(2017) Film and the Fairground in Siouxsie and the Banshees' 'Carousel'. At: 10th Biennial International Conference on Music Since 1900 and Surrey Music Analysis Conference (ICMSN/SurreyMAC 2017) September 11-14 2017, University of Surrey, UK.(2017) The Tech-Processual Construction of Siouxsie and the Banshees’ Panoramic Peepshow. At: EuroMAC 9th European Music Analysis Conference. University of Strasbourg, France.(2017) Not Left to Our Own Devices: Analysing Music Together (With André Dohering and Ralf von Appen) At: Popular Music Studies Today - 19th International Biennial Conference of IASPM. University of Kassel, Germany.(2017) School of Music RePlayed: A Case Study in Audio Archiving Preservation and Pedagogy. At: International Association of Music Libraries and Archives and Documentation Centres IAML Congress, National Library, Riga, Latvia.(2016) School of Music RePlayed: Audio Archive Preservation and Pedagogy. At: Getting it Done: Crunch Time for Audio Archives. ASRA: Australiasian Sound Recordings Association Conference. National Film and Sound Archive, Canberra.(2016) The Tech-processual Staging of Siouxsie Sioux's Voice Inside the Panoramic Peepshow. At: From A Whisper To A Scream - The Voice in Popular Music. 2016 EMP Pop Conference. Seattle, Washington.(2015) Gus Dudgeon’s tech-processual construction of space in Elton John’s ‘Rocket Man’ and David Bowie’s ‘Space Oddity’ At: IASPM-ANZ 2015 Conference: Popular Music, Stars and Stardom. The Australian National University, Canberra.(2015) Time-based Signal Processing and 'Shape' in Alternative Rock Recordings. At: 'Back to the Future: Popular Music and Time' 18th Biennial IASPM Conference, 29th June – 3rd July. Universidade Estadual de Campinas, São Paulo, Brazil(2014) Never Mind the Bollocks… Here’s the Classic Rock Mix. At: IASPM ANZ 2014 Conference: Into the Mix: People, Places, Processes. University of Otago, Dunedin, New Zealand 5-7 December 2014(2014) Recording the Musical Underworld: John Loder's Southern Sonic Style. At: Worlds of Popular Music. Biennial Conference of IASPM UK Ireland. University College Cork. (2014) An Imaginary Subject? Designing 'Music and Digital Media' for a Post-Conservatorium BMus Programme. At: Researching Music, Technology and Education: Critical Insights. Society for Education, Music and Psychology Research [SEMPRE] At: Institute of Education, University of London.(2014) Virtual Remixing: Competition, Creative Commons and Copyright. At: Creativity, Circulation and Copyright: Sonic & Visual Media in the Digital Age. Centre for Research in the Arts, Social Sciences and Humanities [CRASSH] University of Cambridge.(2013) Intermixtuality: Mix Stems, Fans and the Popular Music Intertext. At: Popular Music Communities, Places and Ecologies. IASPM ANZ 2013 Conference. Queensland Conservatorium, Griffith University.(2013) The Virtual Remixer: Mix Stems and Online Communities. At: Music and Metamorphosis: Joint Conference of the Musicological Society of Australia & the New Zealand Musicological Society. Queensland Conservatorium, Griffith University.(2013) Pokey LaFarge and the South City Three - 'Fan It'. At: Fieldwork Playlist Conference. Goldsmiths College, London. (2013) Behind the Magical Mystery Door: History, Mythology and the Challenge to Abbey Road Studios. At: ‘Bridge Over Troubled Waters’: 17th Biennial International IASPM Conference, Oviedo, Spain.(2013) Modern Records, Maverick Methods: Technological, Processual and Analytical Considerations in Popular Music Record Production. [Invited] At: Popular Music Research Group. Goldsmiths College, London.Bennett, S. and Moore, A. (2012) Tech Processual Shaping of Recorded Popular Song. At: Music and Shape Conference. AHRC Research Centre for Musical Performance as Creative Practice. King’s College, London.(2012) Vintage Sound Recording Technology: Practicality, Source and Place. [Invited] At: Cambridge Branch of the Audio Engineering Society, Anglia Ruskin University.(2011) Back to the Future? The Quest for Sonic Perfection in the Age of Digitalization. [Invited] At: Digital Pop and the Death of the Musical Artefact – Popular Music Symposium. Goldsmiths College, London.(2011) Endless Analogue? Situating Vintage Technologies in the Contemporary Recording & Production Workplace. At: 7th ARP, San Francisco State University, USA.(2011) Industry Standard? Adopting Digital Technologies in the Early 1980s Recording & Production Workplace. At: Artistic Work and Creativity in the Digital Era. University of Avignon, France.(2010) Production Anti Production At: 6th ARP, Leeds Metropolitan University, Leeds, UK.(2010) Revisiting the ‘Double Production’ Industry: Equipment Manufacturing, Consumption and the Music Technology Press in the late 2000s. At: Music, Law & Business - Biennial Conference of IASPM Norden, Hanasaari Cultural Centre, Helsinki, Finland.(2010) The Listener as Remixer. At: Experience, Engagement, Meaning - Biennial Conference of IASPM UK/ Ireland, Cardiff University, UK.(2009) No Way Computer! Risk Aversion as an Influence on Equipment Choice among Popular Music Producers of the Late 1990s. At: 5th ARP, University of Glamorgan, Cardiff, UK.(2009) Examining the Emergence and Subsequent Proliferation of Anti Production amongst the Popular Music Producing Elite: An Overview of Doctoral Study. At: 2nd International PhD Music Students Conference, Aristotle University of Thessaloniki, Greece.(2008) Revolution Sacrilege! Examining the Technological Divide amongst Record Producers in the 1980s. At: 4th ARP, University of Massachusetts, Boston, USA.Public Lectures(2014) Pop Eats Itself: The Impact of the Sampler. Milestones in Music Lecture Series, School of Music, ANU.(2013) Popular Music and Subculture. Canberra Museum and Gallery, Canberra ACT.Awards and grantsAHRC Doctoral Scholarship | University of Surrey | 2007Vice Chancellor's Award for Education Excellence | Australian National University | 2019Vice Chancellor's Award for Teaching Excellence | Australian National University | 2019CASS Innovation in Teaching Award | Australian National University | 2018ANU Conference Host Grant | IASPM 2019 | Australian National University | 2018ANU Linkage Teaching & Learning Grant | Australian National University | 2018ANU Humanities Research Centre Fellowship | Australian National University | 2016ANU Major Equipment Grant | Australian National University | 2015ANU Linkage Teaching & Learning Grant | Australian National University | 2014ANU Conference Host Grant | IASPM ANZ 2015 | Australian National University | 2014RCUK GradSchool - Residential Research Programme | 2007Vice Chancellor's Teaching Fellowship Award | University of Westminster | 2012 Outstanding Teacher | University of Westminster Students Union | 2012 [nominated]Innovation in Teaching | University of Westminster Students Union | 2012 [won]Sony Engineering Student of the Year | 2000Professional MembershipSenior Fellow of the Higher Education Academy [SFHEA]Association for the Study of the Art of Record Production [ASARP] International Association for the Study of Popular Music (UK / ANZ) [IASPM] Audio Engineering Society (UK) [AES] American Musicological Society (US) [AMS] Royal Musical Association (UK) [RMA] Institute of Musical Research (UK) [IMR] Musicians Union (UK) [MU] Performing Rights Society (UK) [PRS]The Joe Meek Society (UK)"], "biography": "As an educator, Samantha has eighteen years curriculum design,  authorship and quality management experience. She has held numerous  external examiner positions at overseas Universities and is the  recipient of multiple teaching awards, notably the Vice Chancellor's Award for Education Excellence and a Vice Chancellor's Award  for Teaching Excellence at the Australian National University (2019)  and a Vice Chancellor’s Teaching Fellowship at the University of  Westminster (2012). She is a Senior Fellow of the Higher Education  Academy. Since arriving at the Australian National University in 2013,  she has authored a broad music technology and popular music curriculum  and, after securing a $250,000 major equipment grant, led the  refurbishment of the School of Music's recording studio facilities to  include the installation of a 48-channel Neve Genesys console and a  blend of vintage and contemporary microphones and processors.", "project": ["I am currently working on four projects: two co-authored books in the areas of music production; a journal article on popular music analysis; and, an edited book on popular music analysis.", ""], "publication": []}, "Microsoft-Academic": [{"title": "tip60 is a haplo insufficient tumour suppressor required for an oncogene induced dna damage response", "year": 2007, "source": "nature", "authors": [{"name": "chiara gorrini", "affiliation": "european institute of oncology"}, {"name": "massimo squatrito", "affiliation": "european institute of oncology"}, {"name": "massimo squatrito", "affiliation": "memorial sloan kettering cancer center"}, {"name": "chiara luise"}, {"name": "nelofer syed", "affiliation": "institute of cancer research"}, {"name": "daniele perna", "affiliation": "european institute of oncology"}, {"name": "landon wark", "affiliation": "university of manitoba"}, {"name": "francesca martinato", "affiliation": "european institute of oncology"}, {"name": "domenico sardella", "affiliation": "european institute of oncology"}, {"name": "alessandro verrecchia", "affiliation": "european institute of oncology"}, {"name": "samantha bennett", "affiliation": "european institute of oncology"}, {"name": "stefano confalonieri"}, {"name": "matteo cesaroni", "affiliation": "european institute of oncology"}, {"name": "francesco marchesi", "affiliation": "university of milan"}, {"name": "milena gasco"}, {"name": "eugenio scanziani", "affiliation": "university of milan"}, {"name": "maria capra"}, {"name": "sabine mai", "affiliation": "university of manitoba"}, {"name": "paolo nuciforo"}, {"name": "tim crook", "affiliation": "institute of cancer research"}, {"name": "john lough", "affiliation": "medical college of wisconsin"}, {"name": "bruno amati", "affiliation": "european institute of oncology"}], "id": 137773608}, {"title": "long term psychosocial adjustment of older vs younger survivors of breast and endometrial cancer", "year": 2007, "source": "psycho oncology", "authors": [{"name": "alice b kornblith", "affiliation": "harvard university"}, {"name": "mark powell", "affiliation": "harvard university"}, {"name": "meredith m regan", "affiliation": "harvard university"}, {"name": "samantha bennett", "affiliation": "harvard university"}, {"name": "c n krasner", "affiliation": "harvard university"}, {"name": "beverly moy", "affiliation": "harvard university"}, {"name": "jerry younger", "affiliation": "harvard university"}, {"name": "annekathyrn goodman", "affiliation": "harvard university"}, {"name": "ross s berkowitz", "affiliation": "brigham and women s hospital"}, {"name": "eric p winer", "affiliation": "harvard university"}], "id": 13506822}, {"title": "quality of life of older patients with early stage breast cancer receiving adjuvant chemotherapy a companion study to cancer and leukemia group b 49907", "year": 2011, "source": "journal of clinical oncology", "authors": [{"name": "alice b kornblith", "affiliation": "harvard university"}, {"name": "lan lan"}, {"name": "laura archer"}, {"name": "ann h partridge"}, {"name": "gretchen kimmick"}, {"name": "clifford a hudis"}, {"name": "eric p winer"}, {"name": "rebecca casey"}, {"name": "samantha bennett"}, {"name": "harvey j cohen"}, {"name": "hyman b muss"}], "id": 15137598}, {"title": "cancer related communication between female patients and male partners scale a pilot study", "year": 2006, "source": "psycho oncology", "authors": [{"name": "alice b kornblith", "affiliation": "harvard university"}, {"name": "meredith m regan", "affiliation": "harvard university"}, {"name": "youngmee kim", "affiliation": "american cancer society"}, {"name": "greta e greer", "affiliation": "american cancer society"}, {"name": "beverly parker"}, {"name": "samantha bennett", "affiliation": "harvard university"}, {"name": "eric p winer", "affiliation": "harvard university"}], "id": 13506822}, {"title": "behind the magical mystery door history mythology and the aura of abbey road studios", "year": 2016, "source": "popular music", "authors": [{"name": "samantha bennett", "affiliation": "australian national university"}], "id": 22535337}, {"title": "dyslexia in higher education the decision to study art", "year": 2013, "source": "european journal of special needs education", "authors": [{"name": "alison m bacon", "affiliation": "university of plymouth"}, {"name": "samantha bennett", "affiliation": "university of plymouth"}], "id": 136622136}, {"title": "neighborhood socioeconomic disadvantage neighborhood racial composition and hypertension stage awareness and treatment among hypertensive black men in new york city does nativity matter", "year": 2017, "source": "journal of racial and ethnic health disparities", "authors": [{"name": "helen cole", "affiliation": "autonomous university of barcelona"}, {"name": "dustin t duncan", "affiliation": "new york university"}, {"name": "gbenga ogedegbe", "affiliation": "new york university"}, {"name": "samantha bennett", "affiliation": "new york university"}, {"name": "joseph ravenell", "affiliation": "new york university"}], "id": 2765040861}, {"title": "popular music stars and stardom definitions discourses interpretations", "year": 2018, "source": "", "authors": [{"name": "stephen loy"}, {"name": "julie rickwood"}, {"name": "samantha bennett"}]}, {"title": "rhenium v and technetium v oxo complexes of an n2n s peptidic chelator evidence of interconversion between the syn and anti conformations", "year": 1997, "source": "inorganic chemistry", "authors": [{"name": "ernest wong", "affiliation": "mcmaster university"}, {"name": "theresa fauconnier", "affiliation": "mcmaster university"}, {"name": "samantha bennett", "affiliation": "mcmaster university"}, {"name": "john f valliant", "affiliation": "mcmaster university"}, {"name": "tam nguyen", "affiliation": "mcmaster university"}, {"name": "frank lau", "affiliation": "mcmaster university"}, {"name": "linda f l lu", "affiliation": "mcmaster university"}, {"name": "alfred pollak", "affiliation": "mcmaster university"}, {"name": "russell a bell", "affiliation": "mcmaster university"}, {"name": "john r thornback", "affiliation": "mcmaster university"}], "id": 171072222}, {"title": "an analysis of literature on sport officiating research", "year": 2020, "source": "research quarterly for exercise and sport", "authors": [{"name": "david j hancock", "affiliation": "memorial university of newfoundland"}, {"name": "samantha bennett", "affiliation": "indiana university"}, {"name": "hannah roaten", "affiliation": "indiana university"}, {"name": "kyle chapman", "affiliation": "indiana university"}, {"name": "caleb stanley", "affiliation": "indiana university"}], "id": 128968821}], "ANDS-Grants": []}