{"ANU": {"name": "Sarah Bourke", "link": "https://researchers.anu.edu.au/researchers/bourke-sc", "colleges": "College of Health & Medicine", "email": "sarah.bourke@anu.edu.au", "phone": "", "expertise": [], "interest": ["Aboriginal and Torres Strait Islander health and wellbeingSocial and cultural determinants of healthMedical anthropologyIndigenous research methodologies"], "biography": "Sarah Bourke is a Research Fellow with the National Centre for Epidemiology and Population Health working on the Mayi Kuwayu National Study of Aboriginal and Torres Strait Islander Wellbeing. Sarah is an Aboriginal woman born and raised in Canberra and is descended from the Gidja people of WA and the Gamilaroi people on the border of QLD and NSW. She completed her undergraduate studies at ANU in biological anthropology and psychology before being award a John Monash Scholarship and a Roberta Sykes Scholarship to study for an MPhil in Medical Anthropology with Keble College at the University of Oxford in the UK. She was then awarded a Roberta Sykes Scholarship and a Chevening Scholarship to continue on at Oxford for a DPhil in Anthropology at St. John's College. Her doctoral thesis utilised an Indigenist research framework to ethnographically examine the historical, social, and political factors which influenced the development of the Mayi Kuwayu Study and its emphasis on measuring cultural determinants of health. During her fellowship Sarah plans to continue her work building an Indigenous-led research agenda exploring what helps Aboriginal and Torres Strait Islander individuals, communities, and cultures thrive.", "project": [], "publication": []}, "Microsoft-Academic": [{"title": "the nature of managerial work in small growth orientated businesses", "year": 2005, "source": "small business economics", "authors": [{"name": "colm ogorman", "affiliation": "ramon llull university"}, {"name": "sarah bourke"}, {"name": "john a murray", "affiliation": "university college dublin"}], "id": 41869786}, {"title": "evidence review of indigenous culture for health and wellbeing", "year": 2018, "source": "the international journal of health wellness & society", "authors": [{"name": "sarah bourke"}, {"name": "alyson wright"}, {"name": "jillian guthrie"}, {"name": "lachlan russell"}, {"name": "terry dunbar"}, {"name": "raymond lovett"}], "id": 2765017126}, {"title": "wecare cooperating with older people in the design and evaluation of online social networking services", "year": 2015, "source": "", "authors": [{"name": "m g d steen", "affiliation": "netherlands organisation for applied scientific research"}, {"name": "mari ervasti"}, {"name": "marja harjumaa"}, {"name": "sarah bourke"}, {"name": "victor hernandez"}, {"name": "marlou min"}, {"name": "sharon prins"}]}, {"title": "control of processes", "year": 2004, "source": "", "authors": [{"name": "sarah bourke"}, {"name": "paul kiernan"}]}, {"title": "work in small growth orientated businesses", "year": 2005, "source": "", "authors": [{"name": "colm o gorman"}, {"name": "sarah bourke"}, {"name": "john a murray"}]}], "ANDS-Grants": []}