{"ANU": {"name": "Sarah Olesen", "link": "https://researchers.anu.edu.au/researchers/olesen-sc", "colleges": "College of Health & Medicine", "email": "", "phone": "", "expertise": ["Mental Health", "Epidemiology", "Public Health And Health Services", "Health Promotion"], "interest": ["Mental health epidemiologyMental health service useCommunity and workforce participation and mental healthHealth program evaluationResearch translationDr Olesen is a member of the Psychiatric Epidemiology and Social Issues team at the Centre for Mental Health Research. Her current and planned research aims to better understand people's use of health services in Australia, and the health outcomes of service use, particularly in the area of mental health. Dr Olesen is also involved in projects that investigate the relationships between community and workforce participation and mental health.Dr Olesen uses large community and population surveys and epidemiological methods to address these research topics, as well as her knowledge of clinical and psychological models. By combining these perspectives, Dr Olesen seeks to produce research that provides informed, practical recommendations for policy and health-care settings."], "biography": "Dr Olesen completed a Bachelor of Arts (Psychology/Criminology) with Honours degree at the University of Melbourne in 2003 before beginning a career in mental health research at The Australian National University. Since 2004 she has undertaken research projects on the topics of workforce and community participation, childhood adversity, and health service use, leading to published work in qualtiy academic journals. This included a PhD entitled: “The transition from work to retirement during later adulthood: Its relationship to mental health and role of alternative forms of participation”. Dr Olesen has completed specialised training in longitudinal data analyses and health program evaluation, and contributed to documents and forums that aim to translate research findings into policy and practice recommendations. She continues to undertake research that tackles current public health issues using methods that maximise the ability of this research to inform mental health service delivery.", "project": ["Dr Olesen's research uses several community and epidemiological surveys to investigate the relationships between personal characteristics, service use, and environmental factors and changes in  mental health. These surveys include"], "publication": [{"title": "How financial hardship is associated with the onset of mental health problems over time", "year": "2015", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 50, no. 6, pp. 909-918", "authors": ["Kiely K", "Leach L", "Sarah Olesen"]}, {"title": "New Fatherhood and Psychological Distress: A Longitudinal Study of Australian Men", "year": "2014", "source": "American Journal of Epidemiology, vol. 180, no. 6, pp. 582-589", "authors": ["Leach L", "Sarah Olesen", "Butterworth P"]}, {"title": "", "year": "2013", "source": "Retirement: a trigger for distress or welcome relief from the rat race?", "authors": ["Sarah Olesen", "Butterworth P"]}, {"title": "Mental health affects future employment as job loss affects mental health: Findings from a longitudinal population study", "year": "2013", "source": "BMC Psychiatry, vol. 13", "authors": ["Sarah Olesen", "Butterworth P", "Leach L"]}, {"title": "Ecstasy", "year": "2013", "source": "and the use of sleep medications in a general community sample: a 4-year follow-up'Addiction, vol. 108, no. 9, pp. 1640-1648", "authors": ["Tait R", "George A", "Sarah Olesen"]}, {"title": "Ecstasy use and depression: A 4-year longitudinal study among an Australian general community sample", "year": "2013", "source": "Psychopharmacology, vol. 229, no. 4, pp. 713-721", "authors": ["George A", "Sarah Olesen", "Tait R"]}, {"title": "Relationship quality and levels of depression and anxiety in a large population-based survey", "year": "2013", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 48, no. 3, pp. 417-425", "authors": ["Leach L", "Butterworth P", "Sarah Olesen"]}, {"title": "Socioeconomic differences in antidepressant use in the PATH through life study: Evidence of health inequalities, prescribing bias, or an effective social safety net?", "year": "2013", "source": "Journal of Affective Disorders, vol. 149, no. 1-3, pp. 75-83", "authors": ["Butterworth P", "Sarah Olesen", "Leach L"]}, {"title": "Ecstasy use and depression: A 4-year longitudinal study among an Australian general community sample. Psychopharmacology: 229(4)", "year": "2013", "source": "pp. 713-72", "authors": ["Sarah Olesen", "Tait RJ ("]}, {"title": "Personal factors influence use of cervical cancer screening services: Epidemiological survey and linked administrative data address the limitations of previous research", "year": "2012", "source": "BMC Health Services Research, vol. 12, no. 1", "authors": ["Sarah Olesen", "Butterworth P", "Jacomb P"]}, {"title": "Is poor mental health a risk factor for retirement? Findings from a longitudinal population survey", "year": "2012", "source": "Social Psychiatry and Psychiatric Epidemiology, vol. 47, no. 5, pp. 735-744", "authors": ["Sarah Olesen", "Butterworth P", "Rodgers B"]}, {"title": "The role of hardship in the association between socio-economic position and depression", "year": "2012", "source": "Australian and New Zealand Journal of Psychiatry, vol. 46, no. 4, pp. 364-373", "authors": ["Butterworth P", "Sarah Olesen", "Leach L"]}, {"title": "Feeling safe", "year": "2012", "source": "stable and secure. Having a home", "authors": ["Butterworth P", "Leach L", "Sarah Olesen"]}, {"title": "mental health in the suburbs: an investigation of differences in the prevalence of depression across Canberra suburbs using data from the PATH through Life Study", "year": "2012", "source": "Journal of Public Health, pp. 1-7", "authors": ["Butterworth P", "Leach L", "Sarah Olesen"]}, {"title": "Psychosocial job adversity and health in Australia: analysis of data from the HILDA Survey", "year": "2011", "source": "Australian and New Zealand Journal of Public Health, vol. 35, no. 6, pp. 564-571", "authors": ["Butterworth P", "Leach L", "Rodgers B", "Sarah Olesen"]}, {"title": "The psychosocial quality of work determines whether employment has benefits for mental health: Results from a longitudinal national household panel survey", "year": "2011", "source": "Occupational and Environmental Medicine, vol. 68, no. 11, pp. 806-812", "authors": ["Butterworth P", "Leach L", "Strazdins L", "Sarah Olesen"]}, {"title": "Community participation and mental health during retirement in community sample of Australians", "year": "2011", "source": "Aging and Mental Health, vol. 15, no. 2, pp. 186-197", "authors": ["Sarah Olesen", "Berry H"]}, {"title": "The limitations of employment as a tool for social inclusion", "year": "2010", "source": "BMC Public Health, vol. 10, no. 621, pp. 1-13", "authors": ["Leach L", "Butterworth P", "Strazdins L", "Sarah Olesen"]}, {"title": "Prevalence of self-management versus formal service use for common mental disorders in Australia: Findings from the 2007 National Survey of Mental Health and Wellbeing", "year": "2010", "source": "Australian and New Zealand Journal of Psychiatry, vol. 44, no. 9, pp. 823-830", "authors": ["Sarah Olesen", "Butterworth P", "Leach L"]}, {"title": "Children", "year": "2010", "source": "s exposure to parental and familial adversities: Findings from a population survey of Australians'Family Matters, vol. 2010, no. 84, pp. 43-52", "authors": ["Sarah Olesen", "MacDonald E", "Raphael B"]}, {"title": "Pathways to social inclusion: considering the relationship between unemployment", "year": "2010", "source": "job quality and personal disadvantage", "authors": ["Leach L", "Butterworth P", "Rodgers B", "Sarah Olesen"]}, {"title": "Prevalence of self-management versus formal service use for common mental disorders in Australia: findings from the 2007 National Survey of Mental Health and Wellbeing. Australian and New Zealand Journal of Psychiatry", "year": "2010", "source": "44(9)823-830", "authors": ["Sarah Olesen", "Leach L ("]}, {"title": "", "year": "2009", "source": "Social participation as a strategy to improve mental health: A systematic review of peer-reviewed controlled trials and discussion of key issues for future research and interventions", "authors": ["Sarah Olesen", "Butterworth P", "Rodgers B"]}, {"title": "Validity of the mental health component scale of the 12-item Short-Form Health Survey (MCS-12) as measure of common mental disorders in the general population", "year": "2007", "source": "Psychiatry Research, vol. 152, no. 1, pp. 63-71", "authors": ["Sarah Olesen", "Butterworth P", "Rodgers B"]}, {"title": "Mental Health and the timing of men", "year": "2006", "source": "s retirement'Social Psychiatry and Psychiatric Epidemiology, vol. 41, no. 7, pp. 515-522", "authors": ["Sarah Olesen", "Butterworth P", "Rodgers B"]}, {"title": "Retirement and mental health: Analysis of the Australiannational survey of mental health and well-being", "year": "2006", "source": "Social Science and Medicine, vol. 62, pp. 1179-1191", "authors": ["Butterworth P", "Sarah Olesen", "Rodgers B"]}]}, "Microsoft-Academic": [{"title": "publishing and sharing sensitive data", "year": 2014, "source": "", "authors": [{"name": "sarah olesen"}]}, {"title": "health y sharing of human data", "year": 2015, "source": "", "authors": [{"name": "sarah olesen"}]}], "ANDS-Grants": [{"description": "Depression and anxiety are widespread. As treatment is typically managed by GPs, effective primary care for these disorders is a national priority. The Australia-wide coverage of these services means that the research behind their delivery must be based on community-wide studies of primary care outcomes and determinants. There is an acute lack of such research. Dr Olesen proposes a comprehensive and innovative set of epidemiological investigations to address this gap.", "title": "Primary health care and self-management for depression and anxiety: A vital community-based study for future service delivery", "id": "110975", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/nhmrc/1035690", "researchers": ["Dr Sarah Olesen"], "status": "active", "fundingAmount": 330779, "fundingScheme": "Early Career Fellowships", "startDate": 2012, "endDate": 2020, "dateTimeModified": "2015-04-12T08:12:03Z", "dateTimeCreated": "2013-05-15T07:21:39Z", "funder": ["National Health and Medical Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": ["Dr Sarah Olesen"], "purl": "http://purl.org/au-research/grants/nhmrc/1035690", "identifiers": ["http://purl.org/au-research/grants/nhmrc/1035690", "1035690"], "subjects": ["Primary Health Care", "MEDICAL AND HEALTH SCIENCES", "PUBLIC HEALTH AND HEALTH SERVICES", "health services research", "health care utilisation", "primary care", "population health", "epidemiology"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/110975"}]}]}