{"ANU": {"name": "Sean  Perera", "link": "https://researchers.anu.edu.au/researchers/perera-spf", "colleges": "College of Arts and Social Sciences", "email": "sean.perera@anu.edu.au", "phone": "", "expertise": ["Multicultural Intercultural And Cross Cultural Studies", "Comparative And Cross Cultural Education", "Teacher Education And Professional Development Of Educators", "Education Assessment And Evaluation", "Communication And Media Studies", "Migrant Cultural Studies"], "interest": [], "biography": "", "project": [""], "publication": [{"title": "Communicating science in English: A preliminary exploration into the professional self-perceptions of Australian scientists from language backgrounds other than English", "year": "2016", "source": "Journal of Science Communication, vol. 15, no. 6, pp. 1-20pp", "authors": ["Sean  Perera", "Sean  Perera"]}, {"title": "The Big Picture: Pre-service teachers", "year": "2015", "source": "perceptions of expert' science teachers'Teaching Science, vol. 61, no. 4, pp. 32-45pp", "authors": ["Sean  Perera", "Sean  Perera"]}, {"title": "Science Communication and Science Education", "year": "2013", "source": "in John K Gilbert and Susan Stocklmayer (ed.), Communication and engagement with Science and Technology.  Issues and Dilemmas, Routledge Taylor & Francis Group, New York and Abingdon, pp. 180-196. Japanese Translation Published in 2015", "authors": ["Sean  Perera", "Sean  Perera"]}, {"title": "Is post-compulsory science a study option for everyone? Findings from an innovate science programme for young humanitarian immigrants in Australia. Proceedings of 2013 World Conference on Science and Technology Education. 29 September to 4 October 2013. Borneo Convention Centre Kuching", "year": "2013", "source": "SarawakMalaysia: International Council of Associations for Science Education", "authors": ["Sean  Perera"]}, {"title": "", "year": "2011", "source": "Expert Working Group on Developing an Evidence Base for Science Engagement in Australia: Recommendations", "authors": ["Sean  Perera", "Sean  Perera", "Sean  Perera"]}, {"title": "What", "year": "2012", "source": "s special in a good meal? A study to examine the \"good\" or \"special\" meal as identified by children to gauge the strength of tradition and family values in the face of nutritional directives. Proceedings ASC National Conference 2012. Sydney: Australian Science Communicators. pp. 30-31", "authors": ["Sean  Perera", "Sean  Perera", "Sean  Perera"]}, {"title": "", "year": "2012", "source": ". A taste for science. (Montage). Sunday Observer. Colombo: Associated Newspapers of Ceylon Limited. 19 January 2012. http://www.sundayobserver.lk/2012/02/19/mon06.asp", "authors": ["Sean  Perera"]}, {"title": "critical reflection on pre-Buddhist Sri Lanka. (Montage). Sunday Observer. Colombo: Associated Newspapers of Ceylon Limited. Part 1", "year": "2011", "source": "7 August 2011 & Part 214 August 2011: http://www.sundayobserver.lk/2011/08/07/mon05.asp", "authors": ["Sean  Perera"]}, {"title": "She", "year": "2011", "source": "ll be rightmate - Is the Aussie attitude incompatible with science?. (Science & Technology). The Conversation. The Conversation Media Group. 7 July 2011.", "authors": ["Sean  Perera"]}, {"title": "Serving up the Pierian Waters: A role for science communication in formal science education. \r\nProceedings", "year": "2011", "source": "42nd Annual Australasian Science Education Research Association Conference. Adelaide: University of South Australia. p.84.", "authors": ["Sean  Perera"]}, {"title": "", "year": "2011", "source": ". Terrorism: When the battle within becomes the battle without. (Montage). Sunday Observer. Colombo : Associated Newspapers of Ceylon Limited. 26 June 2011: p.47  http://www.sundayobserver.lk/2011/06/26/mon10.as", "authors": ["Sean  Perera"]}, {"title": "Science Teachers from Non-Western Backgrounds Challenged by (Western) Science:  A Whole Other Ball Game", "year": "2011", "source": "International Journal of Science in Society2(2): pp.11-22", "authors": ["Sean  Perera"]}, {"title": "From public awareness to public understanding of science: A model. (Poster). In Dwivedi", "year": "2010", "source": "K.K.Gascoigne, T., Lewenstein, B., Cho, S.K., Verma, P.K., Vyas, P.C., Banerji, T.B. & Patairiya, M.K. (Eds.), Proceedings, 11th International Conference on Public Communication of Science and Technology. New Delhi: PCST Network. ISBN 81-7272-021-1: p.684", "authors": ["Sean  Perera"]}, {"title": "Constructivist Framework for a Model of Short-term Professional Development for Science Teachers. (Poster). In J. Holbrook", "year": "2010", "source": "M. RannikmaeR. Soobard, B. Cavas, & M. Kim, (Eds.), Proceedings, 3rd World Conference on Science and Technology Education. University of Tartu, Tartu, Estonia", "authors": ["Sean  Perera", "Sean  Perera"]}, {"title": "", "year": "2010", "source": ". Exploring the implication of science communication practices on a model for teacher professional development: Serving up the Pierian Waters. (PhD thesis). Canberra: The Australian National University.", "authors": ["Sean  Perera"]}, {"title": "Science Communication:  Holding knowledge-constructs together. Australian Science Communicators National Conference 2010. Australian Science Communicators", "year": "2010", "source": "Canberra", "authors": ["Sean  Perera"]}, {"title": "", "year": "2009", "source": ". Science communication and its implications for A/L students. (Features). Ceylon Daily News. Colombo: Lake House Publishers. 22 June 2009: p.16.", "authors": ["Sean  Perera"]}, {"title": "", "year": "2009", "source": ". Tackling terrorism through transitions. (Op Ed). The Canberra Times. Canberra: Fairfax Media. \r\n21 August 2009: p.13", "authors": ["Sean  Perera"]}, {"title": "Effective Science Communication Practices and Simple Hands-on Activities:  Two Important Elements of Teacher Professional Development. In M. Costa", "year": "2009", "source": "J. Dorrio& M. Patairiya (Eds.), Proceedings, International Conference on Hands-on Science (HSC1 2009). The Hands-on Science Network, India, pp. 134-138", "authors": ["Sean  Perera"]}, {"title": "Challenges for English Medium Instruction in Sri Lanka. ASTC Dimensions. July/August Issue 2009", "year": "2009", "source": "pp. 11-12", "authors": ["Sean  Perera"]}, {"title": "Linking Teachers", "year": "2007", "source": "Knowledge for Professional Empowerment. In G. Venville & V. Dawson (Eds.)Proceedings, World Conference on Science and Technology Education 2007. Vernier International, Perth, WA., pp. 350-354", "authors": ["Sean  Perera", "Sean  Perera"]}, {"title": "", "year": "2002", "source": ". Identification of nutrient disorders in Dracaena sanderiana cv Gold. Sri Lankan Journal of Agricultural Science. Kandy: University of Peradeniya. Volume 39 (1): pp.27-39.", "authors": ["Sean  Perera"]}, {"title": "Teaching biology vocabulary in the English medium at tertiary level. In R.Raheem & T.Kandiah (Eds), Proceedings,  Sri Lanka English Language Teachers", "year": "2002", "source": "Association 2nd International Conference. Colombo: British Council. p.25", "authors": ["Sean  Perera"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}