{"ANU": {"name": "Shuk Ying (Susanna) Ho", "link": "https://researchers.anu.edu.au/researchers/ho-sy", "colleges": "College of Business& Economics", "email": "susanna.ho@anu.edu.au", "phone": "", "expertise": ["Information Systems Theory", "Computer Human Interaction", "Cognitive Sciences", "Business And Management"], "interest": [], "biography": "Susanna's research focuses on the  area of judgment and decision making,  big data and data analytics,  management turnovers and internal control  material weaknesses, social  media and corporate social responsibility.", "project": ["Australian Research Council (ARC) Discovery Projects, Australia  (A$196,000) 2008/2010: Understanding the Effectiveness of Mobile  Personalisation (with Kar Yan TAM)", "General Research Fund (GRF),  Hong Kong (HK$612,000) 2016/2018: Consumer Use of Product Information  under Web and Mobile Channels in e-Commerce: A Process Design  Perspective (with Leon Zhao and Sang Pil Han)General Research  Fund (GRF), Hong Kong (HK$303,946) 2013/2015: Integrating Consumer  Decision Making and Web Personalization Engagement (with Kar Yan Tam)General  Research Fund (GRF), Hong Kong (HK$550,000) 2009/2011: Examining the  Effects of Avatars as a New Form of Personalisation Agents on Online  Shopping Decision Making and How Distrust Influences These Effects (with  Patrick Y K Chau)"], "publication": [{"title": "S, Choi, S., and Yang, F. (forthcoming)", "year": "Ho,", "source": "Harnessing the Power of Twitter: How are Tweets Associated with Forecast Accuracy?'Journal of the Association of Information Systems. [ABDC A*", "authors": ["", "Shuk Ying (Susanna) Ho"]}, {"title": "Nudging moods to induce unplanned purchases in imperfect mobile personalization contexts", "year": "2018", "source": "MIS Quarterly, vol. 42, no. 3, pp. 757-778. [FT45, ABDC A*", "authors": ["Shuk Ying (Susanna) Ho", "Lim K"]}, {"title": "Continued Voluntary Participation Intention in Firm-Participating Open Source Software Projects", "year": "2017", "source": "Information Systems Research, vol. 28, no. 3, pp. 603-625. [FT45, ABDC A*", "authors": ["Shuk Ying (Susanna) Ho", "Rai A"]}, {"title": "How Does Corporate Social Responsibility Engagement Influence Word of Mouth on Twitter? Evidence from the Airline Industry", "year": "2017", "source": "Journal of Business Ethics. [FT45, ABDC A", "authors": ["Vo T", "Xiao X", "Shuk Ying (Susanna) Ho"]}, {"title": "The Effects of Web Personalization on User Attitude and Behavior: An Integration of the Elaboration Likelihood Model and Consumer Search Theory", "year": "2014", "source": "MIS Quarterly, vol. 38, no. 2, pp. 497-520. [FT45, ABDC A*", "authors": ["Shuk Ying (Susanna) Ho", "Bodoff D"]}, {"title": "Examining the effects of malfunctioning personalized services on online users", "year": "2013", "source": "distrust and behaviors'Decision Support Systems, vol. 56, no. 1, pp. 180-191. [ABDC A*", "authors": ["Chau P", "Shuk Ying (Susanna) Ho", "Shuk Ying (Susanna) Ho"]}, {"title": "The Effects of Location Personalization on Individuals", "year": "2012", "source": "Intention to Use Mobile Services'Decision Support Systems, vol. 53, no. 4 (Nov 2012), pp. 802-812. [ABDC A*", "authors": ["Shuk Ying (Susanna) Ho"]}, {"title": "Timing of Adaptive Web Personalization and its Effects on Online Consumer Behavior", "year": "2011", "source": "Information Systems Research, vol. 22, no. 3, pp. 660-679. [FT45, ABDC A*", "authors": ["Shuk Ying (Susanna) Ho", "Bodoff D", "Tam K"]}, {"title": "Understanding the Impact of Web Personalization on User Information Processing and Decision", "year": "2006", "source": "MIS Quarterly, vol. 30, no. 4, p. 865. [FT45, ABDC A*", "authors": ["Tam K", "Shuk Ying (Susanna) Ho"]}, {"title": "Web Personalization as a Persuasion Strategy: An Elaboration Likelihood Model Perspective", "year": "2005", "source": "Information Systems Research, vol. 16, no. 3, pp. 271-291. [FT45, ABDC A*", "authors": ["Tam K", "Shuk Ying (Susanna) Ho"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}