{"ANU": {"name": "Sonia Pertsinidis", "link": "https://researchers.anu.edu.au/researchers/pertsinidis-s", "colleges": "College of Arts and Social Sciences", "email": "sonia.pertsinidis@anu.edu.au", "phone": "+61 2 6197 0057", "expertise": ["Latin And Classical Greek Literature", "Latin And Classical Greek Languages", "Literary Studies"], "interest": ["Dr Pertsinidis specializes in ancient Greek literature. Her publications cover a range of genres and time periods, from ancient Greek comedy, fable collections and character sketches of the fifth and fourth centuries BCE to the literary works of the first-second centuries CE. Her research interests include ancient Greek philosophy, rhetoric, drama and mythology."], "biography": "", "project": ["My first book is entitled Theophrastus' Characters: A New Introduction (Routledge, 2018). My book introduces the reader to Theophrastus (Aristotle's colleague and immediate successor) and his work known as the Characters, a collection of thirty amusing descriptions of character types who lived in Athens in the fourth century BCE. These character types are as relevant and recognisable today as they were many centuries ago. My book explores the ethical, comic and rhetorical dimensions of the character portraits and demonstrates the enduring influence of Theophrastus' Characters upon ancient and modern literary traditions.", "My current research explores ancient Greek fable collections and the Life of Aesop. In the ancient world, fables were regarded as tools for persuasion and argumentation. This research is partially funded by an Early Career Award from the Australasian Society for Classical Studies and an award from Australasian Women in Ancient World Studies. I have previously published articles on Aristophanes' use of fables, on Babrius' fables, and on the role of fables and stories in classical education. I am currently revising my PhD thesis (on Babrius’ fables) for publication as a book.", "With my colleague Dr Greta Hawes, I am currently working on a co-authored translation and commentary of Pseudo-Plutarch's De Fluviis.", "I am available to supervise Honours, Masters and PhD projects in the field of ancient Greek literature.", ""], "publication": [{"title": "Dung Beetle", "year": "2020", "source": "s Victory: The Moral of the Life of Aesop (Vita G)'Antichthon, vol. 54, pp. 141-163", "authors": ["Sonia Pertsinidis"]}, {"title": "rticulate Animals in the Fables of Babrius", "year": "2020", "source": "in Hedwig Schmalzgruber (ed.), Speaking Animals in Ancient Literature, Universitaetsverlag Winter GmbH, Heidelberg, Germany, pp. 81-102", "authors": ["Sonia Pertsinidis"]}, {"title": "Book Review: An Overview of the Second Sophistic: Richter (D.S.), Johnson (W.A.) (edd.) The Oxford Handbook of the Second Sophistic. New York, Oxford University Press, 2017", "year": "2019", "source": "The Classical Review, pp.1-3", "authors": ["Sonia Pertsinidis"]}, {"title": "NU Discovery Series 2019, Works that Shaped the World:", "year": "2019", "source": "The (Lost) Works of Pythagoras'Lecture Series hosted by the Humanities Research Centre and the ANU College of Arts and Social Sciences. Podcast available at https://works-that-shaped-the-world.simplecast.com", "authors": ["Sonia Pertsinidis"]}, {"title": "How to embrace change and build resilience", "year": "2019", "source": "Better Things Podcast, ANU College of Arts and Social Sciences, available at http://better-things.simplecast.com/", "authors": ["Sonia Pertsinidis"]}, {"title": "Theophrastus", "year": "2018", "source": "Characters: A New IntroductionRoutledge Taylor & Francis Group, United Kingdom", "authors": ["Sonia Pertsinidis"]}, {"title": "Theophrastus", "year": "2018", "source": "Characters: A new Introduction'in Luanna H Meyer (ed.), Oxford Bibliographies Online, Oxford University Press, Oxford, pp. 11-11", "authors": ["Sonia Pertsinidis"]}, {"title": "The Fabulist Aristophanes", "year": "2009", "source": "Fabula, vol. 50, no. 3/4, pp. 208-226", "authors": ["Sonia Pertsinidis"]}, {"title": "The Modern Import of Classical Education", "year": "2008", "source": "in K. Boudouris, M. Knezevic (ed.), Paideia: Education in the Global Era Vol. I, Athens, Ionia Publications, Greece, pp. 59-66", "authors": ["Sonia Pertsinidis"]}]}, "Microsoft-Academic": [{"title": "a dung beetle s victory the moral of the life of aesop vita g", "year": 2020, "source": "antichthon", "authors": [{"name": "sonia pertsinidis", "affiliation": "australian national university"}], "id": 52149532}, {"title": "the fabulist aristophanes", "year": 2009, "source": "fabula", "authors": [{"name": "sonia pertsinidis"}], "id": 126350667}, {"title": "podcast how to embrace change and build resilience", "year": 2019, "source": "", "authors": [{"name": "sonia pertsinidis"}]}, {"title": "an overview of the second sophistic d s richter w a johnson edd the oxford handbook of the second sophistic pp xii 758 ills new york oxford university press 2017 cased 97 us 150 isbn 978 0 19 983747 2", "year": 2019, "source": "classical review", "authors": [{"name": "sonia pertsinidis"}], "id": 50128530}, {"title": "resilience and euripides heracles", "year": 2021, "source": "humanities research", "authors": [{"name": "sonia pertsinidis"}], "id": 2764485006}, {"title": "anu discovery series 2019 works that shaped the world the lost works of pythagoras", "year": 2019, "source": "", "authors": [{"name": "sonia pertsinidis"}]}, {"title": "style delivery and the role of character in rhetoric", "year": 2018, "source": "", "authors": [{"name": "sonia pertsinidis"}]}, {"title": "the characters as a comedy of manners", "year": 2018, "source": "", "authors": [{"name": "sonia pertsinidis"}]}, {"title": "before and after theophrastus characters", "year": 2018, "source": "", "authors": [{"name": "sonia pertsinidis"}]}, {"title": "articulate animals in the fables of babrius", "year": 2020, "source": "", "authors": [{"name": "sonia pertsinidis"}]}], "ANDS-Grants": []}