{"ANU": {"name": "Spencer Whitney", "link": "https://researchers.anu.edu.au/researchers/whitney-sm", "colleges": "College of Science", "email": "spencer.whitney@anu.edu.au", "phone": "", "expertise": ["Plant Physiology", "Transgenesis", "Bacteriology", "Agricultural Molecular Engineering Of Nucleic Acids And Proteins", "Molecular Evolution", "Genetically Modified Field Crops And Pasture", "Enzymes", "Biochemistry And Cell Biology", "Phycology Incl. Marine Grasses", "Agricultural Biotechnology", "Characterisation Of Biological Macromolecules"], "interest": ["Synthetic photosynthesis; Improving plant CO2 capture and growth efficiency.My research focuses on utilising synthetic biology to scrutinize the assembly, metabolic regulation and kinetic plasticity of the biospheres most abundant protein, the photosynthetic CO2-fixing enzyme Rubisco (ribulose-1,5-bisphosphate carboxylase/oxygenase). The research provides training in molecular biology, protein engineering (directed evolution), enzyme kinetics, biochemistry, plastome transformation, tissue culture, measuring leaf photosynthesis and plant growth. Despites Rubisco’s pivotal role in photosynthetic carbon assimilation – catalysing the primary step of incorporating CO2 into carbohydrates that are used to store and transport energy - it is surprisingly an inefficient enzyme in need of improvement. It constitutes about 20 to 30% of soluble leaf protein due to its inefficiency. The catalytic inadequacies of Rubisco (such as a slow turnover rate and poor ability to distinguish CO2 from O2) frequently limit the growth capacity of many plants, including most crops. As such, Rubisco has been studied intensively as a prime target for genetic engineering as a means to supercharge photosynthesis and improve growth efficiency. Towards this significant challenge, the primary foci of research in the Whitney laboratory utilises recent technological and conceptual breakthroughs to study Rubisco biogenesis, modify its catalysis, understand its regulation by Rubisco activase and generally tackle the challenges faced in developing strategies for enhancing Rubisco activity to improve plant productivity."], "biography": "Dr Whitney undertook his BSc (Botany, Biochemistry and Chemistry) honours and PhD at James Cook University of North Queensland where he discovered unique molecular and biochemical features of the photosynthetic CO2-fixing enzyme, Rubisco, from the symbiotic marine microalgae found in corals and clams. In 1996 he moved to the ANU to begin his postdoctoral studies and expanded his interest in interrogating Rubisco biology using plastome transformation biotechnology. His pivotal work on modifying plant photosynthesis via Rubisco engineering led to him being awarded the Goldacre Award in 2002 from the Australian Society of Plant Scientists and an International Photosynthesis Congress Young Scientist Award in 2004. From 2004-09 he held an ARC Research Fellowship and in 2009 was awarded an ARC Future Fellowship. His research is an integral part of the ARC Centre of Excellence for Translational Photosynthesis and the Realizing Increased Photosynthetic Efficiency project funded by the Bill & Melinda Gates Foundation.", "project": [], "publication": [{"title": "Modifying Plant Photosynthesis and Growth via Simultaneous Chloroplast Transformation of Rubisco Large and Small Subunits", "year": "2020", "source": "The Plant Cell, vol. 32, pp. 2898-2916", "authors": ["Martin Avila E", "Lim Y", "Birch R", "Spencer Whitney"]}, {"title": "Directed Evolution of an Improved Rubisco; In Vitro Analyses to Decipher Fact from Fiction", "year": "2019", "source": "International Journal of Molecular Sciences, vol. 20, no. 20, pp. -", "authors": ["Zhou Y", "Spencer Whitney"]}, {"title": "BSD2 is a Rubisco-specific assembly chaperone, forms intermediary hetero-oligomeric complexes, and is nonlimiting to growth in tobacco", "year": "2019", "source": "Plant Cell and Environment, vol. 42, no. 4, pp. 1287-1301", "authors": ["Conlan B", "Birch R", "Kelso C", "Spencer Whitney"]}, {"title": "Preparing Rubisco for a tune up", "year": "2018", "source": "Nature Plants, vol. 4, no. 1, pp. 12-13pp", "authors": ["Conlan B", "Spencer Whitney"]}, {"title": "Shade compromises the photosynthetic efficiency of NADP-ME less than that of PEP-CK and NAD-ME C4 grasses", "year": "2018", "source": "Journal of Experimental Botany, vol. 69, no. 12, pp. 3053-3068pp", "authors": ["Sonawane B", "Sharwood R", "Spencer Whitney"]}, {"title": "Linking photosynthesis and leaf N allocation under future elevated CO2 and climate warming in Eucalyptus globulus", "year": "2017", "source": "Journal of Experimental Botany, vol. 68, no. 5, pp. 1157-1167", "authors": ["Sharwood R", "Crous K", "Spencer Whitney"]}, {"title": "Improving CO2 Fixation by Enhancing Rubisco Performance", "year": "2017", "source": "in Miguel Alcalde (ed.), Directed Enzyme Evolution: Advances and Applications, Springer, Spain, pp. 101-126pp", "authors": ["Wilson R", "Spencer Whitney"]}, {"title": "The role of Rubisco kinetics and pyrenoid morphology in shaping the CCM of haptophyte microalgae", "year": "2017", "source": "Journal of Experimental Botany, vol. 68, no. 14, pp. 3959-3969", "authors": ["Heureux A", "Young J", "Spencer Whitney"]}, {"title": "Biogenesis and Metabolic Maintenance of Rubisco", "year": "2017", "source": "Annual Review of Plant Biology, vol. 68, pp. 29-60", "authors": ["Bracher A", "Spencer Whitney", "Hartl F"]}, {"title": "Improved analysis of C-4 and C-3 photosynthesis via refined in vitro assays of their carbon fixation biochemistry", "year": "2016", "source": "Journal of Experimental Botany, vol. 67, no. 10, pp. 3137-3148", "authors": ["Sharwood R", "Sonawane B", "Ghannoum O", "Spencer Whitney"]}, {"title": "Prospects for improving CO2 fixation in C-3-crops through understanding C-4-Rubisco biogenesis and catalytic diversity", "year": "2016", "source": "Current Opinion in Plant Biology, vol. 31, pp. 135-142", "authors": ["Sharwood R", "Ghannoum O", "Spencer Whitney"]}, {"title": "Large variation in the Rubisco kinetics of diatoms reveals diversity among their carbon-concentrating mechanisms", "year": "2016", "source": "Journal of Experimental Botany, vol. 67, no. 11, pp. 3445-3456", "authors": ["Young J", "Heureux A", "Sharwood R", "Spencer Whitney"]}, {"title": "Prospects for improving CO2 fixation in C-3-crops through understanding C-4-Rubisco biogenesis and catalytic diversity", "year": "2016", "source": "Current Opinion in Plant Biology, vol. 31, pp. 135-142", "authors": ["Sharwood R", "Ghannoum O", "Spencer Whitney"]}, {"title": "Temperature responses of Rubisco from Paniceae grasses provide opportunities for improving C-3 photosynthesis", "year": "2016", "source": "Nature Plants, vol. 2, no. 12, pp. 16186-16186", "authors": ["Sharwood R", "Ghannoum O", "Kapralov M", "Spencer Whitney"]}, {"title": "Evolving Methanococcoides burtonii archaeal Rubisco for improved photosynthesis and plant growth", "year": "2016", "source": "Scientific Reports, vol. 6, pp. -", "authors": ["Wilson R", "Alonso H", "Spencer Whitney"]}, {"title": "Improving recombinant Rubisco biogenesis, plant photosynthesis and growth by coexpressing its ancillary RAF1 chaperone", "year": "2015", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 112, no. 11, pp. 3564-3569", "authors": ["Spencer Whitney", "Birch R", "Kelso C"]}, {"title": "Photosynthesis: Getting it together for CO2 fixation", "year": "2015", "source": "Nature Plants, vol. 1, pp. -", "authors": ["Wilson R", "Spencer Whitney"]}, {"title": "Photo-oxidation of tyrosine in a bio-engineered bacterioferritin", "year": "2014", "source": "reaction centre'-A protein model for artificial photosynthesis'Biochimica et Biophysica Acta: Bioenergetics, vol. 1837, no. 10, pp. 1821-1834", "authors": ["Hingorani K", "Pace R", "Spencer Whitney"]}, {"title": "Exploiting transplastomically modified Rubisco to rapidly measure natural diversity in its carbon isotope discrimination using tuneable diode laser spectroscopy", "year": "2014", "source": "Journal of Experimental Botany, vol. 65, no. 13, pp. 3759-3767", "authors": ["von Caemmerer S", "Tazoe Y", "Evans J", "Spencer Whitney"]}, {"title": "Plastid Transformation for Rubisco Engineering and Protocols for Assessing Expression", "year": "2014", "source": "in Pal Maliga (ed.), Chloroplast Biotechnology. Methods and Protocols, Humana Press, New York, pp. 245-262", "authors": ["Spencer Whitney", "Sharwood R"]}, {"title": "Correlating Rubisco catalytic and sequence diversity within C3 plants with changes in atmospheric CO2 concentrations", "year": "2014", "source": "Plant Cell and Environment, vol. 37, no. 9, pp. 1981-1984", "authors": ["Sharwood R", "Spencer Whitney"]}, {"title": "dvancing our understanding and capacity to engineer nature", "year": "2011", "source": "s CO2-sequestering enzymeRubisco', Plant Physiology, vol. 155, no. 1, pp. 27-35", "authors": ["Spencer Whitney", "Houtz R", "Alonso H"]}, {"title": "NanoESI Mass Spectrometry of Rubisco and Rubisco Activase Structures and Their Interactions with Nucleotides and Sugar Phosphates", "year": "2011", "source": "Journal of the American Society for Mass Spectrometry, vol. 22, no. 9, pp. 1588-1601", "authors": ["Blayney M", "Spencer Whitney", "Beck J"]}, {"title": "Isoleucine 309 acts as a C4 catalytic switch that increases ribulose-1,5-bisphosphate carboxylase/oxygenase (rubisco) carboxylation rate in Flaveria", "year": "2011", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 108, no. 35, pp. 14688-14693", "authors": ["Spencer Whitney", "Sharwood R", "Orr D"]}, {"title": "Engineering the Sunflower Rubisco Subunits into Tobacco Chloroplasts: New Considerations", "year": "2010", "source": "in Constantin A. Rebeiz et al (ed.), The Chloroplast: Basics and Applications, Springer, Netherlands, pp. 285-306", "authors": ["Sharwood R", "Spencer Whitney"]}, {"title": "Rubisco Oligomers Composed of Linked Small and Large Subunits Assemble in Tobacco Plastids and Have Higher Affinities for CO2 and O2", "year": "2009", "source": "Plant Physiology, vol. 149, no. 4, pp. 1887-1895", "authors": ["Spencer Whitney", "Kane H", "Houtz R"]}, {"title": "Substrate-induced Assembly of Methanococcoides burtonii D-Ribulose-1,5-bisphosphate Carboxylase/Oxygenase Dimers into Decamers", "year": "2009", "source": "Journal of Biological Chemistry, vol. 284, no. 49, pp. 33876-33882", "authors": ["Alonso H", "Blayney M", "Beck J", "Spencer Whitney"]}, {"title": "Different thermal sensitivity of the repair of photodamaged photosynthetic machinery in cultured Symbiodinium species", "year": "2009", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 106, no. 9, pp. 3237-3242", "authors": ["Takahashi S", "Spencer Whitney", "Badger M"]}, {"title": "Heat stress causes inhibition of the de novo synthesis of antenna proteins and photobleaching in cultured Symbiodinium", "year": "2008", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 105, no. 11, pp. 4203-4208", "authors": ["Takahashi S", "Spencer Whitney", "Itoh S"]}, {"title": "Directing the evolution of Rubisco and Rubisco activase: first impressions of a new tool for photosynthesis research", "year": "2008", "source": "Photosynthesis Research, vol. 98, pp. 667-675", "authors": ["Mueller-Cajar O", "Spencer Whitney"]}, {"title": "Evolving improved Synechococcus Rubisco functional expression in Escherichia coli", "year": "2008", "source": "Biochemical Journal, vol. 414, pp. 205-214", "authors": ["Mueller-Cajar O", "Spencer Whitney"]}, {"title": "The effects of Rubisco activase on C4 photosynthesis and metabolism at high temperature", "year": "2008", "source": "Journal of Experimental Botany, vol. 59, no. 7, pp. 1789-1798", "authors": ["Hendrickson L", "Sharwood R", "Ludwig M", "Spencer Whitney"]}, {"title": "The Catalytic properties of hybrid Rubisco comprising tobacco small and sunflower large subunits mirror the kinetically equivalent source rubiscos and can support tobacco growth 1[W][OA]", "year": "2008", "source": "Plant Physiology, vol. 146, no. 1, pp. 83-96", "authors": ["Sharwood R", "von Caemmerer S", "Maliga P", "Spencer Whitney"]}, {"title": "Construction of a tobacco master line to improve Rubisco engineering in chloroplasts", "year": "2008", "source": "Journal of Experimental Botany, vol. 59, no. 7, pp. 1909-1921", "authors": ["Spencer Whitney", "Sharwood R"]}, {"title": "The biochemistry of Rubisco in Flaveria", "year": "2008", "source": "Journal of Experimental Botany, vol. 59, no. 7, pp. 1767-1777", "authors": ["Kublen D", "Spencer Whitney", "Moore P"]}, {"title": "Directed Evolution of Rubisco in Escherichia coli Reveals a Specificity-Determining Hydrogen Bond in the Form 11 Enzyme", "year": "2007", "source": "Biochemistry, vol. 46, pp. 14067-14074", "authors": ["Mueller-Cajar O", "Morell M", "Spencer Whitney"]}, {"title": "nalysis of Carboxysomes from Synechococcus PCC7942 Reveals Multiple Rubisco complexes with Carboxysomal Proteins CcmM and CcaA", "year": "2007", "source": "Journal of Biological Chemistry, vol. 282, no. 40, pp. 29323-29335", "authors": ["Long B", "Badger M", "Spencer Whitney"]}, {"title": "rtificially evolved Synechococcus PCC6301 Rubisco variants exhibit improvements in folding and catalytic efficiency", "year": "2007", "source": "Biochemical Journal, vol. 404, pp. 517-524", "authors": ["Greene D", "Spencer Whitney", "Matsumura I"]}, {"title": "Differences in Carbon Isotope Discrimination of Three Variants of D-Ribulose-1,5-biophosphate Carboxylase/Oxygenase Reflect Differences in Their Catalytic Mechanisms", "year": "2007", "source": "Journal of Biological Chemistry, vol. 282, no. 49, pp. 36068-36076", "authors": ["McNevin D", "Badger M", "Spencer Whitney"]}, {"title": "Linked Rubisco Subunits Can Assemble into Functional Oligomers without Impeding Catalytic Performance", "year": "2007", "source": "Journal of Biological Chemistry, vol. 282, no. 6, pp. 3809-3818", "authors": ["Spencer Whitney", "Sharwood R"]}, {"title": "RbcX can function as a Rubisco-chaperonin, but is non essential in Synechococcus PCC7942", "year": "2006", "source": "Plant and Cell Physiology, vol. 47, no. 12, pp. 1630-1640", "authors": ["Emlyn-Jones D", "Woodger F", "Price G", "Spencer Whitney"]}, {"title": "Synechococcus PCC7942 _ccmM (Cyanophyceae) mutant pseudoreverts to air growth without regaining carboxysomes", "year": "2006", "source": "Journal of Phycology, vol. 42, pp. 769-777", "authors": ["Emlyn-Jones D", "Woodger F", "Andrews T", "Spencer Whitney"]}, {"title": "Manipulating Ribulose Bisphosphate Carboxylase/Oxygenase in the Chloroplasts of Higher Plants", "year": "2005", "source": "in A F Collings and C Critchley (ed.), Artificial Photosynthesis: From Basic Biology to Industrial Application, Wiley-VCH Verlag GMBH, Weinheim, pp. 243-261", "authors": ["Andrews T", "Spencer Whitney"]}, {"title": "Using Deubiquitylating Enzymes as Research Tools", "year": "2005", "source": "in Raymond J. Deshaies (ed.), Ubiquitin and Protein Degradation, Elsevier, California, pp. 540-554", "authors": ["Baker R", "Catanzariti A", "Karunasekara Y", "Spencer Whitney"]}, {"title": "Is coral bleaching due to the instability of the zooxanthellae dark reactions", "year": "2004", "source": "Symbiosis, vol. 37, pp. 137-154", "authors": ["Leggat W", "Spencer Whitney", "Yellowlees D"]}, {"title": "Manipulating ribulose biphosphate carboxylase/oxygenase in the chloroplasts of higher plants", "year": "2003", "source": "Archives of Biochemistry and Biophysics, vol. 414, pp. 159-169", "authors": ["Andrews T", "Spencer Whitney"]}, {"title": "Photosynthesis and growth of tobacco with a substituted bacterial Rubisco mirror the properties of the introduced enzyme", "year": "2003", "source": "Plant Physiology, vol. 133, pp. 287-294", "authors": ["Spencer Whitney", "Andrews T"]}, {"title": "Dinoflagellate symbioses:strategies and adaptation for the acquisition and fixation of inorganic carbon", "year": "2002", "source": "Functional Plant Biology, vol. 29, pp. 309-322", "authors": ["Leggat W", "Marendy E", "Baillie B", "Spencer Whitney"]}, {"title": "Plastome-encoded bacterial ribulose-1,5-bisphosphate carboxylase/oxygenase (RubisCO) supports photosynthesis and growth in tobacco.", "year": "2001", "source": "PNAS - Proceedings of the National Academy of Sciences of the United States of America, vol. 98, pp. 14738-14743", "authors": ["Spencer Whitney", "Andrews T"]}, {"title": "Form 1 Rubiscos from non-green algae are expressed abundantly but not assembled in tobacco chloroplasts", "year": "2001", "source": "The Plant Journal, vol. 26, pp. 535-547", "authors": ["Spencer Whitney", "Baldet P", "Hudson G"]}, {"title": "The gene for the ribulose-1,5-biphosphate carboxylase/oxygenase (Rubisco) small subunit relocated to the plastid genome of tobacco directs the synthesis of small subunits that assemble into Rubisco", "year": "2001", "source": "The Plant Cell, vol. 13, pp. 193-205", "authors": ["Spencer Whitney", "Andrews T"]}, {"title": "Directed mutation of the Rubisco large subunit of Tobacco influences photorespiration and growth", "year": "1999", "source": "Plant Physiology, vol. 121, no. 2, pp. 579-588", "authors": ["Spencer Whitney", "von Caemmerer S", "Hudson G"]}]}, "Microsoft-Academic": [{"title": "ending the backlog", "year": 2013, "source": "", "authors": [{"name": "spencer whitney"}]}], "ANDS-Grants": [{"description": "This project uses new biotechnological tools to improve the performance of the photosynthetic protein Rubisco, the primary carbon dioxide-fixing enzyme in plants. By supercharging photosynthesis, this research will help to boost yield and reduce water and nitrogen use in crops.", "title": "Discovery Projects - Grant ID: DP130103825", "id": "534925", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DP130103825", "researchers": ["Dr Spencer Whitney"], "status": "closed", "fundingAmount": 390000, "fundingScheme": "Discovery Projects", "startDate": 2013, "endDate": 2015, "dateTimeModified": "2015-09-14T03:01:44Z", "dateTimeCreated": "2015-04-15T05:10:02Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP130103825", "identifiers": ["http://purl.org/au-research/grants/arc/DP130103825", "DP130103825"], "subjects": ["BIOCHEMISTRY AND CELL BIOLOGY", "BIOLOGICAL SCIENCES", "enzyme engineering", "plastome transformation", "rubisco"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/534925"}]}, {"description": "ARC Centre of Excellence for Translational Photosynthesis. The ARC Centre of Excellence for Translational Photosynthesis seeks to develop and harness advances in photosynthesis research, crop bioengineering, plant phenomics and computational tools to realise increased and sustainable crop yields, opening new routes to achieving the next revolution in plant productivity. It will deliver improved yield by undertaking a continuum of fundamental and applied photosynthesis research and targeting projects with a high probability of producing increased yield. Links with national and international institutions, consortia and breeding companies will enhance the prospects of translating genetic improvements into crops such as wheat, rice and sorghum for improved yield.", "title": "ARC Centres of Excellences - Grant ID: CE140100015", "id": "518504", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/CE140100015", "researchers": ["Prof Murray Badger", "Prof Susanne Von Caemmerer", "Prof John Evans", "Prof Graham Farquhar", "A/Prof Graeme Price", "A/Prof Spencer Whitney", "Prof Graeme Hammer", "A/Prof David Jordan", "A/Prof Min Chen", "Dr Oula Ghannoum", "Dr Robert Furbank", "Dr William Quick"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 22000000, "fundingScheme": "ARC Centres of Excellences", "startDate": 2014, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:26Z", "dateTimeCreated": "2015-04-12T05:08:04Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/CE140100015", "identifiers": ["http://purl.org/au-research/grants/arc/CE140100015", "CE140100015"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518504"}]}]}