{"ANU": {"name": "Stephen Fairweather", "link": "https://researchers.anu.edu.au/researchers/fairweather-sj", "colleges": "College of Science", "email": "stephen.fairweather@anu.edu.au", "phone": "+612 6197 0048", "expertise": ["Receptors And Membrane Biology"], "interest": ["Membrane Physiology and TransportersProtein-Protein InteractionsElectrophysiologyAmino Acid MetabolismMembrane Transporter PhamacologyProtein Molecular Dynamic Simulations"], "biography": "My research focuses on the biochemistry and physiology of membrane transporter proteins. Membrane transporters exist in all biological membranes and mediate the flux of nutrients, ions, and xenobiotics both in and out of living cells. We use molecular biology, biochemical and analytical chemistry methods for the investigation of structure-activity relationships in these proteins. Current research interests include elucidating the identity, function and importance of amino acid transporters in the major human pathogens from the phylum Apicomplexa: Toxoplasma gondii and Plasmodium spp. I am currently employeed as a post-doctoral scientist in the Laboratory of Assoc. Prof. Giel van Dooren in the Research School of Biology and am enjoying working with the molecular parasitologists, combining the study of isolated transporters with their brilliant expertise in the genetics and cell biology in studying these organisms. I am immensely interested in showing how the intrinsic physical chemistry of membrane transporters are vital for understanding their more obviously manifest biological and physiological roles in the whole organisms. I enjoy very much applying new techniques into the novel setting of membrane physiology. Recently this includes widening our research expertise to incorporate high resolution metabolomic techniques such as GC-QQQ and LC-MS/MS, and the expression of apicomplexan membrane proteins in yeast and X.laevis oocytes for high-resolution functional and structural analysis of these proteins.", "project": [], "publication": [{"title": "Heteromeric Solute Carriers: Function, Structure, Pathology and Pharmacology", "year": "2020", "source": "in JD Ash, RE Anderson, M LaVail, C Bowes Rickman, JG Hollyfield, C Grimm (ed.), Advances in Experimental Medicine and Biology, Springer Singapore, Singapore, pp. 1 - 115", "authors": ["Stephen Fairweather", "Shah N", "Broer S"]}, {"title": "mino acid transporters in the regulation of insulin secretion and signalling", "year": "2019", "source": "Biochemical Society Transactions, vol. 47, no. 2, pp. 571-590", "authors": ["Javed K", "Stephen Fairweather"]}, {"title": "mino Acid Transport Across the Mammalian Intestine", "year": "2019", "source": "Comprehensive Physiology, vol. 9, no. 1, pp. 343-373pp", "authors": ["Broer S", "Stephen Fairweather"]}, {"title": "The tyrosine transporter of Toxoplasma gondii is a member of the newly defined apicomplexan amino acid transporter (ApiAT) family", "year": "2019", "source": "PLoS Pathogens, 15, e1007577", "authors": ["Parker K", "Stephen Fairweather", "Rajendran E"]}, {"title": "Disruption of Amino Acid Homeostasis by Novel ASCT2 Inhibitors Involves Multiple Targets", "year": "2018", "source": "Frontiers in Pharmacology, vol. 9, no. 785, pp. 1-11pp", "authors": ["Broer A", "Stephen Fairweather", "Broer S"]}, {"title": "Identification of novel inhibitors of the amino acid transporter B0AT1 (SLC6A19), a potential target to induce protein restriction and to treat type 2 diabetes", "year": "2017", "source": "British Journal of Pharmacology, vol. 174, no. 6, pp. 468-482pp", "authors": ["Cheng Q", "Shah N", "Broer A", "Stephen Fairweather"]}, {"title": "Cationic amino acid transporters play key roles in the survival and transmission of apicomplexan parasites", "year": "2017", "source": "Nature Communications, 8:14455. doi: 10.1038/ncomms14455", "authors": ["Rajendran E", "Hapuarachchi S", "Miller C", "Stephen Fairweather"]}, {"title": "Loss of functional endothelial connexin40 results in exercise-induced hypertension in mice", "year": "2015", "source": "Hypertension, vol. 65, no. 3, pp. 662-U362", "authors": ["Morton S", "Chaston D", "Howitt L", "Stephen Fairweather"]}, {"title": "Intestinal peptidases form functional complexes with the neutral amino acid transporter B0AT1", "year": "2012", "source": "Biochemical Journal, vol. 446, no. 1, pp. 135-148", "authors": ["Stephen Fairweather", "Broer A", "O'Mara M"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}