{"ANU": {"name": "Stephen Loy", "link": "https://researchers.anu.edu.au/researchers/loy-s", "colleges": "College of Arts and Social Sciences", "email": "stephen.loy@anu.edu.au", "phone": "02 6125 7635", "expertise": ["Musicology And Ethnomusicology"], "interest": ["Stephen's research interests range across a variety of areas, taking in both the study of Western art music of the 19th and 20th centuries, as well as popular music studies. A particular research interest is the interaction between the experimental avant-garde of the 1960s and 1970s and aspects of the popular music of the period. He has worked projects on the following topics:Beethoven reception in compositions of the 1960s and 1970sAspects of German identity in the music of BrahmsAnalytical approaches to the music of Led ZeppelinBook ReviewsReview of Speaking of Music: Addressing the Sonorous. In Musicology Australia, vol. 36 no. 2 (2014): 308-311.Conference Papers\"Mixing Styles into Structure: Contrast in the Creation of Large-scale form in Led Zeppelin's Live Sets.\" International Association for the Study of Popular Music, Australia and New Zealand Branch Conference, University of Otago, Dunedin, December 2014.\"Contrast as Structural Agent: Evaluating intra- and inter-song structure in Led Zeppelin’s concert performances.\" Musicological Society of Australia National Conference, University of Melbourne, December 2014.\"Dynamic and Dramatic Contrast in the Creation of Large-scale Structure in Led Zeppelin's Live Sets.\" Musicological Society of Australia National Conference, Queensland Conservatorium of Music, Griffith University, December 2013.\"Form Through Content in Led Zeppelin's Concert Performances.\" PopMAC: International Conference on Analysing Popular Music, University of Liverpool, UK, July 2013.\"'A Little Late these Days it Seems': Late Style in Presence.\" Musicological Society of Australia National Conference, Australian National University, December 2012.\"Led Zeppelin's 'Dazed and Confused': From Lament to Psychedelic Tour de Force.\" Musicological Society of Australia National Conference, University of Western Australia, December 2011.\"Beethoven and Radicalism: Socio-political Engagement and Awareness of Tradition at the Time of the 1970 Bicentenary.\" Musicological Society of Australia National Conference, University of Western Australia, Perth, December 2011.\"Led Zeppelin's 'Dazed and Confused': From Lament to Psychedelic Tour de Force.\" International Council for Traditional Music Colloquium on Laments, Australian National University, April 2011.\"Music, Activism and Tradition: Louis Andriessen's Nine Symphonies of Beethoven.\" Musicological Society of Australia National Conference, Sydney Conservatorium of Music, University of Sydney, September 2005."], "biography": "Dr Loy completed his doctoral studies at the Sydney Conservatorium of Music, The University of Sydney, in 2006, examining connections between the late 1960s avant-garde and the classical tradition of Beethoven. Other research interests include the music of Brahms, and popular music of the 1960s and 1970s. He has lectured at the Sydney Conservatorium of Music and the University of New South Wales.", "project": [], "publication": [{"title": "Questions of Style and Lateness in Led Zeppelin", "year": "2019", "source": "s Presence'Rock Music Studies, vol. 6, no. 3, pp. 179-197", "authors": ["Stephen Loy"]}, {"title": "Popular Music", "year": "2018", "source": "Stars and StardomANU Press, Canberra", "authors": ["Stephen Loy", "Rickwood J", "Bennett S", "eds"]}, {"title": "Popular Music, Stars and Stardom: Definitions, Discourses, Interpretations", "year": "2018", "source": "in Stephen Loy, Julie Rickwood and Samantha Bennett (ed.), Popular Music, Stars and Stardom, ANU Press, Canberra, pp. 1-20", "authors": ["Stephen Loy", "Rickwood J", "Bennett S"]}, {"title": "Music, Activism and Tradition: Louis Andriessen", "year": "2011", "source": "s Nine Symphonies of Beethoven'Context: Journal of Music Research, vol. 34, no. 2009, pp. 15-34", "authors": ["Stephen Loy"]}]}, "Microsoft-Academic": [{"title": "popular music stars and stardom definitions discourses interpretations", "year": 2018, "source": "", "authors": [{"name": "stephen loy"}, {"name": "julie rickwood"}, {"name": "samantha bennett"}]}, {"title": "the interaction effects between general thinking skills and an interactive graphics based dss to support problem structuring", "year": 1991, "source": "decision sciences", "authors": [{"name": "stephen loy", "affiliation": "eastern kentucky university"}], "id": 177792750}, {"title": "global acceptance of stored value smart cards analysis of inhibitors and facilitators", "year": 2002, "source": "international journal of services technology and management", "authors": [{"name": "grover s kearns", "affiliation": "university of south florida"}, {"name": "stephen loy", "affiliation": "eastern kentucky university"}], "id": 154565395}, {"title": "questions of style and lateness in led zeppelin s presence", "year": 2019, "source": "rock music studies", "authors": [{"name": "stephen loy"}], "id": 2764413913}, {"title": "the case for stored value smart cards analysis of facilitators and inhibitors", "year": 2001, "source": "", "authors": [{"name": "grover s kearns"}, {"name": "stephen loy"}]}, {"title": "popular music stars and stardom", "year": 2018, "source": "", "authors": [{"name": "stephen loy"}, {"name": "julie rickwood"}, {"name": "samantha bennett"}]}, {"title": "the hallelujah effect philosophical reflections on music performance practice and technology", "year": 2015, "source": "musicology australia", "authors": [{"name": "stephen loy"}], "id": 201215587}, {"title": "speaking of music addressing the sonorous", "year": 2014, "source": "musicology australia", "authors": [{"name": "stephen loy"}], "id": 201215587}, {"title": "acute hemodynamic effects following acute and long term resistive training in class ii iii congestive heart failure patients 11 15 am", "year": 1996, "source": "journal of cardiopulmonary rehabilitation", "authors": [{"name": "frances weber"}, {"name": "stephen loy"}, {"name": "karen deegan"}, {"name": "geri perez"}], "id": 175991176}, {"title": "led zeppelin s dazed and confused from lament to psychedelic tour de force", "year": 2013, "source": "humanities research", "authors": [{"name": "stephen loy"}], "id": 2764485006}], "ANDS-Grants": []}