{"ANU": {"name": "Stephanie Goodhew", "link": "https://researchers.anu.edu.au/researchers/goodhew-sc", "colleges": "College of Health & Medicine", "email": "stephanie.goodhew@anu.edu.au", "phone": "", "expertise": ["Psychology"], "interest": ["Key Research Interest: Visual Attention (in particular the  influence of attentional breadth of perception & mechanisms of  regulation)For most people, vision is the primary sensory modality, allowing us  to navigate through the world and interact with it. It is our means of  driving safely through traffic, avoiding obstacles, perceiving food we  want to eat, reading, and recognising the face of a loved one. But at  any given moment, there is far more information available to process in  visual scenes than our brain is capable of processing to the level of  awareness. This means that visual attention has a fundamental triaging  role to play in shaping our perception of the world, by selecting  certain relevant information for privileged processing, while filtering  out other information.In many real-world visual tasks, the size of the spatial area over  which we apply our attentional resources is important. For example, when  driving a car, reading the speedometer requires a narrow focus of  spatial attention, whereas monitoring the road for any movement (e.g.,  child approaching the road, trajectories of other cars) requires a broad  focus. Similarly, when watching a crowd of people, recognising an  individual face requires a narrow focus of attention, while determining  the direction in which the majority of the crowd is moving requires a  broader one.Laboratory research has confirmed that different attended-region  sizes benefit different aspects of visual perception. For example, a  narrow attended-region enhances perceptual acuity for fine spatial  details, whereas a wide one facilitates visual search over multiple  diverse objects. Crucially, the fact that different attended-region  sizes are variably optimal for particular tasks implies that to  successfully support dynamic and complex real-world vision, a critical  task is not just to set a size for spatial attention, but to be able to  flexibly alter (i.e., switch) this size in a rapid and efficient  fashion. For example, attentional re-sizing underlies being able to  quickly alter attended-region size from narrow focus on the speedo to  broad focus on the whole scene to avoid collisions. My research is  largely focussed on examining the perceptual consequences of different  attended-region sizes, identifying which individuals are more efficient  at attentional re-sizing, and whether attentional re-sizing flexibility  is a skill that can be improved or trained.Key Research Interest: Anxiety and AttentionIndividuals with trait anxiety and social anxiety have an attentional  bias toward threatening information in their environment. These biases  appear to not only characterise anxiety, but also to be causally  implicated in its origin and maintenance. For example, when giving a  speech, an individual with social anxiety favours attending to the one  frowning, bored-looking face, while ignoring the neutral or smiling  faces in the crowd. Such selective processing of environment can distort  these individuals' experiences of events, and ultimately exacerbate  their anxiety. I am interested in improving our understanding of the  cognitive processes that underlie such attentional biases. Key Research Interest: The Spatial and Temporal Dynamics of Conscious Object PerceptionThe human visual system is continuously confronted with dynamic  visual input. This means that the system must parse this ongoing input  into discrete objects to transform it into the coherent and stable  visual scene that we consciously perceive. For example, when walking  down a crowded street, there are a large number of people, who are  moving, and can disappear temporarily behind other objects. From this,  the system needs to infer what stimulation belongs to a continuing  object over time (e.g., the same person, despite changes in their  appearance because of viewpoint variation and location), versus what  belongs to distinct objects (e.g., two different people who might occupy  the same location between successive glances).Therefore, the visual  system regularly has to draw an inference of whether input from a given  location belongs to a continuous object identity through time (object  continuity), versus two (or more) separate objects (object  individuation). Such inferences occur before conscious perception, but  ultimately determine our subjective experience of the world. I am  interested in the mechanisms that underlie and influence inferences of  object continuity versus object individuation. To do, I have studied  these questions most extensively via object-substitution masking (OSM).Key Research Interest: Migraine Migraine affects about 1 in 7 people, but about half of those do not  know that they have migraine. I am interested in improving general  knowledge about migraine, its characteristics, and treatments options.  For instance, my recent research revealed that 1 in 5 migraineurs did  not know that there are prescription medications available to help  reduce the frequency and severity of attacks. This means that people are  missing out on available treatments, and may be suffering  unnecessarily. There are also acute medications available which help to  minimise a migraine once it starts. However, these need to be used  sparingly, because over-use of such treatments can lead to rebound  headaches - creating the issue for which treatment is sought. Overuse of  such medications is a common route via which migraines transition from  episodic to chronic. Despite this, my recent found that 1 in 5  migraineurs were not aware of this risk. Again, this calls for public  health campigns to improve migraine awareness."], "biography": "", "project": ["Future Fellowship, The Causes and Consequences of Attentional Re-sizing Flexibility, awarded by the Australian Research Council to Stephanie Goodhew, $756,576 (2017-2021)", "This project aims to investigate the mechanisms of dynamic re-scaling of visual attentional focus. Such changes are critical for task performance, yet to date almost nothing is known about the processes underlying them, other than that they can be slow. Using an innovative cognitive psychology approach integrating individual-differences, experimental, and training frameworks, this project expects to generate new theoretical knowledge about attentional rescaling and insights into how to improve it. The expected practical outcomes include selection and training programs for specific contexts (e.g., athletes). This should provide significant economic benefits, such as optimising performance prior to other costly forms of training.", "Discovery Early Career Researcher Award (DECRA), The Temporal Dynamics of Conscious Object Perception, $371,220.00 (2014-2016)", "We live in a constantly changing visual world. Thus a key inferential challenge that the human brain must solve is whether ongoing visual input represents a single object varying over time (for example, one person moving through a scene), or two distinct objects (for example, two different people successively occupying the same location). This project will investigate, for the first time, how the brain optimises this inference by using information about context, whether the flexibility of the inference process reduces with ageing, and the role of the two main visual pathways in this inference. This will enhance our knowledge of this fundamental process in vision, and our ability to promote optimal functioning into later life."], "publication": [{"title": "The Impact of Scaling Rather Than Shaping Attention: Changes in the Scale of Attention Using Global Motion Inducers Influence Both Spatial and Temporal Acuity", "year": "2020", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 46, no. 3, pp. 313-323", "authors": ["Lawrence R", "Edwards M", "Stephanie Goodhew"]}, {"title": "pplying an individual-differences lens to understanding human cognition", "year": "2020", "source": "Consciousness and Cognition, vol. 79, pp. 1-4", "authors": ["Stephanie Goodhew"]}, {"title": "critical review of the cognitive and perceptual factors influencing attentional scaling and visual processing", "year": "2020", "source": "Psychonomic Bulletin & Review, pp. -", "authors": ["Lawrence R", "Edwards M", "Talipski L", "Stephanie Goodhew"]}, {"title": "Bliss is blue and bleak is grey: Abstract word-colour associations influence objective performance even when not task relevant", "year": "2020", "source": "Acta Psychologica, vol. 206, no. Online, pp. -", "authors": ["Stephanie Goodhew", "Kidd E"]}, {"title": "vigilance avoidance account of spatial selectivity in dual-stream emotion induced blindness", "year": "2020", "source": "Psychonomic Bulletin & Review, vol. Online", "authors": ["Proud M", "Stephanie Goodhew", "Edwards M"]}, {"title": "Migraine Literacy and Treatment in a University Sample", "year": "2019", "source": "SN Comprehensive Clinical Medicine, vol. 1, pp. 749-757", "authors": ["Stephanie Goodhew"]}, {"title": "What was that object? On the role of identity information in the formation of object files and conscious object perception [IN PRESS]", "year": "2019", "source": "Psychological Research", "authors": ["Stephanie Goodhew"]}, {"title": "Flexibility in resizing attentional breadth: Asymmetrical versus symmetrical attentional contraction and expansion costs depends on context.", "year": "2019", "source": "Quarterly Journal of Experimental Psychology, vol. 72, no. 10, pp. 2527-2540", "authors": ["Stephanie Goodhew", "Plummer A"]}, {"title": "Translating experimental paradigms into individual-differences research: Contributions, challenges, and practical recommendations", "year": "2019", "source": "Consciousness and Cognition, vol. 69, pp. 14-25", "authors": ["Stephanie Goodhew", "Edwards M"]}, {"title": "The independence of endogenous attentional orienting and object individuation", "year": "2019", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 45, no. 10, pp. 1389-1398", "authors": ["Stephanie Goodhew"]}, {"title": "The spatial mapping of concepts in English and Mandarin", "year": "2019", "source": "Journal of Cognitive Psychology, vol. 31, no. 7, pp. 703-724", "authors": ["Wu Q", "Kidd E", "Stephanie Goodhew"]}, {"title": "Changes in the spatial spread of attention with ageing", "year": "2018", "source": "Acta Psychologica, vol. 188, pp. 188-199pp", "authors": ["Lawrence R", "Edwards M", "Stephanie Goodhew"]}, {"title": "Temporal dynamics of anxiety-related attentional bias: is affective context a missing piece of the puzzle?", "year": "2018", "source": "Cognition and Emotion, vol. 32, no. 6, pp. 1329-1338pp", "authors": ["Cox J", "Christensen PhD B", "Stephanie Goodhew"]}, {"title": "Caricaturing as a General Method to Improve Poor Face Recognition: Evidence From Low-Resolution Images, Other-Race Faces, and Older Adults", "year": "2018", "source": "Journal of Experimental Psychology: Applied, vol. 25, no. 2, pp. 256-279", "authors": ["Dawel A", "Wong T", "McMorrow J", "Stephanie Goodhew"]}, {"title": "Social anxiety and attentional biases: A top-down contribution?", "year": "2017", "source": "Attention, Perception & Psychophysics, pp. 1-12pp", "authors": ["Delchau H", "Christensen PhD B", "Stephanie Goodhew"]}, {"title": "Objects but not concepts modulate the size of the attended region", "year": "2017", "source": "Quarterly Journal of Experimental Psychology, vol. 70, no. 7, pp. 1353-1365pp", "authors": ["Stephanie Goodhew", "Edwards M"]}, {"title": "Testing the generality of the zoom-lens model: Evidence for visual-pathway specific effects of attended-region size on perception", "year": "2017", "source": "Attention, Perception & Psychophysics, vol. 79, no. 4, pp. 1147-1164", "authors": ["Stephanie Goodhew", "Lawrence R", "Edwards M"]}, {"title": "What have we learned from two decades of object-substitution masking? Time to update: Object individuation prevails over substitution", "year": "2017", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 43, no. 6, pp. 1249-1262", "authors": ["Stephanie Goodhew"]}, {"title": "Language use statistics and prototypical grapheme colours predict synaesthetes", "year": "2017", "source": "and non-synaesthetes' word-colour associations'Acta Psychologica, vol. 173, pp. 73-86pp", "authors": ["Stephanie Goodhew", "Kidd E"]}, {"title": "Review: When Masks Reveal More Than They Hide", "year": "2016", "source": "American Journal of Psychology, vol. 129, no. 3, pp. 350-355pp", "authors": ["Stephanie Goodhew"]}, {"title": "Selective spatial enhancement: Attentional spotlight size impacts spatial but not temporal perception", "year": "2016", "source": "Psychonomic Bulletin & Review, vol. 23, no. 4, pp. 1144-1149pp", "authors": ["Stephanie Goodhew", "Shen E", "Edwards M"]}, {"title": "Categorical information influences conscious perception: An interaction between object-substitution masking and repetition blindness", "year": "2016", "source": "Perception and Psychophysics, vol. 78, no. 4, pp. 1186-1202", "authors": ["Stephanie Goodhew", "Greenwood J", "Edwards M"]}, {"title": "Contributions of parvocellular and magnocellular pathways to visual perception near the hands are not fixed, but can be dynamically altered", "year": "2016", "source": "Psychonomic Bulletin & Review, vol. 23, no. 1, pp. 156-162", "authors": ["Stephanie Goodhew", "Clarke R"]}, {"title": "The conceptual cueing database: Rated items for the study of the interaction between language and attention", "year": "2016", "source": "Behavior Research Methods, vol. 48, no. 3, pp. 1004-1007", "authors": ["Stephanie Goodhew", "Kidd E"]}, {"title": "Object individuation is invariant to attentional diffusion: Changes in the size of the attended region do not interact with object-substitution masking", "year": "2016", "source": "Cognition, vol. 157, pp. 358-364", "authors": ["Stephanie Goodhew", "Edwards M"]}, {"title": "Perceived time slows during fleeting fun or fear", "year": "2016", "source": "Quarterly Journal of Experimental Psychology, vol. 71, no. 2, pp. 562-567pp", "authors": ["Corke M", "Bell J", "Stephanie Goodhew"]}, {"title": "Two objects or one? Similarity rather than complexity determines objecthood when resolving dynamic input", "year": "2015", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 41, no. 1, pp. 102-110", "authors": ["Stephanie Goodhew", "Edwards M", "Delchau H"]}, {"title": "Enhanced semantic priming in synesthetes independent of sensory binding", "year": "2015", "source": "Consciousness and Cognition, vol. 33, pp. 443-456", "authors": ["Stephanie Goodhew", "Freire M", "Edwards M"]}, {"title": "ltered visual perception near the hands: A critical review of attentional and neurophysiological models", "year": "2015", "source": "Neuroscience and Biobehavioral Reviews, vol. 55, pp. 223-233", "authors": ["Stephanie Goodhew", "Edwards M", "Ferber S"]}, {"title": "Setting semantics: Conceptual set can determine the physical properties that capture attention", "year": "2014", "source": "Attention, Perception & Psychophysics, vol. 76, no. 6, pp. 1577-1589", "authors": ["Stephanie Goodhew", "Kendall W", "Ferber S"]}, {"title": "The nature of altered vision near the hands: Evidence for the magnocellular enhancement account from object correspondence through occlusion", "year": "2014", "source": "Psychonomic Bulletin & Review, vol. 21, no. 6, pp. 1452-1458", "authors": ["Stephanie Goodhew", "Fogel N", "Pratt J"]}, {"title": "magnocellular contribution to conscious perception via temporal object segmentation", "year": "2014", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 40, no. 3, pp. 948-959", "authors": ["Stephanie Goodhew", "Delchau H", "Edwards M"]}, {"title": "Why is the sunny side always up? Explaining the spatial mapping of concepts by language use", "year": "2014", "source": "Psychonomic Bulletin & Review, vol. 21, no. 5, pp. 1287-1293", "authors": ["Stephanie Goodhew", "Sinclair B", "Kidd E"]}, {"title": "Reduced Temporal Fusion in Near-Hand Space", "year": "2013", "source": "Psychological Science, vol. 24, no. 6, pp. 891- 900", "authors": ["Stephanie Goodhew", "Gozli D", "Ferber S"]}, {"title": "Ideomotor perception modulates visuospatial cueing", "year": "2013", "source": "Psychological Research, vol. 77, no. 5, pp. 528-539", "authors": ["Gozli D", "Stephanie Goodhew", "Moskowitz J"]}, {"title": "Substituting objects from consciousness: A review of object substitution masking", "year": "2013", "source": "Psychonomic Bulletin & Review, vol. 20, no. 5, pp. 859-877", "authors": ["Stephanie Goodhew", "Pratt J", "Dux P"]}, {"title": "Understanding recovery from object substitution masking", "year": "2012", "source": "Cognition, vol. 122, no. 3, pp. 405-415", "authors": ["Stephanie Goodhew", "Dux P", "Lipp O"]}, {"title": "Implicit semantic perception in object substitution masking", "year": "2011", "source": "Cognition, vol. 118, no. 1, pp. 130-134", "authors": ["Stephanie Goodhew", "Visser T", "Lipp O"]}, {"title": "Competing for Consciousness: Prolonged Mask Exposure Reduces Object Substitution Masking", "year": "2011", "source": "Journal of Experimental Psychology: Human Perception and Performance, vol. 37, no. 2, pp. 588-596", "authors": ["Stephanie Goodhew", "Visser T", "Lipp O"]}]}, "Microsoft-Academic": [{"title": "on the fate of visual stimuli masked by object substitution", "year": 2011, "source": "", "authors": [{"name": "stephanie goodhew"}]}], "ANDS-Grants": [{"description": "We live in a constantly changing visual world. Thus a key inferential challenge that the human brain must solve is whether ongoing visual input represents a single object varying over time (for example, one person moving through a scene), or two distinct objects (for example, two different people successively occupying the same location). This project will investigate, for the first time, how the brain optimises this inference by using information about context, whether the flexibility of the inference process reduces with ageing, and the role of the two main visual pathways in this inference. This will enhance our knowledge of this fundamental process in vision, and our ability to promote optimal functioning into later life.", "title": "Discovery Early Career Researcher Award - Grant ID: DE140101734", "id": "518311", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DE140101734", "researchers": ["Dr Stephanie Goodhew"], "status": "closed", "fundingAmount": 371220, "fundingScheme": "Discovery Early Career Researcher Award", "startDate": 2014, "endDate": 2016, "dateTimeModified": "2016-05-29T08:50:46Z", "dateTimeCreated": "2015-04-12T05:07:48Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DE140101734", "identifiers": ["http://purl.org/au-research/grants/arc/DE140101734", "DE140101734"], "subjects": ["PSYCHOLOGY", "PSYCHOLOGY AND COGNITIVE SCIENCES", "cognitive psychology", "object perception", "visual attention"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518311"}]}, {"description": "This project aims to investigate the mechanisms that underlie people&rsquo;s capacity to rescale the focus of their visual attention. Such rescalings are important because they are linked with people&rsquo;s capacity to perform specific tasks. Using an innovative approach within cognitive psychology that integrates individual differences, experimental, and training frameworks, this project expects to generate new theoretical knowledge about attentional re-scaling and its possible improvement. The expected outcomes include selection and training programs for specific contexts such as training athletes and flight attendants. Economic benefits can be expected through the identification of those who will benefit most from training (reducing waste) and developing cost-effective forms of training which improve task performance.", "title": "Future Fellowships - Grant ID: FT170100021", "id": "1317331", "key": "http://purl.org/au-research/grants/arc/FT170100021", "researchers": ["Dr Stephanie Goodhew"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 756576, "fundingScheme": "Future Fellowships", "startDate": 2017, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:52Z", "dateTimeCreated": "2018-03-06T23:37:43Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/FT170100021", "identifiers": ["http://purl.org/au-research/grants/arc/FT170100021", "FT170100021"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1317331"}]}]}