{"ANU": {"name": "Suhail A. R.  Doi", "link": "https://researchers.anu.edu.au/researchers/doi-sa", "colleges": "College of Health & Medicine", "email": "Suhail.Doi@anu.edu.au", "phone": "+97466001271", "expertise": [], "interest": [], "biography": "Prior to joining the Australian National University Dr Doi was Head of the Clinical Epidemiology Unit, Chair of the Population Health Domain of the School of Medicine, Director of Epidemiology programs  and Associate Professor of Clinical Epidemiology at the University of Queensland. He has also worked as a specialist in endocrinology abroad and continues to do so part time after coming to Australia. He has  published widely and has more than 160 publications listed on PubMed,  written a core text on clinical epidemiology and edited a book on the methods of clinical epidemiology as part of the Springer Series in Epidemiology and Public Health. He is the primary author (with Dr Lukman Thalib) of the  Doi-Thalib method for meta-analysis which was introduced in 2008 as an  alternative to the random effects model. He is also the author of the IVhet model of meta-analysis with Dr Jan Barendregt of the University of Queensland. Dr Doi is an Associate Editor of the journal Clinical Medicine & Research and is a reviewer for several  journals in Endocrinology, Medicine and  Public Health. His interest lies in research that addresses unanswered  questions in patient care as well as questions related to methods of  research design and analysis used in Medicine. Thus his research focuses  on patient care topics such as epidemiology, prognosis and treatments of  disease as well as methodology especially that related to meta-analysis.  Specific interests lie in the clinical epidemiology of polycystic ovary  syndrome (his group was responsible for defining its pathophysiology in  2005-2006), clinical epidemiologic methods to evaluate prognosis and  treatment, pharmacoepidemiologic studies, and population based studies  of cancer epidemiology. He has a specific methodologic interest in the  refinement and proper use of the meta-analysis methodologies and would  welcome inquiries from graduate students interested in this area.", "project": [], "publication": [{"title": "Efficacy of anthelminthic drugs and drug combinations against soil-transmitted helminths: a systematic review and network meta-analysis", "year": "2019", "source": "Clinical Infectious Diseases, vol. 68, no. 1, pp. 96-105", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Effectiveness of Market-Level Biosecurity at Reducing Exposure of Poultry and Humans to Avian Influenza: A Systematic Review and Meta-Analysis", "year": "2018", "source": "The Journal of Infectious Diseases, vol. 218, no. 12, pp. 1861-1875", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "new improved graphical and quantitative method for detecting bias in meta-analysis", "year": "2018", "source": "International Journal of Evidence-based Healthcare, vol. 16, no. 4, pp. 195-203", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Comparative effectiveness of malaria prevention measures: A systematic review and network meta-analysis", "year": "2018", "source": "Parasites and Vectors, vol. 11, pp. 1-13pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Hospital effect on infections after four major surgical procedures: outlier and volume-outcome analysis using all-inclusive state data", "year": "2017", "source": "Journal of Hospital Infection, vol. 97, no. 2, pp. 115-121pp.", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Hydroxyvitamin D Concentrations and Clostridium difficile Infection: A Meta-Analysis", "year": "2017", "source": "Journal of Parenteral and enteral nutrition, vol. 41, no. 5, pp. 890-895pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Frequency of adjustment with comorbidity and illness severity scores and indices in cardiac arrest research", "year": "2017", "source": "Resuscitation, vol. 110, pp. 56-73pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Validation of the 6-Month GRACE Score in Predicting 1-Year Mortality of Patients with Acute Coronary Syndrome Admitted to the Arabian Gulf Hospitals", "year": "2017", "source": "Angiology, vol. 68, no. 3, pp. 251-256", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Total temporomandibular joint replacement prostheses: a systematic review and bias-adjusted meta-analysis", "year": "2017", "source": "International Journal of Oral and Maxillofacial Surgery, vol. 46, no. 1, pp. 86-92pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Geographical outcome disparities in infection occurrence after colorectal surgery: An analysis of 58,096 colorectal surgical procedures", "year": "2017", "source": "International Journal of Surgery, vol. 44, pp. 117-121pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Pertussis toxin IgA testing over-diagnoses recent pertussis infection", "year": "2017", "source": "Pathology, vol. 49, no. 7, pp. 770-775", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Effect of Immediate Administration of Antibiotics in Patients With Sepsis in Tertiary Care: A Systematic Review and Meta-analysis", "year": "2017", "source": "Clinical Therapeutics, vol. 39, no. 1, pp. 190-202", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Clostridium Difficile Infection and Risk of Colectomy in Patients With Inflammatory Bowel Disease: A Bias-Adjusted Meta-Analysis", "year": "2017", "source": "Inflammatory Bowel Diseases, vol. 23, no. 2, pp. 200-207", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Upper Versus Lower Gastrointestinal Delivery for Transplantation of Fecal Microbiota in Recurrent or Refractory Clostridium difficile Infection: A Collaborative Analysis of Individual Patient Data From 14 Studies", "year": "2017", "source": "Journal of Clinical Gastroenterology, vol. 51, no. 2, pp. 145-150pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Differential effect of mass deworming and targeted deworming for soil-transmitted helminth control in children: a systematic review and meta-analysis", "year": "2017", "source": "Lancet, vol. 389, no. 10066, pp. 287-297", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The expansion of soil-transmitted helminth control strategies - Authors", "year": "2017", "source": "reply'Lancet, vol. 389, no. 10085, pp. 2191-2191", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prospective Associations between Depression and Obesity for Adolescent Males and Females- A Systematic Review and Meta-Analysis of Longitudinal Studies", "year": "2016", "source": "PLOS ONE (Public Library of Science), vol. 11, no. 6, pp. 18pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The global distribution of comorbid depression and anxiety in people with diabetes mellitus: Risk-adjusted estimates", "year": "2016", "source": "Archives of Pharmacy Practice, vol. 7, no. 3, pp. 80-86", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Exploring Gender Difference in Sleep Quality of Young Adults: Findings from a Large Population Study", "year": "2016", "source": "Clinical Medicine and Research, vol. 14, no. 3-4, pp. 138-144pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "n Improved Classification of Kidney Function Recovery Using Estimated Glomerular Filtration Rate Slope Post-transplantation", "year": "2016", "source": "Transplantation Proceedings, vol. 48, no. 6, pp. 1993-1995", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Evidence based Decision and Meta-Analysis with Applications in Cancer Research Studies", "year": "2016", "source": "Applied Mathematics and Information Sciences, vol. 10, no. 3, pp. 815-822", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Can atorvastatin with metformin change the natural history of prostate cancer as characterized by molecular, metabolomic, imaging and pathological variables? A randomized controlled trial protocol", "year": "2016", "source": "Contemporary Clinical Trials, vol. 50, pp. 16-20", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Sleep quality and obesity in young subjects: A meta-analysis", "year": "2016", "source": "Obesity Reviews, vol. 17, no. 11, pp. 1154-1166", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prevalence of differentiated thyroid cancer in autopsy studies over six decades: A meta-analysis", "year": "2016", "source": "Journal of Clinical Oncology, vol. 34, no. 30, pp. 3672-3679", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prostate-based biofluids for the detection of prostate cancer: A comparative study of the diagnostic performance of cell-sourced RNA biomarkers", "year": "2016", "source": "Prostate International, vol. 4, no. 3, pp. 97-102", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "QE or RE? A bias adjusted weighting procedure for meta-analysis", "year": "2016", "source": "Chinese Journal of Evidence-based medicine, vol. 16, no. 5, pp. 612-616", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The McGill Brisbane Symptom Score in relation to survival in pancreatic adenocarcinoma: a validation study", "year": "2016", "source": "Cancer Causes and Control, vol. 27, no. 7, pp. 941-946", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Patient Assessment of Chronic Illness Care (PACIC) in Type 2 Diabetes: A Longitudinal Study", "year": "2016", "source": "Evaluation and the Health Professions, vol. 39, no. 2, pp. 185-203", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Is there a bi-directional relationship between depression and obesity among adult men and women? Systematic review and bias-adjusted meta analysis", "year": "2016", "source": "Asian Journal of Psychiatry, vol. 21, pp. 51-66", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Influence of patient-assessed quality of chronic illness care and patient activation on health-related quality of life", "year": "2016", "source": "International Journal for Quality in Health Care, vol. 28, no. 3, pp. 306-310", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Parent and adolescent reports in assessing adolescent sleep problems: Results from a large population study", "year": "2016", "source": "Acta Paediatrica, vol. 105, no. 9, pp. e433-e439", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Trends in brain-dead organ donor characteristics: a 13-year analysis", "year": "2016", "source": "Canadian Journal of Surgery, vol. 59, no. 3, pp. 154-160", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Validation of the CoRE Questionnaire for a Medical Journal Peer Review", "year": "2016", "source": "Accountability in Research, vol. 23, no. 1, pp. 47-52", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The global burden of major infectious complications following prostate biopsy", "year": "2016", "source": "Epidemiology and Infection, vol. 144, no. 8, pp. 1784-1791", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Transient Hypothyroidism After Radioiodine for Graves", "year": "2016", "source": "Disease: Challenges in Interpreting Thyroid Function Tests'Clinical Medicine and Research, vol. 14, no. 1, pp. 40-45", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Selection of the appropriate binary effect measure for the correct interpretation in meta-analysis", "year": "2016", "source": "International Journal of Cardiology, vol. 202, pp. 467-468pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "ssociation between patient activation and patient-assessed quality of care in type 2 diabetes: Results of a longitudinal study", "year": "2016", "source": "Health Expectations, vol. 19, no. 2, pp. 356-366", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prostate biopsy, targeted prophylaxis and infectious complications: A critique of methods used", "year": "2016", "source": "BJU International, vol. 117, no. 5, pp. 719-721", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "n evidence-based scale for the antecedents of depressive symptoms in Australian adults", "year": "2016", "source": "Australasian Psychiatry, vol. 24, no. 5, pp. 466-469", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Complexities and Perplexities: A Critical Appraisal of the Evidence for Soil-Transmitted Helminth Infection-Related Morbidity", "year": "2016", "source": "PLoS Neglected Tropical Diseases, vol. 10, no. 5, pp. e0004566-e0004566", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Intermittent Versus Daily Pulmonary Tuberculosis Treatment Regimens: A Meta-Analysis", "year": "2015", "source": "Clinical Medicine and Research, vol. 13, no. 3-4, pp. 117-138", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Longitudinal impact of sleep on overweight and obesity in children and adolescents: A systematic review and bias-adjusted meta-analysis", "year": "2015", "source": "Obesity Reviews, vol. 16, no. 2, pp. 137-149", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The Burden of Non-Adherence to Cardiovascular Medications Among the Aging Population in Australia: A Meta-Analysis", "year": "2015", "source": "Drugs and Aging, vol. 32, no. 3, pp. 217-225", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Survival Comparisons for Breast Conserving Surgery and Mastectomy Revisited: Community Experience and the Role of Radiation Therapy", "year": "2015", "source": "Clinical Medicine and Research, vol. 13, no. 2, pp. 65-73", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Caesarean delivery and the risk of offspring overweight and obesity over the life course: a systematic review and bias-adjusted meta-analysis", "year": "2015", "source": "Clinical Obesity, vol. 5, no. 6, pp. 293-301pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The impact of concordant and discordant comorbidities on patient-assessed quality of diabetes care", "year": "2015", "source": "Health Expectations, vol. 18, no. 5, pp. 1621-1632", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Joint influence of patient-assessed chronic illness care and patient activation on glycaemic control in type 2 diabetes", "year": "2015", "source": "International Journal for Quality in Health Care, vol. 27, no. 2, pp. 117-124", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Diagnostic Performance of Expression of PCA3, Hepsin and miR Biomarkers Inejaculate in Combination With Serum PSA for the Detection of Prostate Cancer", "year": "2015", "source": "Prostate, vol. 75, no. 5, pp. 539-549", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prevalence of osteoporosis in prostate cancer survivors II: a meta-analysis of men not on androgen deprivation therapy", "year": "2015", "source": "Endocrine, vol. 50, no. 2, pp. 344-354", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Wrist acupressure for post-operative nausea and vomiting (WrAP): A pilot study", "year": "2015", "source": "Complementary Therapies in Medicine, vol. 23, no. 3, pp. 372-380", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prostatic urethral lift improves urinary symptoms and flow while preserving sexual function for men with benign prostatic hyperplasia: A systematic review and meta-analysis", "year": "2015", "source": "European Urology, vol. 67, no. 4, pp. 704-713", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "dvances in the meta-analysis of heterogeneous clinical trials II: The quality effects model", "year": "2015", "source": "Contemporary Clinical Trials, vol. 45, no. -, pp. 123-129", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "systematic review and meta-analysis of the effects of Qigong and Tai Chi for depressive symptoms", "year": "2015", "source": "Complementary Therapies in Medicine, vol. 23, no. 4, pp. 516-534", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The effect of right ventricular apical and nonapical pacing on the short- and long-term changes in left ventricular ejection fraction: a systematic review and meta-analysis of randomized-controlled trials", "year": "2015", "source": "PACE - Pacing and Clinical Electrophysiology, vol. 38, no. 9, pp. 1121-1136", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Re: Marlon Perera, Matthew J. Roberts, Suhail A.R. Doi, Damien Bolton. Prostatic Urethral Lift Improves Urinary Symptoms and Flow While Preserving Sexual Function for Men with Benign Prostatic Hyperplasia: A Systematic Review and Meta-analysis. Eur Urol 2", "year": "2015", "source": "European Urology, vol. 68, no. 3, pp. E53-E54", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Simulation Comparison of the Quality Effects and Random Effects Methods of Meta-analysis", "year": "2015", "source": "Epidemiology, vol. 26, no. 4, pp. e42-e44", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "comparison of univariate and bivariate models in meta-analysis of diagnostic accuracy studies", "year": "2015", "source": "International Journal of Evidence-based Healthcare, vol. 13, no. 1, pp. 28-34", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The Impact of Acupuncture on Neurological Recovery in Spinal Cord Injury: A Systematic Review and Meta-Analysis", "year": "2015", "source": "Journal of Neurotrauma, vol. 32, no. 24, pp. 1943-1957", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Examination of the fasting and 2-h plasma glucose in the light of impairment in beta-cell function: what does the epidemiological data tell us?", "year": "2015", "source": "Endocrine, vol. 48, no. 1, pp. 170-178", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Comorbidities, Exposure to Medications, and the Risk of Community-Acquired Clostridium difficile Infection: a systematic review and meta-analysis", "year": "2015", "source": "Infection Control and Hospital Epidemiology, vol. 36, no. 2, pp. 132-141pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Meta-analysis and the problem of inconsistent effects", "year": "2015", "source": "International Journal of Evidence-based Healthcare, vol. 13, no. 3, pp. 115-116", "authors": ["Suhail A. R.  Doi"]}, {"title": "dvances in the meta-analysis of heterogeneous clinical trials I: The inverse variance heterogeneity model.", "year": "2015", "source": "Contemporary Clinical Trials", "authors": ["Suhail A. R.  Doi"]}, {"title": "Breast cancer incidence before and after diagnosis of type 2 diabetes mellitus in women: Increased risk in the prediabetes phase", "year": "2014", "source": "European Journal of Cancer Prevention, vol. 23, no. 2, pp. 76-83", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "n Updated Method for Risk Adjustment in Outcomes Research", "year": "2014", "source": "Value in Health, vol. 17, no. 5, pp. 629-633", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Human seminal fluid as a source of prostate cancer-specific microRNA biomarkers", "year": "2014", "source": "Endocrine-Related Cancer, vol. 21, no. 4, pp. L17-L21", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prevalence of overweight and obesity among children and adolescents of the indian subcontinent: A meta-analysis", "year": "2014", "source": "Nutrition Reviews, vol. 72, no. 8, pp. 541-550", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Geographical and seasonal barriers to mammography services and breast cancer stage at diagnosis", "year": "2014", "source": "Rural and Remote Health, vol. 14, no. 3, pp. -", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Estrogen and selective estrogen receptor modulators (SERMs) for the treatment of acromegaly: A meta-analysis of published observational studies", "year": "2014", "source": "Pituitary, vol. 17, no. 3, pp. 284-295", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The outcome with higher baseline risk should be selected for relative risk in clinical studies: A proposal for change to practice", "year": "2014", "source": "Journal of Clinical Epidemiology, vol. 67, no. 4, pp. 364-367", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "McGill Brisbane Symptom Score for patients with resectable pancreatic head adenocarcinoma", "year": "2014", "source": "World Journal of Gastroenterology, vol. 20, no. 34, pp. 12226-12232", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Empirical versus natural weighting in random effects meta-analysis", "year": "2014", "source": "Statistics in Medicine, vol. 33, no. 7, pp. 1259-1259", "authors": ["Suhail A. R.  Doi"]}, {"title": "Validation of the QTNM staging system for cancer-specific survival in patients with differentiated thyroid cancer", "year": "2014", "source": "Endocrine, vol. 46, no. 2, pp. 300-308", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "PC6 acupoint stimulation for the prevention of postcardiac surgery nausea and vomiting: A protocol for a two-group, parallel, superiority randomised clinical trial", "year": "2014", "source": "BMJ Open, vol. 4, no. 11", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Core-Item Reviewer Evaluation (CoRE) System for Manuscript Peer Review", "year": "2014", "source": "Accountability in Research, vol. 21, no. 2, pp. 109-121", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "novel method for studying the temporal relationship between type 2 diabetes mellitus and cancer using the electronic medical record", "year": "2014", "source": "BMC Medical Informatics and Decision Making, vol. 14, pp. 1-9", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Baseline prevalence of antimicrobial resistance and subsequent infection following prostate biopsy using empirical or altered prophylaxis: A bias-adjusted meta-analysis", "year": "2014", "source": "International Journal of Antimicrobial Agents, vol. 43, no. 4, pp. 301-309", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Type 2 diabetes mellitus, glycemic control, and cancer risk", "year": "2014", "source": "European Journal of Cancer Prevention, vol. 23, no. 2, pp. 134-140", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prevalence of osteoporosis in prostate cancer survivors: A meta-analysis", "year": "2014", "source": "Endocrine, vol. 45, no. 3, pp. 370-381", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Re: 24-hour urinary calcium in primary hyperparathyroidism; black et al", "year": "2014", "source": "Clinical Medicine and Research, vol. 12, no. 1-2, pp. 5-5", "authors": ["Suhail A. R.  Doi"]}, {"title": "Evidence synthesis for medical decision making and the appropriate use of quality scores", "year": "2014", "source": "Clinical Medicine and Research, vol. 12, no. 1-2, pp. 40-46", "authors": ["Suhail A. R.  Doi"]}, {"title": "Putting the diabetes risk due to statins in perspective: A re-evaluation using the complementary outcome", "year": "2014", "source": "Nutrition Metabolim and Cardiovascular Diseases, vol. 24, no. 7, pp. 705-708", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Gestational weight gain in relation to offspring obesity over the life course: a systematic review and bias- adjusted meta- analysis", "year": "2014", "source": "Obesity Reviews, vol. 15, no. 4, pp. 338-347", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "irways in out-of-hospital cardiac arrest: Systematic review and meta-analysis", "year": "2014", "source": "Prehospital Emergency Care, vol. 18, no. 2, pp. 244-256", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "The Effects of the Timing of Spinal Surgery after Traumatic Spinal Cord Injury: A Systematic Review and Meta-Analysis", "year": "2013", "source": "Journal of Neurotrauma, vol. 30, no. 21, pp. 1781-1794", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Smoking behaviour in pregnancy and its impact on smoking cessation at various intervals during follow-up over 21 years: A prospective cohort study", "year": "2013", "source": "BJOG - an international journal of Obstetrics and Gynaecology, vol. 120, no. 3, pp. 288-296", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Randomized clinical trial of the impact of insulin therapy on liver function in patients undergoing major liver resection", "year": "2013", "source": "British Journal of Surgery, vol. 100, no. 5, pp. 610-618", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Mammography Utilization: Patient Characteristics and Breast Cancer Stage at Diagnosis", "year": "2013", "source": "American Journal of Roentgenology, vol. 201, no. 5, pp. 1057-1063", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Pancreatic cancer and predictors of survival: Comparing the CA 19-9/bilirubin ratio with the McGill Brisbane Symptom Score", "year": "2013", "source": "Hepato Pancreato Biliary (HPB), vol. 15, no. 12, pp. 1002-1009", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Population impact of depression either as a risk factor or consequence of type 2 diabetes in adults: A meta-analysis of longitudinal studies", "year": "2013", "source": "Asian Journal of Psychiatry, vol. 6, no. 6, pp. 460-472", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Reliability of Reviewer Ratings in the Manuscript Peer Review Process: An Opportunity for Improvement", "year": "2013", "source": "Accountability in Research, vol. 20, no. 4, pp. 270-284", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Concordance of the late night salivary cortisol in patients with Cushing", "year": "2013", "source": "s syndrome and elevated urine-free cortisol'Endocrine, vol. 43, no. 2, pp. 327-333", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Breast and prostate cancer survivors in a diabetic cohort: Results from the living with diabetes study", "year": "2013", "source": "Clinical Medicine and Research, vol. 11, no. 4, pp. 210-218", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prostate Cancer Risk in Pre-Diabetic Men: A Matched Cohort Study", "year": "2013", "source": "Clinical Medicine and Research, vol. 11, no. 4, pp. 201-209", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Meta-analysis of prevalence", "year": "2013", "source": "Journal of Epidemiology and Community Health, vol. 67, no. 11, pp. 974-978", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Increased Risk of Colon Cancer in Men in the Pre-Diabetes Phase", "year": "2013", "source": "PLOS ONE (Public Library of Science), vol. 8, no. 8, pp. 1-10", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Measuring population-based diabetes-related mortality: A summary of requirements", "year": "2013", "source": "Journal of Clinical Epidemiology, vol. 66, no. 2, pp. 237-238", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Relationship between Factor V Leiden mutation and venous thromboembolism in patients with breast cancer treated with tamoxifen", "year": "2013", "source": "Thrombosis Research, vol. 131, no. 6, pp. 567-568", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Meta-analysis of heterogeneous clinical trials: An empirical example (vol 32, pg 288, 2011)", "year": "2013", "source": "Contemporary Clinical Trials, vol. 34, no. 1, pp. 35-35", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "dequate Lymph Node Recovery Improves Survival in Colorectal Cancer Patients", "year": "2013", "source": "Journal of Surgical Oncology, vol. 107, no. 8, pp. 828-834", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Methods for the bias adjustment of meta-analyses of published observational studies", "year": "2013", "source": "Journal of Evaluation in Clinical Practice, vol. 19, no. 4, pp. 653-657", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Not PEDro", "year": "2013", "source": "s bias: Summary quality scores can be used in meta-analysis'Journal of Clinical Epidemiology, vol. 66, no. 8, pp. 940-941", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "ssociation between weight gain during pregnancy and postpartum weight retention and obesity: A bias-adjusted meta-analysis", "year": "2013", "source": "Nutrition Reviews, vol. 71, no. 6, pp. 343-352", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Cutaneous markers of photo-damage and risk of basal cell carcinoma of the skin: A meta-analysis", "year": "2013", "source": "Cancer Epidemiology, Biomarkers and Prevention, vol. 22, no. 9, pp. 1483-1489", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "ssociation of Hashimoto", "year": "2013", "source": "s thyroiditis with cytotoxic T lymphocyte-associated antigen-4 (CTLA-4) and inducible co-stimulator (ICOS) genes in a Kuwaiti population'Endocrine, vol. 43, no. 3, pp. 666-677", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Mental health issues decrease diabetes-specific quality of life independent of glycaemic control and complications: findings from Australia", "year": "2013", "source": "s living with diabetes cohort study'Health and Quality of Life Outcomes, vol. 11, no. 170, pp. -", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Mortality from diabetic renal disease: A hidden epidemic", "year": "2012", "source": "European Journal of Public Health, vol. 22, no. 2, pp. 280-284", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Cancer risk after medical exposure to radioactive iodine in benign thyroid diseases: A meta-analysis", "year": "2012", "source": "Endocrine-Related Cancer, vol. 19, no. 5, pp. 645-655", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Diabetes and cancer I: Risk, survival, and implications for screening", "year": "2012", "source": "Cancer Causes and Control, vol. 23, no. 6, pp. 967-981", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Clustering of venous thrombosis events at the start of tamoxifen therapy in breast cancer: A population-based experience", "year": "2012", "source": "Thrombosis Research, vol. 130, no. 1, pp. 27-31", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "High-sensitivity C-reactive protein (hs-CRP) as a biomarker for trastuzumab-induced cardiotoxicity in HER2-positive early-stage breast cancer: A pilot study", "year": "2012", "source": "Breast Cancer Research and Treatment, vol. 134, no. 1, pp. 291-298", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Systematic review and meta-analysis of the effect of North American working hours restrictions on mortality and morbidity in surgical patients", "year": "2012", "source": "British Journal of Surgery, vol. 99, no. 3, pp. 336-344", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Recent data regarding low versus high 131I activity for remnant ablation in differentiated thyroid cancer are not generalizable beyond eligibility criteria", "year": "2012", "source": "Nuclear Medicine Communications, vol. 33, no. 11, pp. 1217-1218pp", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Prospective Evaluation of an Australian Pertussis Toxin IgG and IgA Enzyme Immunoassay", "year": "2012", "source": "Clinical and Vaccine Immunology, vol. 19, no. 2, pp. 190-197", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "ECT efficacy and treatment course: A systematic review and meta-analysis of twice vs thrice weekly schedules", "year": "2012", "source": "Journal of Affective Disorders, vol. 138, no. 1-2, pp. 1-8", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Diabetes and cancer II: Role of diabetes medications and influence of shared risk factors", "year": "2012", "source": "Cancer Causes and Control, vol. 23, no. 7, pp. 991-1008", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Impact of obesity on reproductive outcomes after ovarian ablative therapy in PCOS: A collaborative meta-analysis", "year": "2012", "source": "Reproductive BioMedicine Online, vol. 25, no. 3, pp. 227-241", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "High-dose insulin therapy reduces postoperative liver dysfunction and complications in liver resection patients through reduced apoptosis and altered inflammation", "year": "2012", "source": "Journal of Clinical Endocrinology and Metabolism, vol. 97, no. 1, pp. 217-226", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Complications of ureterovesical anastomosis in adult renal transplantation: Comparison of the Lich-Gregoire and the Taguchi techniques", "year": "2011", "source": "Annals of transplantation : quarterly of the Polish Transplantation Society, vol. 16, no. 3, pp. 82-87", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Meta-analysis of heterogeneous clinical trials: An empirical example", "year": "2011", "source": "Contemporary Clinical Trials, vol. 32, no. 2, pp. 288-298", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Impact of the sentinel node frozen section result on the probability of additional nodal metastases as predicted by the MSKCC nomogram in breast cancer", "year": "2011", "source": "Japanese Journal of Clinical Oncology, vol. 41, no. 3, pp. 314-319", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Effect of the ACGME duty hours restrictions on surgical residents and faculty: A systematic review", "year": "2011", "source": "Academic Medicine, vol. 86, no. 1, pp. 34-42", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Combining heterogenous studies using the random-effects model is a mistake and leads to inconclusive meta-analyses", "year": "2011", "source": "Journal of Clinical Epidemiology, vol. 64, no. 2, pp. 119-123", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Screening for diabetes in kuwait and evaluation of risk scores [D?pistage du diab?te au kowe?t et ?valuation des scores de risque]", "year": "2010", "source": "Eastern Mediterranean Health Journal, vol. 16, no. 7, pp. 725-731", "authors": ["Suhail A. R.  Doi"]}, {"title": "Is cerebrospinal fluid leptin altered in idiopathic intracranial hypertension?", "year": "2010", "source": "Clinical Endocrinology, vol. 72, no. 6, pp. 851-852", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Total thyroidectomy followed by postsurgical remnant ablation may improve cancer specific survival in differentiated thyroid carcinoma", "year": "2010", "source": "Clinical Nuclear Medicine, vol. 35, no. 6, pp. 396-399", "authors": ["Suhail A. R.  Doi"]}, {"title": "Unresectable pancreatic adenocarcinoma: do we know who survives?", "year": "2010", "source": "Hepato Pancreato Biliary (HPB), vol. 12, no. 8, pp. 561-566", "authors": ["Suhail A. R.  Doi"]}, {"title": "The influence of methodologic quality on the conclusion of a landmark meta-analysis on thrombolytic therapy", "year": "2009", "source": "International Journal of Technology Assessment in Health Care, vol. 25, no. 1, pp. 107-109", "authors": ["Suhail A. R.  Doi"]}, {"title": "Cardiovascular outcomes in high-risk patients without heart failure treated with ARBs: A systematic review and meta-analysis", "year": "2009", "source": "American Journal of Cardiovascular Drugs, vol. 9, no. 1, pp. 29-43", "authors": ["Suhail A. R.  Doi"]}, {"title": "n alternative quality adjustor for the quality effects model for meta-analysis", "year": "2009", "source": "Epidemiology, vol. 20, no. 2, pp. 314-", "authors": ["Suhail A. R.  Doi"]}, {"title": "Simplifying the TNM system for clinical use in differentiated thyroid cancer", "year": "2009", "source": "Journal of Clinical Oncology, vol. 27, no. 11, pp. 1872-1878", "authors": ["Suhail A. R.  Doi", "Suhail A. R.  Doi"]}, {"title": "Towards a rational classification of polycystic ovary syndrome [Hacia una clasificacion racional del sindrome de ovarios poliquisticos]", "year": "2009", "source": "Salud (i) Ciencia, vol. 16, no. 7, pp. 769-773", "authors": ["Suhail A. R.  Doi"]}, {"title": "Modelling Methodologic Quality into Meta-Analyses and Pitfalls of Not Doing This", "year": "2009", "source": "Annals of Thoracic Surgery, vol. 87, no. 3, pp. 985-986", "authors": ["Suhail A. R.  Doi"]}, {"title": "uthor reply", "year": "2009", "source": "Clinical Medicine and Research, vol. 7, no. 1-2, pp. 2-3", "authors": ["Suhail A. R.  Doi"]}, {"title": "Evidence-based practice among primary care physicians in Kuwait", "year": "2009", "source": "Journal of Evaluation in Clinical Practice, vol. 15, no. 6, pp. 1125-1130", "authors": ["Suhail A. R.  Doi"]}, {"title": "Perception of the educational environment by medical students undergoing a curricular transition in Kuwait", "year": "2009", "source": "Medical Principles and Practice, vol. 18, no. 3, pp. 204-208", "authors": ["Suhail A. R.  Doi"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}