{"ANU": {"name": "Susan  Harris Rimmer", "link": "https://researchers.anu.edu.au/researchers/harris-rimmer-sg", "colleges": "College of Asia & the Pacific", "email": "", "phone": "6125 2177", "expertise": ["Gender Specific Studies", "Human Rights Law", "International Law Excl. International Trade Law", "International Relations", "Government And Politics Of Asia And The Pacific"], "interest": ["Transitional Justice - Timor Leste, Afghanistan, MyanmarFeminist approaches to international lawRefugee and Migration LawInternational Humanitarian LawInternational Aid and DevelopmentRegional Diplomacy - MIKTA, IORA, ASEAN, APECPublic Diplomacy, E-diplomacyFeminist Approaches to DiplomacyThe G20The Security CouncilNational SecurityHuman RightsWomen's Social PolicyTransnational Civil Society Movements"], "biography": "", "project": ["Vision 2012-2015", "Channel 9 morning news – Hillary Clinton campaign - http://www.9jumpin.com.au/show/mornings/videos/4171569990001/", "Putting Gender on the G20 agenda - https://www.youtube.com/watch?v=uGt853XIjzY", "Y20: Big decisions for Young People at the G20 - http://eyelevel.com.au/Y20/topics/g20-y20-and-the-big-decisions-for-young-people/", "Equality: The linchpin of successful development? - One Just World  - http://www.onejustworld.com.au/forums/Equality-The-Linchpin-of-Successful-Development", "Diplomacy in the Internet Age - http://www.youtube.com/watch?v=_NH3dVt73OE", "Australia on the Security Council: Strategies to advance the Women Peace and Security agenda - http://www.youtube.com/watch?v=3uVJigtE3Xo&feature=youtu.be", "What is the G20 and why does it matter - GB TImes - http://www.youtube.com/watch?v=03Ka9JEDNgE", "Why should we care about the G20 - Sky News - http://www.youtube.com/watch?v=LgcOSi4npAo", "Children of the Afghan War - National Press Club, ABC Big Ideas - http://www.abc.net.au/tv/bigideas/stories/2011/05/05/3208933.htm", "Why refugee law is difficult, even without the politics - Wheeler Centre - http://wheelercentre.com/videos/video/lunchbox-soapbox-susan-harris-rimmer-on-why-refugee-law-is-difficult-even-without-the-politics/", "", "Opinion Pieces", "2015", "Why Australia should have joined AIIB – Lowy Interpreter - 30 March 2015 - http://www.lowyinterpreter.org/post/2015/03/30/Why-Australia-should-have-joined-the-AIIB-last-November.aspx", "Opinion for ASEAN Insights Bulletin - Indonesian soft power in ASEAN and beyond", "", "2014", "Julie Bishop needs the company of other women in Cabinet, Canberra Times, 2 December 2014.", "‘And speaking of China…’ Obama’s hope for Asia, The Conversation, 15 November 2014", "Who’s who in the G20 zoo? Focus on the sherpas, The Conversation, 15 November 2014", "Why Joe Hockey and the G20 need women onside, The Conversation, 3 November 2014", "Explainer: who gets invited to the G20 summit, and why, The Conversation, 3 November 2014", "Time to act: can the world prevent sexual violence in armed conflict?, The Conversation,11 June 2014", "Time for the G20 to invest in gender equality, The Conversation, 4 March 2014", "We are all spillovers now: G20 finance meeting explained, The Conversation, 19 February 2014", "Lost in transmission: the Australia Network, soft power and diplomacy, The Converation, 31 January 2014.", "Australia's Die-Hard Diplomacy, East Asia Forum - 21 January 2014, http://www.eastasiaforum.org/2014/01/21/australias-die-hard-diplomacy/", "Davos Diplomacy: Abbott sells G20 Summit to world leaders, The Conversation, 22 January 2014. https://theconversation.com/davos-diplomacy-abbott-sells-g20-summit-to-world-leaders-22188", "Delivering growth but protecting economies: our G20 conundrum, The Conversation, 6 December 2013, https://theconversation.com/delivering-growth-but-protecting-economies-our-g20-conundrum-20894", "Getting behind Burma - CAP News, 5 December 2013. http://asiapacific.anu.edu.au/news-events/all-stories/getting-behind-burma#.Uqp0221XvyU", "Efforts to stop violence against women must focus on social, cultural norms, East Asia Forum, 27 October 2013, http://www.eastasiaforum.org/2013/10/27/efforts-to-stop-violence-against-women-must-focus-on-social-cultural-norms/", "The distortion of Abbott's 'women problem', Public Sector Informant,  Canberra Times, 1 October 2013,  http://www.smh.com.au/national/public-service/the-distortion-of-abbotts-women-problem-20130929-2um0b.html", "Bishop joins ranks of the few, Canberra Times, 30 September 2013,   http://www.canberratimes.com.au/comment/bishop-joins-ranks-of-the-few-20130919-2u2c5.html#ixzz2hrKiAtOy", "G20 Summit Brisbane 2014: Persuasion post-Petersburg, The  Conversation, 9 September 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "Pride and prejudice as curtain comes down on the G20, The  Conversation, 7 September 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "Day one at the G20 Summit: tense and sensibility, The Conversation, 6  September 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "What does the G20 actually do? The Conversation, 4 September 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "FactCheck: did Kevin Rudd help create the G20? The Conversation, 19  August 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "What on earth is the G20 and why should I care?, The Conversation, 6  August 2013,  http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "The top 10 mistakes in the PNG Solution, The Drum, ABC News, 24 July  2013.  http://www.abc.net.au/news/2013-07-24/harris-rimmer-the-top-10-mistakes-in-rudds-png-solution/4838586", "Disappointing politics: Australia’s Indonesia relationship, East Asia Forum, 9 July 2013, http://www.eastasiaforum.org/2013/07/09/disappointing-politics-australias-indonesia-relationship/", "Refugee Convention: the perils of leaving, ASPI Strategist, 20 June  2013,  http://www.aspistrategist.org.au/refugee-convention-the-perils-of-leaving/", "Why soft power is so hard: the impact of aid cuts on regional security, The Conversation, 7 June 2013, http://theconversation.com/profiles/susan-harris-rimmer-20773/articles", "Paying the price for aid and diplomacy cuts, CAP ANU News, 14 May  2013,  http://asiapacific.anu.edu.au/news-events/all-stories/paying-price-aid-and-diplomacy-cuts#.Ul4jYm1XvyU", "Sector on a Fiscal Cliff, Development Policy Blog, 25 February 2013, http://devpolicy.org/sector-on-the-fiscal-cliff-20120224/", "Rising up in support of women, The Canberra Times, 14 February 2013,    http://www.canberratimes.com.au/comment/rising-up-in-support-of-women-20130213-2ed6k.html#ixzz2hrKz5mk2", "Careers in development: an interview with Susan Harris Rimmer on a   career spanning the private sector, public sector, NGOs, and academia,   interviewed by Jonathan Pryke,  19 April 2013,   http://devpolicy.org/careers-in-development-an-interview-with-susan-harris-rimmer-on-a-career-spanning-the-private-sector-public-sector-ngos-and-academia-2013041/", "", "Research Projects", "Building Democracy & Justice After Conflict (complete)", "Women and Diplomacy", "Implementing Women, Peace and Security in Australia’s domestic and foreign policies", "Australia has not only secured a two-year seat on the United Nations Security Council, it has also secured a seat on the UN Women Executive Board.  This provides a platform and momentum for Australia to further the Women, Peace and Security (WPS) agenda.  As part of this commitment, Australia has developed of a National Action Plan (NAP), released in 2012, that commits relevant government agencies to implementing the WPS agenda. This research provides an analysis of the ongoing Australian efforts to implement the NAP domestically and promote the WPS agenda in the United Nations.", "Diplomactic Strategies for Pivotal Powers", "Troika Diplomacy - Russia, Australia and Turkey in the G20 (2013-2015)", "Evaluating Australian Outreach - G20 Leaders Summit Brisbane 2014", "Australia on the UN Security Council: Lessons and Legacies from E10 members", "", "Peacebuilding Diplomacy: Sites, Actors, Dilemmas", "E-Diplomacy in the Asia-Pacific: opportunity and crisis", "Diplomacy: The 21st century professional skillset", "Diplomacy and Development", "Understanding Transitional Justice", ""], "publication": [{"title": "Is the Responsibility to Protect doctrine gender-neutral?", "year": "2015", "source": "in R Thakur, W.Maley (ed.), Theorising the Responsibility to Protect, Cambridge University Press, Cambridge, United Kingdom, pp. 266-284", "authors": ["Susan  Harris Rimmer"]}, {"title": "The big stage: Australian women leading global change", "year": "2014", "source": "in Joy Damousi, Kim Rubenstein and Mary Tomsic (ed.), Diversity in Leadership : Australian women, past and present, ANU Press, Canberra, pp. 91-107", "authors": ["Susan  Harris Rimmer"]}, {"title": "Dangerous intersection: migration and counter-terrorism laws in the case of Dr Mohamed Haneef", "year": "2014", "source": "in Fiona Jenkins, Mark Nolan, Kim Rubenstein (ed.), Allegiance and Identity in a Globalised World, Cambridge University Press, Cambridge, United Kingdom, pp. 291-308", "authors": ["Susan  Harris Rimmer"]}, {"title": "When WPS Met CEDAW (and Broke Up with R2P?)", "year": "2014", "source": "Article for E-International Relations13 March, http://www.e-ir.info/2014/03/13/when-wps-met-cedaw-and-broke-up-with-r2p", "authors": ["Susan  Harris Rimmer"]}, {"title": "ustralian Leadership at the Security Council: Advancing the Women, Peace and Security Agenda", "year": "2013", "source": "Human Rights Defender, vol. 22, no. 2, p. 28", "authors": ["Susan  Harris Rimmer"]}, {"title": "", "year": "2013", "source": "Submission to the Parliamentary Joint Committee on Human Rights: Complementary Protection", "authors": ["Susan  Harris Rimmer", "Susan  Harris Rimmer", "Susan  Harris Rimmer"]}, {"title": "", "year": "2013", "source": "Australian Political Party Poverty Audit August 2013", "authors": ["Susan  Harris Rimmer", "Susan  Harris Rimmer", "Susan  Harris Rimmer"]}, {"title": "Entries on Afghanistan Independent Human Rights Commission and Truth and Reconciliation Commission(Solomon Islands) in Encyclopedia of Transitional Justice 3 Volume Hardback Set", "year": "2013", "source": "eds: Lavinia Stan and Nadya NedelskyCambridge University Press, 2013.", "authors": ["Susan  Harris Rimmer"]}, {"title": "‘Australian Leadership at the Security Council: Advancing the Women", "year": "2013", "source": "Peace and Security Agenda’ UNSW Human Rights DefenderJuly (1,500 words)", "authors": ["Susan  Harris Rimmer"]}, {"title": "‘Coherence and Humility: Development Priorities for the G20’ Contribution to the G20 Monitor", "year": "2013", "source": "July 2013Lowy Institute (3,500 words). http://www.lowyinstitute.org/files/g20_monitor_the_g20_and_development_.pd", "authors": ["Susan  Harris Rimmer"]}, {"title": "Timor-Leste: International intervention, gender and the dangers of negative peace", "year": "2012", "source": "in Edward Aspinall, Robin Jeffrey and Anthony J Regan (ed.), Diminishing Conflicts in Asia and the Pacific: Why some subside and others don't, Routledge, Taylor & Francis Group, New York USA, pp. 19-36", "authors": ["Susan  Harris Rimmer"]}, {"title": "passport to punishment: administrative measures of control for national security purposes", "year": "2010", "source": "in Nicola McGarrity, Andrew Lynch and George Williams (ed.), Counter Terrorism and Beyond: The Culture of Law and Justice after 9/11, Routledge, Taylor & Francis Group, Abingdon and New York, pp. 109-127", "authors": ["Susan  Harris Rimmer"]}, {"title": "Women Cut in Half: Refugee Women and the Commission for Reception, Truth Seeking and Reconciliation in Timor Leste", "year": "2010", "source": "Refugee Survey Quarterly, vol. 29, no. 2, pp. 85-103", "authors": ["Susan  Harris Rimmer"]}, {"title": "ssessing the relevance of the international legal framework in claiming economic and social rights", "year": "2010", "source": "in Ann Nevile (ed.), Human Rights and Social Policy: A Comparative Analysis of Values and Citizenship in OECD Countries, Edward Elgar Publishing, Cheltenham, UK & Northampton, MA, USA", "authors": ["Susan  Harris Rimmer"]}, {"title": "The dangers of character tests under Australian migration laws", "year": "2010", "source": "Australian Journal of Administrative Law, vol. 17, pp. 229-244", "authors": ["Susan  Harris Rimmer"]}, {"title": "Raising women up: analysing Australian advocacy for women", "year": "2010", "source": "s rights under international and domestic law in Margaret Thornton and Trish Luker (eds) Sex Discrimination in Uncertain TimesANU E-press.", "authors": ["Susan  Harris Rimmer"]}, {"title": "Feminist Internationalisms", "year": "2010", "source": "The Australian Feminist Law Journal, vol. 32, no. 1, pp. 3-7", "authors": ["Susan  Harris Rimmer", "Susan  Harris Rimmer"]}, {"title": "Sexing the subject of Transitional Justice", "year": "2010", "source": "The Australian Feminist Law Journal, vol. 32, no. 1, pp. 123-147", "authors": ["Susan  Harris Rimmer"]}, {"title": "Raising Women Up: Analysing Australian Advocacy for Women", "year": "2010", "source": "s Rights under International and Domestic Law'in Margaret Thornton (ed.), Sex Discrimination in Uncertain Times, ANU ePress, Canberra Australia, pp. 291-318", "authors": ["Susan  Harris Rimmer"]}, {"title": "Book Review: Counter-Terrorism Policing: Community, Cohesion and Security", "year": "2009", "source": "Australian and New Zealand Journal of Criminology, vol. 42, no. 2, pp. 269-271", "authors": ["Susan  Harris Rimmer"]}, {"title": "Is ASIO a good judge of character?", "year": "2009", "source": "Alternative Law Journal, vol. 34, no. 2, pp. 102-107", "authors": ["Susan  Harris Rimmer"]}, {"title": "Beloved Madam: The Indonesian ad hoc Human Rights Court", "year": "2009", "source": "in William Binchy (ed.), Timor Leste: Challenges for Justice and Human Rights in the Shadow of the Past, Clarus Press, Dublin, Ireland, pp. 427-473", "authors": ["Susan  Harris Rimmer"]}, {"title": "Book review: Implementing Human Rights Norms: Judicial Discretion and Use of Unincorporated Conventions", "year": "2009", "source": "Australian Journal of Human Rights, vol. 15, no. 1, pp. 181-183", "authors": ["Susan  Harris Rimmer"]}, {"title": "Grand Plans", "year": "2009", "source": "in Barbara Nelson & Andrew MacIntyre (ed.), Capturing the year 2009: Writings from the ANU College of Asia and the Pacific, Australian National University, Canberra, pp. 74-79", "authors": ["Susan  Harris Rimmer"]}, {"title": "Comments: Examining the character of Australian citizens", "year": "2009", "source": "Public Law Review, vol. 20, no. 2, pp. 95-100", "authors": ["Susan  Harris Rimmer"]}, {"title": "The Clarke Inquiry: some insights and emerging issues", "year": "2008", "source": "Australia Institute - Discussion Papers, no. 56, pp. 8-9", "authors": ["Susan  Harris Rimmer", "Susan  Harris Rimmer"]}, {"title": "Orphans or Veterans? Justice for Children born of war in East Timor", "year": "2007", "source": "in R. Charli Carpenter (ed.), Born of War: Protecting Children of Sexual Violence Survivors in Conflict Zones, Kumarian Press (an imprint of Stylus Publishing), USA, pp. 53-77", "authors": ["Susan  Harris Rimmer"]}, {"title": "Orphans", "year": "2007", "source": "or Veterans? Justice for Children Born of War in East Timor'Texas International Law Journal, vol. 42, no. 2, pp. 323-344", "authors": ["Susan  Harris Rimmer"]}, {"title": "The Role of the United Nations High Commissioner for Refugees", "year": "2006", "source": "in Ustinia Dolgopol and Judith Gardam (ed.), The Challenge of Conflict: International Law Responds, Koninklijke Brill, The Netherlands, pp. 517-527", "authors": ["Susan  Harris Rimmer"]}, {"title": "The Roman Catholic Church and the Rights of East Timorese Women", "year": "2006", "source": "in Amanda Whiting & Carolyn Evans (ed.), Mixed Blessings: Laws, Religions, and Womenï¿½s Rights in the Asia-Pacific Region, Martinus Nijhoff Publishers, Leiden, The Netherlands, pp. 161-181", "authors": ["Susan  Harris Rimmer"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}