{"ANU": {"name": "Tamara Riley", "link": "https://researchers.anu.edu.au/researchers/riley-tm", "colleges": "College of Health & Medicine", "email": "Tamara.Riley@anu.edu.au", "phone": "02 6125 5499", "expertise": [], "interest": ["One Health, animal health and management, Aboriginal and Torres Strait Islander health and wellbeing, epidemiology, Indigenous data sovereignty"], "biography": "Tamara completed a Bachelor of Veterinary Science at the University of Sydney and went on to complete the Department of Agriculture and Water Resources graduate program with a Diploma of Government. She has completed a Masters of Philosophy in Applied Epidemiology at the ANU, and a Professional Certificate of Indigenous Research and Melbourne Poche Leadership Fellows Program at the University of Melbourne. Tamara has also worked as a Researcher at the National Indigenous Australians Agency (NIAA).", "project": [], "publication": [{"title": "Evaluating impacts of a One Health approach to companion animal health and management in a remote Aboriginal community in the Northern Territory, Australia", "year": "2020", "source": "Animals, vol. 10, no. 10, pp. 1-12", "authors": ["Tamara Riley", "Lovett R", "Thandrayen J"]}]}, "Microsoft-Academic": [{"title": "evaluating impacts of a one health approach to companion animal health and management in a remote aboriginal community in the northern territory australia", "year": 2020, "source": "open access journal", "authors": [{"name": "tamara riley", "affiliation": "australian national university"}, {"name": "raymond lovett", "affiliation": "australian national university"}, {"name": "joanne thandrayen", "affiliation": "australian national university"}, {"name": "bonny cumming"}, {"name": "katherine a thurber", "affiliation": "australian national university"}], "id": 2764600207}, {"title": "partnerships in aboriginal and torres strait islander health research", "year": 2020, "source": "", "authors": [{"name": "tamara riley"}]}], "ANDS-Grants": []}