{"ANU": {"name": "Tania M. Colwell", "link": "https://researchers.anu.edu.au/researchers/colwell-tm", "colleges": "College of Arts and Social Sciences", "email": "tania.colwell@anu.edu.au", "phone": "+ 61 2 6125 4788", "expertise": ["European History Excl. British Classical Greek And Roman", "British History", "Historical Studies", "Literature In French", "British And Irish Literature"], "interest": ["Cultural, social, and political history of late medieval Europe, esp. France and EnglandGender history of late medieval EuropeManuscript, early book, and literary cultureHistory of emotionsEarly encounters; travel narratives and ethnographiesLate medieval crusades"], "biography": "", "project": ["In progress", "Reading Mélusine: Romance Manuscripts and their Audiences in Late Medieval Europe, c. 1380–1530", "This book examines the historical reception and cultural significance of the popular Mélusine romances, ancestral tales of the Lusignan family which centre on a fairy-dragon and her crusading sons, from the dual perspectives of the French romance manuscripts and their audiences. By investigating the patronage, presentation, transmission, and ownership of the surviving corpus of over thirty manuscripts produced between c. 1380 and c. 1530, Reading Mélusine explains how and why the texts retained their hold on later medieval imaginations, and explores how the cultural values embedded in the romances facilitated their circulation across France and beyond.", "Beyond Wonder: Emotions of Encounter in the Medieval World", "This project explores representations of emotions of encounter in a French collection of travel narratives and ethnographic texts produced between around 1300 and 1530. It examines shifts in the way emotions shaping experience of intercultural encounter were treated and understood and reflects on their implications for understandings of identity in and beyond France. Research for ‘Beyond Wonder’ has been supported by the ARC Centre of Excellence for the History of Emotions and national and international competitive funding. For more information, see 'Beyond Wonder' project description link below.", "Recently completed", "Women and Work in Premodern Europe: Experiences, Relationships, Cultural Representation, c. 1100-1800, edited with Merridee L. Bailey and Julie Hotchin (publ. Routledge, 2018)", "This collection investigates how the working lives of historical women were enacted and represented, and analyses the relationships that shaped women’s experiences of work across the European premodern period. By exploring the array of meanings attributed to work for and by women, this project re-evaluates concepts and experiences of work as sites of social, economic, and cultural production in which women’s identities were created and performed between 1100–1800."], "publication": [{"title": "Review Sylvia Huot, Outsiders: The Humanity and Inhumanity of Giants in Medieval French Prose Romance", "year": "2020", "source": "Parergon, vol. 37, no. 1, pp. 260-261", "authors": ["Tania M. Colwell"]}, {"title": "OEuvres de commande et manuscrits", "year": "2019", "source": "trans. Joanna Pavlevski, in Mélusine, secrets d'une fée, Silvana, Milan, pp. 86-93", "authors": ["Tania M. Colwell"]}, {"title": "Emotives and emotional regimes", "year": "2017", "source": "in Susan Broomhall (ed.), Early Modern Emotions: An introduction, Routledge, Abingdon, pp. 7-10", "authors": ["Tania M. Colwell"]}, {"title": "Melusines Past, Present, and Future", "year": "2017", "source": "in Misty Urban, Deva F. Kemmis, Melissa Ridley Elmes (eds.), Melusine's Footprint: Tracing the Legacy of a Medieval Myth , Brill, Leiden, pp. 388-403", "authors": ["Tania M. Colwell"]}, {"title": "Book Review:", "year": "2017", "source": "Melusine; or The Noble History of Lusignan'Speculum, vol. 92, no. 4, pp. 1200-120", "authors": ["Tania M. Colwell"]}, {"title": "The Middle English Melusine: Evidence for an Early Edition of the Prose Romance in the Bodleian Library", "year": "2014", "source": "Journal of the Early Book Society, vol. 17, pp. 254-282", "authors": ["Tania M. Colwell"]}, {"title": "Book Review: Acts of Recognition: Essays on Medieval Culture by Lee Patterson", "year": "2012", "source": "Parergonvol. 29, no. 1, pp. 266-267", "authors": ["Tania M. Colwell"]}, {"title": "Fragments of the Roman de Melusine in the Upton House Bearsted Collection", "year": "2012", "source": "The Library:The Transactions of the Bibliographical Society , vol. 13, no. 3, pp. 279-315", "authors": ["Tania M. Colwell"]}, {"title": "Gesture, Emotion, and Humanity: Depictions of Melusine in the Upton House Bearsted Fragments", "year": "2011", "source": "in Jeff Rider and Jamie Friedman (ed.), The Inner Life of Women in Medieval Romance Literature: Grief, Guilt, and Hypocrisy, Palgrave Macmillan, New York,  pp. 107-127", "authors": ["Tania M. Colwell"]}, {"title": "Patronage of the poetic Melusine romance: Guillaume l", "year": "2011", "source": "Archeveque's confrontation with dynastic crisis'Journal of Medieval History, vol. 37, no. 2, pp. 215-229", "authors": ["Tania M. Colwell"]}, {"title": "Book Review: The Counts of Laval: Culture", "year": "2009", "source": "Patronage and Religion in Fifteenth- and Sixteenth-Century Franceby Malcolm Walsby, Parergon, vol. 26, no. 1, pp. 285-288", "authors": ["Tania M. Colwell"]}, {"title": "Robin Hood: The Archetypal Outlaw Hero", "year": "2003", "source": "in Therese Weber (ed.), Outlawed! Rebels, Revolutionaries and Bushrangers Catalogue, National Museum of Australia, Canberra, pp. 24-29", "authors": ["Tania M. Colwell"]}, {"title": "Comparative Perspectives on Bills of Rights", "year": "2004", "source": "National Institute of Social Sciences & LawCanberra", "authors": ["Tania M. Colwell", "Debono C", "eds"]}, {"title": "Book Review: Robin Hood: A Mythic Biography by Stephen Knight", "year": "2004", "source": "Parergonvol. 21, no. 1, pp. 193-195", "authors": ["Tania M. Colwell"]}, {"title": "Epilogue", "year": "2003", "source": "in Matthew W Morris (ed.), A Critical Edition of Couldrette's Melusine or Le Roman De Parthenay, Edwin Mellen Press, USA, Canada and UK, pp. 341-344", "authors": ["Tania M. Colwell"]}, {"title": "Melusine: Ideal Mother or Inimitable Monster", "year": "2003", "source": "in Isabel Davis, Miriam Miller, & Sarah Rees Jones (ed.), Love Marriage, and Family Ties In the Later Middle Ages, Brepols Publishers, Belguim, pp. 181-203", "authors": ["Tania M. Colwell"]}, {"title": "Medieval Masculinities: Transgressions and Transformations", "year": "2002", "source": "in Linda Rasmussen, Valerie Spear and Dianne Tillotson (ed.), Our Medieval Heritage: Essays in honour of John Tillotson for his 60th birthday, Merton Priory Press, Cardiff, United Kingdom, pp. 137-156", "authors": ["Tania M. Colwell"]}, {"title": "Why Richard III?", "year": "2000", "source": "Ricardian, vol. 12, no. 151, pp. 161-178", "authors": ["Tania M. Colwell"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}