{"ANU": {"name": "Terhi Nurmikko Fuller", "link": "https://researchers.anu.edu.au/researchers/nurmikko-fuller-t", "colleges": "College of Arts and Social Sciences", "email": "Terhi.Nurmikko-Fuller@anu.edu.au", "phone": "", "expertise": ["Organisation Of Information And Knowledge Resources", "Web Technologies Excl. Web Search", "Library And Information Studies", "Middle Eastern And African History"], "interest": ["Linked Data, ontologies, RDFKnowledge representationWeb science Social science online3D modellingcuneiform and Near Eastern studies, philogical and archaeologicalInformation and Library Sciences, digital librariesMusicology metadataMuseum studies"], "biography": "", "project": ["Examples of the 3D objects created in collaboration with the British Museum, the National Museum of Australia, and the School of Archaeology&Anthropology at the ANU can be seen here: https://sketchfab.com/tmtn/collections", "There is a working prototype for the JazzCats (Jazz Collection of Aggregated Triples) project available at http://jazzcats.cdhr.anu.edu.au/", ""], "publication": [{"title": "Constructive alignment and authentic assessment in a media-rich undergraduate course", "year": "2020", "source": "Educational Media International, vol. 57, no. 1, pp. -", "authors": ["Terhi Nurmikko Fuller", "Hart I"]}, {"title": "Experts and likely to be closed discussions in question and answer communities: An analytical overview", "year": "2019", "source": "Computers in Human Behavior, vol. 92, pp. 519-535", "authors": ["Procaci T", "Siqueira S", "Nunes B", "Terhi Nurmikko Fuller"]}, {"title": "Swinging triples: Bridging jazz performance datasets using linked data", "year": "2018", "source": "1st International Workshop on Semantic Applications for Audio and Music, SAAM 2018 - A satellite event of ISWC 2018, Association for Computing Machinery (ACM), New York, USA, pp. 42-45pp", "authors": ["Terhi Nurmikko Fuller", "Bangert D", "Hao Y"]}, {"title": "JazzCats: Navigating an RDF triplestore of integrated performance metadata", "year": "2018", "source": "5th International Conference on Digital Libraries for Musicology, DLfM 2018, Association for Computing Machinery (ACM), New York, USA, pp. 74-77pp", "authors": ["Bangert D", "Downie J", "Terhi Nurmikko Fuller"]}, {"title": "Tweets, Death, and Rock", "year": "2018", "source": "n' Roll'10th ACM Conference on Web Science, WebSci 2018, Conference Organising Committee, TBC", "authors": ["Xu X", "Terhi Nurmikko Fuller", "Pereira Nunes B"]}, {"title": "Building Worksets for Scholarship by Linking Complementary Corpora", "year": "2018", "source": "International Digital Humanities conference, The Alliance of Digital Humanities Organizations, Montreal Canada, p. 4", "authors": ["Page K", "Terhi Nurmikko Fuller", "Cole T"]}, {"title": "Tweets, Death, and Rock", "year": "2018", "source": "n' Roll'10th ACM Conference on Web Science, Association for Computing Machinery (ACM), New York, NY, USA, pp. 297-306", "authors": ["Xu X", "Terhi Nurmikko Fuller", "Nunes B"]}, {"title": "Building Prototypes Aggregating Musicological Datasets on the Semantic Web", "year": "2018", "source": "Bibliothek Forschung und Praxis, vol. 42, no. 2, pp. 206-221", "authors": ["Terhi Nurmikko Fuller", "Bangert D", "Dix A"]}, {"title": "Publishing Sumerian Literature on the Semantic Web", "year": "2018", "source": "in Vanessa Bigot Juloux, Amy Rebecca Gansell and Alessandro Di Ludovico (ed.), CyberResearch on the Ancient Near East and Neighboring Regions, Brill, USA, pp. 336-363", "authors": ["Terhi Nurmikko Fuller"]}, {"title": "Ten simple rules for measuring the impact of workshops", "year": "2018", "source": "PLOS Computational Biology, vol. 14, no. 8, pp. -", "authors": ["Sufi S", "Nenadic A", "Silva R", "Terhi Nurmikko Fuller"]}, {"title": "Modelling Experts Behaviour in Q&A Communities to Predict Worthy Discussions", "year": "2017", "source": "17th IEEE International Conference on Advanced Learning Technologies, ICALT 2017, ed. Maiga Chang, Nian-Shing Chen, Ronghuai Huang, Kinshuk, Demetrios G Sampson, Radu, IEEE, United States, pp. 291-295", "authors": ["Procaci T", "Siqueira S", "Nunes B", "Terhi Nurmikko Fuller"]}, {"title": "The Effect of Accelerating Migration of Services to Digital Channels on the Elderly", "year": "2017", "source": "9th ACM Web Science Conference, WebSci 2017, Association for Computing Machinery (ACM), New York, USA, pp. 407-408pp", "authors": ["Masterton Perry A", "Terhi Nurmikko Fuller"]}, {"title": "In Collaboration with InConcert: Reflecting a Digital Library as Linked Data for Performance Ephemera", "year": "2016", "source": "Digital Libraries for Musicology DLfM 2016, ed. B. Fields, K. Page, Association for Computing Machinery (ACM), New York, pp. 17-24", "authors": ["Terhi Nurmikko Fuller", "Dix A", "Weigl D"]}, {"title": "Comparative Analysis of Bibliographic Ontologies: Implications for the Digital Humanities", "year": "2016", "source": "Digital Humanities DH2016, ed. Maciej Eder, Jan Rybicki, The Alliance of Digital Humanities Organizations, Krakow, Poland", "authors": ["Terhi Nurmikko Fuller", "Jett J", "Cole T"]}, {"title": "Finding Topical Experts in Question and Answer Communities", "year": "2016", "source": "16th IEEE International Conference on Advanced Learning Technologies, ICALT 2016, IEEE, Los Alamitos, United States, pp. 407-411", "authors": ["Procaci T", "Nunes B", "Terhi Nurmikko Fuller"]}, {"title": "Enhancing Scholarly Use of Digital Libraries: A Comparative Survey Review of Bibliographic Metadata Ontologies", "year": "2016", "source": "Joint Conference for Digital Libraries JCDL 2016, IEEE and ACM (USA), Newark, pp. 35-44", "authors": ["Jett J", "Terhi Nurmikko Fuller", "Cole T"]}, {"title": "The Linked Semantic Network that is Transforming Musicology", "year": "2016", "source": "Workshop Humanities in the Semantic Web and Extended Semantic Web Conference (WHiSe-ESWC 2016), ed. Harald Sack, Eva Blomqvist, Mathieu d'Aquin, Springer, Greece", "authors": ["Terhi Nurmikko Fuller", "Page K"]}, {"title": "Building Complex Research Collections in Digital Libraries: A Survey of Ontology Implications", "year": "2015", "source": "Joint Conference for Digital Libraries JCDL 2015, IEEE and ACM (USA), Knoxville, pp. 169-172", "authors": ["Terhi Nurmikko Fuller", "Page K", "Willcox P"]}, {"title": "On Organising Multimedia Performance Corpora for Musicological Study using Linked Data", "year": "2015", "source": "International Digital Libraries for Musicology workshop DLfM 2015, ed. B. Fields, K. Page, IEEE and ACM (USA), New York, pp. 25-28", "authors": ["Terhi Nurmikko Fuller", "Weigl D", "Page K"]}, {"title": "Comprehensive Analysis of the First Ten Editions of the WEBIST Conference", "year": "2015", "source": "11th International Conference on Web Information Systems and Technologies (WEBIST 2015), ed. V Monfort, K-H Krempels, T A Majchrzak & Z Turk, Springer, Cham, Switzerland, pp. 252-274pp", "authors": ["Lopes G", "Nunes B", "Leme L", "Terhi Nurmikko Fuller"]}, {"title": "ssessing the Suitability of Existing OWL Ontologies for the Representation of Narrative Structures in Sumerian Literature", "year": "2014", "source": "Current Practice in Linked Data for the Ancient World, ISAW Papers, pp. 5pp", "authors": ["Terhi Nurmikko Fuller"]}, {"title": "ncient Sumerian Online: Challenges and Opportunities", "year": "2014", "source": "pp. 34-39", "authors": ["Terhi Nurmikko Fuller"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}