{"ANU": {"name": "Thomas Nulley Valdes", "link": "https://researchers.anu.edu.au/researchers/nulley-valdes-td", "colleges": "College of Arts and Social Sciences", "email": "thomas.nulley-valdes@anu.edu.au", "phone": "61254319", "expertise": ["Literature In Spanish And Portuguese", "Literary Theory", "Comparative Literature Studies", "Latin American History", "Cultural Theory", "Globalisation And Culture", "Hermeneutic And Critical Theory", "History Of Ideas", "Iberian Languages"], "interest": ["19th, 20th, and 21st Century Latin American fiction; World Literature theories and methodologies; Latin America's historical identity discourse; anthologies; Latino literature in the USA; Chilean literary history."], "biography": "During his PhD candidature he conducted fieldwork research for the purposes of acquiring archival material and in order to conduct in-person interviews with authors in Chile, The United States, Portugal, and Spain. Some of these interviews have been published in Latin American Literature Today, Nagarí, Letra Urbana and also in the edited book McCrack: McOndo y el Crack y los destinos de la literatura latinoamericana. He have presented research papers at congresses and university seminars at The University of New South Wales, Sydney University, Griffith University, La Trobe University, the 47th NeMLA Annual Convention, The Humanities Research Centre, Macquarie University, Indiana University, The Australian National University, and the Association of Iberian and Latin American Studies of Australasia Conventions in 2018 and 2020. His peer-reviewed research has appeared in edited collections as well as in Journal of Iberian and Latin American Research and 1616: Anuario de literatura comparada.", "project": ["Thomas completed his doctoral thesis on the contemporary Latin American short story anthology McOndo (1996), approaching the text from the theoretical frameworks and methodologies world literature theory, especially Pascale Casanova's, in order to give greater coherence to this anthology as well as inform and develop Casanova's theory and methodology when used with contemporary literature and in complex literary spaces such as the Latin American field."], "publication": [{"title": "Re-thinking McOndo and its Canonization", "year": "2020", "source": "Journal of Iberian and Latin American Research, vol. 26, no. 2, pp. 226-246", "authors": ["Thomas Nulley Valdes"]}, {"title": "Developing Casanova", "year": "2020", "source": "s Theory and Methodology: an Assessment of Latin Americanist Critiques in the Academic-Literature-World'1616: Anuario de Literatura Comparada, vol. 10, pp. 107-135", "authors": ["Thomas Nulley Valdes"]}, {"title": "The New Latino Boom in the United States and Se habla espaï¿½ol: An Interview with Mayra Santos-Febres", "year": "2019", "source": "Latin American Literature Today, vol. 12, pp. online", "authors": ["Thomas Nulley Valdes"]}, {"title": "El nuevo boom latino en los EE.UU. y Se habla espaï¿½ol: Entrevista a Mayra Santos-Febres", "year": "2019", "source": "Latin American Literature Today, vol. 12, pp. online", "authors": ["Thomas Nulley Valdes"]}, {"title": "Ilan Stavans", "year": "2019", "source": "s Anthologization of the Latino Community in the United States'in Bridget Kevane (ed.), Stavans Unbound: The Critic Between Two Canons, Academic Studies Press, Boston, pp. 156-166", "authors": ["Thomas Nulley Valdes"]}, {"title": "Lina Meruane", "year": "2018", "source": "algunas reflexiones sobre las antologias McOndo y Se habla espanol (Lina Meruanesome reflections on the anthologies McOndo and Se habla espanol)", "authors": ["Thomas Nulley Valdes"]}, {"title": "McOndo y el Crack fueron un diagnostico de la situacion de America Latina (McOndo and Crack were a diagnosis of the situation in Latin America)", "year": "2018", "source": "in Pablo Brescia and Oswaldo Estrada (ed.), McCrack: McOndo, el Crack: Y los destinos de la literatura latinoamericana (McCrack: McOndo, and Crack: And the destiny of Latin American literature), Albatros Ediciones, Spain, pp. 255-265", "authors": ["Thomas Nulley Valdes", "Gomez J"]}, {"title": "Cuando la tecnocultura se transforma en una experiencia literaria. Entrevista a Naief Yehya [When technology transforms itself into a literary experience. Interview with Naief Yehya]", "year": "2018", "source": "pp. online", "authors": ["Thomas Nulley Valdes"]}, {"title": "La derrota de lo real/The Defeat of the Real by Pablo Brescia", "year": "2018", "source": "pp. online", "authors": ["Thomas Nulley Valdes"]}, {"title": "Vivir fuera de lugar me ha dirigido hacia la derrota de lo real: Una conversación con Pablo Brescia (Living out of place has led me towards the defeat of the real: A Conversation with Pablo Brescia)", "year": "2017", "source": "", "authors": ["Thomas Nulley Valdes"]}, {"title": "La literatura tiene una relacion oblicua con lo real. Entrevista a Pablo Brescia (Literature has an oblique relationship with the real. Interview with Pablo Brescia)", "year": "2017", "source": "pp. online", "authors": ["Thomas Nulley Valdes"]}, {"title": "Ilan Stavans y la antologia Se habla espanol: voces latinas en USA (Ilan Stavans and the anthology Spanish is spoken: Latin voices in the USA)", "year": "2017", "source": "pp. online", "authors": ["Thomas Nulley Valdes"]}]}, "Microsoft-Academic": [{"title": "mcondo y el crack fueron un diagnostico de la situacion de america latina", "year": 2018, "source": "", "authors": [{"name": "thomas nulley valdes"}, {"name": "jonatan martin gomez"}]}], "ANDS-Grants": []}