{"ANU": {"name": "Tinh (Jimmy) Doan", "link": "https://researchers.anu.edu.au/researchers/doan-tt", "colleges": "College of Health & Medicine", "email": "Tinh.Doan@anu.edu.au", "phone": "", "expertise": ["Labour Economics", "Economics Of Education", "Economic Development And Growth", "Welfare Economics", "Public Health And Health Services Not Elsewhere Classified", "Health Economics"], "interest": ["Population healthAged population health and employmentLabour market, productivity and employmentWorking and well-beingHousehold economicsProgram/intervention impact evaluationOther economic development issues"], "biography": "", "project": ["Currently I works as part of an interdisciplinary team of academics and policy makers on the ARC Linkage grant “Working longer, staying healthy, keeping productive”. The project aims at investigating the complex longitudinal relationships between work participation, work conditions and hours, social and gendered disadvantage, income, savings and mature age workers’ productivity and health. I undertakes longitudinal analyses using the HILDA (Household Income and Labour Dynamics in Australia Survey) and supports the analysis of a workplace manager survey.", "The project investigates a major social, economic and policy challenge – how to design productive work that accommodates older workers’ health needs in ways that are fair and feasible. I contribute to strengthening and maintaining the Centre’s research leadership in social inequality, labour markets, time and health, by leading and supporting the collection and analysis of quantitative data.", "I also work on a Discovery Research Project “Addressing the hour-glass ceiling: New case for action on gender equality”. This project aims to quantify the underlying and uncounted time limit affecting gender equality in health, wealth and the labour market, laying the foundation for new policy action.", "I am also a co-investigator on a Project with RMIT \"Conversation about life, health and safety: Social supports for young construction workers' health and safety\". The project aims to:", "We will achieve this by examining the nature of supervisor-worker communication about safety issues, health (mental and physical) and experiences outside work, and implementing and evaluating interventions designed to foster healthy, safe and supportive workplaces for young construction workers."], "publication": [{"title": "P valueedriven methods were underpowered to detect publication bias: analysis of Cochrane review meta-analyses", "year": "2021", "source": "Journal of Clinical Epidemiology, vol. 118, pp. 86-92", "authors": ["Furuya Kanamori L", "Chang X", "Lin L", "Tinh (Jimmy) Doan"]}, {"title": "Cost of poor health to the labour market returns to education in Australia: another pathway for socio-economic inequality", "year": "2020", "source": "European Journal of Health Economics, vol. 21, pp. 635-648", "authors": ["Tinh (Jimmy) Doan", "Strazdins L", "Leach L"]}, {"title": "Blue collar timescapes: work, health, and pension eligibility age for mature age Australian bus drivers", "year": "2020", "source": "Critical Public Health", "authors": ["LaBond C", "Banwell C", "Pescud M", "Tinh (Jimmy) Doan"]}, {"title": "Does foreign investment enhance domestic manufacturing firms labour productivity? Evidence from a quantile regression approach [IN PRESS]", "year": "2019", "source": "Economic Change and Restructuring, vol. online", "authors": ["Ha V", "Holmes M", "Tinh (Jimmy) Doan"]}, {"title": "The effect of various income sources on income inequality: A comparison across ethnic groups in Vietnam", "year": "2018", "source": "Environment, Development and Sustainability, vol. 22, pp. 813-834", "authors": ["Nguyen H", "Tinh (Jimmy) Doan", "Tran T"]}, {"title": "Lost in Transition? Declining Returns to Education in Vietnam", "year": "2018", "source": "European Journal of Development Research, vol. 30, pp. 195-216", "authors": ["Tinh (Jimmy) Doan", "Le Q", "Quang Tran T"]}, {"title": "Heterogeneous impacts of provincial governance on household welfare in Vietnam", "year": "2018", "source": "International Journal of Social Welfare, vol. 28, no. 2, pp. 1-12", "authors": ["Quang Tran T", "Tinh (Jimmy) Doan", "Van Vu H"]}, {"title": "", "year": "2018", "source": "Local Competitiveness and Labour Market Returns in a Transition Economy: Evidence from Vietnam", "authors": ["Tinh (Jimmy) Doan", "Tuyen T", "Nguyen H"]}, {"title": "PROVINCIAL COMPETITIVENESS AND LABOUR MARKET RETURNS IN VIETNAM", "year": "2018", "source": "Hitotsubashi Journal of Economics, vol. 59, no. 2, pp. 95-112", "authors": ["Tinh (Jimmy) Doan", "Tran  T", "Nguyen H"]}, {"title": "Heterogeneous Credit Impacts on Health Care Spending of the Poor in Peri-Urban Areas, Vietnam", "year": "2016", "source": "Sage Open, vol. 6, no. 4, pp. 1-5", "authors": ["Tinh (Jimmy) Doan", "Gibson J", "Quang Tran T"]}, {"title": "Corruption, provincial institutions and manfacturing firm productivity: new evidence from a transitional economy", "year": "2016", "source": "Estudios de Economia, vol. 43, no. 2, pp. 199-215", "authors": ["Tinh (Jimmy) Doan", "Quang Tran T", "Huong V"]}, {"title": "Religiosity and Subjective Well-Being Among Old People: Evidence from a Transitional Country", "year": "2016", "source": "Applied Research in Quality of Life", "authors": ["Tran  T", "Nguyen T", "Van Vu H", "Tinh (Jimmy) Doan"]}, {"title": "Factors affecting the intensity of nonfarm participation among ethnic minorities in Northwest Mountains, Vietnam", "year": "2016", "source": "International Journal of Social Economics, vol. 43, no. 4", "authors": ["Tran  T", "Tinh (Jimmy) Doan", "Van Vu H"]}, {"title": "Does rising import competition harm local firm productivity in less advanced economies? Evidence from the Vietnam", "year": "2015", "source": "s manufacturing sector'Journal of International Trade and Economic Development, vol. 25, no. 1, pp. 1-24", "authors": ["Tinh (Jimmy) Doan", "Nguyen S", "Van Vu H"]}, {"title": "Credit participation and constraints of the poor in peri-urban areas, Vietnam: A micro-econometric analysis of a household survey", "year": "2015", "source": "Argumenta, vol. 34, no. 1, pp. 175-200", "authors": ["Tinh (Jimmy) Doan", "Tuyen T"]}, {"title": "Productivity spillovers from foreign direct investment in New Zealand", "year": "2014", "source": "New Zealand Economic Papers, vol. 49, no. 3, pp. 1-27", "authors": ["Tinh (Jimmy) Doan", "Iyer K", "Marï¿½ D"]}, {"title": "Firm exporting and employee benefits: First evidence from vietnam manufacturing SMEs", "year": "2013", "source": "Economics Bulletin, vol. 33, no. 1, pp. 519-535", "authors": ["Tinh (Jimmy) Doan", "Van Vu H", "Lim S"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}