{"ANU": {"name": "Tracy Beck Fenwick", "link": "https://researchers.anu.edu.au/researchers/fenwick-tb", "colleges": "College of Arts and Social Sciences", "email": "tracy.fenwick@anu.edu.au", "phone": "", "expertise": ["Comparative Government And Politics", "Social Policy", "Policy And Administration", "Citizenship", "Political Science", "Policy And Administration Not Elsewhere Classified"], "interest": ["Comparative Politics and Government (Regime Types) and Comparative Social/Drug Policy i.e. Implementation and Design of Poverty Alleviation Strategies (CCTs) and the Governance, Regulation, and Legalization of Cannabis, Federalism and the Welfare State, Subnational Governance and Decentralization, Local and Urban Politics. Regional Expertise Brazil, Argentina, Mexico, Canada and the Caribbean."], "biography": "Tracy Beck Fenwick is the Director, of the Australian Centre for Federalism (SPIR) and a Senior Lecturer in the School of Politics in the College of Arts and Social Sciences,  She was previously a a Post-Doctoral Research Fellow at the Australian National Centre for Latin American Studies at ANU, and a Post-Doctoral Fellow at the Johnson-Shoyama Graduate School of Public Policy at the University of Saskatchewan. She completed her doctorate specializing in Comparative Politics at the University of Oxford, U.K. in 2009 (St. Anthony's College). She holds a M.A. in Comparative Politics and a B.A. in Latin American Studies and Economics from McGill University, Canada. Her research was recently published in a single-authored book: (2016) \"Avoiding Governors: Federalism, Democracy, and Poverty Alleviation in Brazil and Argentina.\" Notre Dame: University of Notre Dame Press.  She also recently published in Global Social Policy (2013), the Journal of Politics in Latin America (2010), and in the Latin American Research Review (2009). Tracy has been a visiting researcher at the Universidad de Buenos Aires (UBA), the Universidade Federal da Bahia (UFBA), and at the Fundacão Getulio Vargas (FGV-SP). From 2003 to 2004, Tracy was also young professional with the Canadian Foundation for the Americas (FOCAL) based at FLACSO in Santo Domingo.  At the School of Politics and International Relations, Tracy teaches Politics in Latin America, Power Sharing: Federalism in Comparative Perspective, Introduction ot Latin American Studies, and Contemporary Brazilian Politics.", "project": ["I work on federalism and the politics of public (social) policy. I have researched CCTs (ideational development, policy diffusion, and the political dimentions of their implementation and outcomes--feedback effects) for over ten years. I am also interested in local and urban politics in federal countries. Most recently I am working on the politics of legallizing cannabis in a federal context (Canada and the US) and policy responses of COVID-19.", "I am interested in supervising topics on Latin America, Development and Democracy (including regime types), the Politics of Policy, Decentralization and Subnational Government, Federalism and Territorial Politics, and/or local and urban politics."], "publication": [{"title": "Five faces of presidential governance: insights from policy-making in democratic Brazil", "year": "2017", "source": "Policy Studies, vol. 38, no. 3, pp. 205-215pp", "authors": ["Tracy Beck Fenwick", "Burges S", "Power T"]}, {"title": "Presidents and policy-making: has Brazil", "year": "2017", "source": "s CCT-led anti-poverty agenda gone far enough?'Policy Studies, vol. 38, no. 3, pp. 216-230pp", "authors": ["Tracy Beck Fenwick"]}, {"title": "From CCTs to a social investment welfare state? Brazil", "year": "2017", "source": "s new' pro-poor strategy'Development Policy Review, vol. 35, no. 5, pp. 659-674", "authors": ["Tracy Beck Fenwick"]}, {"title": "ctivating Democracy in Brazil: Popular Participation, Social Justice, and Interlocking Institutions", "year": "2017", "source": "The Hispanic American Historical Review, vol. 97, no. 4, pp. 760-762pp", "authors": ["Tracy Beck Fenwick"]}, {"title": "How instrument constituencies shape policy transfer: a case study from Ghana", "year": "2017", "source": "Policy & Society: journal of public, foreign and global policy, pp. 1-17pp", "authors": ["Foli R", "Beland D", "Tracy Beck Fenwick"]}, {"title": "voiding Governors: Federalism", "year": "2016", "source": "Democracyand Poverty Alleviation in Brazil and Argentina, University of Notre Dame, United States", "authors": ["Tracy Beck Fenwick"]}, {"title": "Review of the Americas: A Quarterly Review of Latin American History", "year": "2014", "source": "70(3). \"Natasha Borges SugiyamaDiffusion of Government: Social Sector Reforms in Latin America\"", "authors": ["Tracy Beck Fenwick"]}, {"title": "Stuck between the past and the future: Conditional cash transfer programme development and policy feedbacks in Brazil and Argentina", "year": "2013", "source": "Global Social Policy, vol. 13, no. 2, pp. 144-167", "authors": ["Tracy Beck Fenwick"]}, {"title": "The Familiy Stipend Program\" in J. Crocotti and M. Valence (eds.). Brazil Today: An Encyclopedia of Life in the Republic\" Vol.1", "year": "2012", "source": "Santa Barbara: ABC-CLIO", "authors": ["Tracy Beck Fenwick"]}, {"title": "The Institutional Feasibility of National-Local Policy Collaboration: Insights from Brazil and Argentina", "year": "2010", "source": "Journal of Politics in Latin America, vol. 2, no. 2, pp. 155-183", "authors": ["Tracy Beck Fenwick"]}, {"title": "voiding Governors: The Success of Bolsa Familia", "year": "2009", "source": "Latin American Research Review, vol. 44, no. 1, pp. 102-131", "authors": ["Tracy Beck Fenwick"]}]}, "Microsoft-Academic": [{"title": "avoiding governors the success of bolsa familia", "year": 2009, "source": "latin american research review", "authors": [{"name": "tracy beck fenwick"}], "id": 59607649}, {"title": "five faces of presidential governance insights from policy making in democratic brazil", "year": 2017, "source": "policy studies", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}, {"name": "sean w burges", "affiliation": "australian national university"}, {"name": "timothy j power", "affiliation": "university of oxford"}], "id": 114598798}, {"title": "the institutional feasibility of national local policy collaboration insights from brazil and argentina", "year": 2010, "source": "journal of politics in latin america", "authors": [{"name": "tracy beck fenwick", "affiliation": "university of oxford"}], "id": 2736728258}, {"title": "how instrument constituencies shape policy transfer a case study from ghana", "year": 2018, "source": "policy and society", "authors": [{"name": "rosina foli", "affiliation": "johnson shoyama graduate school of public policy"}, {"name": "daniel beland", "affiliation": "johnson shoyama graduate school of public policy"}, {"name": "tracy beck fenwick", "affiliation": "australian national university"}], "id": 129664799}, {"title": "stuck between the past and the future conditional cash transfer programme development and policy feedbacks in brazil and argentina", "year": 2013, "source": "global social policy", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}], "id": 43812680}, {"title": "from ccts to a social investment welfare state brazil s new pro poor strategy", "year": 2017, "source": "development policy review", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}], "id": 132415769}, {"title": "undermining governors argentina s double punishment federal spending strategy", "year": 2021, "source": "publius the journal of federalism", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}, {"name": "lucas gonzalez", "affiliation": "national scientific and technical research council"}], "id": 155556485}, {"title": "avoiding governors federalism democracy and poverty alleviation in brazil and argentina", "year": 2015, "source": "", "authors": [{"name": "tracy beck fenwick"}]}, {"title": "presidents and policy making has brazil s cct led anti poverty agenda gone far enough", "year": 2017, "source": "policy studies", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}], "id": 114598798}, {"title": "activating democracy in brazil popular participation social justice and interlocking institutions", "year": 2017, "source": "americas", "authors": [{"name": "tracy beck fenwick", "affiliation": "australian national university"}], "id": 77777823}], "ANDS-Grants": []}