{"ANU": {"name": "Vanessa Agnew", "link": "https://researchers.anu.edu.au/researchers/agnew-vh", "colleges": "College of Arts and Social Sciences", "email": "vanessa.agnew@uni-due.de", "phone": "", "expertise": ["Historical Studies", "Neurosciences", "Cultural Studies"], "interest": ["I have a wide range of intellectual interests, including historical reenactment, migration and exile studies, genocide representation, the cultural history of music, virtual reality, infection biology, and neuroscience."], "biography": "Vanessa Agnew is a Senior Fellow in the Research School of the Humanities and Arts at the Australian National University and Professor of Anglophone Studies at the University of Duisburg-Essen, Germany. Her training in Brisbane, New York, Cardiff, Milton Keynes, and Berlin is in music, Germanistik, European studies, natural science, and neuroscience. She was tenured ?in German studies at the ?University of Michigan in 2008, where she worked until 2013. Her monograph, Enlightenment Orpheus: The Power of Music in Other Worlds (Oxford UP, 2008), won the Oscar Kenshur Prize for Eighteenth-Century Studies and the American Musicological Society’s Lewis Lockwood Award. She co-edited Settler and Creole Reenactment (Palgrave, 2010), special issues of Criticism 46 (2004), Rethinking History 11 (2007), and book series Historical Reenactment (Palgrave), and is on the editorial board of Music in Society and Culture (Boydell and Brewer). Her other co-edited books include The Routledge Handbook of Reenactment Studies, with Juliane Tomann and Jonathan Lamb (Routledge, 2020), Reenactment Case Studies, with Juliane Tomann and Sabine Stach (Routledge, forthcoming), and Refugee Routes, with Kader Konuk and Jane O. Newman (Transcript, 2020). Her children’s book on refugee flight, It’s Not That Bad, is appearing with Sefa-Verlag. She directs the Academy in Exile's Critical Thinking residency program at the Free University Berlin, which provides support to scholars-at-risk.", "project": ["Academy in Exile's Critical Thinking Residency Program, supported by the Andrew W. Mellon Foundation and other funding bodies, supports scholars at risk from around the world. The program allows threatened scholars to work in safety and establish themselves academically in Germany. It helps translate their research on behalf of intellectual and academic networks in Germany and abroad, providing wide benefit to the global intellectual community. Furthermore, it pilots new models for supporting threatened academics in exile, gathering scholars into like-minded cohorts for mutual support, focusing collaborative work around the theme of critical thinking, and producing innovative pedagogical tools for providing online educational content. Such tools can be replicated and scaled by other programs and initiatives that assist threatened scholars around the world. AiE provides a forum for reflecting on the pressing challenges to intellectual life, critical thinking, reason, social justice, and diversity that are facing us today."], "publication": []}, "Microsoft-Academic": [{"title": "history s affective turn historical reenactment and its work in the present", "year": 2007, "source": "rethinking history", "authors": [{"name": "vanessa agnew"}], "id": 38956679}, {"title": "introduction what is reenactment", "year": 2004, "source": "criticism", "authors": [{"name": "vanessa agnew", "affiliation": "university of michigan"}], "id": 20213736}, {"title": "the routledge handbook of reenactment studies key terms in the field", "year": 2019, "source": "", "authors": [{"name": "vanessa agnew"}, {"name": "jonathan lamb"}, {"name": "juliane tomann", "affiliation": "vanderbilt university"}]}, {"title": "reenacting the stone age journeying back in time through the uckermark and western pomerania", "year": 2018, "source": "", "authors": [{"name": "vanessa agnew"}]}, {"title": "enlightenment orpheus the power of music in other worlds", "year": 2008, "source": "", "authors": [{"name": "vanessa agnew"}]}, {"title": "songs from the edge of the world enlightenment perceptions of khoikhoi and bushmen music", "year": 2013, "source": "", "authors": [{"name": "vanessa agnew", "affiliation": "max planck society"}]}, {"title": "hearing things music and sounds the traveller heard and didn t hear on the grand tour", "year": 2012, "source": "cultural studies review", "authors": [{"name": "vanessa agnew", "affiliation": "university of michigan"}], "id": 2764866180}, {"title": "epilogue genealogies of space in colonial and postcolonial reenactment", "year": 2009, "source": "", "authors": [{"name": "vanessa agnew", "affiliation": "university of michigan"}]}, {"title": "settler and creole reenactment", "year": 2009, "source": "", "authors": [{"name": "vanessa agnew"}, {"name": "jonathan lamb"}, {"name": "daniel spoth"}]}, {"title": "listening to others eighteenth century encounters in polynesia and their reception in german musical thought", "year": 2007, "source": "eighteenth century studies", "authors": [{"name": "vanessa agnew"}], "id": 134335455}], "ANDS-Grants": []}