{"ANU": {"name": "Viveka Turnbull Hocking", "link": "https://researchers.anu.edu.au/researchers/hocking-vt", "colleges": "College of Science", "email": "Viveka.Hocking@anu.edu.au", "phone": "0431 945 252", "expertise": ["Design Innovation", "Design Practice And Management", "Urban And Regional Planning", "Urban And Regional Studies Excl. Planning", "Environmental Science And Management"], "interest": ["Design for Cross-Species Cohabitation - Post-Anthropocentric, More-than-HumanDesign for Social Innovation and SustainabilityDesign-led Approaches to ResearchMulti-Species Urban Entanglements"], "biography": "Dr Viveka Turnbull Hocking’s work looks at design-led approaches to research. Her research has included design for social innovation and sustainability as well as design for cross-species cohabitation. Her design-led approach to research engages with cross-disciplinary conversations and collaborations through the area of design and the built environment. She researches through the Fenner School of Environment and Society at the Australian National University and teaches in the School of Design and Architecture at the University of Canberra.", "project": ["1st Untaming the Urban Symposium 2016: From post-anthropocentric design to urban ecologies, see http://untaming-the-urban.tumblr.com/", "2nd Untaming the Urban Symposium 2018: Cross-disciplinary conversation on multi-species urban entanglements, see https://untamingurban.org", "Untaming the Urban - Book project", "Untaming Aesthetics: Cross-species design consideration for the built environment, see http://apo.org.au/node/178456", "", ""], "publication": [{"title": "Tackling Wicked Problems through Collective Design", "year": "2016", "source": "Intelligent Buildings International, vol. 8, no. 1, pp. 24-36pp", "authors": ["Viveka Turnbull Hocking", "Brown V", "Harris J"]}, {"title": "Design-Led Approach for Enabling Collective Imagining of Sustainable Urban Futures", "year": "2016", "source": "in Leshinsky, R., Legacy, C. (ed.), Instruments of Planning: Tensions and Challenges for More Equitable and Sustainable Cities, Routledge, USA, pp. 105-116", "authors": ["Viveka Turnbull Hocking", "MacKenzie A"]}, {"title": "Home Habitat Habitus: Design for cross-species cohabitation", "year": "2015", "source": "State of Australian Cities Conference 2015, ed. Paul Burton and Heather Shearer, Griffith University, Brisbane, Australia, pp. 12pp", "authors": ["Viveka Turnbull Hocking"]}, {"title": "The Wicked Muse: Partnering Creative Practice, Local Communities and Sustainability", "year": "2013", "source": "State of Australian Cities Conference 2013, ed. Kristian Ruming, Bill Randolph and Nicole Gurran, State of Australian Cities, Sydney, pp. 1-10", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Designing Sustainable Urban Futures: Presenting a Design-led methodology for Sustainability Research", "year": "2011", "source": "State of Australian Cities: National Conference 2011, State of Australian Cities, Melbourne Australia, pp. 1-12", "authors": ["Viveka Turnbull Hocking"]}, {"title": "n Ecology for Design: From the Natural, Through the Artificial, To the Un-Natural", "year": "2011", "source": "in Graham, L. (ed.), Sustainability Research by Designers: An Anthology, Common Ground Publishing, USA, pp. 129-143", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Designerly Ways of Knowing: What Does Design Have to Offer?", "year": "2010", "source": "in Valerie Brown, John Harris, Jacqueline Russell (ed.), Tackling Wicked Problems: Through the Transdisciplinary Imagination, Earthscan Publications Ltd, London, UK and Washington DC, USA, pp. 242-250", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Design with a thousand faces: Design-led methods for the social science research community", "year": "2009", "source": "International Journal of Interdisciplinary Social Science, vol. 4, no. 3, pp. 1-16", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Enabling Design for Sustainable Futures: Design-led research and research-led design", "year": "2009", "source": "Cumulus conference 2009, Cumulus conference 2009, Melbourne, Australia", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Design Approach to Thesis Writing: finding the style, structure and context in design", "year": "2009", "source": "Art Media Design Writing Intersections Conference, ed. Melles, G., Swinburne University of Technology\r\n, Melbourne, Australia, pp. 305-314", "authors": ["Viveka Turnbull Hocking"]}, {"title": "n Ecology for Design: From the Natural, Through the Artificial, To the Un-Natural", "year": "2009", "source": "Design Principles and Practices, vol. 3, no. 1, pp. 41-54", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Co-Designing a Sustainable Culture of Life: designing research methods for sustainable change", "year": "2008", "source": "Changing the Change Design, Visions, Proposals and Tools, ed. Cipolla, C., Peruccio, P.P., Allemandi Conference Press, Italy", "authors": ["Viveka Turnbull Hocking"]}, {"title": "Designing a Travel Guide to the Un-Natural World: Exploring a Design-led Methodology", "year": "2008", "source": "Undisciplined a Design Research Society Conference, ed. David Durling, Chris Rust, Lin-Lin Chen, Philippa Ashton and Ken Friedman, Sheffield Hallam University, UK, pp. 196/1-14", "authors": ["Viveka Turnbull Hocking"]}, {"title": "n UnNatural World: Designer as Tourist", "year": "2007", "source": "The 7th International Conference of the European Academy of Design, Izmir University of Economics, Turkey", "authors": ["Viveka Turnbull Hocking"]}]}, "Microsoft-Academic": [{"title": "tackling wicked problems through collective design", "year": 2016, "source": "intelligent buildings international", "authors": [{"name": "viveka turnbull hocking", "affiliation": "australian national university"}, {"name": "valerie brown", "affiliation": "australian national university"}, {"name": "john a harris", "affiliation": "australian national university"}], "id": 111395508}, {"title": "beyond the object an intersection of design and research within a sustainability context", "year": 2011, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "the wicked muse partnering creative practice local communities and sustainability", "year": 2013, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "designing sustainable urban futures presenting a design led methodology for sustainability research", "year": 2011, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "an ecology for design from the natural through the artificial to the un natural", "year": 2009, "source": "design principles and practices an international journal", "authors": [{"name": "viveka turnbull hocking"}], "id": 2764977239}, {"title": "untaming aesthetics cross species design considerations for the built environment", "year": 2018, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "home habitat habitus design for cross species cohabitation", "year": 2015, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "designing a travel guide to the un natural world exploring a design led methodology", "year": 2009, "source": "", "authors": [{"name": "viveka turnbull hocking"}]}, {"title": "design with a thousand faces design led methods for the social science research community", "year": 2009, "source": "the international journal of interdisciplinary social sciences annual review", "authors": [{"name": "viveka turnbull hocking"}], "id": 2764858909}], "ANDS-Grants": []}