{"ANU": {"name": "Wilfred L. F. Armarego", "link": "https://researchers.anu.edu.au/researchers/armarego-w", "colleges": "College of Health & Medicine", "email": "wilf.armarego@anu.edu.au", "phone": "+612 6281 3652", "expertise": ["Enzymes", "Biochemistry And Cell Biology", "Organic Chemistry", "Medical Biochemistry Amino Acids And Metabolites", "Medical Biochemistry Proteins And Peptides Incl. Medical Proteomics", "Medical Biochemistry Nucleic Acids", "Medicinal And Biomolecular Chemistry", "Cell Metabolism", "Metabolic Medicine"], "interest": ["(a) Studies of dihydropteridine reductase (DHPR) from human and other sources.  The human enzyme is involved in a malignant form of phenylketonuria, an inherited metabolic disorder.  The studies include, enzyme kinetic studies, mechanism, expression in bacteria, mutant enzymes by site-directed mutagenesis of the gene, partial sequencing of the genomic DNA (upstream region), gene replacement in fibroblasts and studies towards preparing a DHPR 'knockout mouse' as a model for the disease for gene replacement.(b) Studies of glyceryl-ether monooxygenase: enzyme kinetics of substrates and inhibitors, effects of detergents, dissociation from lipid membrane, purification and reconstitution, structure of the active site; relationship with enzymes of ether lipid disorders.(c) Organic syntheses of heterocyclic compounds including cofactors, substrates, inhibitors and activators of the above enzymes, as well as relevant detergents and related lipids."], "biography": "EDITORIAL BOARDS: Foundation editor of 'Medicinal Research Reviews' (1981-) and of the Journal 'Pteridines' (1989-).", "project": ["Research Fellows:  Dr Suresh.C. Sharma (Syntheses of unique heterocycles)    1968-1971", "Dr William. Pendergast (Syntheses of chiral amino acids)   1973-1976", "Dr Paul. Waring (Absolute configuration of pterin cofactors) 1979-1985", "Dr David. Randles (Mechanism of action of Dihydropteridine Reductase)  1981-1986", "Postdoctora Fellows:", "Dr Herman. Traub (Studies of tetrahydrofolic acid)   1987-1989", "Dr C.M.Hardy (Isolation of  human dihydropteridine Reductase gene) 1989-1991", "Dr Nan.Yang (Preparation of human dihydropteridine Reductase mutants by site-directed mutagenesis of the gene)     1992-1995", "Visiting Fellows:", "Dr Irmgard. Ziegler, Münich University, (Studies of pterin bound a-1-Acid Glycoproteins accumulated in the blood of patients with malignant disease)  1981  (4 months)", "Prof. Hiroyasu. Taguchi,  Kyoto Womens University,  (Syntheses of chiral tetrahydrobiopterins and chiral glyceryl-ether substrates, and the mechanism of oxygen transfer at the active site of glyceryl-ether mnooxygenase) 1982-1983, 1985 (July-Sept. 2 months), 1986 (Jan-April 3 months),1992 (12 months), 1994 (July-Oct)", "Prof. Thomas.J. Delia, Central Michigan University, (Studies of folic acid and derivatives) 1982-1983", "Dr Simon. Antoulas. Univ. of Zürich, (Studies of reduced folic acid and derivatives) 1983 (3 months)", "Prof. Sadao. Matsuura, Nagoya University, (Syntheses of reduced biopterin derivatives to map the active site of Dihydropteridine Reductase) 1987 (July-Sept. 3 months)", "Dr S. Jaireth (Metabolism of reduced biopterins in vivo in mice (1987, 12 months)", "CURRENT PROJECT:  Carrying out reseach (lostly literature work) to update and enlarge the 7th edition of the book: Purification of Laboratory Chemicals (Elsevier, 2013) which I was written with my coauthor Dr Christina L.L. Chai.", ""], "publication": []}, "Microsoft-Academic": [], "ANDS-Grants": []}