{"ANU": {"name": "William Sanders", "link": "https://researchers.anu.edu.au/researchers/sanders-wg", "colleges": "College of Arts and Social Sciences", "email": "William.Sanders@anu.edu.au", "phone": "", "expertise": ["Aboriginal And Torres Strait Islander Policy", "Public Policy", "Australian Government And Politics", "Housing Markets Development Management", "Public Administration", "Social Policy", "Family And Household Studies", "Political Science"], "interest": [], "biography": "Will joined CAEPR as a Research Fellow in 1993 and was appointed as Fellow in 1999 and Senior Fellow in 2007. His undergraduate training was in government, public administration, and political science, and his PhD was on the inclusion of Aboriginal people in the social security system. Will's research interests cover the political and social aspects of Indigenous policy, as well the economic. He regularly works on Indigenous people's participation in elections, on housing and social security policy issues, including the Community Development Employment Projects scheme, and on federal and intergovernmental aspects of Indigenous affairs policy.", "project": [], "publication": [{"title": "Who responds? An examination of response rates to a national postal survey of Aboriginal and Torres Strait Islander adults, 2018-2019", "year": "2020", "source": "BMC Medical Research Methodology, vol. 20, no. 1, pp. -", "authors": ["Wright A", "Thurber K", "Yap M", "William Sanders"]}, {"title": "Building capacity in indigenous governance: Comparing the Australian and American experiences", "year": "2019", "source": "Australian Journal of Public Administration, vol. 79, no. 1, pp. 26-40", "authors": ["Hendrix B", "Delaney D", "Witmer R", "William Sanders"]}, {"title": "Electoral Administration and Aboriginal Voting Power in the Northern Territory: Reality and Potential Viewed from the 2019 Federal Election", "year": "2019", "source": "CAEPR Working Papers, no. 132/2019, p. 19", "authors": ["William Sanders"]}, {"title": "Beware the people-focused omnibus: Revisiting Whitlam", "year": "2018", "source": "s vision for organising Indigenous affairsGriffith Review 60: First Things First, pp126-133", "authors": ["William Sanders"]}, {"title": "Three accounts of the emergence of the remote jobs and communities program: changing timeframes and types of actors", "year": "2017", "source": "Australian Journal of Political Science, vol. 52, no. 2, pp. 272-287", "authors": ["William Sanders"]}, {"title": "dministrative Arrangements in Australian Indigenous Affairs: Will they Ever Settle?", "year": "2017", "source": "Australian Journal of Public Administration, vol. 76, no. 4, pp. 400-402", "authors": ["William Sanders"]}, {"title": "Work habits and localised authority in Anmatjere CDEPs: Losing good practice through policy and program review", "year": "2016", "source": "in Kirrily Jordan (ed.), Better Than Welfare? Work and Livelihoods for Indigenous Australians After CDEP, ANU Press, Canberra, pp. 155-174", "authors": ["William Sanders"]}, {"title": "Reframed as welfare: CDEP", "year": "2016", "source": "s fall from favour'in Kirrily Jordan (ed.), Better Than Welfare? Work and Livelihoods for Indigenous Australians After CDEP, ANU Press, Canberra, pp. 31-49", "authors": ["William Sanders"]}, {"title": "Financial penalties under the Remote Jobs and Communities Program", "year": "2016", "source": "CAEPR Working Papers, vol. 108, pp. 1-14", "authors": ["Fowkes L", "William Sanders"]}, {"title": "", "year": "2016", "source": "Job Creation and Income Support in Remote Indigenous Australia: Moving Forward with a Better System.  CAEPR Topical Issue No 2/2016", "authors": ["Jordan K", "Fowkes L", "Altman J", "William Sanders"]}, {"title": "Classifying electoral systems by input rules: Building on Blais and Rae through Australian experience", "year": "2015", "source": "Australian Journal of Political Science, vol. 50, no. 3, pp. 462-479", "authors": ["William Sanders"]}, {"title": "survey of Remote Jobs and Communities Program(me) providers: one year in", "year": "2015", "source": "CAEPR Working Papers, no. 97/2015, pp. 1-26", "authors": ["Fowkes L", "William Sanders"]}, {"title": "Indigenous politics in the Australian Journal of Political Science: A review", "year": "2015", "source": "Australian Journal of Political Science, vol. 50, no. 4, pp. 679-694", "authors": ["William Sanders"]}, {"title": "ustralian Public Opinion on Indigenous Issues: Injustice", "year": "2015", "source": "Disadvantage and Support for Recognition ANUPOLL March 2015", "authors": ["Gray M", "William Sanders"]}, {"title": "Experimental Governance in Australian Indigenous Affairs: From Coombs to Pearson via Rowse and the Competing Principles", "year": "2014", "source": "CAEPR Discussion Paper, no. 291/2014, p. 19", "authors": ["William Sanders"]}, {"title": "Changing agendas in Australian Indigenous policy: Federalism, competing principles and generational dynamics", "year": "2013", "source": "Australian Journal of Public Administration, vol. 72, no. 2, pp. 156-170", "authors": ["William Sanders"]}, {"title": "Losing localism, constraining councillors: why the Northern Territory supershires are struggling", "year": "2013", "source": "Policy Studies, vol. 34, no. 4, pp. 474-490", "authors": ["William Sanders"]}, {"title": "Changing Scale, Mixing Interests: Generational Change in Northern Territory Local Government", "year": "2012", "source": "Australian Journal of Political Science, vol. 47, no. 3, pp. 473-490", "authors": ["William Sanders"]}, {"title": "Winning Aboriginal Votes: Reflections on the 2012 Northern Territory Election", "year": "2012", "source": "Australian Journal of Political Science, vol. 47, no. 4, pp. 691-701", "authors": ["William Sanders"]}, {"title": "Coombs", "year": "2012", "source": "bastard child: The troubled life of the CDEP Scheme'Australian Journal of Public Administration, vol. 71, no. 4, pp. 371-391", "authors": ["William Sanders"]}, {"title": "Recategorising Electoral Systems Analytically and Judging Some Undemocratic (Or Learning from an Australian Mistake.", "year": "2012", "source": "IPSA World Congress of Political Science, Reshaping Power, Shifting Boundaries 2012, International Political Science Association, Madrid, Spain, p. 21", "authors": ["William Sanders"]}, {"title": "nalysing electoral systems through five simple questions: A journey of discovery from local government in Australia", "year": "2011", "source": "s Northern Territory to the world of electoral science'Australasian Political Studies Association Conference (APSA 2011), Conference Organising Committee, Canberra Australia, pp. 1-30", "authors": ["William Sanders"]}, {"title": "lice", "year": "2011", "source": "s Unrepresentative Council: Cause for Intervention?'Australian Journal of Political Science, vol. 46, no. 4, pp. 699-706", "authors": ["William Sanders"]}, {"title": "Sorry, but the Indigenous affairs revolution continues", "year": "2010", "source": "in C. Aulich and M. Evans (ed.), The Rudd Government: Australian Commonwealth Administration 2007-2010, ANU ePress, Canberra Australia, pp. 221-240", "authors": ["William Sanders", "Hunt J"]}, {"title": "The impact of local government on desert settlement sustainability", "year": "2010", "source": "Journal of Economic and Social Policy, vol. 13, no. 2, pp. article 4, 21", "authors": ["William Sanders", "Holcombe S"]}, {"title": "Ideology, evidence and competing principles in Australian Indigenous affairs: From Brough to Rudd via Pearson and the NTER", "year": "2010", "source": "Australian Journal of Social Issues, vol. 45, no. 3, pp. 307-331", "authors": ["William Sanders"]}, {"title": "Writing Indigenous affairs: Diverse and innovative approaches", "year": "2009", "source": "Australian Journal of Political Science, vol. 44, no. 4, pp. 737-740", "authors": ["William Sanders"]}, {"title": "In the name of failure: a generational revolution in Indigenous affairs", "year": "2008", "source": "in Chris Aulich and Roger Wettenhall (ed.), Howard's Fourth Government, UNSW Press, Sydney NSW, pp. 187-205", "authors": ["William Sanders"]}, {"title": "Being a Good Senior Manager in Indigenous Community Governance: Working with Public Purpose and Private Benefit", "year": "2008", "source": "Australian Journal of Public Administration, vol. 67, no. 2, pp. 173-185", "authors": ["William Sanders"]}, {"title": "Is homeownership the answer? Housing tenure and Indigenous Australians in remote (and settled) areas", "year": "2008", "source": "Housing Studies, vol. 23, no. 3, pp. 433-460", "authors": ["William Sanders"]}, {"title": "Equality and difference arguments in Australian Indigenous affairs: Examples from income support and housing", "year": "2008", "source": "Public Policy, vol. 3, no. 1, pp. 87-99", "authors": ["William Sanders"]}, {"title": "Sustainable governance for small desert settlements: learning from the multi-settlement regionalism of Anmatjere Community Government Council", "year": "2008", "source": "The Rangeland Journal, vol. 30, no. 1, pp. 137-147", "authors": ["William Sanders", "Holcombe S"]}, {"title": "Regionalism that respects localism: The Anmatjere Community governance Council and beyond", "year": "2008", "source": "in J. Hunt, D.E. Smith, S. Garling, and W. Sanders (ed.), Contested Governance: Culture, Power and Institutions in Indigenous Australia, ANU ePress, Canberra Australia, pp. 283-309", "authors": ["William Sanders"]}, {"title": "Indigenous affairs after the Howard decade: Administrative reform and practical reconciliation or defying decolonization?", "year": "2008", "source": "in Andrew Gunstone (ed.), History, Politics and Knowledge: Essays in Australian Indigenous Studies, Australian Scholarly Publishing Pty Ltd, North Melbourne, pp. 300-314", "authors": ["William Sanders"]}, {"title": "Outsiders or Insiders? Strategic choices for Australian Indigenous leadership", "year": "2008", "source": "in Paul t'Hart and John Uhr (ed.), Public Leadership: Perspectives and Practices, ANU ePress, Canberra Australia, pp. 145-53", "authors": ["William Sanders"]}, {"title": "The Ti Tree Creek Camp study: A contribution to good governance", "year": "2007", "source": "Ngiya: Talk the Law, vol. 1, no. June, pp. 72-92", "authors": ["William Sanders", "Holcombe S"]}, {"title": "Producing powerful numbers", "year": "2007", "source": "in F. Morphy (ed.), Agency, Contingency and Census Process: Observations of the 2006 Indigenous Enumeration Strategy in Remote Aboriginal Australia, ANU ePress, Canberra Australia, pp. 1-8", "authors": ["Morphy F", "William Sanders", "Taylor J"]}, {"title": "The political economy of self-government", "year": "2007", "source": "in J. Altman and M. Hinkson (ed.), Coercive Reconciliation: Stabilise, Normalise, Exit Aboriginal Australia, Arena Printing and Publishing Pty Ltd, Melbourne, pp. 63-67", "authors": ["William Sanders"]}, {"title": "ccommodating difference?: The socio-politics of an Aboriginal fringe camp in a small north Australian town", "year": "2007", "source": "International Journal of Interdisciplinary Social Science, vol. 2, no. 2, pp. 339-48", "authors": ["Holcombe S", "William Sanders"]}, {"title": "ccommodating agency and contingency: Towards an extended strategy for engagement", "year": "2007", "source": "in F. Morphy (ed.), Agency, Contingency and Census Process: Observations of the 2006 Indigenous Enumeration Strategy in Remote Aboriginal Australia, ANU ePress, Canberra Australia, pp. 111-24", "authors": ["Morphy F", "William Sanders", "Taylor J"]}, {"title": "Community Governance: The Ti Tree Creek camp studyDesert Knowledge CRC Working Paper #10", "year": "2007", "source": "Desert Knowledge CRCAlice Springs, Australia", "authors": ["Holcombe S", "William Sanders"]}, {"title": "vast improvement: The 2006 enumeration in the Alice Springs town camps", "year": "2007", "source": "in F. Morphy (ed.), Agency, Contingency and Census Process: Observations of the 2006 Indigenous Enumeration Strategy in Remote Aboriginal Australia, ANU ePress, Canberra Australia, pp. 19-29", "authors": ["William Sanders"]}, {"title": "TSIC", "year": "2007", "source": "in Brian Galligan and Winsome Roberts (ed.), The Oxford Companion to Australian Politics, Oxford University Press, Oxford UK, pp. 49-50pp", "authors": ["William Sanders"]}, {"title": "boriginal politics (contemporary)", "year": "2007", "source": "in Brian Galligan and Winsome Roberts (ed.), The Oxford Companion to Australian Politics, Oxford University Press, Oxford UK, pp. 6-8pp", "authors": ["William Sanders"]}, {"title": "CDEP under DEWR: Policy changes and the new contractualism", "year": "2007", "source": "Impact, vol. Autumn, pp. 6-7", "authors": ["William Sanders"]}, {"title": "Indigenous affairs after the Howard decade: Administrative reform and practical reconciliation or defying decolonisation?", "year": "2006", "source": "Journal of Australian Indigenous Issues, vol. 9, no. 2-3, pp. 43-53", "authors": ["William Sanders"]}, {"title": "Understanding housing outcomes for Indigenous Australians: What can the 2002 NATSISS add?", "year": "2006", "source": "Indigenous Socioeconomic Outcomes: Assessing Recent Evidence, ed. B.H. Hunter, ANU ePress, Canberra, pp. 79-90", "authors": ["William Sanders"]}, {"title": "Views from the top: Secretaries perspectives on the new administrative arrangements in Indigenous Affairs", "year": "2006", "source": "Discussion Paper 286Centre for Aboriginal Economic Policy Research, Australian National University", "authors": ["William Sanders", "Gray W"]}, {"title": "Informing diverse interests: The Ti Tree Camp study", "year": "2006", "source": "Community Governance Newsletter2 (2)", "authors": ["William Sanders", "Holcombe S"]}, {"title": "Debating Indigenous issues: More continuity than change", "year": "2005", "source": "Australian Journal of Social Issues, vol. 40, no. 1, pp. 55-71", "authors": ["Johns M", "William Sanders"]}, {"title": "Never even adequate: Reconciliation and Indigenous affairs", "year": "2005", "source": "in C. Aulich and R. Wetttenhall (ed.), Howard's Second and Third Governments: Australian Commonwealth Administration 1998-2004, UNSW Press, Sydney, pp. 152-72", "authors": ["William Sanders"]}, {"title": "CDEP and ATSIC as bold experiments in governing differently - but where to now?", "year": "2005", "source": "Aborigines, Culture and Economy: The Past, Present, and Future of Rural and Remote Indigenous Lives, ed. D. Austin-Broos and G. Macdonald, University of Sydney Press, Sydney Australia, pp. 203-212", "authors": ["William Sanders"]}, {"title": "Indigenous centres in the policy margins: The CDEP scheme over 30 years", "year": "2005", "source": "Australian Council of Social Service Congress 2005, Unknown, Strawberry Hills, NSW, pp. 75-82", "authors": ["William Sanders"]}, {"title": "Housing and infrastructure", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Pan Macmillan Publishers Australia, Sydney, Australia, pp. 172?181", "authors": ["William Sanders", "Jones R"]}, {"title": "CDEP under DEWR: The flexibility challenge", "year": "2005", "source": "Impact, vol. Summer 05, p. 7", "authors": ["William Sanders"]}, {"title": "Survey of Indigenous interests and local governments in the NT", "year": "2005", "source": "Local Government Reporter, vol. 3, no. 8, pp. 137-41", "authors": ["William Sanders"]}, {"title": "Governance and political participation", "year": "2005", "source": "in Bill Arthur & Frances Morphy (ed.), Macquarie Atlas of Indigenous Australia, Pan Macmillan Publishers Australia, Sydney, Australia, pp. 220-229", "authors": ["William Sanders"]}, {"title": "Dispersal, autonomy and scale in Indigenous community governance: Some reflections on recent Northern Territory experience", "year": "2005", "source": "Australian Journal of Public Administration, vol. 64, no. 4, pp. 53-62", "authors": ["William Sanders"]}, {"title": "Torres Strait elections, 2000 and 2004: Changes in political leadership and style", "year": "2005", "source": "Australian Journal of Political Science, vol. 40, no. 3, pp. 443-451", "authors": ["William Sanders"]}, {"title": "Labors landslide, CLPs tsunami: The 2005 Northern Territory election", "year": "2005", "source": "Australian Quarterly, vol. 77, no. 3, pp. 4-6", "authors": ["William Sanders"]}, {"title": "Prospects for regionalism in Indigenous community governance", "year": "2004", "source": "Dialogue (Academy of the Social Sciences in Australia), vol. 23, no. 2, pp. 56-61", "authors": ["William Sanders"]}, {"title": "Participation and representation in the 2002 ATSIC Elections", "year": "2004", "source": "Australian Journal of Political Science, vol. 39, no. 1, pp. 175-95", "authors": ["William Sanders"]}, {"title": "The Tasmanian Electoral Roll Trial in the 2002 ATSIC Election", "year": "2004", "source": "Australian Journal of Public Administration, vol. 63, no. 2, pp. 51-65", "authors": ["William Sanders"]}, {"title": "Indigenous Australians and the rules of the social security system: Universalism, appropriateness and justice", "year": "2004", "source": "Australian Journal of Public Administration, vol. 63, no. 3, pp. 3-9", "authors": ["William Sanders"]}, {"title": "TSICs achievements and strengths: Implications for institutional reform", "year": "2004", "source": "Journal of Australian Indigenous Issues, vol. 7, no. 3, pp. 14-21", "authors": ["William Sanders"]}, {"title": "New Model of Inclusion? Centrelinks development of income support service delivery for remote Indigenous communities", "year": "2004", "source": "Canberra Bulletin of Public Administration, vol. 111, pp. 17-21", "authors": ["William Sanders"]}, {"title": "From unorganised interests to nations within: Changing conceptions of Indigenous issues in Australia and", "year": "2003", "source": "Australasian Canadian Studies, vol. 21, no. 1, pp. 125?4", "authors": ["William Sanders"]}, {"title": "Community challenge", "year": "2003", "source": "About The House, vol. April-May 2003, pp. 23-24", "authors": ["William Sanders"]}, {"title": "Making Sense of the Census: Observations of the 2001 Enumeration in Remote Aboriginal Australia", "year": "2002", "source": "Australian National UniversityCanberra, ACT", "authors": ["Martin D", "Morphy F", "William Sanders"]}, {"title": "The Indigenous Welfare Economy and the CDEP Scheme", "year": "2001", "source": "Australian National UniversityCanberra", "authors": ["Morphy F", "William Sanders", "eds"]}, {"title": "The 2001 Northern Territory election: The end of an era, a victory for labor and for two-party democracy", "year": "2001", "source": "Australian Quarterly, vol. 73, no. 6, pp. 22-27", "authors": ["William Sanders"]}, {"title": "djusting balances: Reshaping the CDEP scheme after 20 good years", "year": "2001", "source": "The Indigenous Welfare Economy and the CDEP Scheme: Autonomy, Dependence, Self Determination and Mutual Obligation, ed. F. Morphy and W. Sanders, Australian National University, Canberra, pp. 47-50", "authors": ["William Sanders"]}, {"title": "Delivering democracy to Indigenous Australians: Aborigines, Torres Strait Islanders and Commonwealth electoral administration", "year": "2001", "source": "in Marian Sawer (ed.), Elections Full, Free and Fair, The Federation Press, Sydney, pp. 158-174", "authors": ["William Sanders"]}, {"title": "Torres Strait governance structures and the Centenary of Australian Federation: A missed opportunity?", "year": "2000", "source": "Australian Journal of Public Administration, vol. 59, no. 3, pp. 22-33", "authors": ["William Sanders"]}, {"title": "Participation and representation in ATSIC elections: A ten-year perspective", "year": "2000", "source": "Australian Journal of Political Science, vol. 35, no. 3, pp. 493-513", "authors": ["William Sanders", "Taylor J", "Ross K"]}, {"title": "Introduction", "year": "2000", "source": "in Ivison, D.; Patton, P.; Sanders, W. (ed.), Political Theory and the Rights of Indigenous People, Cambridge University Press, Cambridge, pp. 1-21", "authors": ["Ivison D", "Patton P", "William Sanders"]}, {"title": "Understanding the past, looking to the future: The history of Australian Indigenous housing", "year": "2000", "source": "in Read, P. (ed.), Settlement: A History of Australian Indigenous Housing, Aboriginal Studies Press, Canberra, pp. 237-248", "authors": ["William Sanders"]}, {"title": "Working for welfare: What difference does it make", "year": "2000", "source": "The Australian Economic Review, vol. 33, no. 4, pp. 355-362", "authors": ["Altman J", "Gray M", "William Sanders"]}, {"title": "Decolonising Indigenous Australia: Labors contribution?", "year": "2000", "source": "in Warhurst, J.$; Parkin, A.* (ed.), The Machine: Labor confronts the future, Allen & Unwin, St Leonards, NSW, pp. 314-330", "authors": ["William Sanders"]}]}, "Microsoft-Academic": [{"title": "a randomized trial of epidural glucocorticoid injections for spinal stenosis", "year": 2014, "source": "the new england journal of medicine", "authors": [{"name": "janna l friedly", "affiliation": "university of washington"}, {"name": "bryan a comstock", "affiliation": "university of washington"}, {"name": "judith a turner", "affiliation": "university of washington"}, {"name": "patrick j heagerty", "affiliation": "university of washington"}, {"name": "richard a deyo", "affiliation": "kaiser permanente"}, {"name": "sean d sullivan", "affiliation": "university of washington"}, {"name": "zoya bauer", "affiliation": "university of washington"}, {"name": "brian w bresnahan", "affiliation": "university of washington"}, {"name": "andrew l avins", "affiliation": "kaiser permanente"}, {"name": "srdjan s nedeljkovic", "affiliation": "harvard university"}, {"name": "david r nerenz", "affiliation": "henry ford health system"}, {"name": "christopher j standaert", "affiliation": "university of washington"}, {"name": "larry kessler", "affiliation": "university of washington"}, {"name": "venu akuthota", "affiliation": "university of colorado denver"}, {"name": "thiru m annaswamy", "affiliation": "veterans health administration"}, {"name": "allen s chen", "affiliation": "kaiser permanente"}, {"name": "felix e diehn", "affiliation": "mayo clinic"}, {"name": "william firtch", "affiliation": "kaiser permanente"}, {"name": "frederic j gerges", "affiliation": "st elizabeth s medical center"}, {"name": "christopher gilligan", "affiliation": "harvard university"}, {"name": "harley goldberg", "affiliation": "kaiser permanente"}, {"name": "david j kennedy", "affiliation": "stanford university"}, {"name": "shlomo s mandel", "affiliation": "henry ford health system"}, {"name": "mark tyburski", "affiliation": "kaiser permanente"}, {"name": "william sanders", "affiliation": "henry ford health system"}, {"name": "david m sibell", "affiliation": "oregon health science university"}, {"name": "matthew smuck", "affiliation": "stanford university"}, {"name": "ajay d wasan", "affiliation": "university of pittsburgh"}, {"name": "lawrence won", "affiliation": "kaiser permanente"}, {"name": "jeffrey g jarvik", "affiliation": "university of washington"}], "id": 62468778}, {"title": "implementation of the patient centered medical home in the veterans health administration associations with patient satisfaction quality of care staff burnout and hospital and emergency department use", "year": 2014, "source": "jama internal medicine", "authors": [{"name": "karin m nelson", "affiliation": "university of washington"}, {"name": "christian d helfrich", "affiliation": "university of washington"}, {"name": "haili sun", "affiliation": "university of washington"}, {"name": "paul l hebert", "affiliation": "university of washington"}, {"name": "chuan fen liu", "affiliation": "university of washington"}, {"name": "emily d dolan"}, {"name": "leslie taylor"}, {"name": "edwin s wong", "affiliation": "university of washington"}, {"name": "charles maynard", "affiliation": "university of washington"}, {"name": "susan e hernandez", "affiliation": "university of washington"}, {"name": "william sanders", "affiliation": "veterans health administration"}, {"name": "ian randall", "affiliation": "university of washington"}, {"name": "idamay curtis", "affiliation": "veterans health administration"}, {"name": "gordon schectman", "affiliation": "united states department of veterans affairs"}, {"name": "richard b stark", "affiliation": "united states department of veterans affairs"}, {"name": "stephan d fihn", "affiliation": "university of washington"}, {"name": "stephan d fihn", "affiliation": "veterans health administration"}], "id": 65364685}, {"title": "controlling for student background in value added assessment of teachers", "year": 2004, "source": "journal of educational and behavioral statistics", "authors": [{"name": "dale ballou"}, {"name": "william sanders"}, {"name": "paul wright"}], "id": 53135262}, {"title": "photovoltaic modules with integrated devices", "year": 2007, "source": "", "authors": [{"name": "steven croft"}, {"name": "randy dorn"}, {"name": "ilan gur"}, {"name": "bruce d hachtmann"}, {"name": "dennis r hollars"}, {"name": "shefali jaiswal"}, {"name": "p d paulson"}, {"name": "david b pearce"}, {"name": "kannan ramanathan"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}, {"title": "photovoltaic module with integrated current collection and interconnection", "year": 2006, "source": "", "authors": [{"name": "bruce d hachtmann"}, {"name": "shefali jaiswal"}, {"name": "p d paulson"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}, {"title": "protovoltaic module utilizing a flex circuit for reconfiguration", "year": 2006, "source": "", "authors": [{"name": "randy dorn"}, {"name": "bruce d hachtmann"}, {"name": "david harris"}, {"name": "ilan gur"}, {"name": "david b pearce"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}, {"title": "photovoltaic module with insulating interconnect carrier", "year": 2006, "source": "", "authors": [{"name": "bruce d hachtmann"}, {"name": "shefali jaiswal"}, {"name": "david b pearce"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}, {"title": "efficient perforation of high pressure deepwater wells", "year": 2011, "source": "", "authors": [{"name": "william sanders"}, {"name": "carlos baumann"}, {"name": "harvey williams"}, {"name": "flavio dias de moraes", "affiliation": "petrobras"}, {"name": "jonathan shipley"}, {"name": "martin eric bethke"}, {"name": "scott ogier", "affiliation": "petrobras"}]}, {"title": "rooftop photovoltaic systems", "year": 2008, "source": "", "authors": [{"name": "steven croft"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}, {"title": "photovoltaic module with integrated energy storage", "year": 2008, "source": "", "authors": [{"name": "ilan gur"}, {"name": "david harris"}, {"name": "shefali jaiswal"}, {"name": "p d paulson"}, {"name": "william sanders"}, {"name": "ben tarbell"}]}], "ANDS-Grants": [{"description": "This project will document the implementation of a major new government program starting in mid 2013 which focuses on employment/participation challenges among Indigenous people in remote areas. It will assess the extent to which the program achieves an approach which is both collaborative with Indigenous communities and integrated across government. It will also develop a conceptual, sociological anlaysis of the role of work in remote Indigenous communities and how this impacts on successive iterations of government policy in this area. The project's significance lies partly in adopting an exploratory approach to program implementation in which it is not assumed that objectives are clear at the outset, except in the most general of terms.", "title": "Linkage Projects - Grant ID: LP130100226", "id": "517064", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/LP130100226", "researchers": ["Dr William Sanders", "Dr Kirrily Jordan", "Dr May Lam"], "status": "closed", "fundingAmount": 160000, "fundingScheme": "Linkage Projects", "startDate": 2013, "endDate": 2016, "dateTimeModified": "2016-05-29T08:53:25Z", "dateTimeCreated": "2015-04-12T05:05:53Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LP130100226", "identifiers": ["http://purl.org/au-research/grants/arc/LP130100226", "LP130100226"], "subjects": ["POLICY AND ADMINISTRATION", "STUDIES IN HUMAN SOCIETY", "employment", "participation and engagement", "remote indigenous communities"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517064"}]}]}