{"ANU": {"name": "Yan (Stefanie) Zhang", "link": "https://researchers.anu.edu.au/researchers/zhang-yxxxxxxxxx", "colleges": "College of Science", "email": "Stefanie.Zhang@anu.edu.au", "phone": "", "expertise": ["Environmental Science And Management", "Building", "Urban Analysis And Development", "Environment And Resource Economics", "Econometrics", "Environment Policy", "Urban Policy"], "interest": ["Building energy efficiency;Energy behavior;Energy policy;Urban sustainability;Energy and climate"], "biography": "Yan Zhang's research focuses on building energy efficiency, energy and climate policy, and urban environment. With a particular interest in human’s role in energy and environmental issues, she explores the relationship between occupant behavior and building energy performance from a multidisciplinary perspective. She received her PhD from ANU in 2021, and holds a Bachelor’s degree in Engineering Management from Tongji University (2012) and a Master’s degree in Energy & Environmental Management from Beijing Institute of Technology (2015). She also has enjoyable and valuable research experiences in a wide range of topics, including low carbon cities, mechanism research of urban systems, urban-rural development, urban planning, real estate management, etc. In addition, she contributes to the academic community as a reviewer for many journals, including Renewable and Sustainable Energy Reviews, Environmental Research Letters, Energy and Buildings, Journal of Cleaner Production, Environmental Science and Pollution Research, Transportation Research Part F: Psychology and Behaviour, and Asia Pacific Journal of Public Health, etc.", "project": [], "publication": [{"title": "Characterizing energy-related occupant behavior in residential buildings: Evidence from a survey in Beijing, China", "year": "2020", "source": "Energy and Buildings, vol. 214", "authors": ["Yan (Stefanie) Zhang", "Bai X", "Mills F"]}, {"title": "Rethinking the role of occupant behavior in building energy performance: A review", "year": "2018", "source": "Energy and Buildings, vol. 172, pp. 279-294pp", "authors": ["Yan (Stefanie) Zhang", "Bai X", "Mills F", "Pezzey J"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}