{"ANU": {"name": "Yasmine Musharbash", "link": "https://researchers.anu.edu.au/researchers/musharbash-y", "colleges": "College of Arts and Social Sciences", "email": "Yasmine.Musharbash@anu.edu.au", "phone": "02-6125 1060", "expertise": ["Social And Cultural Anthropology", "Aboriginal And Torres Strait Islander Cultural Studies", "Studies Of Aboriginal And Torres Strait Islander Society", "Family And Household Studies"], "interest": ["Anthropology of the Everyday, Indigenous/Non-Indigenous Relations, Human/Other-than-Human Relations, Monster Anthropology, Animal/Human Relations, Neocolonialism, Central Australia, Warlpiri Studies, Anthropology of Place and Domestic Space, Anthropology of Emotions, Embodiment, Boredom Studies, Personhood, Sociality and Relatedness, Anthropology of Death and Grieving, Anthropology of Sleep and the Night."], "biography": "since 2019: Senior Lecturer in the School of Archaeology & Anthropology, CASS, ANU 2009-2019: The University of Sydney (Lecturer, Future Fellow, Senior Lecturer) 2009 Aboriginal Areas Protection Authority (Anthropologist) 2004-2008: University of Western Australia (Postdoctoral Fellow) 2003-2004: Torres Strait Regional Authority (Native Title Anthropologist) 1999 – 2003: The Australian National University (PhD) 1997: Copenhagen University ERASMUS Summer School of Anthropology  1989-1997: Freie Universität Berlin (M.A. in Social Anthropology and English) 1993-1994: Monash University", "project": ["Ethnographically, my work is located in central Australia and mostly centred on Yuendumu, an Aboriginal community about three hours northwest of Alice Springs. I have been conducting fieldwork there annually since 1994, originally focussing on everyday life as it unfolds in Warlpiri homes and country. One of the biggest joys I know is to see where anthropological fieldwork takes me and, following incidents, events, questions, ideas, and experiences from the field, my research has branched out in a number of directions:", "One such cluster is concerned with sleep, the night, ideas of safety and threat, and an inter-related one has taken me into the domains of the anthropology of emotions and embodiment. Here, I focussed especially on fear, but also on grief and loneliness, and then moved on to studying laughter and boredom. In all these endeavours I have always emphasised comparison, radical difference, and cultural relativity.", "Social relations, sociality, and notions of the person, and of self and other are themes I return to from various directions, e.g. by studying birthday parties or fighting, childhood socialisation, intergenerational relations, and, especially, the ways in which Warlpiri people relate to others: to non-Indigenous people, to strangers, to enemies, but also to animals, plants, the weather, smoke, the underground, and to monsters. In this vein, I had an ARC Future Fellowship specifically looking at ‘bad relations’.", "The research on monsters has blossomed into an on-going inter-disciplinary and comparative project that brings together anthropology and monster studies. Under the umbrella term ‘monster’ my co-editors and I have gathered ethnographic analyses from all over the world, that look at human/other-than-human engagements from a variety of angles (in instances of social change and transformation, for example, or as explorations of the different ways in which people ‘live with’ the monsters that haunt them.)"], "publication": [{"title": "Monster Anthropology. Ethnographic Explorations of Transforming Social Worlds Through Monsters", "year": "2020", "source": "BloomsburyLondon and New York", "authors": ["Yasmine Musharbash", "Presterudstuen GH eds"]}, {"title": "Monster Anthropology in Australasia and Beyond", "year": "2014", "source": "Palgrave MacmillanNew York", "authors": ["Yasmine Musharbash", "Presterudstuen GH eds"]}, {"title": "Yuendumu Everyday: Contemporary life in remote Aboriginal Australia", "year": "2008", "source": "Aboriginal Studies PressCanberra, Australia", "authors": ["Yasmine Musharbash"]}, {"title": "Pangkarlangu, Wonder, Extinction", "year": "2020", "source": "in Y Musharbash & G H Presterudstuen (ed.), Monster Anthropology: Ethnographic Explorations of Transforming Social Worlds Through Monsters, Bloomsbury, London and New York, pp. 59-74", "authors": ["Yasmine Musharbash"]}, {"title": "Introduction: Monsters and Change", "year": "2020", "source": "in Y Musharbash & G H Presterudstuen (ed.), Monster Anthropology: Ethnographic Explorations of Transforming Social Worlds Through Monsters, Bloomsbury, London and New York, pp. 1-27", "authors": ["Yasmine Musharbash", "Presterudstuen GH"]}, {"title": "The Hairies: Cleverman (Griffen, 2016-2017)", "year": "2020", "source": "in Simon Bacon (ed.), Monsters: A Companion, Peter Lang AG, International Academic Publishers, Bern, pp. 137-145", "authors": ["Yasmine Musharbash"]}, {"title": "Story in and on Signs: Making Resistance and Acquiescence Legible as Forms of Resilience", "year": "2019", "source": "in Laurent Dousset & Melissa Nayral (ed.), Pacific Realites: Changing Perspectives on Resilience and Resistance, Berghahn Books, New York, pp. 23-43", "authors": ["Yasmine Musharbash"]}, {"title": "Yuendumu Dog Tales", "year": "2018", "source": "in Natalie Porter and Ilana Gershon (ed.), Living with Animals: Binds across Species, Cornell University Press, USA, pp. 17-28", "authors": ["Yasmine Musharbash"]}, {"title": "Predicaments of Proximity. Revising Relatedness in a Warlpiri Town", "year": "2018", "source": "in Diane Austin-Broos and Francesca Merlan (ed.), People and Change in Indigenous Australia, University of Hawaii Press, United States of America, pp. 44-58", "authors": ["Yasmine Musharbash"]}, {"title": "Yulyurdu: Smoke in the Desert", "year": "2018", "source": "Anthropological Forum, vol. 28, no. 2, pp. 116-125", "authors": ["Yasmine Musharbash"]}, {"title": "nthropology and Smoke: Editors", "year": "2018", "source": "Introduction to the Smoke Special Issue'Anthropological Forum, vol. 28, no. 2, pp. 107-115pp", "authors": ["Dennis S", "Yasmine Musharbash"]}, {"title": "", "year": "2018", "source": "Smoke and Anthropology (Guest Editors: Simone Dennis and Yasmine Musharbash)", "authors": ["Dennis S", "Yasmine Musharbash", "eds"]}, {"title": "Telling Warlpiri Dog Stories", "year": "2017", "source": "Anthropological Forum, vol. 27, no. 2, pp. 95-113", "authors": ["Yasmine Musharbash"]}, {"title": "Country", "year": "2017", "source": "community' and growth town': Three spatio-temporal snapshots of Warlpiri experiences of home', in Justine Lloyd and Ellie Vasta (ed.), Reimagining Home in the 21st Century, Edward Elgar Publishing Inc., USA, pp. 72-86", "authors": ["Yasmine Musharbash"]}, {"title": "Evening Play: Acquainting Toddlers with Dangers and Fear at Yuendumu, Northern Territory", "year": "2016", "source": "in Hideaki Terashima & Barry S Hewlett (ed.), Social Learning and Innovation in Contemporary Hunter-Gatherers: Evolutionary and Ethnographic Perspectives, Springer Japan KK, Tokyo, pp. 171-177", "authors": ["Yasmine Musharbash"]}, {"title": "Short Essay on Monsters, Birds, and Sounds of the Uncanny", "year": "2016", "source": "Semiotic Review, vol. 2, no. 3, pp. 1-11", "authors": ["Yasmine Musharbash"]}, {"title": "The Triangle: A Narrative Portrait of Place-Gathered Monstrousness", "year": "2016", "source": "in Erin Vander Wall (ed.), Edgelands: A Collection of Monstrous Geographies, Inter-Disciplinary Press, UK, pp. 31-40", "authors": ["Yasmine Musharbash"]}, {"title": "Monstrous Transformations: A Case Study from Central Australia", "year": "2014", "source": "in Yasmine Musharbash & Geir Henning Presterudstuen (ed.), Monster Anthropology in Australasia and Beyond, Palgrave Macmillan, New York, pp. 39-56", "authors": ["Yasmine Musharbash"]}, {"title": "Introduction: Monsters, Anthropology, and Monster Studies", "year": "2014", "source": "in Yasmine Musharbash & Geir Henning Presterudstuen (ed.), Monster Anthropology in Australasia and Beyond, Palgrave Macmillan, New York, pp. 1-24", "authors": ["Yasmine Musharbash"]}, {"title": "Here be Kurdaitcha: Towards an Ethnography of the Monstrous on the Margins of a Central Australian Aboriginal Town", "year": "2014", "source": "in C Douglas, R Monacella (ed.), Places and Spaces of Monstrosity, Inter-Disciplinary Press, Oxford, UK, pp. 117-124", "authors": ["Yasmine Musharbash"]}, {"title": "Night, sight, and feeling safe: An exploration of aspects of Warlpiri and Western sleep", "year": "2013", "source": "Australian Journal of Anthropology, The, vol. 24, no. 1, pp. 48-63", "authors": ["Yasmine Musharbash"]}, {"title": "Embodied Meaning: Sleeping Arrangements in Central Australia", "year": "2013", "source": "in Katie Glaskin and Richard Chenhall (ed.), Sleep Around the World: Anthropological Perspectives, Palgrave Macmillan Ltd, New York, pp. 45-60", "authors": ["Yasmine Musharbash"]}, {"title": "Warungka: Becoming and Un-becoming a Warlpiri Person", "year": "2011", "source": "in Ute Eickelcamp (ed.), Growing Up in Central Australia: New Anthropological Studies of Aboriginal Childhood and Adolescence, Berghahn Books, New York, pp. 63-81", "authors": ["Yasmine Musharbash"]}, {"title": "Ethnography & the Production of Anthropological Knowledge: Essays in Honour of Nicolas Peterson", "year": "2011", "source": "ANU PressCanberra, Australia", "authors": ["Yasmine Musharbash", "Barber M", "eds"]}, {"title": "Only whitefella take that road", "year": "2010", "source": ": Culture seen through the intervention at Yuendumu'in Jon Altman and Melinda Hinkson (ed.), Culture Crisis: Anthropology and Politics in Aboriginal Australia, UNSW Press, Sydney, pp. 212-225", "authors": ["Yasmine Musharbash"]}, {"title": "Marriage, Love Magic and Adultery: Walpiri Relationships as Seen by Three Generations of Anthropologists", "year": "2010", "source": "Oceania, vol. 80, no. 3, pp. 272-288", "authors": ["Yasmine Musharbash"]}, {"title": "Warlpiri fears/whitefella fears: Ways of being in Central Australia seen through an emotion", "year": "2010", "source": "Emotion, Space and Society, vol. 3, pp. 95-102", "authors": ["Yasmine Musharbash"]}, {"title": "Perilous Laughter: Examples from Yuendumu, Central Australia", "year": "2008", "source": "Anthropological Forum, vol. 18, no. 3, pp. 271-277", "authors": ["Yasmine Musharbash"]}, {"title": "You", "year": "2008", "source": "ve Got to be Joking: Asserting the Analytical Value of Humour and Laughter in Contemporary Anthropology'Anthropological Forum, vol. 18, no. 3, pp. 209-217", "authors": ["Carty J", "Yasmine Musharbash"]}, {"title": "Sorry Business is Yapa Way", "year": "2008", "source": ": Warlpiri Mortuary Rituals as Embodied Practice'in K. Glaskin, M. Tonkinson, Y. Musharbash and V. Burbank (ed.), Mortality, Mourning and Mortuary Practices in Indigenous Australia, Ashgate Publishing Ltd, Farnham UK, pp. 21-36", "authors": ["Yasmine Musharbash"]}, {"title": "Boredom, time, and modernity: An example from Aboriginal Australia", "year": "2007", "source": "American Anthropologist, vol. 109, no. 2, pp. 307-317", "authors": ["Yasmine Musharbash"]}, {"title": "Red Bucket for the Red Cordial, Green Bucket for the Green Cordial: On the Logic and Logistics of Warlpiri Birthday Parties", "year": "2004", "source": "Australian Journal of Anthropology, The, vol. 15, no. 1, pp. 12-22", "authors": ["Yasmine Musharbash"]}, {"title": "Indigenous families and the welfare system: The Yuendumu community case study", "year": "2001", "source": "Stage Two", "authors": ["Yasmine Musharbash"]}, {"title": "Yuendemu CDEP: The Warlpiri work ethic and Kardiya staff turnover", "year": "2001", "source": "The Indigenous Welfare Economy and the CDEP Scheme: Autonomy, Dependence, Self Determination and Mutual Obligation, ed. F. Morphy and W. Sanders, Australian National University, Canberra, pp. 153-165", "authors": ["Yasmine Musharbash"]}, {"title": "The Yuendemu Community Case Study", "year": "2000", "source": "in Smith, D. (ed.), Indigenous Families and the Welfare System: Two Community Case Studies, Australian National University, Canberra, pp. 53-84", "authors": ["Yasmine Musharbash"]}]}, "Microsoft-Academic": [{"title": "boredom time and modernity an example from aboriginal australia", "year": 2007, "source": "american anthropologist", "authors": [{"name": "yasmine musharbash", "affiliation": "university of western australia"}], "id": 102499938}, {"title": "yuendumu everyday contemporary life in remote aboriginal australia", "year": 2009, "source": "", "authors": [{"name": "yasmine musharbash"}]}, {"title": "you ve got to be joking asserting the analytical value of humour and laughter in contemporary anthropology", "year": 2008, "source": "anthropological forum", "authors": [{"name": "john carty"}, {"name": "yasmine musharbash"}], "id": 92835259}, {"title": "marriage love magic and adultery warlpiri relationships as seen by three generations of anthropologists", "year": 2010, "source": "oceania", "authors": [{"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 58557618}, {"title": "mortality mourning and mortuary practices in indigenous australia", "year": 2009, "source": "", "authors": [{"name": "myrna tonkinson"}, {"name": "victoria burbank"}, {"name": "katie glaskin"}, {"name": "yasmine musharbash"}]}, {"title": "night sight and feeling safe an exploration of aspects of warlpiri and western sleep", "year": 2013, "source": "the australian journal of anthropology", "authors": [{"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 202606351}, {"title": "telling warlpiri dog stories", "year": 2017, "source": "anthropological forum", "authors": [{"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 92835259}, {"title": "yulyurdu smoke in the desert", "year": 2018, "source": "anthropological forum", "authors": [{"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 92835259}, {"title": "anthropology and smoke editors introduction to the smoke special issue", "year": 2018, "source": "anthropological forum", "authors": [{"name": "simone dennis", "affiliation": "australian national university"}, {"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 92835259}, {"title": "warlpiri fears whitefella fears ways of being in central australia seen through an emotion", "year": 2010, "source": "emotion space and society", "authors": [{"name": "yasmine musharbash", "affiliation": "university of sydney"}], "id": 150370431}], "ANDS-Grants": [{"description": "By investigating the deterioration of social relations currently experienced by Warlpiri people at the settlement of Yuendumu, this project develops a paradigmatic case study contributing towards better understanding contemporary Aboriginal Australia. It explores on-the-ground realities and historical material to identify patterns underlying the transformations of social relations. It analyses these and their effects through an innovative conceptual framework integrating anthropological approaches with the interdisciplinary study of the emotions. The outcomes will considerably further current developments in Australian anthropology and it will make a timely qualitative contribution to current public debates about Aboriginal policy.", "title": "Future Fellowships - Grant ID: FT130100415", "id": "517387", "institutions": ["University of Sydney"], "key": "http://purl.org/au-research/grants/arc/FT130100415", "researchers": ["Dr Yasmine Musharbash"], "status": "closed", "fundingAmount": 656316, "fundingScheme": "Future Fellowships", "startDate": 2013, "endDate": 2017, "dateTimeModified": "2017-07-05T03:01:37Z", "dateTimeCreated": "2015-04-12T05:06:24Z", "funder": ["Australian Research Council"], "managingInstitution": ["University of Sydney"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/FT130100415", "identifiers": ["http://purl.org/au-research/grants/arc/FT130100415", "FT130100415"], "subjects": ["ANTHROPOLOGY", "STUDIES IN HUMAN SOCIETY", "aboriginal australia", "continuity and change", "sociality"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/517387"}]}]}