{"ANU": {"name": "Ying Yi Chih", "link": "https://researchers.anu.edu.au/researchers/chih-y", "colleges": "College of Business& Economics", "email": "ying-yi.chih@anu.edu.au", "phone": "", "expertise": [], "interest": ["• Infrastructure Project Planning and Management • Public Project Procurement and Management • Public-Private Partnerships  • Employee Psychological Well-being and Performance Managment in the Contexts of Projects and Construction Industry"], "biography": "", "project": [], "publication": [{"title": "Enhancing value co-creation in professional service projects: The roles of professionals, clients and their effective interactions", "year": "2019", "source": "International Journal of Project Management, vol. 37, no. 5, pp. 599-615", "authors": ["Ying Yi Chih", "Zwikael O", "Restubog S"]}, {"title": "Project benefit management: Setting effective target benefits", "year": "2018", "source": "International Journal of Project Management, vol. 36, no. 4, pp. 650-658pp", "authors": ["Zwikael O", "Ying Yi Chih", "Meredith J"]}, {"title": "Dynamic Capabilities of Project-Based Organization in Global Operations", "year": "2018", "source": "Journal of Management in Engineering, vol. 34, no. 5, pp. -", "authors": ["Choi S", "Cho I", "Han S", "Ying Yi Chih"]}, {"title": "Interactive Effects of Supportive Leadership and Top Management Team", "year": "2018", "source": "s Charismatic Vision in Predicting Worker Retention in the Philippines'Journal of Construction Engineering and Management - ASCE, vol. 144, no. 10, pp. 1-10", "authors": ["Ying Yi Chih", "Kiazad K", "Cheng D"]}, {"title": "Managing Critical Risks Affecting the Financial Viability of Public-Private Partnership Projects: Case Study of Toll Road Projects in Vietnam", "year": "2018", "source": "Journal of Construction Engineering and Management - ASCE, vol. 144, no. 12", "authors": ["Nguyen A", "Mollik A", "Ying Yi Chih"]}, {"title": "Broken promises: Implications for Chinese construction workers", "year": "2017", "source": "job insecurity and performance'Journal of Construction Engineering and Management - ASCE, vol. 143, no. 4, pp. 10pp", "authors": ["Ying Yi Chih", "Kiazad K", "Li M"]}, {"title": "Influence of Participants", "year": "2017", "source": "Characteristics on Sustainable Building Practices in Emerging Economies: An Empirical Case Study'Journal of Construction Engineering and Management - ASCE, vol. 143, no. 8, pp. 11pp.", "authors": ["Nguyen H", "Nguyen L", "Ying Yi Chih"]}, {"title": "Feeling Positive and Productive: Role of Supervisor-Worker Relationship in Predicting Construction Workers", "year": "2017", "source": "Performance in the Philippines'Journal of Construction Engineering and Management - ASCE, vol. 143, no. 8, pp. 04017049 (10pp)", "authors": ["Ying Yi Chih", "Kiazad K", "Cheng D"]}, {"title": "Does organizational justice matter? Implications for construction workers", "year": "2016", "source": "organizational commitment'Journal of Management in Engineering", "authors": ["Ying Yi Chih", "Kiazad K", "Cheng D"]}, {"title": "Investigating Employee Turnover in the Construction Industry: A Psychological Contract Perspective", "year": "2016", "source": "Journal of Construction Engineering and Management - ASCE, vol. 142, no. 6", "authors": ["Ying Yi Chih", "Kiazad K", "Lian Z"]}, {"title": "Enhancing project funding decision quality", "year": "2015", "source": "in Mitsuo Gen, Kuinam J. Kim, Xiaoxia Huang, Yabe Hiroshi (ed.), Industrial Engineering, Management Science and Applications 2015, Springer Berlin Heidelberg, New York Dordrecht London, pp. 363-374", "authors": ["Zwikael O", "Ying Yi Chih"]}, {"title": "Knowledge Areas Taught in Project Management Programs in Australia, the United Kingdom and the United States", "year": "2015", "source": "International Research Network on Organizing by Projects IRNOP 2015, UCL, London, UK, pp. 18pp", "authors": ["Ying Yi Chih", "Nguyen L", "Garcia de Soto Lastra B"]}, {"title": "Value Co-Creation Theoretical Framework in Project-Based Organizations: The Case of Professional Service Firms", "year": "2015", "source": "International Research Network on Organizing by Projects IRNOP 2015, UCL, London, UK, pp. 24pp", "authors": ["Ying Yi Chih", "Zwikael O"]}, {"title": "Project benefit management: A conceptual framework of target benefit formulation", "year": "2015", "source": "International Journal of Project Management, vol. 33, no. 1, pp. 352-362", "authors": ["Ying Yi Chih", "Zwikael O"]}, {"title": "Value Co-Creation in Management Consulting: A Theoretical Framework in Professional Service Context", "year": "2015", "source": "2015 Annual Meeting of the Academy of Management, Academy of Management", "authors": ["Ying Yi Chih", "Zwikael O"]}, {"title": "Evaluating the Quality of Proposed Projects", "year": "2015", "source": "Target Benefits'2015 Annual Meeting of the Academy of Management, Academy of Management", "authors": ["Zwikael O", "Ying Yi Chih"]}, {"title": "Project benefit management: formulation and appraisal of target benefits", "year": "2014", "source": "Project Management Institute Research and Education Conference 2014, Project Management Institute, Portland, Oregon", "authors": ["Zwikael O", "Ying Yi Chih"]}, {"title": "On the Use of Simulation-Based Training for Project Management Education: Mind the Gap, as One Size Does Not Fit All", "year": "2015", "source": "Journal of Management in Engineering, 31 (2) pp. 040140351-11", "authors": ["Zwikael O", "Shtub A", "Ying Yi Chih"]}, {"title": "Project Benefit Management: Setting Target Benefits", "year": "2013", "source": "European Academy of Management 2013, European Academy of Management, Brussels, Belgium, p. 22", "authors": ["Zwikael O", "Ying Yi Chih"]}, {"title": "Reconceptualising mega project success in Australian Defence: Recognising the importance of value co-creation", "year": "2013", "source": "International Journal of Project Management, vol. 31, no. 8, pp. 1139-1153", "authors": ["Chang A", "Ying Yi Chih", "Chew E"]}, {"title": "Benefit Realisation from Public Projects: A Theoretical Framework for the Quality of Target Benefits", "year": "2013", "source": "British Academy of Management Annual Conference 2013, British Academy of Management, Liverpool, pp. 2-24", "authors": ["Ying Yi Chih", "Zwikael O"]}, {"title": "Simulation-Based Training in Project Management Education: The Moderating Effect of Individual Differences on Learning Outcomes Realization", "year": "2012", "source": "Project Management Institute Research and Education Conference 2012, Project Management Institute, Limerick, Ireland, pp. 1-22", "authors": ["Zwikael O", "Shtub A", "Ying Yi Chih"]}, {"title": "The Moderating Effect of Individual Differences on the Effectiveness of Simulation-Based Training", "year": "2012", "source": "Annual Academy of Management Conference 2012, ed. Leslie Toombs, Academy of Management, United States of America, pp. 39pp", "authors": ["Zwikael O", "Shtub A", "Ying Yi Chih"]}, {"title": "Governmental Roles in Unsolicited Public Private Partnerships (PPP) Mechanism: an Examination of Taiwan", "year": "2011", "source": "s Framework'7th International Critical Management Studies Conference 2011, CMS7 2011, International Critical Management Studies Group, Naples, Italy, pp. 1-14", "authors": ["Ying Yi Chih", "Chen Y", "Lee F"]}, {"title": "lternative methods for choosing an appropriate project delivery system (PDS)", "year": "2011", "source": "Facilities, vol. 29, no. 13-14, pp. 527-541", "authors": ["Ibbs C", "Ying Yi Chih"]}, {"title": "Critical Analysis of Management Methodologies: The Case of Project Management", "year": "2011", "source": "7th International Critical Management Studies (CMS) Conference, International Critical Management Studies Group, Naples, Italy, pp. 1-9", "authors": ["Zwikael O", "Smyrk J", "Ying Yi Chih"]}, {"title": "Choosing a project delivery system in a multi-project environment", "year": "2010", "source": "Construction Law International, vol. 5, no. 1, pp. 7-10", "authors": ["Ying Yi Chih", "Ibbs C"]}, {"title": "Towards a comprehensive understanding of public private partnerships for infrastructure development", "year": "2009", "source": "California Management Review, vol. 51, no. 2, pp. 51-78", "authors": ["Kwak Y", "Ying Yi Chih", "Ibbs C"]}, {"title": "Qualitative Comparison of Alternative Project Delivery Systems (PDSs) for Transportation Projects", "year": "2008", "source": "International Conference on Transportation Construction Management 2008, Transportation Construction Management (TCM) Group, USA, pp. 1-10", "authors": ["Ibbs C", "Ying Yi Chih"]}, {"title": "CASE STUDY OF TAIWAN", "year": "2007", "source": "S FRAMEWORK TO EVALUATE UNSOLICITED PUBLIC/PRIVATE PARTNERSHIP PROPOSALS'International Conference on Construction Project Management/2nd International Conference on Construction Engineering and Management (ICCPM/ICCEM), ed. Conference Program Committee, Nanyang Technological University and Korea Institute of Construction Engineering and Management, Singapore, pp. 1-11", "authors": ["Ying Yi Chih", "Chen Y"]}, {"title": "case study of Virginia", "year": "2007", "source": "s Framework to Evaluate Unsolicited Public/Private Partnership Proposals: The Public-Private Transportation Act (PPTA)'World Conference on Transport Research Society 2007, ed. Conference Program Committee, Conference Organising Committee, Berkley, California, pp. 1-16", "authors": ["Ibbs C", "Ying Yi Chih", "Miller J"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}