{"ANU": {"name": "Yuerui Lu", "link": "https://researchers.anu.edu.au/researchers/lu-yx", "colleges": "College of Engineering & Computer Science", "email": "yuerui.lu@anu.edu.au", "phone": "", "expertise": [], "interest": [], "biography": "Yuerui (Larry) Lu received his Ph.D. degree from Cornell University, the school of Electrical and Computer Engineering, in 2012. He holds a B.S. degree from department of Applied Physics at University of Science and Technology of China. In 2013, he joined the Australian National University as a research fellow and lecturer under the Future Engineering Research Leadership Fellowship. In 2016, he was promoted to an associate professor at the ANU. His research interests include MEMS/NEMS sensors and actuators, nano-manufacturing technologies, renewable energy harvesting, biomedical novel devices, nano-materials, nano-electronics, etc. He was the recipient of several awards, including the competitive ACT Young Tall Poppy of 2016, Media and Outreach Award from Australian National University in 2015, Discovery Early Career Research Award (DECRA) from Australian Research Council (ARC) in 2014, Future Engineering Research Leadership Fellow from Australian National University in 2013, MRS Graduate Student Award (Silver) in 2012 from Materials Research Society, Best Poster Award in 2012 from Cornell NanoScale Facility Annual Meeting, Daisy Yen Wu Scholarship in 2012 from Cornell University, Chinese Government Award for outstanding Ph.D. students in 2010, Guo Moruo Presidential Award in 2003 from University of Science and Technology of China, etc. He is serving as a reviewer for several journals, including Nature Communications, Light: Science and Applications, Advanced Materials, ACS Nano, Small, Applied Physics Letters, Nanotechnology, Optics Express, Optics Letters, Sensors and Actuators A: Physical, etc. He is serving as an associate editor for the nature publishing group journal Scientific Reports.", "project": ["My research focuses on nanotechnologies, including  micro/nano-electro-mechanical sensors and actuators, nano-scale energy  conversion devices, biomedical devices, novel nano materials, etc. I am looking for highly motivated Ph.D. graduate students who are majoring in applied physics, electrical engineering, mechanical engineering, chemistry, materials science engineering, biomedical engineering, or other closely related areas to join my research team. We always look for dedicated undergraduate or master students to  join us, to do creative work in rapidly growing field and generate co-authored publications.", "1. MEMS/NEMS based novel biomedical devices", "The ability to detect bio-molecule at ultra-low concentrations (e.g. atto-molar) will enable the possibility of detecting diseases earlier than ever before. A critical challenge for any new bio-sensing technology is to optimize two metrics --- shorter analysis time, and higher concentration sensitivity in clinically relevant small volumes. Moreover, practical considerations are equally important: simplicity of use, mass producible (low cost), and ease of integration within the clinical structure. Compared with other methods, nano-electro-mechanical system (NEMS) based bio-sensors are promising in clinical diagnostics because of their extremely high mass sensitivity, fast response time and the capability of integration on chip. We have demonstrated a low concentration DNA (atto-molar sensitivity) optically interrogated ultrasonic mechanical mass sensor, which has ordered nanowire (NW) array on top of a bilayer membrane. This method represents a mass-based platform technology that can sense molecules at low concentrations, which could be useful for early-stage disease detection. We can develop this sensor further to measure an array of biomarkers (e.g. DNA or proteins), by providing both the needed specificity and sensitivity in physiological disease (e.g. cancer) detection.", "Recommended references:", "2. Nonlinearity engineering for nano-electro-mechanical system", "A nano-electro-mechanical system (NEMS) that integrates various nano-scale mechanical sensors onto a single chip, has attracted exceptional interest among research and engineering communities. Among other remarkable characteristics, these tiny mechanical structures possess strong nonlinear properties. Typically, device nonlinearity is intentionally avoided, because higher amplitude fluctuations in the nonlinear region could be translated into frequency variability. Recently, we found that nonlinearity bifurcation could be used to stabilize our membrane oscillator with nanowire (NW) arrays. As a consequence, we propose to use our NEMS device as a platform to investigate its nonlinear dynamics and gain a deeper understanding of the origins of that nonlinearity. This could present a general mechanism to assist oscillation frequency stabilization and improve NEMS resonator performance for bio-molecular sensing applications. These nanowire arrays could also be embedded into suspended micro-channels. Coupled with the nonlinearity-assisted frequency stabilization result, the sensitivity of the mass sensor could be improved by orders of magnitude.", "Recommended references:", "3. Nano-electro-mechanical system based on novel two dimensional nano-materials", "Two-dimensional (2D) nano-materials, such as molybdenum disulfide (MoS2) and graphene, have atomic or molecular thickness, exhibiting promising applications in nano-electro-mechanical systems. Graphene is a one-atom thick carbon sheet, with atoms arranged in a regular hexagonal pattern. Molybdenum disulfide (MoS2) belongs to transition metal dichalcogenides (TMD) semiconductor family YX2 (Y=Mo, W; X=S, Se, Te), with a layered structure. These 2D nano-materials can be integrated into nano-electro-mechanical systems, enabling ultra-sensitive mechanical mass sensors, with single molecule or even single atom sensitivities. Moreover, the mechanical resonators based on these 2D nano-materials would be a perfect platform to investigate quantum mechanics, opto-mechanics, material internal friction force, nonlinear physics, etc.", "Recommended references:", "4. High-throughput Nano-manufacturing", "Nanolithography is important for nano-scale device fabrication, both in academia and in the semiconductor industry. The fundamental challenge in developing nanolithography systems is to create a system with high resolution (sub-20 nm), high throughput (4-inch wafer exposure within 30 seconds), high controllability and low cost. I have demonstrated the proof of concept for a new lithography system --- Radioisotope-powered Parallel Electron Lithography (RIPEL). This system uses high energy electrons emitted from radioisotope thin films to expose resist through a stencil mask. The RIPEL system simultaneously exposes the entire substrate, making it a parallel system, as opposed to the serial raster scanning electron beam lithography system. This will enable the rapid exposure of nano-scale features over very large substrates. However, there are still several significant hurdles in preventing RIPEL’s practical uses. We will study these hurdles and propose developing building blocks to overcome these hurdles, through radioisotope electron sources development, new mask design, and investigation of new electron resist. These building blocks will enhance RIPEL’s throughput by four orders of magnitude. The progress will significantly benefit the areas that need volumetric nanostructures with high spatial density and good controllability, such as plasmonics, nanoelectronics, micro/nano-electro-mechanical systems, nano-structured thin film solar cells, biomedical devices, etc.", "Recommended references:", "5. High-efficiency nano-structured thin film solar cells", "Nanostructured silicon thin film solar cells are promising, due to the strongly enhanced light trapping, high carrier collection efficiency, and potential low cost. Ordered nanostructure arrays, with large-area controllable spacing, orientation, and size, are critical for reliable light-trapping and high-efficiency solar cells. Available top-down lithography approaches to fabricate large-area ordered nanostructure arrays are challenging due to the requirement of both high lithography resolution and high throughput. Here, a novel ordered silicon nano-conical-frustum array structure, exhibiting an impressive absorbance over broad band wavelengths by a thickness of only 5 μm, is realized by our recently reported technique radioisotope-powered parallel electron lithography. Moreover, high-efficiency (up to 10.8%) solar cells are demonstrated, using these ordered ultrathin silicon nano-conical-frustum arrays.", "Although these nano-structure arrays have high light absorption efficiency, the solar cell efficiency is still less than half of that for bulk crystalline Si solar cells and the open circuit voltage and fill factor are lower too. This is probably due to the high surface recombination losses, which are introduced by the highly enhanced surface area from the nanostructures, although a thin passivation oxide layer was used. Therefore, how to reduce the surface loss through appropriate surface passivation is critical to further enhance the conversion efficiency. In addition, it will be also interesting to transfer the related fabrication techniques to low-cost substrate.", "Recommended references:", "6. High-efficiency betavoltaic cells by novel semiconductor nano-materials", "Betavoltaics are generators that convert energy from a radioactive beta source to electricity. A beta radioisotope atom gives off a beta high energy particle (e.g., electron) through beta decay, which is governed by Poisson statistics emission event. Radioactive decay is independent of temperature and pressure. Only near nuclear fusion temperatures can the fundamental decay processes be modified. Furthermore the half-lives of many radioisotopes are several years to decades to even centuries. When the high energy beta particles traverse a semiconductor, electron-hole pairs are produced and separated by the built in electrical field of the pn junction, leading to energy conversion. Betavoltaic power sources have very promising applications in harsh environments where long life of the energy source is required. Novel semiconductor nano-materials, such as porous silicon, GaN nano-crystals, etc, have great potential to realize high efficiency betavoltaic cells.", "Recommended references:"], "publication": [{"title": "Preface for a special issue on 2D materials: Growth", "year": "2017", "source": "characterisationproperties and devices", "authors": ["Lee C", "Sundharam R", "Jaiswal M eds", "Yuerui Lu"]}, {"title": "Enhanced second-harmonic generation from two-dimensional MoSe2 by waveguide integration", "year": "2017", "source": "2017 Conference on Lasers and Electro-Optics, CLEO 2017, IEEE, New York, pp. 1-2", "authors": ["Chen H", "Corboliou V", "Solntsev A", "Yuerui Lu"]}, {"title": "Enhanced second-harmonic generation from two-dimensional MoSe2 on a silicon waveguide", "year": "2017", "source": "Light: Science & Applications, vol. 6, no. 10, pp. 1-7", "authors": ["Chen H", "Corboliou V", "Solntsev A", "Yuerui Lu"]}, {"title": "Elastic and Inelastic Light-Matter Interactions in 2D Materials", "year": "2017", "source": "IEEE Journal on Selected Topics in Quantum Electronics, vol. 23, no. 1, pp. -", "authors": ["Pei J", "Yang J", "Yuerui Lu"]}, {"title": "Phosphorene: An emerging 2D material", "year": "2017", "source": "Journal of Materials Research, vol. 32, no. 15, pp. 2839-2847", "authors": ["Yang J", "Yuerui Lu"]}, {"title": "Optical properties of phosphorene", "year": "2017", "source": "Chinese Physics B, vol. 26, no. 3, pp. 9pp", "authors": ["Yang J", "Yuerui Lu"]}, {"title": "Oxygen plasma produced stable few-layer phosphorene in the air", "year": "2016", "source": "Australian Conference on Optical Fibre Technology (ACOFT 2016), Optical Society of American (OSA), New York, USA, pp. -", "authors": ["Gai X", "Pei J", "Yang J", "Yuerui Lu"]}, {"title": "tomically thin lateral p-n junction photodetector with large effective detection area", "year": "2016", "source": "2D Materials, vol. 3, no. 4, pp. 9pp", "authors": ["Xu Z", "Zhang Y", "Wang Z", "Yuerui Lu"]}, {"title": "Molecule-Induced Conformational Change in Boron Nitride Nanosheets with Enhanced Surface Adsorption", "year": "2016", "source": "Advanced Functional Materials, vol. 26, no. 45, pp. 8202-8210", "authors": ["Cai Q", "Du A", "Gao G", "Yuerui Lu"]}, {"title": "Light-Matter Interactions in Phosphorene", "year": "2016", "source": "Accounts of Chemical Research, vol. 49, no. 9, pp. 1806-1815", "authors": ["Junpeng L", "Yang J", "Carvalho A", "Yuerui Lu"]}, {"title": "Producing air-stable monolayers of phosphorene and their defect engineering", "year": "2016", "source": "Nature Communications, vol. 7, no. 10450, pp. 10450-10450", "authors": ["Pei J", "Gai X", "Yang J", "Yuerui Lu"]}, {"title": "Layer-dependent surface potential of phosphorene and anisotropic/layer-dependent charge transfer in phosphorene-gold hybrid systems", "year": "2016", "source": "Nanoscale, vol. 8, no. 1, pp. 129-135pp", "authors": ["Xu R", "Yang J", "Zhu Y", "Yuerui Lu"]}, {"title": "Exciton Brightening in Monolayer Phosphorene via Dimensionality Modification", "year": "2016", "source": "Advanced Materials, vol. 28, no. 18, pp. 3493-3498pp", "authors": ["Xu R", "Yang J", "Win Myint Y", "Yuerui Lu"]}, {"title": "Strongly enhanced photoluminescence in nanostructured monolayer MoS2 by chemical vapor deposition", "year": "2016", "source": "Nanotechnology, vol. 27, no. 13, pp. 7pp", "authors": ["Zhu Y", "Yang J", "Zhang S", "Yuerui Lu"]}, {"title": "Two-Dimensional CH(3)NH(3)Pbl(3) Perovskite: Synthesis and Optoelectronic Application", "year": "2016", "source": "ACS Nano, vol. 10, no. 3, pp. 3536-3542", "authors": ["Lin J", "Xue Y", "Wang Z", "Yuerui Lu"]}, {"title": "Manipulation of photoluminescence of two-dimensional MoSe2 by gold nanoantennas", "year": "2016", "source": "Scientific Reports, vol. 6, pp. 22296-22296", "authors": ["Chen H", "Yang J", "Rusak E", "Yuerui Lu"]}, {"title": "Robust Excitons and Trions in Monolayer MoTe2", "year": "2015", "source": "ACS Nano, vol. 9, no. 6, pp. 6603-6609", "authors": ["Yang J", "Yuerui Lu", "Win Myint Y"]}, {"title": "Electronic applications of graphene mechanical resonators", "year": "2015", "source": "IET Circuits, Devices and Systems, vol. 9, no. 6, pp. 413-419", "authors": ["Sharma A", "Varshney U", "Yuerui Lu"]}, {"title": "D materials for nanophotonic devices", "year": "2015", "source": "SPIE Micro+Nano Materials, Devices, and Applications Symposium 2015, ed. Palomba S.Eggleton B, SPIE, Australia, pp. 1-7", "authors": ["Xu R", "Yang J", "Zhang S", "Yuerui Lu"]}, {"title": "new two-dimensional material: Phosphorene", "year": "2015", "source": "International Microwave Workshop Series on Advanced Materials and Processes for RF and THz Applications, MTT-S IMWS-AMP 2015, IEEE, TBC, pp. -", "authors": ["Yuerui Lu"]}, {"title": "Optical tuning of exciton and trion emissions in monolayer phosphorene", "year": "2015", "source": "Light: Science & Applications, vol. 4, pp. e312 (7pp)", "authors": ["Yang J", "Xu R", "Pei J", "Yuerui Lu"]}, {"title": "Giant Plasmene Nanosheets, Nanoribbons, and Origami", "year": "2014", "source": "ACS Nano, vol. 8, no. 11, pp. 11086-11093", "authors": ["Si K", "Sikdar D", "Cheng Y", "Yuerui Lu"]}]}, "Microsoft-Academic": [{"title": "extraordinary photoluminescence and strong temperature angle dependent raman responses in few layer phosphorene", "year": 2014, "source": "acs nano", "authors": [{"name": "shuang zhang", "affiliation": "australian national university"}, {"name": "jiong yang", "affiliation": "australian national university"}, {"name": "renjing xu", "affiliation": "australian national university"}, {"name": "fan wang"}, {"name": "weifeng li", "affiliation": "agency for science technology and research"}, {"name": "muhammad ghufran", "affiliation": "australian national university"}, {"name": "yongwei zhang", "affiliation": "agency for science technology and research"}, {"name": "z yu", "affiliation": "university of wisconsin madison"}, {"name": "gang zhang", "affiliation": "agency for science technology and research"}, {"name": "qinghua qin", "affiliation": "australian national university"}, {"name": "yuerui lu", "affiliation": "australian national university"}], "id": 145476921}, {"title": "extraordinary photoluminescence and strong temperature angle dependent raman responses in few layer phosphorene", "year": 2014, "source": "arxiv mesoscale and nanoscale physics", "authors": [{"name": "shuang zhang", "affiliation": "australian national university"}, {"name": "jiong yang", "affiliation": "australian national university"}, {"name": "renjing xu", "affiliation": "australian national university"}, {"name": "fan wang"}, {"name": "weifeng li", "affiliation": "agency for science technology and research"}, {"name": "muhammad ghufran", "affiliation": "australian national university"}, {"name": "yongwei zhang", "affiliation": "agency for science technology and research"}, {"name": "z yu", "affiliation": "university of wisconsin madison"}, {"name": "gang zhang", "affiliation": "agency for science technology and research"}, {"name": "qinghua qin", "affiliation": "australian national university"}, {"name": "yuerui lu", "affiliation": "australian national university"}], "id": 2596328991}, {"title": "selective etching of metallic carbon nanotubes by gas phase reaction", "year": 2006, "source": "science", "authors": [{"name": "guangyu zhang", "affiliation": "stanford university"}, {"name": "pengfei qi", "affiliation": "stanford university"}, {"name": "xinran wang", "affiliation": "stanford university"}, {"name": "yuerui lu", "affiliation": "stanford university"}, {"name": "xiaolin li", "affiliation": "stanford university"}, {"name": "ryan tu", "affiliation": "stanford university"}, {"name": "sarunya bangsaruntip", "affiliation": "stanford university"}, {"name": "david mann", "affiliation": "stanford university"}, {"name": "li zhang", "affiliation": "stanford university"}, {"name": "hongjie dai", "affiliation": "stanford university"}], "id": 3880285}, {"title": "producing air stable monolayers of phosphorene and their defect engineering", "year": 2016, "source": "nature communications", "authors": [{"name": "jiajie pei", "affiliation": "australian national university"}, {"name": "jiajie pei", "affiliation": "beijing institute of technology"}, {"name": "xin gai", "affiliation": "australian national university"}, {"name": "jiong yang", "affiliation": "australian national university"}, {"name": "xinbin wang", "affiliation": "beijing institute of technology"}, {"name": "z yu", "affiliation": "university of wisconsin madison"}, {"name": "dukyong choi", "affiliation": "australian national university"}, {"name": "barry lutherdavies", "affiliation": "australian national university"}, {"name": "yuerui lu", "affiliation": "australian national university"}], "id": 64187185}, {"title": "two dimensional ch3nh3pbi3 perovskite synthesis and optoelectronic application", "year": 2016, "source": "acs nano", "authors": [{"name": "jingying liu"}, {"name": "yunzhou xue", "affiliation": "soochow university"}, {"name": "ziyu wang"}, {"name": "zaiquan xu"}, {"name": "changxi zheng"}, {"name": "bent weber"}, {"name": "jingchao song"}, {"name": "yusheng wang", "affiliation": "soochow university"}, {"name": "yuerui lu", "affiliation": "australian national university"}, {"name": "yupeng zhang"}, {"name": "qiaoliang bao", "affiliation": "soochow university"}], "id": 145476921}, {"title": "optical tuning of exciton and trion emissions in monolayer phosphorene", "year": 2015, "source": "light science & applications", "authors": [{"name": "jiong yang", "affiliation": "australian national university"}, {"name": "renjing xu", "affiliation": "australian national university"}, {"name": "jiajie pei", "affiliation": "australian national university"}, {"name": "jiajie pei", "affiliation": "beijing institute of technology"}, {"name": "ye win myint", "affiliation": "australian national university"}, {"name": "fan wang", "affiliation": "australian national university"}, {"name": "zhu wang", "affiliation": "university of wisconsin madison"}, {"name": "shuang zhang", "affiliation": "australian national university"}, {"name": "z yu", "affiliation": "university of wisconsin madison"}, {"name": "yuerui lu", "affiliation": "australian national university"}], "id": 2498964232}, {"title": "optical tuning of exciton and trion emissions in monolayer phosphorene", "year": 2015, "source": "arxiv materials science", "authors": [{"name": "jiong yang", "affiliation": "australian national university"}, {"name": "renjing xu", "affiliation": "australian national university"}, {"name": "jiajie pei", "affiliation": "australian national university"}, {"name": "jiajie pei", "affiliation": "beijing institute of technology"}, {"name": "ye win myint", "affiliation": "australian national university"}, {"name": "fan wang", "affiliation": "australian national university"}, {"name": "zhu wang", "affiliation": "university of wisconsin madison"}, {"name": "shuang zhang", "affiliation": "australian national university"}, {"name": "z yu", "affiliation": "university of wisconsin madison"}, {"name": "yuerui lu", "affiliation": "australian national university"}], "id": 2596376215}, {"title": "high efficiency ordered silicon nano conical frustum array solar cells by self powered parallel electron lithography", "year": 2010, "source": "nano letters", "authors": [{"name": "yuerui lu", "affiliation": "cornell university"}, {"name": "amit lal"}], "id": 143846845}, {"title": "dna functionalization of carbon nanotubes for ultrathin atomic layer deposition of high κ dielectrics for nanotube transistors with 60 mv decade switching", "year": 2006, "source": "journal of the american chemical society", "authors": [{"name": "yuerui lu", "affiliation": "stanford university"}, {"name": "sarunya bangsaruntip"}, {"name": "xinran wang"}, {"name": "li zhang"}, {"name": "yoshio nishi"}, {"name": "hongjie dai", "affiliation": "stanford university"}], "id": 111155417}, {"title": "molecule induced conformational change in boron nitride nanosheets with enhanced surface adsorption", "year": 2016, "source": "advanced functional materials", "authors": [{"name": "qiran cai", "affiliation": "deakin university"}, {"name": "aijun du", "affiliation": "queensland university of technology"}, {"name": "guoping gao", "affiliation": "queensland university of technology"}, {"name": "srikanth mateti", "affiliation": "deakin university"}, {"name": "bruce c c cowie", "affiliation": "australian synchrotron"}, {"name": "dong qian", "affiliation": "university of texas at dallas"}, {"name": "shuang zhang", "affiliation": "australian national university"}, {"name": "yuerui lu", "affiliation": "australian national university"}, {"name": "lan fu", "affiliation": "australian national university"}, {"name": "takashi taniguchi", "affiliation": "national institute for materials science"}, {"name": "shaoming huang", "affiliation": "wenzhou university"}, {"name": "ying chen", "affiliation": "deakin university"}, {"name": "rodney s ruoff", "affiliation": "ulsan national institute of science and technology"}, {"name": "lu hua li", "affiliation": "deakin university"}], "id": 135204980}], "ANDS-Grants": [{"description": "This project aims to realise rapid fabrication of controllable nano-devices over large areas with high throughput and low cost. The lack of large-size (greater than four inch) mask and ultra-low dose resist are the fundamental challenges for high-throughput radioisotope-powered parallel electron nano-lithography (RIPEL) systems. This project aims to realise a large-size RIPEL mask by using the ultra-light supporting material aerographite that has a state-of-the-art ratio value of Young's modulus to cubic density. It will also develop a new inorganic nanoparticle resist with ultra-low dose. These building blocks will enhance RIPEL's throughput by four orders of magnitude. The project will contribute to making processors or solid state storage cheaper and more efficient.", "title": "Discovery Early Career Researcher Award - Grant ID: DE140100805", "id": "518398", "institutions": ["Australian National University"], "key": "http://purl.org/au-research/grants/arc/DE140100805", "researchers": ["Dr Yuerui Lu"], "status": "closed", "fundingAmount": 395220, "fundingScheme": "Discovery Early Career Researcher Award", "startDate": 2014, "endDate": 2016, "dateTimeModified": "2016-05-29T08:49:54Z", "dateTimeCreated": "2015-04-12T05:07:54Z", "funder": ["Australian Research Council"], "managingInstitution": ["Australian National University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DE140100805", "identifiers": ["http://purl.org/au-research/grants/arc/DE140100805", "DE140100805"], "subjects": ["NANOTECHNOLOGY", "TECHNOLOGY", "beta-emitter", "high-throughput", "nano-lithography"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/518398"}]}, {"description": "This project aims to investigate phosphorene, a new two-dimensional material, for the development of new optical and electronic devices. Such materials have unique optical and electronic properties due to their flat physical structure, which gives rise to strong interactions between light and matter. The expected outcome of this project will be new kinds of near infrared light emitting diodes, single photon emitters and ground-breaking lasers. These developments will enable the fabrication of new low-power light sources that can integrate with communication technologies now, and quantum communication technologies in the future.", "title": "Discovery Projects - Grant ID: DP180103238", "id": "1316899", "key": "http://purl.org/au-research/grants/arc/DP180103238", "researchers": ["A/Prof Yuerui Lu", "A/Prof Benjamin Buchler", "Asst Prof Zongfu Yu"], "subject_type": null, "subject_value_resolved": null, "institutions": null, "status": "active", "fundingAmount": 402934, "fundingScheme": "Discovery Projects", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:43Z", "dateTimeCreated": "2018-03-06T23:37:35Z", "funder": ["Australian Research Council"], "managingInstitution": null, "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/DP180103238", "identifiers": ["http://purl.org/au-research/grants/arc/DP180103238", "DP180103238"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1316899"}]}, {"description": "This project aims to establish a readily accessible facility for measurement of electric and magnetic properties of materials under extreme temperature, magnetic field, and sensitivity conditions. The expected outcome is to build capacity for and support world-leading research into novel topological materials, atomically thin materials, materials with strong light-matter interactions and magnetic materials. The benefits to society are new devices for efficient generation, storage, transmission and switching of energy.", "title": "Linkage Infrastructure, Equipment and Facilities - Grant ID: LE180100054", "id": "1317727", "institutions": ["Monash University"], "key": "http://purl.org/au-research/grants/arc/LE180100054", "researchers": ["Prof Michael Fuhrer", "Dr Mark Edmonds", "Prof Udo Bach", "Prof Kiyonori Suzuki", "Dr Julie Karel", "Prof Kourosh Kalantar-zadeh", "A/Prof Lan Wang", "Prof Vipul Bansal", "Dr Jianzhen Ou", "A/Prof Jan Seidel", "Dr Jiabao Yi", "A/Prof Yuerui Lu"], "status": "active", "fundingAmount": 824080, "fundingScheme": "Linkage Infrastructure, Equipment and Facilities", "startDate": 2018, "endDate": 2023, "dateTimeModified": "2018-10-02T04:21:13Z", "dateTimeCreated": "2018-03-06T23:37:46Z", "funder": ["Australian Research Council"], "managingInstitution": ["Monash University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LE180100054", "identifiers": ["http://purl.org/au-research/grants/arc/LE180100054", "LE180100054"], "subjects": ["CONDENSED MATTER PHYSICS", "PHYSICAL SCIENCES"], "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1317727"}]}, {"description": "This project aims to establish the most advanced all-in-one multi-functional 3D imaging system in the world. The facility is expected to combine broadband pulse lasers, optical and electronic measurement modules and electrochemical workstations with confocal Raman microscopy to realise 3D imaging and mapping of micro and nanoscale devices. The facility will offer optical tools for in-situ studying of how these micro and nanoscale devices are affected by interactions with external stimuli such as light, heat and stress. The facility will build capacity in Australia for research into advanced functional devices, and develop the workforce for device industries of the future.", "title": "Linkage Infrastructure, Equipment and Facilities - Grant ID: LE190100116", "id": "1378845", "institutions": ["Monash University"], "key": "http://purl.org/au-research/grants/arc/LE190100116", "researchers": ["A/Prof Qiaoliang Bao", "Prof Igor Aharonovich", "Prof Kourosh Kalantar-zadeh", "Prof Wenlong Cheng", "A/Prof Yuerui Lu", "A/Prof Jacek Jasieniak", "Prof Nicolas Voelcker", "Prof Min Gu", "Dr Luhua Li", "Prof Mark Banaszak Holl", "Prof Tao Wu", "Prof Matthew Phillips", "A/Prof Brian Abbey", "Prof Ann Roberts", "Prof Dan Li"], "subject_type": null, "subject_value_resolved": null, "status": "active", "fundingAmount": 809000, "fundingScheme": "Linkage Infrastructure, Equipment and Facilities", "startDate": 2019, "endDate": 2023, "dateTimeModified": "2019-06-03T03:28:54Z", "dateTimeCreated": "2019-06-03T03:28:54Z", "funder": ["Australian Research Council"], "managingInstitution": ["Monash University"], "principalInvestigator": null, "purl": "http://purl.org/au-research/grants/arc/LE190100116", "identifiers": ["http://purl.org/au-research/grants/arc/LE190100116", "LE190100116"], "subjects": null, "links": [{"rel": "self", "href": "http://researchdata.edu.au/api/v2.0/registry/activities/grants/1378845"}]}]}