{"ANU": {"name": "Zbigniew H. Stachurski", "link": "https://researchers.anu.edu.au/researchers/stachurski-zh", "colleges": "College of Engineering & Computer Science", "email": "zbigniew.stachurski@anu.edu.au", "phone": "+61 2 6125 5681", "expertise": [], "interest": ["Structure of solids: Theory of  atomic arrangement in ideal and real amorphous solids. Measuring atomic  arrangements in real amorphous organic, inorganic and metallic alloys. Structure and properties  of natural materials. Mechanics of composite materials: elastic and  buckling behaviour of anisotropic domes. Manufacturing of composites:  effect of vibrations on void reduction in laminated composites Fibre  reinforcement of materials: mechanical and physical properties of clay -  cellulose fibre composite Mechanics of materials: variation of strength  properties of genetically modified plants"], "biography": "", "project": ["Software for simulation of Ideal Amorphous Solid (IAS)", "http://users.cecs.anu.edu.au/~u9300839/IAS_GUI.zip", "Real time strain measurement system for material characterisationAn Analytical Transmission Electron Microscope for the Investigation of Functional Materials, Earth Processes and Novel Condensed MatterApplication of pressure waves for B-staging and manufacturing of laminated compositesSatomgi Research Project: ACT ESA Information ArchitectureReplacement X-ray generators: fundamental infrastructure for materials scienceSystems Approach to Management of Government InformationFacility for Polarization Characterization of Ferroelectric, Plezoelectric, Pryoelectric MaterialsQuickstep Process ProjectImproved understanding of nanoscale materials - structure, composition, crystallography and defects revealed by electron imaging and analysis at high spatial resolutionAnalysis of Thermoforming Methods for Composite MaterialsAustralian Materials Technology Network - Future MaterialsEast Timor Water Filter ProjectDevelopment of a ceramic structure incorporating an articulated porous microstructure to permit the passage of fluids and gasesFabrication and characterisation of a specially structured material with regulated and articulated porosity for filtration and slow releaseMultilayer Technical Textiles for High Performance Rigid Composite ProductsManufacturing and Modelling of Fibre Reinforced CompositesComposite Materials - Manufacturing Technologies Workshop, October 1997Amorphous thin film materials in solar applicationsAssessment of Advanced Manufacturing Techniques for the Automotive IndustryTowards a Theory of AmorphounessThe definition of an ideal amorphous solid of class IMulti-layer orthogonal offset plate arraysOn the Theory of Ideal Amorphous Structures and Properties of Polymers at the Nano-scale LevelThe New Science of Ideal Amorphous Solids Based on Statistical Geometry and Random ClustersThe stress-strain curve of amorphous glassy PMMAFast, Accurate Motion and Force Control of Shape Memory AlloysDuctile Instability and Strain Softening Phenomenon in Fragile Glass FormersTheoretical and Experimental Stuydies on Amorphous Piezoelectric Polymer SystemsDoping boron nitride nanotubes for light emission and controlled electric conductivitiesHigh Performance Carbon Fibre Composite Batteries: A revolutionary Technology To Power Future VehiclesMechanical Behaviour of Amorphous Glassy Polymers - Simulation of Stress-Strain ResponseUltra high temperature ceramics: materials, wet chemistry based processing and propertiesDeep-Ultraviolet Light Emission from Boron Nitride NanotubesTesting facility for Mechanical Testing of Advanced MaterialsGas Analysis System for Thermochemical Storage of Solar EnergyPreparation and characterization of an advanced epoxy/PPO resin system for high electrical insulation applicationsInvestigation of highly transient events by means of an ultra high speed digital cameraCharacterisation and design of glass-fibre reinforced composites for Barley-Visible Impact (BVID) ResistanceDevelopment of a Ceramic Structure Incorporating an Articulated Porous Microstructure to Permit the Passage of Gases and FluidsEmbedded Micro- and Nanoparticulates: Studies of their Preparation, Nanostructure and PropertiesComputing the Ideal Amorphous SolidTheoretical Model for Plastic Deformation in Amorphous PolymersDensity Fluctuation, Structure and Topology of Amorphous Glassy Materials"], "publication": [{"title": "Structural evolution in a metallic glass pillar upon compression", "year": "2018", "source": "Materials Science and Engineering A, vol. 721, pp. 8-13pp", "authors": ["Tong X", "Wang G", "Bednarcik J", "Zbigniew H. Stachurski"]}, {"title": "computational fluid dynamic study of PV cell temperatures in novel platform and standard arrangements", "year": "2017", "source": "Solar Energy, vol. 144, pp. 203-214", "authors": ["Edgar R", "Zbigniew H. Stachurski", "Cochard S"]}, {"title": "Repeat-length variation in a wheat cellulose synthase-like gene is associated with altered tiller number and stem cell wall composition", "year": "2017", "source": "Journal of Experimental Botany, vol. 68, no. 7, pp. 1519-1529", "authors": ["Hyles J", "Vautrin S", "Pettolino F", "Zbigniew H. Stachurski"]}, {"title": "Ultra-Durable and Transparent Self-Cleaning Surfaces by Large-Scale Self-Assembly of Hierarchical Interpenetrated Polymer Networks", "year": "2016", "source": "ACS Applied Materials and Interfaces, vol. 8, no. 21, pp. 13615-13623", "authors": ["Wong W", "Zbigniew H. Stachurski", "Nisbet D"]}, {"title": "Structural evolution and strength change of a metallic glass at different temperatures", "year": "2016", "source": "Scientific Reports, vol. 6, pp. -", "authors": ["Tong X", "Wang G", "Zbigniew H. Stachurski"]}, {"title": "concordant shift model for flow in bulk metallic glasses", "year": "2016", "source": "Acta Metallurgica Sinica (English Letters), vol. 29, no. 2, pp. 134-139", "authors": ["Wang G", "Zbigniew H. Stachurski"]}, {"title": "Double-layer orthogonal-offset photovoltaic platforms", "year": "2015", "source": "Applied Energy, vol. 147, pp. 478-485", "authors": ["Edgar RA Cochard S", "Zbigniew H. Stachurski"]}, {"title": "Fundamentals of Amorphous Solids: Structure and Proerties", "year": "2015", "source": "Copyright by Higher Education PressBeijing. Published by Wiley-VCH Verlag GmbH & Co, USA, under exclusive license granted by HEP. 260 pp with 150 illustrations. ISBN 978-3-527-33707-1.", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Novel photovoltaic module tracking architecture", "year": "2014", "source": "Optical Instrumentation for Energy and Environmental Applications 2014, Optical Society of American (OSA), United States, pp. 12-15", "authors": ["Zbigniew H. Stachurski"]}, {"title": "X-ray scattering from amorphous solids", "year": "2013", "source": "Journal of Non-crystalline Solids, vol. Online (published dates tbc), p. 7-12", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Nanocrystalline Diamond Thin Films Synthesis on Curved Surface", "year": "2014", "source": "Plasma Chemistry and Plasma Processing, vol. 34, no. 4, pp. 767-784", "authors": ["Li D", "Qin QH Zuo D", "Zbigniew H. Stachurski"]}, {"title": "survey of the natural variation in biomechanical and cell wall properties in inflorescence stems reveals new insights into the utility of Arabidopsis as a wood model", "year": "2013", "source": "Functional Plant Biology, vol. 40, no. 7, pp. 662-676", "authors": ["MacMillan C", "O'Donnell P", "Smit A", "Zbigniew H. Stachurski"]}, {"title": "Three-dimensional panel configurations to reduce wind load and increase convection cooling of photovoltaic surface on solar tracking systems", "year": "2013", "source": "Nanotechnology 2013: Bio Sensors, Instruments, Medical, Environment and Energy - 2013 NSTI Nanotechnology Conference and Expo, NSTI-Nanotech 2013, Conference Organising Committee, Washington, DC, pp. 516-519", "authors": ["Edgar RA Cochard S", "Zbigniew H. Stachurski"]}, {"title": "Lateral drill holes decrease strength of the femur: An observational study using finite element and experimental analyses", "year": "2013", "source": "Journal of Orthopaedic Surgery and Research, vol. 8, no. 1, (2013) pp89-96", "authors": ["Fox M", "Scarvell J", "Smith P", "Zbigniew H. Stachurski"]}, {"title": "Boron Nitride Nanotube Reinforced Polyurethane Composites", "year": "2013", "source": "Progress in Natural Science: Materials International, vol. 23, no. 2013, pp. 170-173", "authors": ["Li L", "Chen Y", "Zbigniew H. Stachurski"]}, {"title": "Theoretical Model of an Ideal Amorphous Solid", "year": "2013", "source": "Physics Procedia, vol. 48, no. 2013, pp. 55-58", "authors": ["Zbigniew H. Stachurski"]}, {"title": "CFD analysis of the flow between dual-layer orthogonal-offset plate arrays", "year": "2012", "source": "Australasian Fluid Mechanics Conference, AFMC 2012, ed. Brandner P.A.Pearce, Australasian Fluid Mechanics Society, TBC, pp. 4pp", "authors": ["Edgar R", "Cochard S", "Zbigniew H. Stachurski"]}, {"title": "Phonon thermal conductivity of a nanowire with amorphous structure", "year": "2012", "source": "Computational Materials Science, vol. 59, pp. 152-157", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Wind loads on solar panels in dual-layer offset-plate arrangements", "year": "2012", "source": "15th Australasian Wind Energy Engineering Society Workshop, Proceedings of the 15th Australasian Wind Engineering Society Workshop, Sydney Australia, pp. 57-61", "authors": ["Ross E", "Cochard S", "Zbigniew H. Stachurski"]}, {"title": "On the void reduction mechanisms in vibration assisted consolidation of fibre reinforced polymer composites", "year": "2011", "source": "Composites Part A: Applied Science and Manufacturing, vol. 42, no. 3, pp. 320-327", "authors": ["Muric-Nesic J", "Compston P", "Zbigniew H. Stachurski"]}, {"title": "Geometry and Topology of Structure in Amorphous Solids", "year": "2011", "source": "Metallurgical and Materials Transactions A, vol. 42A, no. 1, pp. 14-22", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Review: On Structure and Properties of Amorphous Materials", "year": "2011", "source": "Materials, vol. 4, pp. 1564-1598", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Shape Memory Effect in Biopolymers under Uniaxial Deformation", "year": "2011", "source": "Polymer, vol. 52, 874-880", "authors": ["Zbigniew H. Stachurski"]}, {"title": "The geometry, topology and structure of amorphous solids", "year": "2010", "source": "Acta Materialia, vol. 58, no. 2, pp. 615-625", "authors": ["Lee C", "Zbigniew H. Stachurski"]}, {"title": "Microstructure of Horseshoe Nails Using Neutron Diffraction", "year": "2010", "source": "Journal of Materials Engineering and Performance, vol. 19, no. 3, pp. 380-384", "authors": ["Goossens D", "Studer A", "Zbigniew H. Stachurski"]}, {"title": "Orientation and Structure Development in Poly(lactide) under Uniaxial Deformation", "year": "2008", "source": "Acta Materialia, vol. 56, no. 18, pp. 5083-5090", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Microstructure and properties of stoneware clay bodies", "year": "2006", "source": "Clay Minerals, vol. 41, no. 3, pp. 771-785", "authors": ["Zbigniew H. Stachurski"]}, {"title": "On the definition of an ideal amorphous solid of uniform hard spheres", "year": "2006", "source": "Solid State Sciences, vol. 8, no. 8-9, pp. 868-879", "authors": ["To L-Th Daley D", "Zbigniew H. Stachurski"]}, {"title": "Testing materials hardness: Science, technology and applications", "year": "2006", "source": "Materials Forum, vol. 30, pp. 118-125", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Testing Materials", "year": "2006", "source": "Hardness ScienceTechnology & Application', Materials Forum, vol. 30, no. 2006, pp. 118-125", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Review of Deformation and computer Simulations in Amorphous Glassy Polymers", "year": "2005", "source": "Journal of Industrial and Engineering Chemistry, vol. 11, no. 6, 2005, pp. 773-796", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Thermal stability and nanocrystallization of Zr-Ti-Ni-Cu-Be bulk metallic glass", "year": "2005", "source": "Materials Forum, vol. 29, pp. 546-550", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Superplastic deformation behaviour of Zr41.25Ti13.75Ni10Cu12.5Be22.5 bulk metallic glass in the supercooled liquid region", "year": "2005", "source": "Intermetallics, vol. 13, no. 1, pp. 79-85", "authors": ["Shen J", "Wang G", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Compressive fracture characteristics of a Zr-based bulk metallic glass at high test temperatures", "year": "2005", "source": "Materials Science and Engineering A, vol. 398, no. 1-2, pp. 82-87", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Superplasticity and superplastic forming ability of a Zr-Ti-Ni-Cu-Be bulk metallic glass in the supercooled liquid region", "year": "2005", "source": "Journal of Non-crystalline Solids, vol. 351, no. 3, pp. 209-217", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Thermal stability and nanocrystallization of ZR-TI-NI-CU-BE bulk metallic glass", "year": "2005", "source": "International Conference on Advanced Materials Processing 2005, ed. J.F. Nie, M. Barnett, Institute of Materials Engineering Australasia, Australia, pp. 546-550", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Tensile fracture characteristics and deformation behavior of a Zr-based bulk metallic glass at high temperatures", "year": "2005", "source": "Intermetallics, vol. 13, no. 6, pp. 642-648", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "Isothermal nanocrystallization behaviour of Zr41.25Ti13.75Ni10Cu12.5Be22.5 bulk metallic glass in the supercooled liquid region", "year": "2005", "source": "Scripta Materialia, vol. 53, no. 6, pp. 641-645", "authors": ["Wang G", "Shen J", "Sun J", "Zbigniew H. Stachurski"]}, {"title": "The effects of water aging on the interphase region and interlaminar fracture toughness in polymer-glass composites", "year": "2004", "source": "Composites Science and Technology, vol. 64, no. 13-14, pp. 2185-2195", "authors": ["Hodzic A", "Kim J", "Zbigniew H. Stachurski"]}, {"title": "nalysis of an Ideal amorphous Solid", "year": "2004", "source": "Annual Condensed Matter and Materials Meeting 2004, ed. Nick Savvides, Australian Institute of Physics, ANU, Canberra, pp. WP24", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Improved manufacture and productivity of a high performance composite oar blade", "year": "2004", "source": "European Conference on Composite Materials 2004, ed. C Galiotis, European Society for Composite Materials, Greece, pp. 1-9", "authors": ["Campbell J", "Compston P", "Zbigniew H. Stachurski"]}, {"title": "Random close packing of spheres in a round cell", "year": "2004", "source": "Journal of Non-crystalline Solids, vol. 333, no. 2, pp. 161-171", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Course Redesign and Quality Assurance in Materials Engineering", "year": "2003", "source": "Journal of Materials Education, vol. 24, no. 4-6, pp. 237-244", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Study of the Random Close Packing of Spheres", "year": "2003", "source": "Annual Condensed Matter and Materials Meeting 2003, ed. J. Cashion, T. Finlayson, D. Paganin, A. Smith, G. Troup, Australian Institute of Physics, Australia, p. 13", "authors": ["To L", "Zbigniew H. Stachurski"]}, {"title": "Strength and deformation of rigid polymers: the stress-strain curve in amorphous PMMA", "year": "2003", "source": "Polymer, vol. 44, no. 19, pp. 6067-6076", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Definition and Properties of Ideal Amorphous Solids", "year": "2003", "source": "Physical Review Letters, vol. 90, no. 15, pp. 155502-6", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Composite materials based on wood and nylon fibre", "year": "2003", "source": "Composites Part A: Applied Science and Manufacturing, vol. 34, no. 2, pp. 171-181", "authors": ["McHenry E", "Zbigniew H. Stachurski"]}, {"title": "Strength and deformation of rigid polymers: structure and topology in amorphous polymers", "year": "2003", "source": "Polymer, vol. 44, no. 19, pp. 6059-6066", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Micromechanics of stress relaxation in amorphous glassy PMMA.  Part I. Molecular model for anelastic behaviour", "year": "2002", "source": "Polymer, vol. 43, no. 26, pp. 7409-7417", "authors": ["Zbigniew H. Stachurski"]}, {"title": "Micromechanics of stress relaxation in amorphous glassy PMMA Part II: application of the RT model", "year": "2002", "source": "Polymer, vol. 43, no. 26, pp. 7419-7427", "authors": ["Pfister L", "Zbigniew H. Stachurski"]}, {"title": "Effect of matrix toughness on the shear strength of brittle and rubber-modified glass-fiber/vinyl ester composites", "year": "2002", "source": "Journal of Materials Science Letters, vol. 21, no. 10, pp. 771-773", "authors": ["Pantano V", "Compston P", "Zbigniew H. Stachurski"]}, {"title": "Nano-indentation and Nano-scratch of Polymer/Glass Interface. Part II: Model of Interphases in Water Aged Composite materials", "year": "2001", "source": "Polymer, vol. 42, pp. 5701-5710", "authors": ["Hodzic A", "Kim J", "Zbigniew H. Stachurski"]}, {"title": "Droplet on a fibre: Surface tension and geometry", "year": "2001", "source": "Composite Interfaces, vol. 8, no. 6, pp. 415-425", "authors": ["Hodzic A", "Zbigniew H. Stachurski"]}, {"title": "n analysis of microdroplet test: effects of specimen geometry, matrix type, fibre treatment and water ageing", "year": "2001", "source": "Polymers and Polymer Composites, vol. 9, no. 8, pp. 499-508", "authors": ["Hodzic A", "Zbigniew H. Stachurski"]}, {"title": "Metamorphosis of Voronoi polyhedra as a definite measure of the elastic-to-dissipative atomic displacement transition", "year": "2001", "source": "Polimery: macromolecular materials, chemistry and technology of polymers, vol. 46, no. 5, p. 302", "authors": ["Zbigniew H. Stachurski"]}, {"title": "The nano-scratch technique as a novel method for measurement of an interphase width", "year": "2000", "source": "Journal of Materials Science Letters, vol. 19, pp. 1665-1667", "authors": ["Hodzic A", "Zbigniew H. Stachurski"]}, {"title": "Nano-indentation and nano-scratch of Polymer/Glass Interface. Part I: Experimental and Mechanical Analysis", "year": "2000", "source": "Polymer, vol. 41, pp. 6895-6905", "authors": ["Hodzic A", "Zbigniew H. Stachurski"]}, {"title": "Improvements to the microdroplet single fibre composite test", "year": "1998", "source": "Journal of Materials Science Letters, vol. 17, pp. 645-647", "authors": ["Mak M", "Zbigniew H. Stachurski"]}, {"title": "The geometry of spherulite boundaries", "year": "1998", "source": "Polymer, vol. 39, pp. 5717-5724", "authors": ["Zbigniew H. Stachurski"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}