{"ANU": {"name": "Zhen Xiong (George) Chen", "link": "https://researchers.anu.edu.au/researchers/chen-zxg", "colleges": "College of Business& Economics", "email": "George.chen@anu.edu.au", "phone": "", "expertise": ["Organisational Behaviour"], "interest": [], "biography": "", "project": [], "publication": [{"title": "How Does Growth Need Strength Influence Employee Outcomes? Roles of Hope, Leadership, and Culture.", "year": "2016", "source": "The International Journal of Human Resource Management, pp. 1-28", "authors": ["Lin X", "Qian J", "Li M", "Zhen Xiong (George) Chen"]}, {"title": "The impact of future time orientation on employees", "year": "2015", "source": "feedback-seeking behavior from supervisors and co-workers: The mediating role of psychological ownership'Journal of Management & Organization, vol. 21, no. 3, pp. 336-349", "authors": ["Qian J", "Lin X", "Han Z", "Zhen Xiong (George) Chen"]}, {"title": "Social exchange spillover in leader-member relations: A multilevel model", "year": "2015", "source": "Journal of Organizational Behavior, vol. 36, no. 5, pp. 673-697", "authors": ["Zhen Xiong (George) Chen", "Zhen Xiong (George) Chen", "Zhong L"]}, {"title": "Business Leadership in the Chinese Context: Trends, Findings, and Implications", "year": "2014", "source": "Management and Organization Review, vol. 10, no. 2, pp. 199-221", "authors": ["Zhang Z", "Zhen Xiong (George) Chen", "Zhen Xiong (George) Chen"]}, {"title": "Why Do I Feel Valued and Why Do I Contribute? A Relational Approach to Employee", "year": "2013", "source": "s Organization-Based Self-Esteem and Job Performance'Journal of Management Studies, vol. 50, no. 6, pp. 1018-1040", "authors": ["Liu J", "Hui C", "Lee C", "Zhen Xiong (George) Chen"]}, {"title": "The relationship between organizational justice and organizational citizenship behaviour: The role of cultural value orientations", "year": "2013", "source": "Management and Organization Review, vol. 9, no. 2, pp. 345-374", "authors": ["Schilpzand M", "Martins L", "Kirkman B", "Zhen Xiong (George) Chen"]}, {"title": "uthentic leadership and feedback-seeking behaviour: An examination of the cultural context of mediating processes in China", "year": "2012", "source": "Journal of Management & Organization, vol. 18, no. 3, pp. 286-299", "authors": ["Qian J", "Lin X", "Zhen Xiong (George) Chen"]}, {"title": "Fulfilling obligations: Why Chinese employees stay", "year": "2012", "source": "The International Journal of Human Resource Management, vol. 23, no. 1, pp. 35-51", "authors": ["Liu J", "Hui C", "Lee C", "Zhen Xiong (George) Chen"]}, {"title": "Empowerment and Creativity: A cross-level investigation", "year": "2012", "source": "Leadership Quarterly The, vol. 23, no. 1, pp. 55-65", "authors": ["Li-Yun S", "Zhen Xiong (George) Chen", "Jin Q"]}, {"title": "Inducements, Contributions, and Fulfillment in New Employee Psychological Contracts", "year": "2011", "source": "Human Resource Management, vol. 50, no. 2, pp. 201-226", "authors": ["Lee C", "Liu J", "Rousseau D", "Zhen Xiong (George) Chen"]}, {"title": "ffective Job Insecurity: A mediator of cognitive job insecurity and employee outcomes relationships", "year": "2010", "source": "International Studies of Management and Organization, vol. 40, no. 1, pp. 20-39", "authors": ["Huang G", "Lee C", "Ashford S", "Zhen Xiong (George) Chen"]}, {"title": "Individual Power Distance Orientation and Follower Reactions to Transformational Leaders: A Cross-Level, Cross-Cultural Examinations", "year": "2009", "source": "The Academy of Management Journal, vol. 52, no. 4, pp. 744-764", "authors": ["Kirkman B", "Zhen Xiong (George) Chen", "Farh J"]}, {"title": "busive supervision and employee contextual performance:The Mediating Role of Emotional Exhaustion and the Moderating Role of Work Unit Structure", "year": "2008", "source": "Management and Organization Review, vol. 4, no. 3, pp. 393-411", "authors": ["Aryee S", "Sun L", "Zhen Xiong (George) Chen"]}, {"title": "Cross-cultural development of an abridged job insecurity measure", "year": "2008", "source": "Journal of Organizational Behavior, vol. 29, no. 3, pp. 373-390", "authors": ["Lee C", "Bobko P", "Ashford S", "Zhen Xiong (George) Chen"]}, {"title": "Leader-member exchange, employee performance, and work outcomes: an empirical study in the Chinese context", "year": "2008", "source": "The International Journal of Human Resource Management, vol. 19, no. 10, pp. 1809-1824", "authors": ["Wang H", "Law K", "Zhen Xiong (George) Chen"]}, {"title": "Delegation and employee work outcomes: the cultural context of mediating processes in China", "year": "2007", "source": "The Academy of Management Journal, vol. 50, no. 1, pp. 226-238", "authors": ["Zhen Xiong (George) Chen", "Aryee S"]}, {"title": "ntecedents and outcomes of abusive supervision; test of a trickle-down model", "year": "2007", "source": "Journal of Applied Psychology, vol. 92, no. 1, pp. 191-201", "authors": ["Aryee S", "Zhen Xiong (George) Chen", "Sun L"]}, {"title": "Reactions to psychological contract breach: a dual perspective", "year": "2007", "source": "Journal of Organizational Behavior, vol. 29, pp. 527-548", "authors": ["Zhen Xiong (George) Chen", "Tsui A", "Zhong L"]}, {"title": "n empirical study on the process model of abusive supervision in China", "year": "2006", "source": "International Association for Chinese Management Research, ed. Jing Zhou, Blackwell Publishing Ltd, China", "authors": ["Zhen Xiong (George) Chen", "Aryee S", "Sun L"]}, {"title": "Investigation of the multidimensional model of job insecurity in China and the USA", "year": "2006", "source": "Applied Psychology: An International Review, vol. 55, no. 4, pp. 167-195", "authors": ["Lee C", "Bobko P", "Zhen Xiong (George) Chen"]}, {"title": "Leader-member exchange in a Chinese context: antecedents, outcomes and mediating role of psychological empowerment", "year": "2006", "source": "Journal of Business Research, vol. 59, no. 7, pp. 793-801", "authors": ["Aryee S", "Zhen Xiong (George) Chen"]}, {"title": "The construct of organizational citizenship behaviour: Should we analyze after we have conceptualized?", "year": "2005", "source": "in David L. Turnipseed (ed.), Handbook of organizational citizenship behaviour: A review of good soldier activity in organizations, Nova Science Publishers Inc., New York, USA, pp. 47-65", "authors": ["Law K", "Wong C", "Zhen Xiong (George) Chen"]}, {"title": "Processes Linking Perceived Leader-subordinate Goal Similarity to Subordinate Performance", "year": "2005", "source": "Academy of Management Conference 2005, ed. K. Mark Weaver, Academy of Management, Danvers, MA, United States", "authors": ["Zhen Xiong (George) Chen", "Aryee S", "Lee C"]}, {"title": "Leader-member exchange as a mediator of the relationship between transformational leadership and followers", "year": "2005", "source": "performance and organisational citizenship behaviour'Asian Academy of Management Journal, vol. 48, no. 3, pp. 420-432", "authors": ["Wang H", "Law K", "Hackett R", "Zhen Xiong (George) Chen"]}, {"title": "Test of a mediation model of perceived organisational support", "year": "2005", "source": "Journal of Vocational Behaviour, vol. 66, no. 3, pp. 457-470", "authors": ["Zhen Xiong (George) Chen", "Aryee S", "Lee C"]}, {"title": "Exchange fairness and employee performance: an examination of the relationship between organisational politics and procedural justice", "year": "2004", "source": "Organizational Behavior and Human Decision Processes, vol. 94, no. 1, pp. 1-14", "authors": ["Aryee S", "Zhen Xiong (George) Chen", "Budhwar P"]}, {"title": "Countering the trend towards careerist orientation in the age of downsizing: Test of a social exchange model in China", "year": "2004", "source": "Journal of Business Research, vol. 57, no. 4, pp. 321-328", "authors": ["Aryee S", "Zhen Xiong (George) Chen"]}, {"title": "Empowered to act: understanding the relationship between delegation and employee outcomes in China", "year": "2004", "source": "Academy of Management Conference 2004, Rowan University, USA", "authors": ["Zhen Xiong (George) Chen", "Aryee S"]}, {"title": "Consumer ethnocentrism and willingness to buy domestic products in a developing country setting: testing moderating effects", "year": "2004", "source": "Journal of Consumer Marketing, vol. 21, no. 6, pp. 391-400", "authors": ["Wang C", "Zhen Xiong (George) Chen"]}, {"title": "Collectivism in action: Its moderating effects on the relationship between organisational commitment and employee performance in China", "year": "2004", "source": "Group and Organization Management, vol. 29, no. 4, pp. 425-441", "authors": ["Francesco A", "Zhen Xiong (George) Chen"]}, {"title": "The relationship between the three components of commitment and employee performance in China", "year": "2003", "source": "Journal of Vocational Behaviour, vol. 62, no. 3, pp. 490-510", "authors": ["Zhen Xiong (George) Chen", "Francesco A"]}, {"title": "Loyalty to supervisor vs. organisational commitment: Relationship to employee performance in China", "year": "2002", "source": "Journal of Occupational and Organizational Psychology, vol. 75, no. 3, pp. 339-356", "authors": ["Zhen Xiong (George) Chen", "Tsui A", "Farh J"]}, {"title": "Trust as a mediator of the relationship between organisational justice and work outcomes: test of an exchange model", "year": "2002", "source": "Journal of Organizational Behavior, vol. 23, no. 3, pp. 267-285", "authors": ["Aryee S", "Budhwar P", "Zhen Xiong (George) Chen"]}, {"title": "Further investigation of the outcomes of loyalty to supervisor: Job satisfaction and intention to stay", "year": "2001", "source": "Journal of Managerial Psychology, vol. 16, no. 7-8, pp. 650-660", "authors": ["Zhen Xiong (George) Chen"]}, {"title": "Segment intenders and non-intenders in China", "year": "2001", "source": "s property market: a hybrid approach'Journal of Consumer Marketing, vol. 18, no. 4, pp. 319-331", "authors": ["Wang C", "Chan A", "Zhen Xiong (George) Chen"]}, {"title": "Culture and procedural justice: The influence of power distance on reactions to voice", "year": "2001", "source": "Journal of Experimental Social Psychology, vol. 37, no. 4, pp. 300-315", "authors": ["Ackerman G", "Brockner J", "Greenberg J", "Zhen Xiong (George) Chen"]}]}, "Microsoft-Academic": [], "ANDS-Grants": []}