{
  "sections": {
    "Abstract": "b'{\"search-keyword: clean-text| displaying exact matches\":\"Degrees of Freedom of a Communication Channel:\\\\nUsing Generalised Singular Values\\\\nRam Somaraju and Jochen Trumpf\\\\n\\\\narXiv:0901.1694v1 [cs.IT] 13 Jan 2009\\\\n\\\\nAbstract\\\\nA fundamental problem in any communication system is: given a communication channel between a transmitter\\\\nand a receiver, how many independent signals can be exchanged between them? Arbitrary communication channels\\\\nthat can be described by linear compact channel operators mapping between normed spaces are examined in this\\\\npaper. The (well-known) notions of degrees of freedom at level o and essential dimension of such channels are\\\\ndeveloped in this general setting. We argue that the degrees of freedom at level o and the essential dimension\\\\nfundamentally limit the number of independent signals that can be exchanged between the transmitter and the\\\\nreceiver. We also generalise the concept of singular values of compact operators to be applicable to compact\\\\noperators defined on arbitrary normed spaces which do not necessarily carry a Hilbert space structure. We show\\\\nhow these generalised singular values can be used to calculate the degrees of freedom at level o and the essential\\\\ndimension of compact operators that describe communication channels. We describe physically realistic channels\\\\nthat require such general channel models.\\\\nIndex Terms\\\\nOperator Channels, Degrees of Freedom, Generalised Singular Values, Essential Dimension\\\\n\\\\n\\\\f1\\\\n\\\\nDegrees of Freedom of a Communication Channel:\\\\nUsing Generalised Singular Values\\\\nI. I NTRODUCTION\\\\nThe basic consideration in this paper can be stated as\\\\nfollows: given an arbitrary communication channel, is\\\\nit possible to evaluate the number of independent subchannels or modes available for communication. Though\\\\nthis question is not generally examined explicitly, it\\\\nplays an important role in various information theoretic\\\\nproblems.\\\\nA rigorous proof of Shannons famous capacity result [1] for continuous-time band-limited white Gaussian\\\\nnoise channels requires a cal",
    "Introduction": "culation of the number\\\\nof approximately time-limited and band-limited subchannels (see e.g. [2, ch. 8] and [3,4]). This result can be\\\\ngeneralised to dispersive/non-white Gaussian channels\\\\nusing the water-filling formula [1,2]. In order to use this\\\\nformula, one needs to diagonalise the channel operator\\\\nand allocate power to the different sub-channels or\\\\nmodes based on the singular values of the corresponding\\\\nsub-channel. One therefore needs to calculate the modes\\\\nand the power transferred (square of the singular values)\\\\non each one of these sub-channels to calculate the\\\\nchannel capacity.\\\\nThe water-filling formula has been used extensively\\\\nin order to calculate the capacity of channels that use\\\\ndifferent forms of diversity. In particular, the capacity of\\\\nmultiple-input multiple-output (MIMO) antenna systems\\\\nhas been calculated using this water-filling formula for\\\\nvarious conditions imposed on the transmitting and the\\\\nreceiving antennas (see e.g. [5] and references therein).\\\\nWater-filling type formulas have been used for other\\\\nmulti-access schemes such as OFDM-MIMO [6] and\\\\nCDMA [7] (see also Tulino [8, sec 1.2] and references\\\\ntherein). More recently, several papers have examined\\\\nthe number of degrees of freedom1 available in spatial\\\\nchannels [9][13]. Questions of this nature have also\\\\nbeen studied in other contexts such as optics [14] and\\\\nspatial sampling of electromagnetic waves [15,16].\\\\nBoth types of results, the modes of communication\\\\nused for the water-filling formula and the number of\\\\ndegrees of freedom of spatial channels use the singular\\\\n1\\\\n\\\\nNote that other terms such as modes of communication, essential\\\\ndimension etc. have been used instead of degrees of freedom in some\\\\nof these papers.\\\\n\\\\nvalue decomposition (SVD) theorem. One can use SVD\\\\nto diagonalise the channel operator and the magnitude of\\\\nthe singular values determines the power transferred on\\\\neach of the sub-channels. The magnitude of these singular values can therefore be used to calculate the number\\\\nof degrees of freedom of the c",
    "Related Work": "hannel (see e.g. [9,12]).\\\\nHowever, the SVD theorem is only applicable to compact\\\\noperators defined on Hilbert spaces. An implicit and\\\\nvalid assumption that is used in these papers is that\\\\nthe operators describing the communication channels are\\\\ndefined on Hilbert spaces. These results can therefore not\\\\nbe generalised directly to communication systems that\\\\nare modeled by operators defined on normed spaces that\\\\ndo not admit an inner product structure. There are several\\\\ninstances of practical channels that can not be modeled\\\\nusing operators defined on inner-product spaces (see\\\\nSection II-A for examples). In this paper, we develop\\\\na general theory that enables one to evaluate the number\\\\nof degrees of freedom of such systems.\\\\nWe wish to examine if it is possible to evaluate the\\\\nnumber of parallel sub-channels available in general\\\\ncommunication systems that can be described using\\\\nlinear compact operators. Any communication channel\\\\nis subject to various physical constraints such as noise\\\\nat the receiver or finite power available for transmission.\\\\nIf the channel can be modeled via a linear compact operator, then these constraints ensure that only finitely many\\\\nindependent channels are available for communication.\\\\nRoughly speaking, we call the number of such channels\\\\nthe number of degrees of freedom of the communication\\\\nsystem (see Section III for a precise definition). Note\\\\nthat if the channel is modeled using a linear operator\\\\nthat is not compact then it will in fact have infinitely\\\\nmany parallel sub-channels, or some channels that can\\\\ntransfer an infinite amount of power (see Theorem 3.10\\\\nbelow and the discussion following it). It could hence\\\\nbe argued that the theory presented in this paper is the\\\\nmost general theory needed to model physically realistic\\\\nchannels.\\\\nWe give novel definitions for the terms degrees of freedom and essential dimension in the following section.\\\\nEven though these terms have been used interchangeably\\\\nin the literature, we distinguish between the two. The\\\\nessential dimension of a ",
    "Methodology": "channel is useful for channels\\\\n\\\\n\\\\f2\\\\n\\\\nthat have numbers of degrees of freedom that are essentially independent of the receiver noise level (e.g.\\\\nthe time-width/band-width limited channels in Slepians\\\\nwork [17]). Also, we generalise the notion of singular\\\\nvalues to compact operators defined on normed spaces\\\\nand explain how these generalised singular values can\\\\nbe used to compute degrees of freedom and the essential\\\\ndimension.\\\\nA. Channel Model\\\\nWe assume that a communication channel between a\\\\ntransmitter and a receiver can be modeled as follows.\\\\nLet X be a linear vector space of functions that the\\\\ntransmitter can generate and let Y be a linear vector\\\\nspace of functions that the receiver can measure. We\\\\nassume the existence of a linear operator T : X  Y\\\\nthat maps each signal generated by a transmitter to a\\\\nsignal that a receiver can measure. We also assume that\\\\nthere is a norm k  kX on X and a norm k  kY on Y .\\\\nThis model is very general and can be applied to various\\\\nsituations of practical relevance.\\\\nFor instance, consider a MIMO communication system wherein the transmitter symbol waveform shape on\\\\neach antenna is a raised cosine. In this case we can\\\\nthink of the space of transmitter functions X to be (more\\\\nprecisely, to be parametrised by) the n-dimensional complex space Cn that determines the phase and amplitude\\\\nof the raised cosine waveform on each antenna. Here\\\\nn is the number of transmitting antennas. Also, we\\\\ncan think of the space of receiver functions as Cm ,\\\\nwhere m is the number of receiving antennas. T in this\\\\ncontext is a channel matrix, representing the linearized\\\\nchannel operator that depends on the scatterers in the\\\\nenvironment.\\\\nAlternatively, consider a MIMO communication system in which the transmitter symbols are not fixed but\\\\ncan be any waveform of time. Suppose the symbol\\\\ntime is fixed to ts seconds. In this case, we can think\\\\nof the space of transmitter functions, X , as the space\\\\nL2 ([0, ts ], Cn ) of Cn -valued square integrable functions\\\\ndefined on [0, ts ]. Similarly, w",
    "Experiment": "e can think of the space\\\\nof receiver functions, Y , as the space L2 ([0, ts ], Cm ).\\\\nAgain, T is the channel operator.\\\\nIrrespective of the precise form of the underlying\\\\nspaces X and Y , we always call elements of X transmitter functions and the elements of Y receiver functions.\\\\nAlso, we call the space X the space of transmitter\\\\nfunctions and the space Y the space of receiver functions.\\\\nIn particular, we do not distinguish between the two\\\\ndifferent physical situations: a) the elements of X are\\\\nfunctions of time and b) the elements of X are vectors\\\\n\\\\nin some finite dimensional space. This should cause no\\\\nconfusion and we use this convention for the remainder\\\\nof this document.\\\\nWe now restrict ourselves to situations where there\\\\nis a source constraint k  kX  P that can be imposed\\\\non the space of transmitter functions X , and where the\\\\noperator T is compact. Roughly speaking, the norm\\\\non the space of transmitter functions X captures the\\\\nphysical restriction that the transmitter functions can\\\\nnot be arbitrarily big, while the norm on the space of\\\\nreceiver functions can be interpreted as a measure of how\\\\nbig the received signals are compared to a pre-specified\\\\nnoise level. We therefore try to find how many linearly\\\\nindependent signals can be generated at the receiver that\\\\nare big enough by transmitter functions that are not too\\\\nbig. The compactness of the operator T ensures that only\\\\nfinitely many independent signals can be received (see\\\\nSection II-A for examples of such channels). This vague\\\\nidea is clarified further in the following two sections.\\\\nB. Outline\\\\nThe remainder of this paper is organised as follows: in\\\\nthe next section we consider a finite dimensional example and motivate the definition of degrees of freedom. We\\\\nalso discuss several examples of practical communication systems to which the theory developed in this paper\\\\nmay be applied. Section III presents the main results\\\\nof this paper as well as formal definitions of degrees\\\\nof freedom, essential dimension and generalised singular\\\\nvalues. ",
    "Discussion": "Conclusions are presented in Section IV. Detailed\\\\nproofs of the theorems in this paper are presented in the\\\\nAppendix.\\\\nMost of the material presented in this paper forms part\\\\nof the first authors PhD thesis [18].\\\\nII. M OTIVATION\\\\nWe motivate our definition of degrees of freedom\\\\nat level o for compact operators on normed spaces by\\\\nconsidering linear operators on finite dimensional spaces.\\\\nConsider a communication channel that uses n transmitting antennas and m receiving antennas which can be\\\\nmathematically modeled as follows. Let the current on\\\\nthe n transmitting antennas be given by x  Cn . This\\\\ncurrent on the transmitting antennas generates a current\\\\ny  Cm in the m receiving antennas according to the\\\\nequation\\\\ny = Hx.\\\\nHere, H  Cmn is the channel matrix. We can define\\\\nm by x 7 y = Hx. Also,\\\\nthe operator T : Cn  Cp\\\\nfor n = 1, 2, . . . , k  k = () (), with () denoting\\\\n\\\\n\\\\f3\\\\n\\\\nthe complex conjugate transpose, is the standard norm\\\\nin Cn . In this context, the norm determines the power of\\\\nthe signal on the antennas.\\\\nThe singular value decomposition theorem tells us\\\\nthat there exist sets of orthonormal basis vectors\\\\n{v1 , . . . , vn }  Cn and {u1 , . . . , um }  Cm such that\\\\nthe matrix representation for T in these bases is diagonal.\\\\nLet Hd be such a matrix with the basis vectors ordered\\\\nsuch that the diagonal elements (i.e. the singular values\\\\nof T ) are in non-increasing order. A simple examination\\\\nof the diagonal matrix proves that for all o > 0 there exist\\\\na number N and a set of linearly independent vectors\\\\n{y1 , . . . , yN }  Cm such that for all x  B 1,Cn (0)2\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai yi \\\\n  o.\\\\ninf \\\\nHd x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nFor a given o, call the smallest number that satisfies the\\\\nabove condition N (o). Note that the vectors y1 , . . . , yN\\\\nspan the space of all linear combinations of the left\\\\nsingular vectors of T whose corresponding singular\\\\nvalues are greater than or equal to o.\\\\nA simple examination of the diagonal matrix tells us\\\\nthat N (o) is equal to the number of singular values of T\\\\nthat are greater than o and is hence clearly independent\\\\nof the bases chosen. This leads us to our definition for\\\\ndegrees of freedom in finite dimensional spaces.\\\\nDefinition 2.1: Let T : Cn  Cm be a linear operator\\\\nand let o > 0 be given. Then the number of degrees of\\\\nfreedom at level o for T is the smallest number N such\\\\nthat there exists a set of vectors y1 , . . . , yN  Cm such\\\\nthat for all x  B 1,Cn (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai yi \\\\n  o.\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\nThis definition is appropriate for the number of degrees\\\\nof freedom because for a MIMO system the norm k  k\\\\nrepresents the power in the signal. Suppose we wish\\\\nto transmit N linearly independent signals from the\\\\ntransmitter to the receiver, and the total power available\\\\nfor transmission is bounded. Suppose further that the\\\\nreceived signal is measured in the presence of noise.\\\\nBy requiring that x  B 1,Cn (0) we are constraining the\\\\npower available for transmission. We model the noise\\\\nby assuming that any two signals at the receiver can\\\\nbe distinguished if the power of the difference between\\\\nthe signals is greater than some level o. Similar ideas\\\\nhave been used for instance by Bucci et. al. [16] (see\\\\nalso [4,10,17]). According to this definition, the number\\\\nof degrees of freedom is equal to the number of linearly\\\\n2\\\\nGiven a normed space X, r  0 and x  X, B r,X (x) denotes\\\\nthe closed ball of radius r centered at x  X.\\\\n\\\\nindependent signals that the receiver can distinguish\\\\nunder the assumptions of a transmit power constraint\\\\nand a receiver noise level represented by o. Note that\\\\nwe are making the implicit assumption that the power\\\\nP is 1 in the above definition. This does not cause a\\\\nproblem because we can always scale the norm in order\\\\nto consider situations where P 6= 1.\\\\nThe above definition was motivated using the singular value decomposition theorem in finite dimensional\\\\nspaces. It can therefore be easily generalised to infinite\\\\ndimensional Hilbert spaces using the corresponding singular value decomposition in infinite dimensional Hilbert\\\\nspaces (see eg. [16,18]3 ). However, the singular value\\\\ndecomposition can only be used for operators defined on\\\\nHilbert spaces. It cannot be used for operators defined\\\\non general normed spaces. Observe that the definition for\\\\ndegrees of freedom above only depends on the norm kk\\\\nand not on the assumption that the underlying spaces Cn\\\\nand Cm are Hilbert spaces. It will be shown in this paper\\\\nthat the above definition can be extended to compact\\\\noperators defined on arbitrary normed spaces.\\\\nNow consider the situation where the singular values of the operator T show a step like behavior. For instance, suppose the singular values are\\\\n{1, 0.9, 0.85, 0.5, 0.1, 0.05, .0005}. In this particular case\\\\nthe number of degrees of freedom at level o is equal\\\\nto 4 for a big range of values of o and the number\\\\nof degrees of freedom is essentially independent of the\\\\nactual value of o chosen. Such a situation arises in several\\\\nimportant cases (see eg. [4,9,14,16,17]). It would be\\\\nuseful to have a general way in which one can specify\\\\na number of degrees of freedom of a channel that is\\\\nindependent of the arbitrarily chosen level o. In this paper\\\\nwe provide a novel definition for such a number and call\\\\nit the essential dimension of the channel. This definition\\\\nis sufficiently general to be applicable to a variety of\\\\nchannels and quantifies the essential dimension of any\\\\nchannel that can be described using a compact operator.\\\\nA. Examples\\\\nAs explained in section I-A, we assume that a communication channel can be described using the triple X , Y\\\\nand T . Here X is the space of transmitter functions, Y\\\\nis the space of receiver functions and T is the channel\\\\noperator and is assumed to be compact. As explained\\\\nearlier in this section, if the spaces X and Y are Hilbert\\\\nspaces and if the operator T is a linear compact operator\\\\nthen the well known theory of singular values of Hilbert\\\\nspace operators can be used to determine the number of\\\\ndegrees of freedom of such channels. However, if either\\\\n3\\\\n\\\\nAlso compare with the time-bandwidth problem in [4,17].\\\\n\\\\n\\\\f4\\\\n\\\\none of the spaces X or Y is not an inner product space\\\\nthen one cannot use this theory.\\\\nThere are several practical channels that are best\\\\ndescribed using abstract spaces that do not admit an\\\\ninner product structure. In this subsection, we consider\\\\nthree examples of such channels. In the first example,\\\\nthe measurement technique used in the receiver restricts\\\\nthe space of receiver functions. In the second one, the\\\\nmodulation technique used means that the constraints\\\\non the space of transmitter functions are best described\\\\nusing a norm that is not compatible with an inner\\\\nproduct. The final example discusses a physical channel\\\\nthat naturally admits a norm on the space of transmitter\\\\nfunctions that is described using a vector product and\\\\ntherefore does not admit an inner-product structure.\\\\nExample 2.1: In any practical digital communication\\\\nsystem, the receiver is designed to receive a finite set\\\\nof transmitted signals. Suppose the transmitted signal is\\\\ngenerated from a source alphabet {t1 , . . . , tN } and for\\\\nsimplicity assume that in a noiseless system each element\\\\nfrom the source alphabet ti , 1  i  N , generates a signal ri , 1  i  N , at the receiver. In the corresponding\\\\nnoisy system, the fundamental problem is to determine\\\\nwhich element from the source alphabet was transmitted\\\\ngiven the signal r = ri + n was received. Here, n\\\\nis the noise in the system. One common approach to\\\\nsolving this problem is to define some metric d(, ) that\\\\nmeasures the distance between two receiver signals and\\\\nto calculate\\\\nr  = argmin d(r, ri ).\\\\n\\\\nThis is the common approach used in information theory.\\\\nHowever, it is generally easier to measure just the\\\\namplitude of the received signal on each of the m\\\\nantennas. In fact, in a rapidly changing environment it\\\\nmight not be possible to build an effective matched filter\\\\nand therefore there is no benefit in measuring the square\\\\nof the received signal. In this case the distance between\\\\nany two signals can be described using the metric\\\\nZ \\\\n|y1 (t)  y2 (t)|dt.\\\\nd(y1 , y2 ) =\\\\n0\\\\n\\\\nHere, one can describe the space of receiver functions\\\\nusing the Banach space L1 ([0,  ], Cm ) with the norm\\\\ndefined by\\\\nZ\\\\n\\\\n\\\\n0\\\\n\\\\nThis channel therefore is best described using a normed\\\\nspace as opposed to an inner product space to model the\\\\nset of receiver signals.\\\\nExample 2.2: Consider a multi-carrier communication system that uses some form of amplitude or angle\\\\nmodulation to transmit information. Suppose that there\\\\nare n carriers and that the vector  = [1 , . . . , n ]\\\\ndetermines the modulating signal on each of the carriers.\\\\nWe can think of the modulating waveforms as the space\\\\nof transmitter functions X 4 .\\\\nIf amplitude modulation is used then the vector \\\\ndetermines the total power used for modulation. If the\\\\ntotal power available for transmission is bounded then\\\\none might have an inequality of the form\\\\n\\\\n{ri ,1in}\\\\n\\\\nOne concludes that the element from the source alphabet\\\\nthat corresponds to r  is (most likely) the transmitted signal. Generally, this metric d(, ) determines the abstract\\\\nspace Y of receiver function.\\\\nNow consider a MIMO antenna system with n transmitting and m receiving antennas. Suppose that the receiver measures the signals on the m receiving antennas\\\\nfor a period of  seconds. One can describe the received\\\\nsignal by a function y(t), where y : [0,  ]  Cm . In\\\\norder to implement the receiver one can use a matched\\\\nfilter if the shapes of all noiseless receiver signals are\\\\nknown. In this case the distance between two received\\\\nsignals can be described using the metric\\\\n\\\\u00131/2\\\\n\\\\u0012Z \\\\n\\\\n(y1 (t)  y2 (t)) (y1 (t)  y2 (t))dt\\\\nd(y1 , y2 ) =\\\\n0\\\\n\\\\nOne can describe the space of receiver functions using\\\\nthe Hilbert space L2 ([0,  ], Cm ) with the inner product\\\\ndefined by\\\\nZ \\\\ny1 (t)y2 (t)dt.\\\\nhy1 , y2 i :=\\\\n0\\\\n\\\\n|y(t)|dt.\\\\n\\\\nkyk :=\\\\n\\\\nn\\\\nX\\\\n\\\\n|i |2  P.\\\\n\\\\ni=1\\\\n\\\\nWe can therefore describe the space of transmitter functions using the standard Euclidian space Rn with inner\\\\nproduct\\\\nhx1 , x2 i = xT1 x2 .\\\\nNow consider the case where angle modulation is\\\\nused. In this case all the transmitted signals have the\\\\nsame power and the total power available for transmission places no restrictions on the space of transmitter\\\\nfunctions. However, the space of transmitter functions\\\\ncan be subjected to other forms of constraints. For\\\\ninstance, if frequency modulation is used then the maximum frequency deviation used might be bounded by\\\\nsome number b to minimise co-channel interference (see\\\\ne.g. [19, p. 110,513]). Similarly if phase modulation is\\\\nused the maximum phase variation has to be less than\\\\n4\\\\n\\\\nIn this case we do not consider the actual signal on the transmitting antenna (i.e. carrier + modulation) to be the transmitter function.\\\\nCf. the discussion in Subsection I-A.\\\\n\\\\n\\\\f5\\\\n\\\\n . This bound may also depend on other practical\\\\nconsiderations such as linearity of the modulator. In\\\\nthis case one might constrain the space of transmitter\\\\nfunctions as\\\\nsup |i | < b.\\\\n1in\\\\n\\\\nThe space of transmitter functions of this channel is best\\\\ndescribed using the n-dimensional Banach space Rn\\\\nwith norm\\\\nkxk = sup |xi |.\\\\n\\\\ngeneral normed spaces. The following theorem ensures\\\\nthat the definition makes sense even in the infinite\\\\ndimensional setting.\\\\nTheorem 3.1: Suppose X and Y are normed spaces\\\\nwith norms kkX and kkY , respectively, and T : X  Y\\\\nis a compact operator. Then for all o > 0 there exist5\\\\nN\\\\nN  Z+\\\\n0 and a set {i }i=1  Y such that for all x \\\\nB 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o.\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\n\\\\n1in\\\\n\\\\nExample 2.3: In this final example we examine spatial\\\\nwaveform channels (SWCs) [18]. In SWCs we assume\\\\nthat a current flows in a volume in space and generates\\\\nan electromagnetic field in a receiver volume that is\\\\nmeasured [10,15,16,18]. Such channels have been used\\\\nto model MIMO systems previously [10,12,13,15,16,18].\\\\nIf a current flows in a volume in space that has a finite\\\\nconductivity, power is lost from the transmitting volume\\\\nin two forms. Firstly, power is lost as heat and secondly\\\\npower is radiated as electromagnetic energy. So the total\\\\npower lost can be described using the set of equations\\\\nPtotal = Z\\\\nPrad + Plost\\\\nJ (r)J(r)dr\\\\nPlost =\\\\nZV\\\\nE (r)  H(r)d\\\\nPrad =\\\\n\\\\n\\\\nHere, V is some volume that contains the transmitting\\\\nantennas, J is the current density in the volume V\\\\nand  is some sufficiently smooth surface the interior\\\\nof which contains V with d denoting a surface area\\\\nelement. Also E and H are the electric and magnetic\\\\nfields generated by the current density J and  denotes\\\\nthe vector product in R3 .\\\\nBecause of the vector product in the last equation\\\\nabove, the total power lost defines a norm on the space\\\\nof square-integrable functions that does not admit an\\\\ninner-product structure [18]. The theory developed in this\\\\npaper is used to calculate the degrees of freedom of such\\\\nspatial waveform channels in [18].\\\\nIII. M AIN R ESULTS\\\\nIn this section we outline the main results of this paper.\\\\nAll the proofs of theorems are given in the Appendix.\\\\nA. Degrees of Freedom for Compact Operators\\\\nThe definition of degrees of freedom at level o for\\\\ncompact operators on normed spaces is identical to the\\\\nfinite dimensional counterpart (Definition 2.1) discussed\\\\nin the previous section with Cn and Cm replaced by\\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nNote that for N = 0 the set {i }N\\\\ni=1 is empty and\\\\nthe sum in the above expression is void. We will use\\\\nthe following definition for the number of degrees of\\\\nfreedom at level o for compact operators on normed\\\\nspaces.\\\\nDefinition 3.1 (Degrees of freedom at level o):\\\\nSuppose X and Y are normed spaces with norms k  kX\\\\nand k  kY , respectively, and T : X  Y is a compact\\\\noperator. Then the number of degrees of freedom of T\\\\nat level o is the smallest N  Z+\\\\n0 such that there exists\\\\na set of vectors {1 , . . . , N }  Y such that for all\\\\nx  B 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o.\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\nY\\\\nThis definition has exactly the same interpretation as in\\\\nthe finite dimensional case: if there is some constraint\\\\nk  kX  1 on the space of source functions and if the\\\\nreceiver can only measure signals that satisfy k  kY > o,\\\\nthen the number of degrees of freedom is the maximum\\\\nnumber of linearly independent signals that the receiver\\\\ncan measure under these constraints.\\\\nThis definition however is a descriptive one and can\\\\nnot be used to calculate the number of degrees of freedom for a given compact operator because the proof of\\\\nTheorem 3.1 is not constructive. In the finite dimensional\\\\ncase we can calculate the degrees of freedom by calculating the singular values. However, as far as we are aware,\\\\nthere is no known generalisation of singular values for\\\\ncompact operators on arbitrary normed spaces6. In the\\\\nfollowing subsection we will propose such a generalisation. In fact, we will use the degrees of freedom to\\\\ngeneralise the concept of singular values. We will discuss\\\\nthe problem of computing degrees of freedom using\\\\ngeneralised singular values in subsection III-D below.\\\\n+\\\\nare respectively the sets of integers, non-negative\\\\nZ, Z+\\\\n0 and Z\\\\nintegers and positive integers.\\\\n6\\\\nA generalisation to compact operators on Hilbert spaces is of\\\\ncourse classical and well known.\\\\n5\\\\n\\\\n\\\\f6\\\\nDegrees of Freedom vs \\\\n\\\\nDefinition 3.2 (Generalised Singular Values):\\\\nSuppose X and Y are normed spaces and T : X  Y\\\\nis a compact operator. Let N (o) denote the number of\\\\ndegrees of freedom of T at level o. Then om is the mth\\\\ngeneralised singular value of T if\\\\n\\\\n10\\\\n9\\\\n\\\\n...\\\\n\\\\nDegrees of Freedom\\\\n\\\\n8\\\\n7\\\\n6\\\\n5\\\\n\\\\nsupo>om N (o) = m  1\\\\n\\\\n4\\\\n\\\\ninf o<om N (o) = M  m.\\\\n\\\\n3\\\\n2\\\\n\\\\nplacements\\\\n..\\\\n.\\\\no\\\\nFig. 1.\\\\n\\\\n1\\\\n0\\\\n0\\\\n\\\\n0.1\\\\n\\\\n0.2\\\\n\\\\n0.3\\\\n\\\\n0.4\\\\n\\\\n0.5\\\\n\\\\n\\\\n0.6\\\\n\\\\n0.7\\\\n\\\\n0.8\\\\n\\\\n0.9\\\\n\\\\n1\\\\n\\\\nDegrees of Freedom of a Compact Operator\\\\n\\\\nNext, we establish some useful properties of degrees\\\\nof freedom that will help motivate the definition of\\\\ngeneralised singular values given in the next subsection.\\\\nTheorem 3.2: Suppose X and Y are normed spaces\\\\nwith norms kkX and kkY , respectively, and T : X  Y\\\\nis a compact operator. Let N (o) denote the number of\\\\ndegrees of freedom of T at level o. Then\\\\n1) N (o) = 0 for all o  kT k.\\\\n2) Unless T is identically zero, there exists an o0 > 0\\\\nsuch that N (o)  1 for all 0 < o < o0 .\\\\n3) N (o) is a non-increasing, upper semicontinuous\\\\nfunction of o.\\\\n4) In any finite interval (o1 , o2 )  R, with 0 < o1 <\\\\no2 , N (o) has only finitely many discontinuities, i.e.\\\\nN (o) only takes finitely many non-negative integer\\\\nvalues in any finite o interval.\\\\nThe following two examples show that as o goes to\\\\nzero, N (o) need not be finite nor go to infinity.\\\\nExample 3.1: Let l1 be the Banach space of all realvalued sequences with finite l1 norm and let (e1 , e2 , . . .)\\\\nbe the standard Schauder basis for l1 . Define the operator\\\\nT : l1  l1 by en 7 e1 for all n  Z+ . This operator is\\\\nwell-defined and compact and N (o)  1 for all o > 0.\\\\nExample 3.2: Let l1 and (e1 , e2 , . . .) be defined as in\\\\nthe previous example. Define T : l1  l1 by en 7 n1 en\\\\nfor all n  Z+ . Again T is well-defined and compact\\\\nbut limo0 N (o) = .\\\\nFigure 1 shows a typical example of degrees of freedom\\\\nat level o for some compact operator that satisfies all the\\\\nproperties in the above theorem.\\\\nB. Generalised Singular Values\\\\nWe will identify the discontinuities in the number of\\\\ndegrees of freedom of T at level o with the (generalised)\\\\nsingular values of T .\\\\n\\\\nand\\\\n\\\\nFurther, if m < M then for all m < n  M , on := om\\\\nis the nth generalised singular value of T .\\\\nNote that by Theorem 3.2, part 3 we have N (om ) \\\\nm  1 with equality if (but not only if) om is not a\\\\nrepeated generalised singular value.\\\\nLet the degrees of freedom of some operator T be as\\\\nshown in Figure 1. Then the generalised singular values,\\\\nom , of T identify the jumps in the degrees of freedom.\\\\nSo, o1 = 0.9, o2 = o3 = o4 = 0.8, o5 = 0.6, . . .\\\\nAnother way of understanding the connection between\\\\nthe number of degrees of freedom at level o and generalised singular values is as follows.\\\\nProposition 3.3: Suppose X and Y are normed\\\\nspaces and T : X  Y is a compact operator. Let N (o)\\\\ndenote the number of degrees of freedom of T at level o.\\\\nThen N (o) is equal to the number of generalised singular\\\\nvalues that are greater than o.\\\\nThe intuition behind the definition for generalised singular values needs further clarification. In the finite\\\\ndimensional case, if p is the pth singular value of some\\\\noperator T : Cn  Cm , then there exist corresponding\\\\nleft and right singular vectors vp  Cn and up  Cm\\\\nsuch that vp is of unit norm, T vp = up and the norm\\\\nof up is p . This is not necessarily true for arbitrary\\\\ncompact operators on normed spaces as the following\\\\nexample proves.\\\\nExample 3.3: Let l1 and (e1 , e2 , . . .) be defined as in\\\\nExample 3.1. Define the operator T : l1  l1 by T en =\\\\n(1  n1 )e1 for all n  Z+ . Then T is well-defined and\\\\ncompact. Also, the number of degrees of freedom of T\\\\nat level o is\\\\n\\\\u001a\\\\n0 if o  1,\\\\nN (o) =\\\\n1 if o < 1.\\\\nSo o1 = 1. However, for any vector x in the unit sphere\\\\nin l1 , kT xkl1 < 1.\\\\nThe above example motivates the slightly more complicated statement in the following theorem which explains\\\\nthe intuition behind the definition of generalised singular\\\\nvalues.\\\\nTheorem 3.4: Suppose X and Y are normed spaces\\\\nwith norms kkX and kkY , respectively, and T : X  Y\\\\nis a compact operator. Let om be a generalised singular\\\\n\\\\n\\\\f7\\\\n\\\\nvalue of the operator T . Then for all  > 0 there exists\\\\na   X , kkX = 1, such that\\\\nom +   kT kY  om  .\\\\nThe above theorem shows how the generalised singular\\\\nvalues are related to the traditionally accepted notion of\\\\nsingular values of compact operators on Hilbert spaces.\\\\nIn general, they are values the operator restricted to\\\\nthe unit sphere can get arbitrarily close to in norm.\\\\nHowever, we still need to prove that in the special case of\\\\nHilbert spaces the new definition for generalised singular\\\\nvalues agrees with the traditionally accepted definition\\\\nfor singular values.\\\\nRecall that if H1 and H2 are Hilbert spaces with\\\\ninner products h, iH1 and h, iH2 respectively and if\\\\nT : H1  H2 is a compact operator then the Hilbert\\\\nadjoint operator for T is defined as the unique operator\\\\nT  : H2  H1 that satisfies [20, Sec. 3.9]\\\\nhT x, yiH2 = hx, T  yiH1\\\\n\\\\nfor all x  H1 and y  H2 . The singular values of T\\\\nare defined to be the square roots of the eigenvalues of\\\\nthe operator T  T : H1  H1 . We will refer to these as\\\\nHilbert space singular values to distinguish them from\\\\ngeneralised singular values. Note that we always count\\\\nrepeated eigenvalues or (generalised) singular values\\\\nrepeatedly. The following two theorems establish the\\\\nconnection between Hilbert space singular values and the\\\\nnumber of degrees of freedom at level o. The theorems\\\\nare important in their own right because they show that\\\\nthere are two other equivalent ways of calculating the\\\\ndegrees of freedom of a Hilbert space operator.\\\\nTheorem 3.5: Suppose H1 and H2 are Hilbert spaces\\\\nand T : H1  H2 is a compact operator. Then for all\\\\no > 0 there exist an N  Z+\\\\n0 and a set of N mutually\\\\northogonal vectors {i }N\\\\n\\\\nH1 such that if\\\\ni=1\\\\nx  H1 , kxkH1  1 and hx, i iH1 = 0\\\\n\\\\nthen\\\\nkT xkH2  o.\\\\n\\\\nMoreover, the smallest N that satisfies the above condition for a given o is equal to the number of Hilbert space\\\\nsingular values of T that are greater than o.\\\\nTheorem 3.6: Suppose that H1 and H2 are Hilbert\\\\nspaces and T : H1  H2 is a compact operator. Then\\\\nthe number of degrees of freedom at level o is equal to\\\\nthe number of Hilbert space singular values of T that\\\\nare greater than o.\\\\nAs a corollary of Theorem 3.6 we get the following\\\\nresult.\\\\nCorollary 3.1: Suppose H1 and H2 are Hilbert spaces\\\\nand T : H1  H2 is a compact operator. Suppose {om }\\\\n\\\\nare the generalised singular values of T and {m } are\\\\nthe possibly repeated Hilbert space singular values of T\\\\nwritten in non-increasing order. Then\\\\nm = o m\\\\n\\\\nfor all m  Z+ .\\\\nThis corollary, reassuringly, proves that the generalised\\\\nsingular values are in fact generalisations of the traditionally accepted notion of Hilbert space singular values.\\\\nWe will therefore use the terms generalised singular values and singular values interchangeably unless specified\\\\notherwise for the remainder of this paper.\\\\nIn Hilbert spaces we have three characterizations for\\\\ndegrees of freedom: 1) as in Definition 3.2, 2) as in\\\\nTheorem 3.6 in terms of singular values and 3) as in\\\\nTheorem 3.5 in terms of mutually orthogonal functions\\\\nin the domain.\\\\nWe have used the first two characterisations in the\\\\ngeneralisation to normed spaces. However, the final characterisation is more difficult to generalise. It would be\\\\nextremely useful to generalise the final characterisation\\\\nbecause, for the Hilbert space case, the functions i in\\\\nTheorem 3.5 are in some sense the best functions to\\\\ntransmit (see e.g. [14]). One could possibly replace the\\\\nmutual orthogonality by almost orthogonality using the\\\\nRiesz lemma (see e.g. [20, pp. 78]).\\\\nLemma 3.7 (Rieszs lemma): Let Y and Z be subspaces of a normed space X and suppose that Y is closed\\\\nand is a proper subspace of Z . Then for all   (0, 1)\\\\nthere exists a z  Z , kzk = 1, such that for all y  Y\\\\nky  zk  .\\\\nThe following conjecture is still an open question.\\\\nConjecture 3.1: Let X and Y be reflexive Banach\\\\nspaces and let T : X  Y be compact. Given any o > 0\\\\nand some   (0, 1), there exists a finite set of vectors\\\\n{i }N\\\\ni=1  X such that for all x  X , kxkX  1,\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  \\\\n(1)\\\\ninf \\\\nx \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nX\\\\n\\\\nimplies\\\\n\\\\nkT xkY  o.\\\\nComparing with Theorem 3.5, condition (1) is analogous\\\\nto requiring that x be orthogonal to all the i . The conjecture is definitely not true unless we impose additional\\\\nconditions such as reflexivity on X and/or Y as the next\\\\nexample proves.\\\\nExample 3.4: Let l1 , (e1 , e2 , . . .) and the compact\\\\noperator T : l1  l1 be defined\\\\nas in Example 3.1.\\\\nP\\\\nNow let o < 1. For any x = n n en  l1 , if kxk = 1\\\\nand if n  0 for all n then kT xk = kxk = 1 > o.\\\\n\\\\n\\\\f8\\\\n\\\\nHence no finite set of vectors can satisfy the conditions\\\\nin the conjecture.\\\\nIn the following subsection, we use degrees of freedom\\\\nand generalised singular values to define the essential\\\\ndimension of a communication channel.\\\\nC. Essential Dimension for Compact Operators\\\\nThe definition for degrees of freedom given in Section III-A depends on the arbitrarily chosen number o and\\\\ntherefore this definition does not give a unique number\\\\nfor a given channel. The physical intuition behind choosing this arbitrary small number o is nicely explained in\\\\nXu and Janaswamy [12]. In that paper o =  2 denotes the\\\\nnoise level at the receiver and the authors state that the\\\\nnumber of degrees of freedom fundamentally depends\\\\non this noise level.\\\\nHowever, in several important cases the number of degrees of freedom of a channel is essentially independent\\\\nof this arbitrarily chosen positive number [4,9,11,13,14,\\\\n16]. This is due to the fact that in these cases the singular\\\\nvalues of the channel operator show a step like behavior.\\\\nTherefore, for a big range of values of o, the number\\\\nof degrees of freedom at level o is constant. This leads\\\\nus to the concept of essential dimensionality7 which is\\\\nonly a function of the channel and not the arbitrarily\\\\nchosen positive number o. Some of the properties that\\\\none might require from the essential dimension of a\\\\nchannel operator are:\\\\n1) It must be uniquely defined for a given operator\\\\nT.\\\\n2) The definition must be applicable to a general class\\\\nof operators under consideration so that comparisons can be made between different operators.8\\\\n3) It must in some sense represent the number of\\\\ndegrees of freedom at level o.\\\\nThe last requirement above needs further clarification.\\\\nObviously the essential dimension of T can not in\\\\ngeneral be equal to the number of degrees of freedom at\\\\nlevel o because the latter is a function of o. However, if\\\\nthe singular values of T plotted in non-increasing order\\\\nchange suddenly from being large to being small then the\\\\nnumber of degrees of freedom at the knee in this graph\\\\nis the essential dimension of T . The following definition\\\\nfor the essential dimension tries to identify this knee\\\\nin the set of generalised singular values.\\\\n7\\\\nNote that the term essential dimension has been used instead\\\\nof degrees of freedom in several papers. As far as we are aware,\\\\nthis is the first time an explicit distinction is being made between the\\\\ntwo terms.\\\\n8\\\\nThis requirement is in contrast to the essential dimension definition in [17] that is only applicable to the time-bandwidth problem.\\\\n\\\\nEach level o defines a unique number of degrees\\\\nof freedom N (o) for a given compact operator T . So\\\\nfor each positive integer n  Z+ we can calculate\\\\nE(n) = ({o : n = N (o)}). Here () is the Lebesgue\\\\nmeasure. The function E(n) is well defined because of\\\\nthe properties of generalised singular values discussed in\\\\nTheorem 3.2. We can now define the essential dimension\\\\nof T as follows.\\\\nDefinition 3.3: The essential dimension of a compact\\\\noperator T is\\\\nEssDim(T ) = argmax{E(n) : n  Z+ }\\\\n\\\\nwhere E(n) is defined as above. If argmax above is\\\\nnot unique then choose the smallest n of all the n that\\\\nmaximise E(n) as the essential dimension.\\\\nIn this definition we are simply calculating the maximum\\\\nrange of values of the arbitrarily chosen o over which the\\\\nnumber of degrees of freedom of an operator does not\\\\nchange. It uniquely determines the essential dimension of\\\\nall compact operators. Further, it is equal to the number\\\\nof degrees of freedom at level o for the maximum range\\\\nof o. Choosing this value for the number of degrees\\\\nof freedom in order to model communication systems\\\\nhas the big advantage that it is independent of the noise\\\\nlevel at the receiver. Further, if for a given noise level\\\\nthe number of degrees of freedom is greater than the\\\\nessential dimension then one can be sure that even if the\\\\nnoise level varies by a significant amount the number\\\\nof degrees of freedom will always be greater than the\\\\nessential dimension.\\\\nThe essential dimension of T is the smallest number of\\\\ngeneralised singular values of T after which the change\\\\nin two consecutive singular values is a maximum. One\\\\ncould also look at how the generalised singular values are\\\\nchanging gradually and the above definition is a special\\\\ncase of the following notion of essential dimension of\\\\norder n, namely the case where n = 1.\\\\nDefinition 3.4: Let X, Y be normed spaces and let\\\\nT : X  Y be a compact operator. Let {om } be the set\\\\nof generalised singular values of T numbered in nonincreasing order. Then define the essential dimension of\\\\nT of order n to be N if n is even and\\\\noN n/2  oN +n/2  oM n/2  oM +n/2\\\\n\\\\nfor all M 6= N . If there are several N that satisfy the\\\\nabove condition then choose the smallest such N . If n\\\\nis odd then choose the smallest N that satisfies\\\\noN (n1)/2  oN +(n+1)/2  oM (n1)/2  oM +(n+1)/2\\\\n\\\\nfor all M 6= N .\\\\nA simple example illustrates the concepts of essential\\\\ndimensionality and degrees of freedom.\\\\n\\\\n\\\\f9\\\\n\\\\nn vs n\\\\n1\\\\n0.9\\\\n0.8\\\\nSingular values\\\\n\\\\n0.7\\\\n0.6\\\\n0.5\\\\n0.4\\\\n0.3\\\\n0.2\\\\n0.1\\\\n0\\\\n\\\\nFig. 2.\\\\n\\\\n1\\\\n\\\\n2\\\\n\\\\n3\\\\n\\\\n4\\\\n\\\\n5\\\\n\\\\n6\\\\n\\\\n7\\\\n\\\\nn\\\\n\\\\n8\\\\n\\\\n9\\\\n\\\\n10 11 12 13 14 15\\\\n\\\\nSingular values of an Operator\\\\n\\\\nExample 3.5: Figure 2 shows the singular values of\\\\nsome operator T . For this operator the number of degrees\\\\nof freedom at level 0.75 is 7 and at level 0.1 is 8.\\\\nThe essential dimension of the channel is 7. This\\\\nis because for o  [0.4, 0.8), N (o) = 7. Therefore\\\\nE(7) = 0.4 which is greater than E(n) for all n 6= 7. The\\\\nessential dimension of order 2 is 8 because o7  o9 = 0.7\\\\nwhich is greater than oM 1  oM +1 for all M 6= 8.\\\\nD. Computing generalised singular values\\\\nBoth, degrees of freedom and essential dimension\\\\nfor a communication channel, can be evaluated if the\\\\ngeneralised singular values of the operator T describing\\\\nthe channel are known. However, no known method\\\\nexists for computing these singular values for general\\\\ncompact operators. In this section, we develop a numerical method, based on finite dimensional approximations,\\\\nthat could be used to calculate generalised singular\\\\nvalues.\\\\nTheorem 3.8: Suppose X and Y are normed spaces\\\\nand T : X  Y is a compact operator. Also suppose\\\\nthat X has a complete Schauder basis {1 , 2 , . . .} and\\\\nlet Sn = span{1 , . . . , n }. Let Tn = T |Sn : Sn  Y ,\\\\nn  Z+ . If om , the mth singular value of T , exists then\\\\nfor n large enough om,n , the mth singular value of Tn ,\\\\nwill exist and\\\\nlim om,n = om .\\\\nn\\\\n\\\\nIf om,n exists then it is a lower bound for om .\\\\nThe theorem shows that if the domain of the operator\\\\nhas some complete Schauder basis then we can calculate\\\\nthe generalised singular values of the operator restricted\\\\nto finite dimensional subspaces and as the subspaces\\\\nget bigger we will approach the singular values of the\\\\noriginal operator. Moreover, the theorem also proves that\\\\n\\\\nthe singular values of the finite dimensional operators\\\\nprovide lower bounds for the original generalised singular values. We, however, still need a practical method of\\\\ncalculating the singular values of linear operators defined\\\\non finite dimensional normed spaces.\\\\nLet X, Y be two finite dimensional Banach spaces and\\\\nlet T : X  Y be a linear operator. Suppose o1 , . . . , on\\\\nare the generalised singular values of T and denote B1 =\\\\n{x  X : kxkX  1}. We know that for all o  op+1 ,\\\\nN (o)  p. Hence for each o  op+1 there exists a set\\\\n{i }pi=1  Y such that\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o.\\\\nsup inf \\\\nT x \\\\na\\\\n,...,a\\\\n\\\\n\\\\n1\\\\np\\\\nxB1\\\\ni=1\\\\n\\\\nY\\\\n\\\\nLet p,o denote the set of all sets {i : ki kY  1}pi=1 \\\\nY that satisfy the above inequality for a given o  op+1\\\\nand let\\\\n[\\\\np =\\\\np,o .\\\\noop+1\\\\n\\\\nWith this notation we can now prove that the generalised\\\\nsingular values of a linear operator defined on a finite\\\\ndimensional normed space can be expressed as the\\\\nsolution of an optimisation problem.\\\\nTheorem 3.9: Let X, Y be two finite dimensional\\\\nBanach spaces and let T : X  Y be a linear operator.\\\\nAlso let B1 be the closed unit ball in X and suppose p\\\\nis defined as explained above. Then\\\\nsup kT xkY = o1\\\\n\\\\nxB1\\\\n\\\\nand for all p  Z+\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nsup\\\\ninf\\\\na\\\\n\\\\ninf\\\\nT\\\\nx\\\\n\\\\n\\\\n = op+1 .\\\\n\\\\ni\\\\ni\\\\np\\\\n\\\\n{i }i=1 p xB1 a1 ,...,ap \\\\ni=1\\\\nY\\\\nGiven the correct set of functions i , the above\\\\ntheorem characterises the singular values in terms of a\\\\nmaximisation problem over a finite dimensional domain.\\\\nIt is however difficult to check whether a given set of\\\\nfunctions {i }pi=1 is an element of p . We therefore\\\\npropose the following algorithm to calculate bounds on\\\\nthe generalised singular values.\\\\nSuppose X, Y , T : X  Y , o1 , . . . , on and B1 are\\\\ndefined as in Theorem 3.9. Let\\\\no1 = sup kT xkY .\\\\nxB1\\\\n\\\\nBecause B1  X is a compact set and k  kY and T are\\\\ncontinuous, there exists an x1  B1 such that kT x1 kY =\\\\no1 . Choose 1 = T x1 .\\\\nNow suppose 1 , . . . , p have been chosen. Then let\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\n\\\\nop+1 = sup inf \\\\nT x \\\\nai i \\\\n .\\\\n(2)\\\\na\\\\n,...,a\\\\n\\\\n\\\\n1\\\\np\\\\nxB1\\\\ni=1\\\\n\\\\nY\\\\n\\\\n\\\\f10\\\\n\\\\nAgain, because B1  X is a compact set and k  kY\\\\nand T are continuous, there exists an xp+1  B1 such\\\\nthat xp+1 attains the maximum in the above equation.\\\\nChoose p+1 = T xp+1. Comparing with Theorem 3.9\\\\nwe note that op+1 is an upper bound for op+1 . It is an\\\\nopen question as to whether op+1 = op+1 .\\\\nIn this algorithm, instead of searching over all possible\\\\nsets in p we select a special set that is in some sense\\\\n(it consists of images of the x  B1 that attain the\\\\nmaximum in equation (2)) the best possible set to use.\\\\nThis choice is essential because otherwise the calculation\\\\nof generalised singular values becomes too cumbersome\\\\n(one needs to find the set p before calculating op+1 ).\\\\nNote however, that the above algorithm gives the correct\\\\nvalue for o1 .\\\\nThe theory presented here has been used to compute\\\\nthe generalised singular values and degrees of freedom\\\\nin spatial waveform channels of the type discussed in\\\\nExample 2.3. The results of these computations are\\\\npresented in Somaraju [18]. Due to space constraints,\\\\nthese results are not further discussed in this paper.\\\\nE. Non-compactness of channel operators\\\\nThroughout this paper we have exclusively dealt with\\\\nchannels that can be modeled using compact operators.\\\\nWe have done so because of the following result.\\\\nTheorem 3.10: (Converse to Theorem 3.1) Suppose\\\\nX and Y are normed spaces with norms k  kX and\\\\nk  kY , respectively, and T : X  Y is a bounded linear\\\\noperator. If for all o > 0 there exist N  Z+\\\\n0 and a set\\\\n{i }N\\\\n\\\\nY\\\\nsuch\\\\nthat\\\\nfor\\\\nall\\\\nx\\\\n\\\\nB\\\\n(0)\\\\n1,X\\\\ni=1\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nthen T is compact.\\\\nSo any bounded channel operator with finitely many\\\\nsub-channels must be compact. Indeed, if one can find\\\\na channel that is not described by a compact operator,\\\\nthen it will have infinitely many sub-channels and will\\\\ntherefore have infinite capacity. Also, if the channel is\\\\ndescribed by an operator that is linear but unbounded\\\\nthen there will obviously exist sub-channels over which\\\\narbitrarily large gains can be obtained.9\\\\nIV. C ONCLUSION\\\\nIn this paper we assume that a communication channel\\\\ncan be modeled by a normed space X of transmitter\\\\n9\\\\n\\\\nIt could hence be argued that non-compact channel operators are\\\\nunphysical, however, we will leave it to the reader to make this\\\\njudgement.\\\\n\\\\nfunctions that a transmitter can generate, a normed space\\\\nY of functions that a receiver can measure and an\\\\noperator T : X  Y that maps the transmitter functions\\\\nto functions measured by the receiver. We then introduce\\\\nthe concepts of degrees of freedom at level o, essential\\\\ndimension and generalised singular values of such channel operators in the case where they are compact. One\\\\ncan give a physical interpretation for degrees of freedom\\\\nas follows: if there is some constraint k  kX  1 on\\\\nthe space of source functions and if the receiver can\\\\nonly measure signals that satisfy k  kY > o then the\\\\nnumber of degrees of freedom is the number of linearly\\\\nindependent signals that the receiver can measure under\\\\nthe given constraints. If the degrees of freedom are\\\\nlargely independent of the level o then it makes sense to\\\\ntalk about the essential dimension of the channel. The\\\\nessential dimension of the channel is the smallest number\\\\nof degrees of freedom of the channel that is the same for\\\\nthe largest range of levels o. We show how one can use\\\\nthe number of degrees of freedom at level o to generalise\\\\nthe Hilbert space concept of singular values to arbitrary\\\\nnormed spaces. We also provide a simple algorithm that\\\\ncan be used to approximately calculate these generalised\\\\nsingular values. Finally, we prove that if the operator\\\\ndescribing the channel is not compact then it must either\\\\nhave infinite gain or have an infinite number of degrees\\\\nof freedom. The general theory developed in this paper is\\\\napplied to spatial waveform channels in Somaraju [18].\\\\nA PPENDIX\\\\nProofs of Theorems: Theorem 3.1. Suppose X and\\\\nY are normed spaces with norms k  kX and k  kY ,\\\\nrespectively, and T : X  Y is a compact operator.\\\\nThen for all o > 0 there exist N  Z+\\\\n0 and a set\\\\n{i }N\\\\n\\\\nY\\\\nsuch\\\\nthat\\\\nfor\\\\nall\\\\nx\\\\n\\\\nB\\\\n(0)\\\\n1,X\\\\ni=1\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\ninf \\\\nT x \\\\nai i \\\\n  o.\\\\n(3)\\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nProof: The proof is by contradiction. Let o > 0 be\\\\ngiven. Suppose no such N exists.\\\\nLet x1  B 1,X (0) be any vector. Choose 1 = T x1 .\\\\nSuppose that {x1 , . . . , xN } and {1 , . . . , N } have been\\\\nchosen. Then, by our assumption, there exists an xN +1 \\\\nB 1,X (0) such that\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n > o.\\\\n(4)\\\\ninf \\\\nT xN +1 \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nChoose N +1 = T xN +1 . By induction, for M  N we\\\\nhave\\\\nkT xN +1  T xM kY > o.\\\\n\\\\n\\\\f11\\\\n\\\\nThis follows from (4) by setting ai = 0, i  N , i 6= M ,\\\\nand aM = 1. Therefore, using the Cauchy criterion,\\\\nthe sequence {T xn }\\\\nn=1 chosen by induction cannot\\\\nhave a convergent subsequence. This is the required\\\\ncontradiction because {xn }\\\\nn=1 is a bounded sequence\\\\nand T is compact.\\\\nTheorem 3.2. Suppose X and Y are normed spaces\\\\nwith norms kkX and kkY , respectively, and T : X  Y\\\\nis a compact operator. Let N (o) denote the number of\\\\ndegrees of freedom of T at level o. Then\\\\n1) N (o) = 0 for all o  kT k.\\\\n2) Unless T is identically zero, there exists an o0 > 0\\\\nsuch that N (o)  1 for all 0 < o < o0 .\\\\n3) N (o) is a non-increasing, upper semicontinuous\\\\nfunction of o.\\\\n4) In any finite interval (o1 , o2 )  R, with 0 < o1 <\\\\no2 , N (o) has only finitely many discontinuities, i.e.\\\\nN (o) only takes finitely many non-negative integer\\\\nvalues in any finite o interval.\\\\nProof:\\\\n1) Because T is compact it is bounded, and therefore\\\\nkT k < . Suppose o  kT k then kT xkY \\\\nkT k  o for all x  B 1,X (0). Therefore N (o) = 0.\\\\n2) If kT k > 0 there exists an x  X , kxkX  1 such\\\\nthat kT xkY > 0. Set o0 := kT xkY . Then for all\\\\n0 < o < o0 , N (o)  1.\\\\n3) Suppose 0 < o1 < o2 . Then there exist functions\\\\n1 , . . . , N (o1 ) such that for all x  B 1,X (0)\\\\n\\\\n\\\\n\\\\n\\\\nN (o1 )\\\\nX\\\\n\\\\n\\\\n\\\\n\\\\n < o1 < o2\\\\ninf\\\\nT\\\\nx\\\\n\\\\na\\\\n\\\\ni\\\\ni\\\\n\\\\na1 ,...,aN (o1 ) \\\\n\\\\n\\\\ni=1\\\\nY\\\\n\\\\nTherefore N (o2 )  N (o1 ) from the definition of\\\\nthe number of degrees of freedom at level o, i.e.\\\\nN (o) is non-increasing. In particular we have\\\\n\\\\nBut (5) contradicts (6) for  := 12 (  o1 ). Hence\\\\nlimoo1 N (o) = N (o1 ) and N (o) is upper semicontinuous.\\\\n4) This follows from Parts 1 and 3.\\\\nProposition 3.3. Suppose X and Y are normed spaces\\\\nand T : X  Y is a compact operator. Let N (o) denote\\\\nthe number of degrees of freedom of T at level o. Then\\\\nN (o) is equal to the number of generalised singular\\\\nvalues that are greater than o.\\\\nProof: This follows from careful counting of the\\\\nnumbers of degrees of freedom at level o including repeated counting according to the height of any occurring\\\\njumps.\\\\nTheorem 3.4. Suppose X and Y are normed spaces\\\\nwith norms kkX and kkY , respectively, and T : X  Y\\\\nis a compact operator. Let om be a generalised singular\\\\nvalue of the operator T . Then for all  > 0 there exists\\\\na   X , kkX = 1, such that\\\\nom +   kT kY  om  .\\\\n\\\\nProof: The proof is by contradiction. Assume that\\\\nthere exists a  > 0 such that for all   X , kkX = 1,\\\\nwe have kT kY \\\\n/ [om  , om + ]. Let N (o) denote the\\\\nnumber of degrees of freedom at level o of the operator\\\\nT . From the definition of degrees of freedom at level o\\\\nwe have\\\\nN (om + )  m  1,\\\\n\\\\n(7)\\\\n\\\\nN (om  )  m.\\\\n\\\\n(8)\\\\n\\\\nBy (7), there exist vectors 1 , . . . , m1  Y such that\\\\nfor all x  B 1,X (0)\\\\n\\\\n\\\\nm1\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  om + .\\\\ninf \\\\nT x \\\\na1 ,...,am1 \\\\n\\\\ni=1\\\\n\\\\nlim N (o)  N (o1 ).\\\\n\\\\noo1\\\\n\\\\nAssume that the above inequality is strict. Then\\\\nthere exists an N  Z+\\\\n0 , N < N (o1 ), and for all\\\\n > 0 there exists a set {i }N\\\\ni=1  Y such that\\\\nfor all x  B 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o1 + .\\\\ninf \\\\nT x \\\\n(5)\\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nOn the other hand, since N (o1 ) > N , for all sets\\\\n{i }N\\\\ni=1  Y there exists an x  B 1,X (0) such\\\\nthat\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n > o1 . (6)\\\\n := inf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nBy our assumption on kT kY ,\\\\n\\\\n\\\\nm1\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  om  .\\\\ninf \\\\nT  \\\\na1 ,...,am1 \\\\n\\\\ni=1\\\\n\\\\nThis follows from consideration of the case a1 =    =\\\\nam1 = 0. Hence N (om  )  m  1 since scaling \\\\nto non-unit norm is equivalent to scaling all the ai . This\\\\ncontradicts inequality (8). Therefore there exists a  that\\\\nsatisfies the conditions of the theorem.\\\\nTheorem 3.5. Suppose H1 and H2 are Hilbert spaces\\\\nand T : H1  H2 is a compact operator. Then for all\\\\no > 0 there exist an N  Z+\\\\n0 and a set of N mutually\\\\nN\\\\northogonal vectors {i }i=1  H1 such that if\\\\nx  H1 , kxkH1  1 and hx, i iH1 = 0\\\\n\\\\n\\\\f12\\\\n\\\\nthen\\\\nkT xkH2  o.\\\\n\\\\nMoreover, the smallest N that satisfies the above condition for a given o is equal to the number of Hilbert space\\\\nsingular values of T that are greater than o.\\\\nProof: We first prove that such an N is given by\\\\nthe number of Hilbert space singular values of T that\\\\nare greater than o and then prove that this is the smallest\\\\nsuch N .\\\\nLet o > 0 be given. Because T is compact, we can\\\\nuse the singular value decomposition theorem which says\\\\n[21, p. 261]\\\\nX\\\\nT =\\\\ni h, i iH1 i .\\\\n(9)\\\\ni\\\\n\\\\nZ+\\\\n\\\\nHere, i , i and i with i \\\\nare the Hilbert space\\\\nsingular values and left and right singular vectors of T ,\\\\nrespectively. We assume w.l.o.g. that the Hilbert space\\\\nsingular values are ordered in non-increasing order. We\\\\ndenote by N1  Z+ the number of Hilbert space singular\\\\nvalues of T that are greater than o, i.e. i > o if and only\\\\nif i  N1 .\\\\nNow, if x is orthogonal to i , i = 1, . . . , N1 and if\\\\nkxkH1  1 then from equation (9)\\\\nkT xk2H2\\\\n\\\\n=\\\\n\\\\n\\\\nX\\\\n\\\\nxr is the remainder term that is orthogonal to all the i .\\\\nFrom equation (9) and i  o for i > N1 it follows that\\\\n\\\\n\\\\nN1\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\ni hx, i iH1 i \\\\n  o\\\\n\\\\nT x \\\\n\\\\n\\\\ni=1\\\\n\\\\nH2\\\\n\\\\nand hence N1  N2 by the definition of the number of\\\\ndegrees of freedom at level o (set ai = i hx, i iH1 in\\\\nthat definition).\\\\nTo prove that N1  N2 assume that N1 > N2 to arrive\\\\n2\\\\nat a contradiction. Then there exists a set {i }N\\\\ni=1  H2\\\\nsuch that\\\\n\\\\n\\\\nN2\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o\\\\ninf \\\\nT x \\\\na1 ,...,aN2 \\\\n\\\\ni=1\\\\n\\\\nH2\\\\n\\\\nfor all x  H1 , kxkH1  1. Because we assume that\\\\nN1 > N2 , there exists a y  span{1 ,P\\\\n. . . , N1 } which\\\\nN1\\\\nis orthogonal to all the i . Let y =\\\\ni=1 bi i . Then\\\\nPN1 bi\\\\ny = T x where x =\\\\n\\\\nby\\\\nequation\\\\n(9). We\\\\ni=1 i i\\\\ncan assume w.l.o.g. that the bi are normalised so that\\\\nkxkH1 = 1. If this is done then\\\\n\\\\n2\\\\n\\\\nN2\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\ninf \\\\nT x \\\\n= kyk2H2\\\\n(10)\\\\na1 ,...,aN2 \\\\n\\\\ni=1\\\\n\\\\nH2\\\\n\\\\n=\\\\n\\\\ni2 |hx, i iH1 |2 ki k2H2\\\\n\\\\ni=1\\\\n\\\\n o2\\\\n\\\\n\\\\nX\\\\n\\\\n>\\\\n\\\\n|hx, i iH1 |2\\\\n\\\\nN1\\\\nX\\\\ni=1\\\\nN1\\\\nX\\\\ni=1\\\\n\\\\n= o2 .\\\\n\\\\ni=N1 +1\\\\n\\\\n o2 .\\\\n{i }N\\\\ni=1\\\\n\\\\nFor N < N1 , the linear span of any set\\\\n H1\\\\nhas a non-trivial orthogonal complement in the span of\\\\n1\\\\n{i }N\\\\ni=1 . Any vector x in this complement with kxkH1 =\\\\n1 fullfills the conditions of the theorem but kT xkH2 > o\\\\nby equation (9).\\\\nTheorem 3.6. Suppose that H1 and H2 are Hilbert\\\\nspaces and T : H1  H2 is a compact operator. Then\\\\nthe number of degrees of freedom at level o is equal to\\\\nthe number of Hilbert space singular values of T that\\\\nare greater than o.\\\\nProof: As in the prove of the previous theorem, let\\\\nN1  Z+ denote the number of Hilbert space singular\\\\nvalues of T that are greater than o. Let i , i and i with\\\\ni  Z+ denote the Hilbert space singular values in nonincreasing order and the left and right singular vectors\\\\nof T , respectively. Let N2  Z+ denote the number of\\\\ndegrees of freedom of T at level o.\\\\nWe first prove that N1  P\\\\nN2 . If x is in the unit ball in\\\\nH1 then we can write x = \\\\ni=1 hx, i iH1 i + xr . Here\\\\n\\\\nb2i\\\\n\\\\n(11)\\\\n\\\\nb2i 2\\\\no (12)\\\\ni2\\\\n\\\\n(13)\\\\n\\\\nIn the above we get equation (10) from the fact that y\\\\nis orthogonal to all the i , inequality (12) from i > o\\\\nfor i  N1 and equation (13) from kxkH1 = 1. The\\\\ninequality (10)(13) is the required contradiction. This\\\\nproves that N1  N2 and hence N1 = N2 .\\\\nCorollary 3.1. Suppose H1 and H2 are Hilbert spaces\\\\nand T : H1  H2 is a compact operator. Suppose {om }\\\\nare the generalised singular values of T and {m } are\\\\nthe possibly repeated Hilbert space singular values of T\\\\nwritten in non-increasing order. Then\\\\nm = o m\\\\n\\\\nfor all m  Z+ .\\\\nProof: This follows immediately from Theorem 3.6\\\\nand Proposition 3.3 by a simple counting argument.\\\\nTheorem 3.8. Suppose X and Y are normed spaces\\\\nand T : X  Y is a compact operator. Also suppose\\\\nthat X has a complete Schauder basis {1 , 2 , . . .} and\\\\nlet Sn = span{1 , . . . , n }. Let Tn = T |Sn : Sn  Y ,\\\\nn  Z+ . If om , the mth singular value of T , exists then\\\\n\\\\n\\\\f13\\\\n\\\\nfor n large enough om,n , the mth singular value of Tn ,\\\\nwill exist and\\\\nlim om,n = om .\\\\n\\\\nTherefore for all o > 0\\\\n\\\\nIf om,n exists then it is a lower bound for om .\\\\nProof Outline: The crux of the argument used to prove\\\\nthe theorem is as follows. Assume o > 0 is given and\\\\nlet N (o) denote the number of degrees of freedom at\\\\nlevel o for the operator T . By definition there exist\\\\nfunctions {1 , . . . , N (o) }  Y such that for all x  X ,\\\\nkxkX  1, T x can be approximated to level o by\\\\na linear combination of the i and further, no set of\\\\n }  Y can approximate all the T x\\\\nfunctions {1 , . . . , N\\\\nif N < N (o). Equivalently, there is a vector in the closed\\\\nunit ball in X whose image under T can be approximated\\\\nby a vector in span{1 , . . . , N (o) } but not by any vector\\\\n }.\\\\nin span{1 , . . . , N\\\\nSo we take the inverse image of an o-net of points in\\\\nspan{1 , . . . , N (o) } and choose n large enough so that\\\\nall the inverse images are close to Sn . We can do this\\\\nbecause the i form a complete Schauder basis for X .\\\\nWe then show that there exists a vector in Sn such that\\\\nits image under T cannot be approximated by a linear\\\\n for N < N (o). This will\\\\ncombination of 1 , . . . , N\\\\nprove that the number of degrees of freedom at level o\\\\nof Tn approaches that of T and consequently so do the\\\\nsingular values. The details are as follows.\\\\nProof: We will prove this theorem in two parts.\\\\nAssume that om exists. In part a) we will prove that if\\\\nom,N exists for some N  Z+ then om,n exists for all\\\\nn > N , and the om,n form a non-decreasing sequence\\\\nindexed by n that is bounded from above by om . In part\\\\nb) we prove by contradiction that om,n exists for some\\\\nn  Z+ and that om,n must converge to om .\\\\nWe will use the following notation in the proof:\\\\n\\\\nBecause\\\\n\\\\nNn2 (o)  Nn1 (o).\\\\n\\\\n(14)\\\\n\\\\nn\\\\n\\\\nspano {1 , . . . , N } =\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\n{y  Y : inf \\\\ny \\\\nai i \\\\n  o}\\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nand Br = {x  X : kxkX  r}.\\\\nPart a: Let T and Tn be defined as in the theorem\\\\nand let N (o) and Nn (o) be the numbers of degrees of\\\\nfreedom at level o of T and Tn , respectively. Assume\\\\nthat om,n1 exists and let n2 > n1 .\\\\nThen for all sets {1 , . . . , Nn1 (o)1 }  Y there is a\\\\n  Sn1  B1 such that\\\\nTn1  = T  \\\\n/ spano {1 , . . . , Nn1 (o)1 }.\\\\n\\\\nBecause Sn1  Sn2 we have   Sn2  B1 and\\\\nTn2  = T  \\\\n/ spano {1 , . . . , Nn1 (o)1 }.\\\\n\\\\ninf\\\\n\\\\no<om,n1\\\\n\\\\nNn1 (o)  m\\\\n\\\\n(15)\\\\n\\\\nwe have Nn2 (o)  Nn1 (o)  m for o < om,n1 . Hence\\\\nom,n2 must exist.\\\\nFrom the definition of generalised singular values we\\\\nhave inequality (15) and\\\\nsupo>om,n2 Nn2 (o)  m  1\\\\n\\\\nIf om,n1 > om,n2 then there exists an o such that om,n1 >\\\\no > om,n2 . Therefore,\\\\nNn1 (o )  m > m  1  Nn2 (o ).\\\\n\\\\nThis contradicts inequality (14). Therefore om,n1 \\\\nom,n2 .\\\\nThe same line of arguments as above can be used to\\\\nshow that if both om and om,n exist then om,n  om .\\\\nRecall that we have assumed at the beginning that om\\\\nexists. Therefore, if om,N exists for some N  Z+ then\\\\nom,n is a non-decreasing sequence in n  N that is\\\\nbounded from above by om .\\\\nPart b: By part a), if om,n exists for n  n1 then,\\\\nbecause om,n is a bounded monotonic sequence in n it\\\\nmust converge to some om  om .\\\\nNow there are two situations to consider. Firstly, om,n\\\\nmight not exist for any n  Z+ . Secondly, om,n might\\\\nexist for some n but the limit om might be strictly less\\\\nthan om . We consider the two situations separately and\\\\narrive at the same set of inequalities in both situations.\\\\nWe then derive a contradiction from that set.\\\\nSituation 1: Assume that om,n does not exist for any\\\\nn  Z+ . Then\\\\nNn (o)  m  1\\\\n(16)\\\\nfor all n  Z+ and o > 0. Using the definition of degrees\\\\nof freedom for T there exist constants  <  < om such\\\\nthat\\\\nNn ()  m  1\\\\n\\\\nfor all n  Z+\\\\n\\\\nand\\\\n\\\\nN ()  m.\\\\n\\\\n(17)\\\\n(18)\\\\n\\\\nSituation 2: Assume that om < om . From the definition of generalised singular values we know\\\\nsupo>om,n Nn (o)  m  1\\\\ninf o<om N (o)  m.\\\\n\\\\nfor all n  Z+\\\\n\\\\nand\\\\n\\\\n\\\\f14\\\\n\\\\nBecause om,n  om , we know that there exist numbers\\\\n and  , om <  <  < om such that\\\\nNn ()  m  1\\\\n\\\\nfor all n  Z+\\\\n\\\\nand\\\\n\\\\nN ()  m.\\\\n\\\\n(19)\\\\n\\\\nT p,n \\\\n/ span {1,n , . . . , m1,n }.\\\\n\\\\n(20)\\\\n\\\\nThis directly contradicts condition (24). Therefore, if om\\\\nexists then om,n exists for n large enough and\\\\n\\\\nThese are the same conditions as (17) and (18). Therefore, in both situations we need to prove that the inequalities (19) and (20) cannot be simultaneously true.\\\\nBecause T is compact, T B1 is totally bounded [20,\\\\nch. 8]. Therefore, T B1 has a finite o-net for all o > 0.\\\\nHence there exists a set of vectors {1 , . . . , P }  B1\\\\nsuch that for all y  T B1 there exists a p, 1  p  P\\\\nwith\\\\n\\\\nkT p  ykY <\\\\n.\\\\n(21)\\\\n2\\\\nNow, because {1 , 2 , . . .} is a complete Schauder basis\\\\nfor X and because P < , there exists a number N\\\\nsuch that for all n > N and for all p, 1  p  P , there\\\\nexists a p,n  Sn  B1 such that\\\\nkp,n  p kX\\\\n\\\\n\\\\n<\\\\n.\\\\n2kT k\\\\n\\\\n(22)\\\\n\\\\nTherefore, for all y  T B1 and for all n > N there\\\\nexists a p, 1  p  P and a p,n  Sn  B1 such that\\\\nkT p,n  ykY\\\\n\\\\n= kT p,n  T p + T p  ykY\\\\n\\\\nWe get the first inequality above from the triangle\\\\ninequality, the second one from inequality (21) and the\\\\nfinal one from inequality (22). From inequality (19) and\\\\nthe definition of the number of degrees of freedom, we\\\\nknow that for all n  Z+ there exists a set of vectors\\\\n{1,n , . . . , m1,n }  Y such that\\\\n(24)\\\\n\\\\nfor all y  T (Sn  B1 ).\\\\nBut, from the definition of the number of degrees of\\\\nfreedom and inequality (20) we know that for all n  Z+\\\\nand all sets of vectors {1,n , . . . , m1,n } there exists a\\\\nvector   T B1 such that\\\\n\\\\n/ span {1,n , . . . , m1,n }.\\\\n\\\\nFrom inequality (23) we know that for all n > N there\\\\nexists a p,n  Sn  B1 such that\\\\nkT p,n  k <   .\\\\n\\\\n(25)\\\\n\\\\nlim om,n = om .\\\\n\\\\nn\\\\n\\\\nTheorem 3.9. Let X, Y be two finite dimensional\\\\nBanach spaces and let T : X  Y be a linear operator.\\\\nAlso let B1 be the closed unit ball in X and suppose p\\\\nis defined as in Section III-D. Then\\\\nsup kT xkY = o1\\\\n\\\\nxB1\\\\n\\\\nand for all p  Z+\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\ninf\\\\nsup\\\\na\\\\n\\\\ninf\\\\nT\\\\nx\\\\n\\\\n\\\\n = op+1 .\\\\n\\\\ni\\\\ni\\\\np\\\\na\\\\n,...,a\\\\n\\\\np \\\\n{i }i=1 p xB1 1\\\\ni=1\\\\n\\\\nY\\\\n\\\\nop+1\\\\n\\\\ndenote the left hand side of the\\\\nProof: Let\\\\nabove equation. Assume op+1 < op+1 . Then there exists\\\\na set {i }pi=1  p such that\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\n\\\\nai i \\\\n < op+1 .\\\\nop+1 := sup inf \\\\nT x \\\\na\\\\n,...,a\\\\n\\\\n\\\\n1\\\\np\\\\nxB1\\\\ni=1\\\\n\\\\n kT p,n  T p kY + kT p  ykY\\\\n\\\\n< kT (p,n  p )kY +\\\\n2\\\\n \\\\n< kT k\\\\n+\\\\n2kT k\\\\n2\\\\n=   .\\\\n(23)\\\\n\\\\ny  span {1,n , . . . , m1,n }\\\\n\\\\nTherefore, for all n > N there exists a p,n  Sn  B1\\\\nsuch that\\\\n\\\\nN (op+1 )\\\\n\\\\nBy definition this implies\\\\n p, a contradiction\\\\nto inf o<op+1 N (o)  p + 1. Hence op+1  op+1 . Now\\\\nassume op+1 > op+1 . Let o  (op+1 , op+1 ). From\\\\nsupo>op+1 N (o) = p it follows N (o)  p. Hence there\\\\nexists a set {i }pi=1  Y such that\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nsup inf \\\\nT x \\\\nai i \\\\n  o < op+1 .\\\\na\\\\n,...,a\\\\n\\\\n\\\\n1\\\\np\\\\nxB1\\\\ni=1\\\\n\\\\n p,o  p and\\\\n\\\\n\\\\np\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\na\\\\n\\\\n>\\\\ninf\\\\nsup\\\\ninf\\\\nT\\\\nx\\\\n\\\\n\\\\ni i\\\\n ,\\\\n\\\\n{i }pi=1 p xB1 a1 ,...,ap \\\\n\\\\nTherefore\\\\nop+1\\\\n\\\\n{i }pi=1\\\\n\\\\ni=1\\\\n\\\\nop+1\\\\n\\\\na contradiction. Hence\\\\n= op+1 .\\\\nTheorem 3.10. (Converse to Theorem 3.1) Suppose X\\\\nand Y are normed spaces with norms k  kX and k  kY ,\\\\nrespectively, and T : X  Y is a bounded linear\\\\noperator. If for all o > 0 there exist N  Z+\\\\n0 and a\\\\nN\\\\nset {i }i=1  Y such that for all x  B 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  o\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nthen T is compact.\\\\nProof: We prove that T is compact by showing\\\\nthat the set T (B 1,X (0)) is totally bounded. Let  > 0 be\\\\n\\\\n\\\\f15\\\\nN\\\\ngiven. Then there exist an N  Z+\\\\n0 and a set {i }i=1 \\\\nY such that for all x  B 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\n\\\\n(26)\\\\nai i \\\\n  .\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\n4\\\\ni=1\\\\n\\\\nY\\\\n\\\\nFor any given x  B 1,X (0) we can choose axi , i =\\\\n1, . . . , N such that\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\naxi i \\\\n\\\\nT x \\\\n\\\\n\\\\ni=1\\\\nY\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\n\\\\nai i \\\\n +\\\\n\\\\ninf \\\\nT x \\\\n(27)\\\\na1 ,...,aN \\\\n\\\\n4\\\\ni=1\\\\n\\\\nY\\\\n\\\\n\\\\n\\\\n.\\\\n(28)\\\\n2\\\\nHere, the last inequality follows from (26). Also, because\\\\nwe can choose ai = 0 for i = 1, . . . , N , for all x \\\\nB 1,X (0)\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nai i \\\\n  kT xkY .\\\\n(29)\\\\ninf \\\\nT x \\\\na1 ,...,aN \\\\n\\\\ni=1\\\\n\\\\nY\\\\n\\\\nSubstituting inequality (29) into (27) and\\\\ntriangle inequality, we get\\\\n\\\\n\\\\nN\\\\n\\\\n\\\\nX\\\\n\\\\n\\\\nx \\\\na\\\\n\\\\n 2kT k +\\\\n\\\\ni i \\\\n  2kT xkY +\\\\n\\\\n\\\\n4\\\\ni=1\\\\n\\\\nY\\\\n\\\\nusing the\\\\n\\\\n\\\\n.\\\\n4\\\\n\\\\n(30)\\\\n\\\\nWe get the last inequality from the boundedness of T .\\\\nBecause the span of 1 , . . . , N is finite dimensional\\\\nand because of the uniform bound (30), there exists a\\\\nfinite set of elements {y1 , . . . , yM }  Y such that for\\\\nall x  B 1,X (0)\\\\n\\\\n\\\\n\\\\n\\\\nN\\\\nX\\\\n\\\\n\\\\n\\\\nx \\\\n\\\\ninf \\\\nyi \\\\naj j \\\\n  .\\\\n(31)\\\\ni=1,...,M \\\\n2\\\\n\\\\nj=1\\\\n\\\\nY\\\\n\\\\nFrom inequalities (31) and (28) and the triangle inequality we get for all x  B 1,X (0)\\\\ninf\\\\n\\\\ni=1,...,M\\\\n\\\\nkyi  T xkY  .\\\\n\\\\n(32)\\\\n\\\\nTherefore, the yi , i = 1, . . . , M form a finite -net\\\\nfor T (B 1,X (0)) and therefore T (B 1,X (0)) is totally\\\\nbounded. Hence, T is compact.\\\\nR EFERENCES\\\\n[1] C. E. Shannon, A mathematical theory of communication, Bell\\\\nSyst. Tech. J., vol. 27, pp. 379423, 1948.\\\\n[2] R. Gallagher, Information Theory and Reliable Communication.\\\\nNew York, USA: John Wiley & Sons, 1968.\\\\n[3] S. Verd u, Fifty years of Shannon theory, IEEE Transactions\\\\non Information Theory, vol. 44, no. 6, p. 2057, 1998.\\\\n\\\\n[4] H. Landau and H. Pollak, Prolate spheroidal wave functions,\\\\nFourier analysis and uncertainty - III: The dimension of the\\\\nspace of essentially time- and band-limited signals, The Bell\\\\nSystem Technical Journal, vol. 41, pp. 12951336, Jul 1962.\\\\n[5] E. Biglieri and G. Taricco, Transmission and Reception with\\\\nMultiple Antennas: Theoretical Foundations, ser. Foundations\\\\nand Trends in Communications and Information Theory. Now\\\\nPublishers, 2004.\\\\n[6] H. B olcskei, D. Gesbert, and A. J. Paulraj, On the capacity of\\\\nOFDM-based spatial multiplexing systems, IEEE Transactions\\\\non Communications, vol. 50, no. 2, p. 225, 2002.\\\\n[7] A. Grant and P. D. Alexander, Random sequence multisets\\\\nfor synchronous code-division multiple-access channels, IEEE\\\\nTransactions on Information Theory, vol. 44, no. 7, p. 2832,\\\\n1998.\\\\n[8] A. M. Tulino and S. Verd u, Random Matrix Theory and Wireless\\\\nCommunications, ser. Foundations and Trends in Communications and Information Theory. Now Publishers, 2004.\\\\n[9] A. S. Y. Poon, R. W. Brodersen, and D. N. C. Tse, Degrees\\\\nof freedom in multiple-antenna channels: A signal space approach, IEEE Transactions on Information Theory, vol. 51,\\\\nno. 2, pp. 523536, February 2005.\\\\n[10] L. Hanlen and M. Fu, Wireless communication systems with\\\\nspatial diversity: A volumetric model, IEEE Transactions on\\\\nWireless Communications, vol. 5, no. 1, pp. 133142, January\\\\n2006.\\\\n[11] R. A. Kennedy, P. Sadeghi, T. D. Abhayapala, and H. M.\\\\nJones, Intrinsic limits of dimensionality and richness in random\\\\nmultipath fields, IEEE Transactions on Signal Processing,\\\\nvol. 55, pp. 25422556, 2007.\\\\n[12] J. Xu and R. Janaswamy, Electromagnetic degrees of freedom\\\\nin 2-D scattering environments, IEEE Transactions on Antennas and Propagation, vol. 54, no. 12, pp. 38823894, December\\\\n2006.\\\\n[13] M. D. Migliore, On the role of the number of degrees of\\\\nfreedom of the field in MIMO channels, IEEE Transactions on\\\\nAntennas Propagation, vol. 54, no. 2, pp. 620628, February\\\\n2006.\\\\n[14] D. A. Miller, Communicating with waves between volumes:\\\\nevaluating orthogonal spatial channels and limits on coupling\\\\nstrengths, Applied Optics, vol. 39, no. 11, pp. 16811699, April\\\\n2000.\\\\n[15] O. M. Bucci and G. Franceschetti, On spatial bandwidth of\\\\nscattered fields, IEEE Transactions on Antennas and Propagation, vol. 35, no. 12, pp. 14451455, December 1987.\\\\n[16] , On the degrees of freedom of scattered fields, IEEE\\\\nTransactions on Antennas Propagation, vol. 37, no. 7, pp. 318\\\\n326, July 1989.\\\\n[17] D. Slepian, On bandwidth, Proc. IEEE, vol. 64, no. 3, pp.\\\\n292300, Mar. 1976.\\\\n[18] R. Somaraju, Essential dimension and degrees of freedom for\\\\nspatial waveform channels, Ph.D. dissertation, The Australian\\\\nNational University, 2008.\\\\n[19] S. Haykin, Communication Systems. Wiley; 4th edition, 2000.\\\\n[20] E. Kreyszig, Introductory functional analysis with applications.\\\\nJohn Wiley & Sons, 1989.\\\\n[21] T. Kato, Perturbation Theory for Linear Operators. Springer,\\\\n1980.\\\\n\\\\n\\\\f\"}\\n'"
  },
  "key_words": {
    "Abstract": [
      [
        "compact operators communication",
        0.6166
      ],
      [
        "compact channel operators",
        0.6106
      ],
      [
        "linear compact channel",
        0.5938
      ],
      [
        "operators communication channels",
        0.5937
      ],
      [
        "compact channel",
        0.5704
      ]
    ],
    "Introduction": [
      [
        "calculate capacity channels",
        0.6023
      ],
      [
        "capacity channels",
        0.5692
      ],
      [
        "channels calculate",
        0.5641
      ],
      [
        "capacity channels use",
        0.5527
      ],
      [
        "channel needs calculate",
        0.5475
      ]
    ],
    "Related Work": [
      [
        "compact operators communication",
        0.6034
      ],
      [
        "operators communication channel",
        0.5944
      ],
      [
        "channels ndefined hilbert",
        0.5842
      ],
      [
        "communication channels ndefined",
        0.567
      ],
      [
        "operators describing communication",
        0.5581
      ]
    ],
    "Methodology": [
      [
        "channel model",
        0.6764
      ],
      [
        "channel useful channels",
        0.6413
      ],
      [
        "assume communication channel",
        0.6306
      ],
      [
        "communication channel",
        0.6183
      ],
      [
        "channel useful",
        0.6002
      ]
    ],
    "Experiment": [
      [
        "receiver functions space",
        0.629
      ],
      [
        "transmitter nfunctions space",
        0.599
      ],
      [
        "transmitter functions elements",
        0.5254
      ],
      [
        "channel operator",
        0.5002
      ],
      [
        "transmitter functions",
        0.4773
      ]
    ],
    "Discussion": [
      [
        "compact channel operators",
        0.6299
      ],
      [
        "channel operators nthroughout",
        0.6152
      ],
      [
        "channel operators",
        0.5994
      ],
      [
        "compactness channel operators",
        0.5885
      ],
      [
        "nvalues channel operator",
        0.5863
      ]
    ]
  },
  "summarization": {
    "Abstract": "Degrees of freedom at level o and essential dimension limit the number of independent signals that can be exchanged in a communication channel. Ram Somaraju and Jochen Trump argue that the degrees of freedom limit the capacity of a communication system. they use linear compact operators to describe arbitrary communication channels.",
    "Introduction": "culation of the number of approximately time-limited and band-limited subchannels can be done using the water-filling formula. This formula can be used to calculate the capacity of non-white Gaussian channels. The number of degrees of freedom available in spatial channels can also be calculated using the singular.",
    "Related Work": "SVD theorem is only applicable to compact operators defined on Hilbert spaces. We evaluate the number of parallel sub-channels available in general communication systems. The number of degrees of freedom of a communication system can be calculated. Theory is the most general theory needed to model physically realistic channels.",
    "Methodology": "channel is useful for channels that have degrees of freedom independent of the receiver noise level. We generalise the notion of singular operators to compact operators defined on normed spaces. We assume that a communication channel between a transmitter and a receiver can be modeled as a channel. The channel model can be used to compute the essential degree of freedom.",
    "Experiment": "in the remainder of the paper, we look at the theory of degrees of freedom. We show how the theory can be applied to practical communication systems. The theory is based on the compactness of the channel operator T. We also discuss the definition of a finite dimensional example of the theory.",
    "Discussion": "definition of degrees of freedom for compact operators on normed spaces. Theorems of the theorems are presented in Section IV of the paper. We model a communication channel using n transmitting antennas and m receiving antennas. We show that the number of independent signals is equal to the degree of freedom of the operator."
  }
}