{
  "sections": {
    "Abstract": "b'{\"search-keyword: clean-text| displaying exact matches\":\"Symposium on Theoretical Aspects of Computer Science 2009 (Freiburg), pp. 673684\\\\nwww.stacs-conf.org\\\\n\\\\narXiv:0902.2072v1 [cs.LO] 12 Feb 2009\\\\n\\\\nSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n1\\\\n \\\\nLUTZ SCHRODER\\\\nAND DIRK PATTINSON 2\\\\n1\\\\n\\\\nDFKI Bremen and Department of Computer Science, Universit at Bremen\\\\nE-mail address: Lutz.Schroeder@dfki.de\\\\n\\\\n2\\\\n\\\\nDepartment of Computing, Imperial College London\\\\nE-mail address: dirk@doc.ic.ac.uk\\\\nA BSTRACT. Canonical models are of central importance in modal logic, in particular as they witness strong completeness and hence compactness. While the canonical model construction is well\\\\nunderstood for Kripke semantics, non-normal modal logics often present subtle difficulties  up to\\\\nthe point that canonical models may fail to exist, as is the case e.g. in most probabilistic logics. Here,\\\\nwe present a generic canonical model construction in the semantic framework of coalgebraic modal\\\\nlogic, which pinpoints coh",
    "Introduction": "erence conditions between syntax and semantics of modal logics that guarantee strong completeness. We apply this method to reconstruct canonical model theorems that are\\\\neither known or folklore, and moreover instantiate our method to obtain new strong completeness\\\\nresults. In particular, we prove strong completeness of graded modal logic with finite multiplicities,\\\\nand of the modal logic of exact probabilities.\\\\n\\\\nIn modal logic, completeness proofs come in two flavours: weak completeness, i.e. derivability of\\\\nall universally valid formulas, is often proved using finite model constructions, and strong completeness, which additionally allows for a possibly infinite set of assumptions. The latter entails\\\\nrecursive enumerability of the set of consequences of a recursively enumerable set of assumptions,\\\\nand is usually established using (infinite) canonical models. The appeal of the first method is that it\\\\ntypically entails decidability. The second method yields a stronger result and has some advantages\\\\nof its own. Firs",
    "Related Work": "t, it applies in some cases where finite models fail to exist, which often means that the\\\\nlogic at hand is undecidable. In such cases, a completeness proof via canonical models will at least\\\\nsalvage recursive enumerability. Second, it allows for schematic axiomatisations, e.g. pertaining to\\\\nthe infinite evolution of a system or to observational equivalence, i.e. statements to the effect that\\\\ncertain states cannot be distinguished by any formula.\\\\nIn the realm of Kripke semantics, canonical models exist for a large variety of logics and are\\\\nwell understood, see e.g. [2]. But there is more to modal logic than Kripke semantics, and indeed\\\\nthe natural semantic structures used to interpret a large class of modal logics go beyond pure relations. This includes e.g. the selection function semantics of conditional logics [4], the semantics\\\\n1998 ACM Subject Classification: F.4.1 [Mathematical Logic and Formal Languages]: Mathematical Logic  modal\\\\nlogic; I.2.4 [Artificial Intelligence]: Knowledge Representation Formalisms and ",
    "Methodology": "Methods  modal logic, representation\\\\nlanguages.\\\\nKey words and phrases: Logic in computer science, semantics, deduction, modal logic, coalgebra.\\\\nWork of the first author performed as part of the DFG project Generic Algorithms and Complexity Bounds in Coalgebraic Modal Logic (SCHR 1118/5-1). Work of the second author partially supported by EPSRC grant EP/F031173/1.\\\\n\\\\nc L. Schroder\\\\n \\\\n\\\\nand D. Pattinson\\\\nCC\\\\n\\\\nCreative Commons Attribution-NoDerivs License\\\\n\\\\n\\\\f674\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\nof probabilistic logics in terms of probability distributions, and the game frame semantics of coalition logic [16]. To date, there is very little research that provides systematic criteria, or at least\\\\na methodology, for establishing strong completeness for logics not amenable to Kripke semantics.\\\\nThis is made worse as the question of strong completeness crucially depends on the chosen semantic\\\\ndomain, which as illustrated above may differ widely. It is precisely this variety in semantics that\\\\nmakes it hard to employ the strong-completeness-via-canonicity approach, as in many cases there\\\\nis no readily available notion of canonical model. The present work improves on this situation by\\\\nproviding a widely applicable generic canonical model construction. More precisely, we establish\\\\nthe existence of quasi-canonical models, that is, models based on the set of maximally consistent\\\\nsets of formulas that satisfy the truth lemma, as there may be no unique, or canonical, such model in\\\\nour more general case. In order to cover the large span of semantic structures, we avoid a commitment to a particular class of models, and instead work within the framework of coalgebraic modal\\\\nlogic [15] which precisely provides us with a semantic umbrella for all of the examples above. This\\\\nis achieved by using coalgebras for an endofunctor T as the semantic domain for modal languages.\\\\nAs we illustrate in examples, the semantics of particular logics is then obtained by particular choices\\\\nof T . Coalgebraic modal logic serves in particular as a general semantic framework for non-normal\\\\nmodal logics. As such, it improves on neighbourhood semantics in that it retains the full semantic\\\\nstructure of the original models (neighbourhood semantics offers only very little actual semantic\\\\nstructure, and in fact may be regarded as constructed from syntactic material [18]).\\\\nIn this setting, our criterion can be formulated as a set of coherence conditions that relate\\\\nthe syntactic component of a logic to its coalgebraic semantics, together with a purely semantic\\\\ncondition stating that the endofunctor T that defines the semantics needs to preserve inverse limits\\\\nweakly, and thus allows for a passage from the finite to the infinite. We are initially concerned with\\\\nthe existence of quasi-canonical models relative to the class of all T -coalgebras, that is, whith logics\\\\nthat are axiomatisable by formulas of modal depth uniformly equal to one [17]. As in the classical\\\\ntheory, the corresponding result for logics with extra frame conditions requires that the logic is\\\\ncanonical, i.e. the frame that underlies a quasi-canonical model satisfies the frame conditions, which\\\\nholds in most cases, but for the time being needs to be established individually for each logic.\\\\nOur new criterion is then used to obtain both previously known and novel strong completeness\\\\nresults. In addition to positive results, we dissect a number of logics for which strong completeness\\\\nfails and show which assumption of our criterion is violated. In particular, this provides a handle\\\\non adjusting either the syntax or the semantics of the logic at hand to achieve strong completeness.\\\\nFor example, we demonstrate that the failure of strong completeness for probabilistic modal logic\\\\n(witnessed e.g. by the set of formulas assigning probability  1  1/n to an event for all n but excluding probability 1) disappears in the logic of exact probabilities. Moreover, we show that graded\\\\nmodal logic, and more generally any description logic [1] with qualified number restrictions, role\\\\nhierarchies, and reflexive, transitive, and symmetric roles, is strongly complete over the multigraph\\\\nmodel of [5], which admits infinite multiplicities. While strong completeness fails for the naive\\\\nrestriction of this model to multigraphs allowing only finite multiplicities, we show how to salvage\\\\nstrong completeness using additive (finite-)integer-valued measures. Finally, we prove strong completeness of several conditional logics w.r.t. conditional frames (also known as selection function\\\\nmodels); for at least one of these logics, strong completeness was previously unknown.\\\\n\\\\n1. Preliminaries and Notation\\\\nOur treatment of strong completeness is parametric in both the syntax and the semantics of a wide\\\\nrange of modal logics. On the syntactic side, we fix a modal similarity type  consisting of modal\\\\n\\\\n\\\\fSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n\\\\n675\\\\n\\\\noperators with associated arities. Given a similarity type  and a countable set P of atomic propositions, the set F() of -formulas is inductively defined by the grammar\\\\n()  ,  ::= p |  |  |    | L(1 , . . . , n )\\\\nwhere p  P and L   is n-ary; further boolean operators (, , , ) are defined as usual.\\\\nGiven any set X (e.g. of formulas, atomic propositions, or sets (!)), we write Prop(X) for the set\\\\nof propositional formulas over X and (X) = {L(x1 , . . . , xn ) | L   is n-ary, x1 , . . . , xn  X}\\\\nfor the set of formulas arising by applying exactly one operator to elements of X. We instantiate\\\\nour results to a variety of settings later with the following similarity types:\\\\nExamples 1.1. 1. The similarity type K of standard modal logic consists of a single unary\\\\noperator .\\\\n2. Conditional logic [4] is defined over the similarity type CL = {} where the binary operator\\\\n is read as a non-monotonic conditional (default, relevant etc.), usually written in infix notation.\\\\n3. Graded modal operators [8] appear in expressive description logics [1] in the guise of so-called\\\\nqualified number restrictions; although we discuss only modal aspects, we use mostly description\\\\nlogic notation and terminology below. The operators of graded modal logic (GML) are GML =\\\\n{( k) | k  N} with ( k) unary. We write  k.  instead of ( k). A formula  k.  is read as\\\\nat least k successor states satisfy , and we abreviate  =   1..\\\\n4. The similarity type PML of probabilistic modal logic (PML) [14] contains the unary modal\\\\noperators Lp for p  Q  [0, 1], read as with probability at least p, . . . .\\\\nWe split axiomatisations of modal logics into two parts: the first group of axioms is responsible for\\\\naxiomatising the logic w.r.t. the class of all (coalgebraic) models, whereas the second consists of\\\\nframe conditions that impose additional conditions on models. As the class of all coalgebraic models, introduced below, can always be axiomatised by formulas of rank 1, i.e. containing exactly one\\\\nlevel of modal operators [17] (and conversely, every collection of such axioms admits a complete\\\\ncoalgebraic semantics [18]), we restrict the axioms in the first group accordingly. More formally:\\\\nDefinition 1.2. A (modal) logic is a triple L = (, A, ) where  is a similarity type, A \\\\nProp((Prop(P ))) is a set of rank-1 axioms, and   () is a set of frame conditions. We\\\\nsay that L is a rank-1 logic if  = . If   (), we write L  if  can be derived from\\\\nA   with the help of propositional reasoning, uniform substitution, and the congruence rule: from\\\\n1  1 , . . . , n  n infer L(1 , . . . , n )  L(1 , . . . , n ) whenever L   is n-ary. For\\\\na set   () of assumptions, we write  L  if L 1      n   for (finitely many)\\\\n1 , . . . , n  . A set  is L-inconsistent if  L , and otherwise L-consistent.\\\\nExamples 1.3. 1. The modal logic K comes about as the rank-1 logic (K , AK , ) where Ak =\\\\n{, (p  q)  (p  q)}. The logics K4, S4, KB, . . . arise as (K , AK , ) where \\\\ncontains the additional axioms that define the respective logic [2], e.g.  = {p  p} in the\\\\ncase of K4.\\\\n2. For conditional logic, we take the similarity type CL together with rank-1 axioms r  ,\\\\nr  (p  q)  ((r  p)  (r  q)) stating that the binary conditional is normal in its second\\\\nargument. Typical additional rank-1 axioms are\\\\n(ID)\\\\n(DIS)\\\\n(CM)\\\\n\\\\naa\\\\n(a  c)  (b  c)  ((a  b)  c)\\\\n(a  c)  (a  b)  ((a  b)  c)\\\\n\\\\n(identity)\\\\n(disjunction)\\\\n(cautious monotony)\\\\n\\\\nwhich together form the so-called System C, a modal version of the well-known KLM\\\\n(Krauss/Lehmannn/Magidor) axioms of default reasoning due to Burgess [3].\\\\n\\\\n\\\\f676\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n3. The axiomatisation of GML given in [8] consists of the rank-1 axioms\\\\n(p  q)  (p  q)\\\\n k. p  W\\\\n l. p for l < k\\\\n k. p  i=0,...,k  i. (p  q)  (k  i). (p  q)\\\\n(p  q)  ( k. p   k. q)\\\\nFrame conditions of interest include e.g. reflexivity (p   1. p), symmetry (p    1. p), and\\\\ntransitivity ( 1.  n. p   n. p).\\\\nTo keep our results parametric also in the semantics of modal logic, we work in the framework of\\\\ncoalgebraic modal logic in order to achieve a uniform and coherent presentation. In this framework,\\\\nthe particular shape of models is encapsulated by an endofunctor T : Set  Set, the signature\\\\nfunctor (recall that such a functor maps every set X to a set T X, and every map f : X  Y to a\\\\nmap T f : T X  T Y in such a way that composition and identities are preserved), which may be\\\\nthought of as a parametrised data type. We fix the data , L, T etc. throughout the generic part of\\\\nthe development. The role of models in then played by T -coalgebras:\\\\nDefinition 1.4. A T -coalgebra is a pair C = (C, ) where C is a set (the state space of C) and\\\\n : C  T C is a function, the transition structure of C.\\\\nWe think of T C as a type of successors, polymorphic in C. The transition structure  associates\\\\na structured collection of successors (c) to each state x  C. The following choices of signature\\\\nfunctors give rise to the semantics of the modal logics discussed in Expl. 1.3.\\\\nExamples 1.5. 1. Coalgebras for the covariant powerset functor P defined on sets X by P(X) =\\\\n{A | A  X} and on maps f by P(f )(A) = f [A] are Kripke frames, as relations R  W  W\\\\non a set W of worlds are in bijection with functions of type W  P(W ). Restricting the powerset\\\\nfunctor to finite subsets, i.e. putting P (X) = {A  X | A finite}, one obtains the class of image\\\\nfinite Kripke frames as P -coalgebras.\\\\n2. The semantics of conditional logic is captured coalgebraically by the endofunctor S that maps\\\\na set X to the set (P(X)  P(X)) of selection functions over X (the action of S on functions\\\\nf : X  Y is given by S(f )(s)(B) = f [s(f 1 [B])]). The ensuing S-coalgebras are precisely the\\\\nconditional frames of [4].\\\\n3. The (infinite) multiset functor B maps a set X to the set B X of multisets over X, i.e.\\\\nfunctions of type X  N  {}. Accordingly, B -coalgebras are multigraphs (graphs with edges\\\\nannotated by multiplicities). Multigraphs provide an alternative semantics for GML which is in\\\\nmany respects more natural than the original Kripke semantics [5], as also confirmed by new results\\\\nbelow.\\\\n4. Finally, if supp() = {x  X | (x) 6= P\\\\n0} is the support of a function  : X  [0, 1]\\\\nand D(X) = { : X  [0, 1] | supp() finite, xX (x) = 1} is the set of finitely supported\\\\nprobability distributions on X, then D-coagebras are probabilistic transition systems, the semantic\\\\ndomain of PML.\\\\nThe link between coalgebras and modal languages is provided by predicate liftings [15], which are\\\\nused to interpret modal operators. Essentially, predicate liftings convert predicates on the state space\\\\nX into predicates on the set T X of structured collections of states:\\\\nDefinition 1.6. [15] An n-ary predicate lifting (n  N) for T is a family of maps X : PX n \\\\nPT X, where X ranges over all sets, satisfying the naturality condition\\\\nX (f 1 [A1 ], . . . , f 1 [An ]) = (T f )1 [Y (A1 , . . . , An )]\\\\n\\\\n\\\\fSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n\\\\n677\\\\n\\\\nfor all f : X  Y , A1 , . . . , An  PY . (For the categorically minded,  is a natural transformation\\\\nQn  Q  T op , where Q denotes contravariant powerset.) A structure for a similarity type  over\\\\nan endofunctor T is the assignment of an n-ary predicate lifting JLK to every n-ary modal operator\\\\nL  .\\\\nGiven a valuation V : P  P(C) of the propositional variables and a T -coalgebra (C, ), a\\\\nstructure for  allows us to define a satisfaction relation |=(C,,V ) between states of C and formulas\\\\n  () by stipulating that c |=(C,,V ) p iff c  V (p) and\\\\nc |=(C,,V ) L(1 , . . . , n ) iff (c)  JLKC (J1 K, . . . , Jn K),\\\\nwhere JK = {c  C | c |=(C,,V ) }. An L-model is now a model, i.e. a triple (C, , V ) as above,\\\\nsuch that c |=(C,,V )  for all all c  C and all substitution instances  of A  . An L-frame is\\\\na T -coalgebra (C, ) such that (C, , V ) is an L-model for all valuations V . The reader is invited\\\\nto check that the following predicate liftings induce the standard semantics for the modal languages\\\\nintroduced in Expl. 1.1.\\\\nExamples 1.7. 1. A structure for K over the covariant powerset functor P is given by\\\\nJKX (A) = {Y  P(X) | Y  A}. The frame classes defined by the frame conditions mentioned in Expl. 1.3.1 are well-known; e.g. a Kripke frame (X, R) is a K4-frame iff R is transitive.\\\\n2. Putting JKX (A, B) = {f  S(X) | f (A)  B} reconstructs the semantics of conditional\\\\nlogic in a coalgebraic setting.\\\\nP\\\\n3. A structure for GML over B is given by J( k)KX (A) = {f : X  N{} | xA f (x) \\\\nk}. The frame conditions mentioned in Expl. 1.3.3 correspond to conditions on multigraphs that\\\\ncan be read off directly from the logical axioms. E.g. a multigraph satisfies the transitivity axiom\\\\n 1.  n. p   n. p iff whenever x has non-zero transition multiplicity to y and y has transition\\\\nmultiplicity at least n to z, then x has transition multiplicity at least n to z.\\\\n4. The structure over D that\\\\nP captures PML coalgebraically is given by the the predicate lifting\\\\nJLp KX (A) = {  D(X) | xA (x)  p} for p  [0, 1]  Q.\\\\nFrom now on, fix a modal logic L = (, A, ) and a structure for  over a functor T . We say that\\\\nL is strongly complete for some class of models if every L-consistent set of formulas is satisfiable\\\\nin some state of some model in that class. Restricting to finite sets  defines the notion of weak\\\\ncompleteness; many coalgebraic modal logics are only weakly complete [17].\\\\nDefinition 1.8. Let X be a set. If   F() and  : P  P(X) is a valuation, we write  for\\\\nthe result of substituting  (p) for p in , with propositional subformulas evaluated according to the\\\\nboolean algebra structure of P(X). (Hence,  is a formula over the set P(X) of atoms.) A formula\\\\n  Prop((P(X)) is one-step L-derivable, denoted 1L , if  is propositonally entailed by the\\\\nset { |  : P  P(X),   A}. A set   Prop((P(X))) is one-step L-consistent if there do\\\\nnot exist formulas 1 , . . . , n   such that 1L (1      n ). Dually, the one-step semantics\\\\nJK1X  T X of a formula   Prop((P(X)) is defined inductively by JL(A1 , . . . , An )K1X =\\\\nJLK\\\\nT X (A1 ,1. . . , An ) for A1 , . . . , An  X. A set   Prop((P(X))) is one-step satisfiable if\\\\n JKX 6= . We say that L (or ) is separating if t  T X is uniquely determined by the set\\\\n{  (P(X)) | t  [[]]1X }. We call L (or A) one-step sound if every one-step derivable formula\\\\n  Prop((P(X))) is one-step valid, i.e. JK1X = X.\\\\nHenceforth, we assume that L is one-step sound, so that every T -coalgebra satisfies the rank-1\\\\naxioms; in the absence of frame conditions ( = ), this means in particular that every T -coalgebra\\\\n\\\\n\\\\f678\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\nis an L-frame. The above notions of one-step satisfiability and one-step consistency are the main\\\\nconcepts employed in the proof of strong completeness in the following section.\\\\nGiven a structure\\\\nT for  over T , every set B of rank-1 axioms over  defines a subfunctor TB of\\\\nB with TB (X) = {[[ ]]1X |   B,  : P  P(X)}  T X. This functor induces a structure for\\\\nwhich B is one-step sound.\\\\nExample 1.9. The additional rank-1 axioms of Expl. 1.3.2 induce subfunctors SB of the functor S\\\\nof Expl. 1.5.2. E.g. we have\\\\nS{ID } X = {f  S(X) | A  X. f (A)  A}\\\\nS{ID,DIS } X = {f  S(X) | A, B  X. f (A)  A  f (A  B)  f (A)  f (B)}\\\\nS{ID,DIS ,CM } X = {f  S(X) | A, B  X. f (A)  A  (f (B)  A  f (A)  B  f (B))}\\\\n(it is an amusing exercise to verify the last claim).\\\\n\\\\n2. Strong Completeness Via Quasi-Canonical Models\\\\nWe wish to establish strong completeness of L by defining a suitable T -coalgebra structure  on\\\\nthe set S of maximally L-consistent subsets of F(), equipped with the standard valuation V (p) =\\\\n{  S | p  }. The crucial property required is that  be coherent, i.e.\\\\n()  [[L]](1 , . . . , n )  L(1 , . . . , n )  ,\\\\nwhere  = {  S |   }, for L   n-ary,   S, and 1 , . . . , n  F(), as this allows\\\\nproving, by a simple induction over the structure of formulas,\\\\nLemma 2.1 (Truth lemma). If  is coherent, then for all formulas ,  |=(S,,V )  iff   .\\\\nWe define a quasi-canonical model to be a model (S, , V ) with  coherent; the term quasi-canonical\\\\nserves to emphasise that the coherence condition does not determine the transition structure \\\\nuniquely. By the truth lemma, quasi-canonical models for L are L-models, i.e. satisfy all substitution instances of the frame conditions. The first question is now under which circumstances\\\\nquasi-canonical models exist; we proceed to establish a widely applicable criterion. This criterion\\\\nhas two main aspects: a local form of strong completeness involving only finite sets, and a preservation condition on the functor enabling passage from finite sets to certain infinite sets. We begin\\\\nwith the latter part:\\\\nDefinition 2.2. A surjective -cochain (of finite sets) is a sequence (Xn )nN of (finite) sets\\\\nequipped with surjective functions pn : Xn+1  Xn called projections. The inverse limit lim Xn\\\\nQ\\\\n\\\\nof (Xn ) is the set {(xi )  iN Xi | n. pn (xn+1 ) = xn } of coherent families (xi ). The limit\\\\nprojections are the maps i ((xn )nN ) = xi , i  N; note that the i are surjective, i.e. every x  Xi\\\\ncan be extended to a coherent family. Since all set functors preserve surjections, (T Xn ) is a surjective -cochain with projections T pn . The functor T weakly preserves inverse limits of surjective\\\\n-cochains of finite sets if for every surjective -cochain (Xn ) of finite\\\\nQ sets, the canonical map\\\\nT (lim Xn )  lim T Xn is surjective, i.e. every coherent family (tn ) in T Xn is induced by a (not\\\\n\\\\n\\\\nnecessarily unique) t  T (lim Xn ) in the sense that T n (t) = tn for all n.\\\\n\\\\nExample 2.3. Let A be a finite alphabet; then the sets An , n  N, form a surjective -cochain of\\\\nfinite sets with projections pn : An+1  An , (a1 , . . . , an+1 ) 7 (a1 , . . . , an ). The inverse limit\\\\nlim An is the set A of infinite sequences over A. The covariant powerset functor P preserves this\\\\n\\\\ninverse limit weakly: given a coherent family of subsets Bn  An , i.e. pn [Bn+1 ] = Bn for all n,\\\\n\\\\n\\\\fSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n\\\\n679\\\\n\\\\nwe define the set B  A as the set of all infinite sequences (an )n1 such that (a1 , . . . , an )  Bn\\\\nfor all n; it is easy to check that indeed B induces the Bn , i.e. n [B] = Bn . However, B is by no\\\\nmeans uniquely determined by this property: Observe that B as just defined is a safety property. The\\\\nintersection of B with any ",
    "Experiment": "liveness property C, e.g. the set C of all infinite sequences containing\\\\ninfinitely many occurrences of a fixed letter in A, will also satisfy n [B  C] = Bn for all n.\\\\nThe second part of our criterion is an infinitary version of a local completeness property called\\\\none-step completeness, which has been used previously in weak completeness proofs [15, 17].\\\\nDefinition 2.4. We say that L is strongly one-step complete over finite sets if for finite X, every\\\\none-step consistent subset  of Prop((P(X))) is one-step satisfiable.\\\\nThe difference with plain one-step completeness is that  above may be infinite. Consequently,\\\\nstrong and plain one-step completeness coincide in case the modal similarity type  is finite, since\\\\nin this case, Prop((P(X))) is, for finite X, finite up to propositional equivalence. The announced\\\\nstrong completeness criterion is now the following.\\\\nTheorem 2.5. If L is strongly one-step complete over finite sets and separating,  is countable,\\\\nand T weakly preserves inverse limits of surjective -cochains of finite sets, then L has a quasicanonical model.\\\\nProof sketch. The most natural argument is via the dual adjunction between sets and boolean algebras that associates to a set the boolean algebra of its subsets, and to a boolean algebra the set of its\\\\nultrafilters. For economy of presentation, we outline a direct proof instead: we prove that\\\\n() every maximally one-step consistent   Prop((A)) is one-step satisfiable,\\\\nwhere A = { |   F()}  P(S).\\\\nThe existence of the required coherent coalgebra structure  on S follows immediately, since the\\\\ncoherence requirement for (),   S, amounts to one-step satisfaction of a maximally one-step\\\\nconsistent subset of Prop((A)).\\\\nTo prove (), let  = {Ln | n  N}, let P = {pn | n  N}, let Fn denote the set of -formulas\\\\nof modal nesting depth at most n that employ only modal operators from n = {L0 , . . . , Ln } and\\\\nonly the atomic propositions p0 , . . . , pn , and let Sn be the set of maximally consistent subsets of Fn .\\\\nThen S is (isomorphic to) the inverse limit lim Sn , where the projections Sn+1  Sn and the limit\\\\n\\\\nprojections S  Sn are just intersection with Fn . As the sets Sn are finite, we obtain by strong onestep completeness tn  T Sn such that tn |=1Sn   Prop((An )), where An = {  Sn |   Fn }.\\\\nBy separation, (tn )nN is coherent, and hence is induced by some t  T S by weak preservation of\\\\ninverse limits; then, t |=1S .\\\\nTogether with the Lindenbaum Lemma we obtain strong completeness as a corollary.\\\\nCorollary 2.6. Under the conditions of Thm. 2.5, L is strongly complete for L-models.\\\\nBoth Thm. 2.5 and Cor. 2.6 do apply to the case that L has frame conditions. When L is of rank 1\\\\n(i.e.  = ), Cor. 2.6 implies that L is strongly complete for (models based on) L-frames. In\\\\nthe presence of frame conditions, the underlying frame of an L-model need not be an L-frame, so\\\\nthat the question arises whether L is also strongly complete for L-frames. In applications, positive\\\\nanswers to this question, usually referred to as the canonicity problem, typically rely on a judicious\\\\nchoice of quasi-canonical model to ensure that the latter is an L-frame, often the largest quasicanonical model under some ordering on T S. Detailed examples are given in Sec. 3.\\\\nRemark 2.7. It is shown in [13] that T admits a strongly complete modal logic if T weakly preserves (arbitrary) inverse limits and preserves finite sets. The essential contribution of the above\\\\n\\\\n\\\\f680\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\nresult is to remove the latter restriction, which fails in important examples. Moreover, the observation that we need only consider surjective -cochains is relevant in some applications, see below.\\\\nRemark 2.8. A last point that needs clearing up is whether strong completeness of coalgebraic\\\\nmodal logics can be established by some more general method than quasi-canonical models of the\\\\nquite specific shape used here. The answer is negative, at least in the case of rank-1 logics L: it has\\\\nbeen shown in [12] that every such L admits models which consist of the maximally satisfiable sets\\\\nof formulas and obey the truth lemma. Under strong completeness, such models are quasi-canonical.\\\\nThis seems to contradict the fact that some canonical model constructions in the literature,\\\\nnotably the canonical Kripke models for graded modal logics [8, 6], employ state spaces which\\\\nhave multiple copies of maximally consistent sets. The above argument indicates that such logics\\\\nfail to be coalgebraic, and indeed this is the case for GML with Kripke semantics. As mentioned\\\\nabove, GML has an alternative coalgebraic semantics over multigraphs, and we show below that\\\\nthis semantics does admit quasi-canonical models in our sense.\\\\n\\\\n3. Examples\\\\nWe now show how the generic results of the previous section can be applied to obtain canonical\\\\nmodels and associated strong completeness and compactness theorems for a large variety of structurally different modal logics. We have included some negative examples where canonical models\\\\nnecessarily fail to exist due to non-compactness, and we analyse which conditions of Thm. 2.5 fail\\\\nin each case. We emphasise that in the positive examples, the verification of said conditions is\\\\nentirely stereotypical. Weak preservation of inverse limits of surjective -cochains usually holds\\\\nwithout the finiteness assumption, which is therefore typically omitted.\\\\nExample 3.1 (Strong completeness of Kripke semantics for K). Recall from Expl. 1.5.1 that Kripke\\\\nframes are coalgebras for the powerset functor T X = P(X). Strong completeness of K with\\\\nrespect to Kripke semantics is, of course, well known. We briefly illustrate how this can be derived\\\\nfrom our coalgebraic treatment. To see that K is strongly one-step complete over finite sets X,\\\\nlet   Prop(K (P(X))) be maximally one-step consistent. It is easy to check that {x  X |\\\\n{x}  } satisfies . To prove that the powerset functor weakly preserves inverse limits, let (Xn )\\\\nbe an -cochain, and let (An  P(Xn )) be a coherent family. Then (An ) is itself a cochain, and the\\\\nset A = lim An  lim Xn induces (An ) (w.r.t. the subset ordering on P(X)). Separation is clear.\\\\n\\\\n\\\\nBy Thm. 2.5, there exists a quasi-canonical Kripke model for all normal modal logics. In particular,\\\\nthe standard canonical model [4] is quasi-canonical; it witnesses strong completeness (w.r.t. frames)\\\\nof all canonical logics such as K4, S4, S5.\\\\nExample 3.2 (Failure of strong completeness of K over finitely branching models). As seen in\\\\nExpl. 1.5.1, finitely branching Kripke frames are coalgebras for the finite powerset functor P .\\\\nIt is clear that quasi-canonical models fail to exist in this case, as compactness fails over finitely\\\\nbranching frames: one can easily construct formulas n that force a state to have at least n different\\\\nsuccessors. The obstacle to the application of Thm. 2.5 is that the finite powerset functor fails to\\\\npreserve inverse limits weakly, as the inverse limit of an -cochain of finite sets may fail to be finite.\\\\nExample 3.3 (Conditional logic). Recall from Expl. 1.5.2 that the conditional logic CK is interpreted over the functor S(X) = P(X)  P(X). To prove strong one-step completeness over finite\\\\nsets X, let \\\\nT Prop(CL (P(X))) be maximally one-step consistent. Define f : P(X)  P(X)\\\\nby f (A) = {B  X | A  B  }; it is mechanical to check that f |=1 . To see that S weakly\\\\npreserves inverse limits, let (Xn ) be a surjective -cochain, let X = lim Xn , and let (fn  S(Xn ))\\\\n\\\\n\\\\n\\\\fSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n\\\\n681\\\\n\\\\nbe coherent. Define f : P(X)  P(X) by letting (xn )  f (A) for a coherent family (xn )  X\\\\niff whenever A = n1 [B] for some n and some B  Xn , then xn  fn (B). Using surjectivity\\\\nof the projections of (Xn ), it is straightforward to prove that f induces (fn ). Finally, separation\\\\nis clear. By Thm. 2.5, it follows that the conditional logic CK has a quasi-canonical model, and\\\\nhence that CK is strongly complete for conditional frames. In the case of the additional rank-1\\\\naxioms mentioned in Expl. 1.3.2 and the corresponding subfunctors of S described in Expl. 1.9, the\\\\nsituation is as follows.\\\\nIdentity: The functor S{ID } weakly preserves inverse limits of surjective -cochains. In the\\\\nnotation above, put (xn )  f (A) iff the condition above holds and (xn )  A.\\\\nIdentity and disjunction: The functor S{ID ,DIS } weakly preserves inverse limits of surjective\\\\n1 B  A, then x  f (B).\\\\n-cochains: put (xn )  f (A) iff (xn )  A and whenever (xn )  m\\\\nm\\\\nm\\\\nSystem C: It is open whether the the functor S{ID ,DIS ,CM } weakly preserves inverse limits of\\\\nsurjective -cochains, and whether System C is strongly complete over conditional frames.\\\\nIndeed it appears to be an open problem to find any semantics for which System C is strongly\\\\ncomplete, other than the generalised neighbourhood semantics as described e.g. in [18], which is\\\\nstrongly complete for very general reasons but provides little in the way of actual semantic information. The classical preference semantics according to Lewis is only known to be weakly complete [3]. Friedman and Halpern [9] do silently prove strong completeness of System C w.r.t. plausibility measures; however, on close inspection the latter turn out to be essentially equivalent to the\\\\nabove-mentioned generalised neighbourhood semantics. Moreover, Segerberg [19] proves strong\\\\ncompleteness for a whole range of conditional logics over general conditional frames, where, in\\\\nanalogy to corresponding terminology for Kripke frames, a general conditional frame is equipped\\\\nwith a distinguished set of admissible propositions limiting both the range of valuations and the\\\\ndomain of selection functions. In contrast, our method yields full conditional frames in which the\\\\nframe conditions hold for any valuation of the propositional variables. While in the case of CK and\\\\nits extension by ID alone, these models differ from Segerbergs only in that they insert default values for the selection function on non-admissible propositions, the canonical model for the extension\\\\nof CK by {ID , DIS } has non-trivial structure on non-admissible propositions, and we believe that\\\\nour strong completeness result for this logic is genuinely new.\\\\nExample 3.4 (Strong completeness of GML over multigraphs). Recall from Expl. 1.5.3 that graded\\\\nmodal logic (GML) has a coalgebraic semantics in terms of the multiset functor B . To prove\\\\nstrong one-step completeness over finite sets X, let   Prop(GM L (P(X))) be maximally onestep consistent. We define B  B (X) by B(A)  n   n. A  ; it is easy to check that B\\\\nis well-defined and additive. To prove weak preservation of inverse limits, let (Xn ) be an -cochain,\\\\nlet X = lim Xn , and let (Bn  B (Xn )) be coherent. Then define B  B (X) pointwise by\\\\n\\\\nB((xn )) = min Bn (xn ),\\\\nnN\\\\n\\\\nnoting that the sequence (Bn (xn )) is decreasing by coherence. A straightforward computation\\\\nshows that B induces (Bn ). Separation is clear.\\\\nBy the above and Thm. 2.5, all extensions of GML have quasi-canonical multigraph models.\\\\nWhile the technical core of the construction is implicit in the work of Fine [8] and de Caro [6],\\\\nthese authors were yet unaware of multigraph semantics, and hence our result that GML is strongly\\\\ncomplete over multigraphs has not been obtained previously.\\\\nThe standard frame conditions for reflexivity, symmetry, and transitivity (Expls. 1.5.3\\\\nand 1.7. 3) and arbitrary combinations thereof are easily seen to be satisfied in the quasi-canonical\\\\nmodel constructed above. We point out that this contrasts with Kripke semantics in the case of the\\\\n\\\\n\\\\f \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n682\\\\n\\\\ngraded version of S4, i.e. GML extended with the reflexivity and transitivity axioms of Expl. 1.5.3:\\\\nas shown in [7], the complete axiomatisation of graded modal logic over transitive reflexive Kripke\\\\nframes includes two rather strange combinatorial artefacts, which by the above disappear in the\\\\nmultigraph semantics. The reason for the divergence (which we regard as an argument in favour of\\\\nmultigraph semantics) is that, while in many cases multigraph models are easily transformed into\\\\nequivalent Kripke models by just making copies of states, no such translation exists in the transitive\\\\nreflexive case (transitivity alone is unproblematic).\\\\nObserve moreover that the above extends straightforwardly to decription logics ALCQ(R)\\\\nwith qualified number restrictions and a role hierarchy R where roles may be distinguished as, in any\\\\ncombination, transitive, reflexive, or symmetric. As shown in [10, 11], ALCQ(R) is undecidable\\\\nfor many R, even when only transitive roles are considered. For undecidable logics, completeness\\\\nis in some sense the next best thing, as it guarantees if not recursiveness then at least recursive\\\\nenumerability of all valid formulas, and hence enables automatic reasoning. Essentially, our results\\\\nshow that the natural axiomatisation of ALCQ(R) with transitive, symmetric and reflexive roles is\\\\nstrongly complete over multigraphs, a result which fails for the standard Kripke semantics.\\\\nExample 3.5 (Failure of strong completeness of image-finite GML). Similarly to the case of imagefinite Kripke frames, one can model an image-finite version of graded modal logic coalgebraically\\\\nby exchanging the functor B for the finite multiset functor B, where B(X) consists of all maps\\\\nX  N with finite support. Of course, the resulting logic is non-compact and hence fails to admit\\\\na canonical model. This is witnessed not only by the same family of formulas as in the case of\\\\nimage-finite Kripke semantics, which targets finiteness of the number of different successors, but\\\\nalso by the set of formulas { n. a | n  N}, which targets finiteness of multiplicities. Analysing\\\\nthe conditions of Thm. 2.5, we detect two violations: not only does weak preservation of inverse\\\\nlimits fail, but there is also no way to find an axiomatisation which is strongly one-step complete\\\\nover finite sets (again, consider sets { n. {x} | n  N}).\\\\nStrong completeness of image-finite GML can be recovered by slight adjustments to the syntax and\\\\nsemantics. We formulate a more general approach, as follows.\\\\nExample 3.6 (Strong completeness of the logic of additive measures). We fix an at most countable\\\\ncommutative monoid M (e.g. M = N). We think of the elements of M as describing the measure\\\\nof a set of elements. To ensure compactness, we have to allow some sets to have undefined measure.\\\\nThat is, we work with coalgebras for the endofunctor TM defined by\\\\nTM (X) = {(A, ) | A  P(X) closed under disjoint unions,  : A  M additive}\\\\nThe modal logic of additive M -valued measures is given by the similarity type M = {Em | m \\\\nM } where Em  expresses that  has measure m, i.e.\\\\n[[Em ]]X B = {(A, )  TM (X) | B  A, (B) = m}.\\\\nM is clearly separating. The logic is axiomatised by the following two axioms:\\\\nEm a  En a\\\\n\\\\n(n 6= m) and\\\\n\\\\nEm (a  b)  En (a  b)  Em+n a.\\\\n\\\\nThese axioms are strongly one-step complete over finite sets X: if   Prop(M (P(X))) is\\\\nmaximally one-step consistent, then (A, ) |=1  where A  A iff Em A   for some necessarily\\\\nunique m, in which case (A) = m. Moreover, TM weakly preserves inverse limits X = lim Xn ,\\\\n\\\\nwith finite Xn : a coherent family ((An , n )  TM (Xn )) is induced by (A, )  TM (X), where\\\\nA = {n1 [B] | n  N, B  An } and (n1 [B]) = n (B) is easily seen to be well-defined and\\\\nadditive. Theorem 2.5 now guarantees existence of quasi-canonical models. A simple example is\\\\nM = Z/2Z, which induces a logic of even and odd.\\\\n\\\\n\\\\fSTRONG COMPLETENESS OF COALGEBRAIC MODAL LOGICS\\\\n\\\\n683\\\\n\\\\nFor the case M =WN, we obtain a variant of graded modal logic with finite multiplicities, where\\\\nwe code  k. as  0i<k Ek . However, it may still be the case that a state has a family of\\\\nsuccessor sets of unbounded measure, so that undefinedness of the measure of the entire state space\\\\njust hides an occurrence of infinity. This defect is repaired by insisting that the measure of the whole\\\\nstate space is finite at the expense of disallowing the modal operator E0 in the language, as follows.\\\\nExample 3.7 (Strong completeness of finitely branching GML ). To force the entire state space to\\\\nhave finite measure, we additionally introduce a measurability operator E, interpreted by [[E]]B =\\\\n{(A, ) | B  A}, and impose obvious axioms guaranteeing that measures on X are defined on\\\\nboolean subalgebras of P(X), in particular E (i.e. (X) is finite), and En a  Ea. In order to\\\\nachieve compactness, we now leave a bolt hole on the syntactical side and exclude the operator E0 .\\\\nIn other words, the syntax of GML is given by the similarity type \\\\nGML = {E}  {En | n > 0},\\\\n\\\\nand we interpret GML over coalgebras for the functor BM defined by\\\\nBM (X) = {(A, ) | A boolean subalgebra of P(X),  : A  N additive}.\\\\nSeparation is clear. The axiomatisation of GML is given by the axiomatisation of the modal logic\\\\nof additive measures, the above-mentioned axioms on E, and the additional axiom\\\\nW\\\\nEn a  Eb  En (a  b)  En (a  b)  0<k<n (Ek (a  b)  Enk (a  b))\\\\nwhich compensates for the absence of E0 . Strong one-step completeness over finite sets and weak\\\\npreservation of inverse limits is shown analogously as in Expl. 3.6, so that we obtain a strongly\\\\ncomplete finitely branchingWgraded modal logic GML . The tradeoff is that the operator  k. is\\\\nno longer expressible as  0i<k Ei  in GML which only allows to formulate the implication\\\\n 1.   n. .\\\\nExample 3.8 (Failure of strong completeness for PML over finitely supported probability distributions). Like image-finite graded modal logic, probabilistic modal logic as introduced in Expl. 1.5.4\\\\nfails to be compact, and violates the conditions of Thm. 2.5 on two counts, namely weak preservation of inverse limits and strong one-step completeness over finite sets. The first issue is related\\\\nto image-finiteness, while the second is rooted in the structure of the real numbers: e.g. the set\\\\n{L1/21/n a | n  N}  {L1/2 a} is finitely satisfiable but not satisfiable.\\\\nExample 3.9 (Strong completeness of the logic of exact probabilities). In order to remove the\\\\nabove-mentioned failure of compactness, we consider the fragment of probabilistic modal logic\\\\ncontaining only operators Ep stating that a given event has probability exactly p. (This is, of course,\\\\nless expressive than the operators Lp but still allows reasonable statements such as that rolling a six\\\\non a die happens with probability 1/6.) Moreover, we require probabilities to be rational and allow\\\\nprobabilities to be undefined, thus following the additive measures approach as outlined above,\\\\nwhere we consider a subfunctor of TQ defined by the requirement that the whole set has measure 1.\\\\nHowever, we are able to impose stronger conditions on the domain A  P(X) of a probability\\\\nmeasure P on X: we require that X  A and that A, B  A, B  A imply A  B  F A, which is\\\\nreflected in the additional axioms E1  and Ep a  Eq (a  b)  Epq (a  b). It is natural that we\\\\ncannot force closure under intersection, as there is in general no way to infer the exact probability\\\\nof A  B from the probabilities of A and B. Along the same lines as above, we now obtain quasicanonical models, and hence strong completeness and compactness, of the arising modal logic of\\\\nexact probabilities.\\\\n\\\\n\\\\f684\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n4. ",
    "Discussion": "Conclusion\\\\nWe have laid out a systematic method of proving existence of canonical models in a generic semantic framework encompassing a wide range of structurally different modal logics. We have shown\\\\nhow this method turns the construction of canonical models into an entirely mechanical exercise\\\\nwhere applicable, and points the way to obtaining compact fragments of non-compact logics. As\\\\nexample applications, we have reproved a number of known strong completeness result and established several new results of this kind; specifically, the latter includes strong completeness of the\\\\nfollowing logics.\\\\n The modal logic of exact probabilities, with operators Ep with probability exactly p.\\\\n Graded modal logic over transitive reflexive multigraphs, i.e. the natural graded version of\\\\nS4, and more generally description logic with role hierarchies including transitive, reflexive, and\\\\nsymmetric roles and qualified number restrictions also on non-simple (e.g. transitive) roles.\\\\n The conditional logic CK + {ID, DIS }, i.e. with the standard axioms of identity and disjunction, interpreted over conditional frames.\\\\nA number of interesting open problems remain, e.g. to find further strongly complete variants of\\\\nprobabilistic modal logic or to establish strong completeness of the full set of standard axioms of\\\\ndefault logic, Burgess System C [3], over the corresponding class of conditional frames.\\\\n\\\\nReferences\\\\n[1] F. Baader, D. Calvanese, D. L. McGuinness, D. Nardi, and P. F. Patel-Schneider, eds. The Description Logic Handbook. Cambridge University Press, 2003.\\\\n[2] P. Blackburn, M. de Rijke, and Y. Venema. Modal Logic. Cambridge University Press, 2001.\\\\n[3] J. Burgess. Quick completeness proofs for some logics of conditionals. Notre Dame J. Formal Logic, 22:7684,\\\\n1981.\\\\n[4] B. Chellas. Modal Logic. Cambridge University Press, 1980.\\\\n[5] G. DAgostino and A. Visser. Finality regained: A coalgebraic study of Scott-sets and multisets. Arch. Math. Logic,\\\\n41:267298, 2002.\\\\n[6] F. De Caro. Graded modalities II. Stud. Log., 47:110, 1988.\\\\n[7] M. Fattorosi-Barnaba and C. Cerrato. Graded modalities III. Stud. Log., 47:99110, 1988.\\\\n[8] K. Fine. In so many possible worlds. Notre Dame J. Formal Logic, 13:516520, 1972.\\\\n[9] N. Friedman and J. Y. Halpern. Plausibility measures and default reasoning. J. ACM, 48(4):648685, 2001.\\\\n[10] I. Horrocks, U. Sattler, and S. Tobies. Practical reasoning for expressive description logics. In Logic for Programming and Automated Reasoning, LPAR 99, vol. 1705 of LNCS, pp. 161180. Springer, 1999.\\\\n[11] Y. Kazakov, U. Sattler, and E. Zolin. How many legs do I have? Non-simple roles in number restrictions revisited.\\\\nIn Logic for Programming, Artificial Intelligence, and Reasoning, LPAR 2007, vol. 4790 of LNCS, pp. 303317.\\\\nSpringer, 2007.\\\\n[12] A. Kurz and D. Pattinson. Coalgebraic modal logic of finite rank. Math. Struct. Comput. Sci., 15:453473, 2005.\\\\n[13] A. Kurz and J. Rosick y. Strongly complete logics for coalgebras. Draft, July 2006.\\\\n[14] K. Larsen and A. Skou. Bisimulation through probabilistic testing. Inform. Comput., 94:128, 1991.\\\\n[15] D. Pattinson. Coalgebraic modal logic: Soundness, completeness and decidability of local consequence. Theoret.\\\\nComput. Sci., 309:177193, 2003.\\\\n[16] M. Pauly. A modal logic for coalitional power in games. J. Logic Comput., 12:149166, 2002.\\\\n[17] L. Schr oder. A finite model construction for coalgebraic modal logic. J. Log. Algebr. Prog., 73:97110, 2007.\\\\n[18] L. Schr oder and D. Pattinson. Rank-1 modal logics are coalgebraic. In Theoretical Aspects of Computer Science,\\\\nSTACS 07, vol. 4393 of LNCS, pp. 573585. Springer, 2007. Full version to appear in J. Log. Comput.\\\\n[19] K. Segerberg. Notes on conditional logic. Stud. Log., 48:157168, 1989.\\\\n\\\\nThis work is licensed under the Creative Commons Attribution-NoDerivs License. To view a\\\\ncopy of this license, visit http://creativecommons.org/licenses/by-nd/3.0/.\\\\n\\\\n\\\\f\"}\\n'"
  },
  "key_words": {
    "Abstract": [
      [
        "modal logics present",
        0.5718
      ],
      [
        "coalgebraic modal logics",
        0.562
      ],
      [
        "modal logic particular",
        0.5469
      ],
      [
        "modal logics",
        0.5407
      ],
      [
        "normal modal logics",
        0.5118
      ]
    ],
    "Introduction": [
      [
        "modal logic completeness",
        0.7192
      ],
      [
        "modal logics guarantee",
        0.6578
      ],
      [
        "logic completeness",
        0.6529
      ],
      [
        "semantics modal logics",
        0.6109
      ],
      [
        "entails decidability second",
        0.603
      ]
    ],
    "Related Work": [
      [
        "logic kripke semantics",
        0.6341
      ],
      [
        "kripke semantics canonical",
        0.6053
      ],
      [
        "kripke semantics",
        0.5776
      ],
      [
        "logics semantics",
        0.5732
      ],
      [
        "semantics canonical",
        0.5712
      ]
    ],
    "Methodology": [
      [
        "semantics modal logics",
        0.6428
      ],
      [
        "modal logics discussed",
        0.6393
      ],
      [
        "ncoalgebraic modal logic",
        0.6364
      ],
      [
        "modal logic consists",
        0.6228
      ],
      [
        "axiomatisations modal logics",
        0.6206
      ]
    ],
    "Experiment": [
      [
        "strong completeness logic",
        0.6197
      ],
      [
        "strong completeness plausibility",
        0.5942
      ],
      [
        "completeness criterion following",
        0.5915
      ],
      [
        "completeness logic",
        0.5896
      ],
      [
        "completeness plausibility",
        0.5851
      ]
    ],
    "Discussion": [
      [
        "graded modal logic",
        0.665
      ],
      [
        "nprobabilistic modal logic",
        0.6628
      ],
      [
        "modal logic cambridge",
        0.6535
      ],
      [
        "modal logics",
        0.647
      ],
      [
        "logics modal logic",
        0.643
      ]
    ]
  },
  "summarization": {
    "Abstract": "canonical models are of central importance in modal logic. This paper presents a generic canonical model construction in the semantic framework of coalgebraic modal logics. The study shows strong completeness and compactness of the model construction.   The paper was presented at the.Symposium on Theoretical Aspects of Computer Science.",
    "Introduction": "conditions between syntax and semantics of modal logics that guarantee strong completeness. We prove strong comple completeness of graded modal logic with finite multiplicities. We reconstruct canonical model theorems that are neither known or folklore. We also instantiate our method to prove new strong compleutations.",
    "Related Work": "t, it applies in some cases where finite models fail to exist. canonical models exist for a large variety of logics, but there is more to modal logic than Kripke semantics. It allows for schematic axiomatisations, e.g. the infinite evolution of a system.",
    "Methodology": "new criteria for strong completeness for non-normal logics. We establish a generic canonical model construction. We use coalgebraic modal logic as a semantic framework. We show that the semantics of certain logics can be derived from coalgebra. We also show that a model is complete over the multigraphs of a multigraph.",
    "Experiment": "liveness property C is an infinitary version of a local completeness property. We show that L is strongly one-step complete over finite sets. L has a quasicanonical model if and only if it is countable. We prove the strong completeness criterion using the Lindenbaum Lemma.",
    "Discussion": "we have laid out a systematic method of proving existence of canonical models in a generic semantic framework. We show how the method can be used to construct compact fragments of non-compact logics. We also show strong completeness of the modal logic of exact probabilities."
  }
}