{
  "sections": {
    "Abstract": "b'{\"search-keyword: clean-text| displaying exact matches\":\"1\\\\n\\\\nDesign Guidelines for Training-based MIMO\\\\nSystems with Feedback\\\\nXiangyun Zhou, Parastoo Sadeghi, Tharaka A. Lamahewa and Salman Durrani\\\\n\\\\narXiv:0903.0443v1 [cs.IT] 3 Mar 2009\\\\n\\\\nAbstract\\\\nIn this paper, we study the optimal training and data transmission strategies for block fading\\\\nmultiple-input multiple-output (MIMO) systems with feedback. We consider both the channel gain\\\\nfeedback (CGF) system and the channel covariance feedback (CCF) system. Using an accurate\\\\ncapacity lower bound as a figure of merit, we investigate the optimization problems on the temporal\\\\npower allocation to training and data transmission as well as the training length. For CGF systems\\\\nwithout feedback delay, we prove that the optimal solutions coincide with those for non-feedback\\\\nsystems. Moreover, we show that these solutions stay nearly optimal even in the presence of feedback\\\\ndelay. This finding is important for practical MIMO training design. For",
    "Introduction": " CCF systems, the optimal\\\\ntraining length can be less than the number of transmit antennas, which is verified through numerical\\\\nanalysis. Taking this fact into account, we propose a simple yet near optimal transmission strategy\\\\nfor CCF systems, and derive the optimal temporal power allocation over pilot and data transmission.\\\\n\\\\nIndex Terms\\\\nInformation capacity, multiple-input multiple-output, channel estimation, channel gain feedback,\\\\nchannel covariance feedback.\\\\n\\\\nThis paper was presented in part at the 2008 IEEE International Conference on Communication Systems, Guangzhou,\\\\nChina, Nov. 2008.\\\\nThis work was supported under Australian Research Councils Discovery Projects funding scheme (project no.\\\\nDP0773898).\\\\nAuthors are with the College of Engineering and Computer Science, the Australian National University, Canberra, ACT\\\\n0200, Australia. Emails: {xiangyun.zhou, parastoo.sadeghi, tharaka.lamahewa, salman.durrani}@anu.edu.au\\\\n\\\\nNovember 2, 2018\\\\n\\\\nDRAFT\\\\n\\\\n\\\\fI. I NTRODUCTION\\\\nA. ",
    "Related Work": "Background and Motivation\\\\nThe study of multiple-input multiple-output (MIMO) communication systems can be broadly categorized based on the availability and accuracy of channel state information (CSI) at the receiver or the\\\\ntransmitter sides. Under the perfect CSI assumption at the receiver, the MIMO channel information\\\\ncapacity and data transmission strategies often have elegantly simple forms and many classical results\\\\nexist in the literature [1, 2]. From [28] we know that the MIMO information capacity with perfect\\\\nreceiver CSI can be further increased if some form of CSI is fed back to the transmitter. The transmitter\\\\nCSI can be in the form of causal channel gain feedback (CGF) or channel covariance feedback (CCF).\\\\nIn practical communication systems with coherent detection, however, the state of the MIMO\\\\nchannel needs to be estimated at the receiver and hence, the receiver CSI is never perfect due to\\\\nnoise and time variations in the fading channel. Taking the channel estimation error into account, a\\\\nwidely-used capacity lower bound was formulated in [9, 10] for independent and identically distributed\\\\n(i.i.d.) MIMO channels, and the optimal data transmission for CGF systems was studied in [10].\\\\nPilot-symbol-assisted modulation (PSAM) has been used in many practical communication systems,\\\\ne.g., in Global System for Mobile Communications (GSM) [11]. In PSAM schemes, pilot (or training)\\\\nsymbols are inserted into data blocks periodically to facilitate channel estimation at the receiver [12].\\\\nIt is noted that pilot symbols are not information-bearing signals. Therefore, an important design\\\\naspect of communication systems is the optimal allocation of resources (such as power and time) to\\\\npilot symbols that results in the best tradeoff between the quality of channel estimation and rate of\\\\ninformation transfer. Three pilot parameters under a system designers control are: 1) spatial structure\\\\nof pilot symbols, 2) temporal power allocation to pilot and data, and 3) the number of pilot symbols\\\\nor simply training length.\\\\nThe optimal pilot design has been studied from an information-theoretic viewpoint for non-feedback\\\\nmulti-antenna systems of practical interest [9, 13, 14]. For non-feedback MIMO systems with i.i.d.\\\\nchannels, the authors in [9] provided optimal solutions for all the aforementioned design parameters\\\\n\\\\n\\\\fby maximizing the derived capacity lower bound. For CCF systems with correlated MIMO channels,\\\\nthe optimal solution for the pilots spatial structure was investigated in [1517]. However, optimal\\\\nsolutions for the temporal pilot power allocation and training length are generally unknown for MIMO\\\\nsystems with any form of feedback. Some results were reported in [18] for rank-deficient channel\\\\ncovariance matrix known at the transmitter, which are based on a relaxed capacity lower bound.\\\\nHowever, this relaxed capacity bound is generally loose for moderately to highly correlated channels,\\\\nwhich can render the provided solutions suboptimal.\\\\n\\\\nB. Approach and Contributions\\\\nIn this paper, we are concerned with the optimal design of pilot parameters for MIMO systems with\\\\nvarious forms of feedback at the transmitter. Our main design objectives are the optimal temporal\\\\npower allocation to pilot and data symbols, as well as the optimal training length that maximize\\\\nthe rate of information transfer in the channel. Our figure of merit is a lower bound on the ergodic\\\\ncapacity of MIMO systems, which is an extension of those derived in [10] from i.i.d channels to\\\\ncorrelated channels.\\\\nWe address practical design questions such as: Are the simple solutions provided in [9] for nonfeedback MIMO systems also optimal for systems with feedback? In CGF systems, feedback delay\\\\nis unavoidable. If the CGF takes d symbol periods to arrive at the transmitter, the transmitter can\\\\nonly utilize this information after the first d symbol periods. In this case, we would like to know\\\\nwhether the optimal pilot design is significantly affected by the feedback delay. Furthermore, for\\\\nCCF systems with correlated channels, the optimal training length may be shorter than the number\\\\nof transmit antennas, which is generally difficult to solve analytically. In this case, we would like to\\\\nknow whether a near-optimal, yet simple pilot and data transmission strategy exists.\\\\nIn this context, the main contributions of this paper are summarized as follows.\\\\n\\\\n\\\\nFor delayless CGF with i.i.d. channels, we show that the solutions to the optimal temporal power\\\\nallocation to pilot and data transmission as well as the optimal training length coincide with the\\\\nsolutions for non-feedback systems.\\\\n\\\\n\\\\f\\\\n\\\\nFor delayed CGF systems with i.i.d. channels, our numerical results show that evenly distributing\\\\nthe power over the entire data transmission (regardless of the delay time) gives near optimal\\\\nperformance at practical signal-to-noise ratio (SNR). As a result, the solutions to the optimal\\\\ntemporal power allocation to pilot and data transmission, as well as the optimal training length\\\\nfor the delayless system stay nearly optimal regardless of the delay time.\\\\n\\\\n\\\\n\\\\nFor CCF systems with correlated channels, we propose a simple transmission scheme, taking into\\\\naccount the fact that training length Lp can be less than the number of transmit antennas. This\\\\nscheme only requires numerical optimization of Lp and does not require numerical optimization\\\\nover the spatial or temporal power allocation over pilot and data transmission. Our numerical\\\\nresults show that this scheme is very close to optimal. In addition, our results show that optimizing\\\\nLp can result in a significant capacity improvement for correlated channels.\\\\n\\\\n\\\\n\\\\nUsing the proposed scheme for CCF systems, we find the solution to the optimal temporal\\\\npower allocation to pilot and data transmission, which does not depend on the channel spatial\\\\ncorrelation under a mild condition on block length or SNR. Therefore, the proposed transmission\\\\nand power allocation schemes for CCF systems give near optimal performance while having very\\\\nlow computational complexity.\\\\n\\\\nThe rest of the paper is organized as follows. The PSAM transmission scheme, channel estimation\\\\nmethod, as well as an accurate capacity lower bound for spatially correlated channels are presented\\\\nin Section II. The optimal transmission and power allocation strategy for non-feedback systems are\\\\nsummarized in Section III. The optimal transmission and power allocation strategy for CGF and CCF\\\\nsystems are studied in Section IV and Section V, respectively. Finally, the main contributions of this\\\\npaper are summarized in Section VI.\\\\nThroughout the paper, the following notations will be used: Boldface upper and lower cases denote\\\\nmatrices and column vectors, respectively. The matrix I N is the N  N identity matrix. [] denotes\\\\nthe complex conjugate operation, and [] denotes the complex conjugate transpose operation. The\\\\nnotation E{} denotes the mathematical expectation. tr{}, |  | and rank{} denote the matrix trace,\\\\ndeterminant and rank, respectively.\\\\n\\\\n\\\\fPLTs\\\\n(1  )PLTs = Pp Lp Ts\\\\n\\\\nPLTs = Pd Ld Ts\\\\n(1  )Pd Ld Ts = Pd,2 (Ld  d)Ts\\\\n\\\\nPd Ld Ts = Pd,1 dTs\\\\n\\\\npilots\\\\n\\\\nLp\\\\n\\\\ndata sub-block 1\\\\nnon-adaptive\\\\ntransmission\\\\n\\\\nd = Ld\\\\n\\\\ndata sub-block 2\\\\nadaptive transmission\\\\n\\\\nLd\\\\n\\\\nFig. 1. An example of a transmission block of L symbols in a system with delayed feedback. It consists of a training subblock, followed by two data sub-blocks. Temporal power allocations are shown at the top and the length of each sub-block\\\\nis shown at the bottom.\\\\n\\\\nII. S YSTEM M ODEL\\\\nWe consider a MIMO block-flat-fading channel model with input-output relationship given by\\\\ny = Hx + n,\\\\n\\\\n(1)\\\\n\\\\nwhere y is the Nr  1 received symbol vector, x is the Nt  1 transmitted symbol vector, H is\\\\nthe Nr  Nt channel gain matrix, and n is the Nr  1 noise vector having zero-mean circularly\\\\n2 . Without loss in generality, we\\\\nsymmetric complex Gaussian (ZMCSCG) entries with variance n\\\\n2 = 1. The entries of H are also ZMCSCG with unit variance. We consider spatial correlations\\\\nlet n\\\\n1/2\\\\n\\\\namong the transmit antennas only. Therefore, H = H 0 RH , where H 0 has i.i.d. ZMCSCG entries\\\\nwith unit variance. The spatial correlation at the transmitter is characterized by the covariance matrix\\\\nRH = E{H  H}/Nr . In the case where the channels are spatially independent, we have RH =\\\\nI Nt . We assume that RH is a positive definite matrix and denote the eigenvalues of RH by g =\\\\n[g1 g2 . . . gNt ]T . Furthermore, we use the concept of majorization to characterize the degree of\\\\n\\\\nchannel spatial correlation [19, 20], which is summarized in Appendix I.\\\\n\\\\nA. Transmission Scheme\\\\nFig. 1 shows an example of a transmission block of L symbol periods in a PSAM scheme. The\\\\nchannel gains remain constant over one block and change to independent realizations in the next\\\\n\\\\n\\\\fblock. During each transmission block, each transmit antenna sends Lp pilot symbols, followed by\\\\nLd (= L  Lp ) data symbols as shown in Fig. 1. The receiver performs channel estimation during the\\\\n\\\\npilot transmission. For CGF systems, the receiver feeds the channel estimates back to the transmitter\\\\nonce per block to allow adaptive data transmission in the form of power control. In practical scenarios,\\\\nthere is a time delay of d symbol periods before the transmitter receives the feedback information as\\\\nshown in Fig. 1. That is, the data transmission during the first d symbol periods is not adaptive to\\\\nthe channel, and adaptive transmission is only available for the remaining Ld  d symbol periods. We\\\\ndefine  = d/Ld as the feedback delay factor. For CCF systems, less frequent feedback is required as\\\\nthe channel correlation changes much slower than the channel gains. Therefore, we do not consider\\\\nfeedback delay, i.e., d = 0. Note that for non-feedback systems, d = Ld .\\\\nThe total transmission energy per block is given by PLTs as shown in Fig. 1, where P is the\\\\naverage power per transmission and Ts is the symbol duration. We define the PSAM power factor\\\\nas the ratio of the total energy allocated to the data transmission, denoted by . We also denote the\\\\npower or SNR per pilot and data transmission by Pp and Pd 1 , respectively. Therefore, we have the\\\\nfollowing relationships.\\\\nPLTs = Pp Lp Ts + Pd Ld Ts , Pp = (1  )\\\\n\\\\nPL\\\\nPL\\\\n, and Pd = \\\\n.\\\\nLp\\\\nLd\\\\n\\\\n(2)\\\\n\\\\nFor feedback systems with delay of d symbol periods, the total energy for data transmission Pd Ld Ts\\\\nis further divided into the non-adaptive data transmission sub-block and the adaptive data transmission\\\\nsub-block as shown in Fig. 1. We define the data power division factor as the ratio of the total data\\\\nenergy allocated to the non-adaptive sub-block, denoted by . Therefore, we have the following\\\\nrelationships.\\\\nPd Ld Ts = Pd,1 d Ts + Pd,2 (Ld  d)Ts , Pd,1 =\\\\n\\\\n1\\\\n\\\\nPd , and Pd,2 =\\\\nPd ,\\\\n\\\\n1\\\\n\\\\n(3)\\\\n\\\\nwhere Pd,1 and Pd,2 are the power per transmission during the non-adaptive and adaptive sub-blocks.\\\\n1\\\\n\\\\nIdeally for CGF systems, Pd should be larger for the transmission blocks over which the channel is strong and smaller\\\\n\\\\nfor blocks over which the channel is weak. However, the results in [10] suggest that this temporal data power adaptation\\\\nprovides little capacity gain, hence it is not considered in this paper.\\\\n\\\\n\\\\fB. Channel Estimation\\\\nIn each transmission block, the receiver performs channel estimation during the pilot transmission.\\\\nCombining the first Lp received symbol vectors in a Nr  Lp matrix, we have\\\\nY = HX p + N ,\\\\n\\\\n(4)\\\\n\\\\nwhere X p is the Nt  Lp pilot matrix and N is the Nr  Lp noise matrix.\\\\nAssuming the channel spatial correlation can be accurately measured at the receiver, the channel\\\\ngain H can be estimated using the linear minimum mean square error (LMMSE) estimator [21]. We\\\\n =H\\\\n 0 R1/2 and H\\\\n  =H\\\\n  0 R1/2 respectively,\\\\ndenote the channel estimate and estimation error as H\\\\n \\\\n\\\\nH\\\\nH\\\\n\\\\n 0 and H\\\\n  0 have i.i.d. ZMCSCG entries with unit variance. H\\\\n is given as [16]\\\\nwhere H\\\\n = Y (X p  RH X p + I Lp )1 X p  RH .\\\\nH\\\\n\\\\n(5)\\\\n\\\\nThe covariance matrix of the estimation error is given by [16]\\\\n1\\\\n 1\\\\n  \\\\nRH\\\\n  = E{H H}/Nr = (RH + X p X p ) .\\\\n\\\\n(6)\\\\n\\\\nFrom the orthogonality property of LMMSE estimator, we have\\\\n\\\\nRH\\\\n .\\\\n = E{H H}/Nr = RH  RH\\\\n\\\\n(7)\\\\n\\\\nC. Ergodic Capacity Bounds\\\\nThe exact capacity expression under imperfect receiver CSI is still unavailable. We consider a lower\\\\nbound on the ergodic capacity for systems using LMMSE channel estimation [9, 10]. In particular,\\\\nthe authors in [10] derived a lower bound and an upper bound for spatially i.i.d. channels. Here we\\\\nextend these results to spatially correlated channels as follows.\\\\nA lower bound on the ergodic capacity per channel use is given by [10]\\\\n\\\\f\\\\n\\\\fo\\\\nn\\\\n\\\\f\\\\n\\\\f\\\\n1 \\\\n\\\\nCLB = EH\\\\n  ) HQ\\\\f ,\\\\n log 2 \\\\fI Nt + H (I Nr + Hx\\\\n\\\\nwhere Q = E{xx } is the input covariance matrix, and\\\\n\\\\n\\\\n\\\\n  \\\\n   },\\\\n \\\\n  0 R1/2 xx (R1/2 ) H\\\\n= E{Hxx\\\\nH } = E{H\\\\nHx\\\\n \\\\n0\\\\n \\\\n \\\\nH\\\\nH\\\\n\\\\no\\\\nn\\\\n1/2 \\\\n1/2\\\\n\\\\n)\\\\n}\\\\nI Nr = tr{RH\\\\nxx\\\\n(R\\\\n= E tr{RH\\\\n  Q}I Nr ,\\\\n \\\\n \\\\nH\\\\n\\\\n(8)\\\\n\\\\n\\\\f  0ZH\\\\n   } = E{tr{Z}}I N , given that H\\\\n  0 has i.i.d. entries with unit variance\\\\nwhere we have used E{H\\\\n0\\\\nr\\\\n\\\\nand is independent of Z . Therefore, the ergodic capacity lower bound per channel use in (8) can be\\\\nrewritten as\\\\n\\\\f\\\\n\\\\fo\\\\nn\\\\n\\\\f\\\\n\\\\f\\\\n1   \\\\nlog\\\\n+\\\\n(1\\\\n+\\\\ntr\\\\n{R\\\\nQ})\\\\nH\\\\nHQ\\\\nCLB",
    "Methodology": " = EH\\\\n\\\\f .\\\\n \\\\n\\\\n2 \\\\fI Nt\\\\nH\\\\n\\\\n(9)\\\\n\\\\nAn upper bound on the ergodic capacity per channel use is given by [10]\\\\n\\\\nwhere\\\\n\\\\n\\\\fo\\\\n\\\\f\\\\n\\\\f\\\\n\\\\fo\\\\nn\\\\nn\\\\n\\\\f\\\\n\\\\f\\\\n\\\\f\\\\n\\\\f\\\\nlog2 \\\\fey|H\\\\n+ I Nr )\\\\f ,\\\\nCUB = EH\\\\n \\\\n \\\\f  Ex log 2 \\\\fe(Hx|x\\\\n\\\\n \\\\n \\\\ny|H\\\\n  Q}I Nr + I Nr ,\\\\n = E{yy |H} = HQH + tr{RH\\\\n\\\\nand\\\\n\\\\n\\\\n  \\\\n \\\\n   |x},\\\\n  0 R1/2 xx (R1/2 ) H\\\\nHx|x\\\\n= E{Hxx\\\\nH |x} = E{H\\\\n \\\\n0\\\\n \\\\n \\\\nH\\\\nH\\\\n1/2\\\\n\\\\n1/2 \\\\n\\\\n\\\\n\\\\n= tr{RH\\\\n  xI Nr .\\\\n  ) }I Nr = x RH\\\\n  xx (RH\\\\n\\\\nTherefore, the ergodic capacity upper bound per channel use can be written as\\\\n\\\\f\\\\n\\\\fo\\\\no\\\\nn\\\\nn\\\\n1 + tr{RH\\\\n  Q}\\\\n\\\\f\\\\n\\\\f\\\\n1   \\\\n,\\\\nCUB = EH\\\\nlog\\\\nlog\\\\n+\\\\nN\\\\nE\\\\nH\\\\nHQ\\\\n+\\\\n(1\\\\n+\\\\ntr\\\\n{R\\\\nQ})\\\\n\\\\f\\\\n \\\\nr x\\\\n\\\\n2\\\\n2 \\\\fI Nt\\\\nH\\\\n1 + x R H\\\\n x\\\\n= CLB + Cgap ,\\\\n\\\\n(10)\\\\n\\\\nwhere Cgap is the difference between the upper bound and the lower bound, which indicates the\\\\nmaximum error of the bounds. The authors in [10] studied the tightness of the bounds for i.i.d.\\\\nchannels. They observed that Cgap /CLB is negligible for Gaussian inputs, hence the bounds are tight.\\\\nWe find that this is also true for spatially correlated channels with LMMSE estimation. Therefore, the\\\\ncapacity lower bound per channel use in (9) is accurate enough to be used in our analysis assuming\\\\nGaussian inputs. The average capacity lower bound per transmission block is therefore given by\\\\nC LB =\\\\n\\\\n\\\\f\\\\n\\\\fo\\\\nn\\\\nLd\\\\nLd\\\\n\\\\f\\\\n\\\\f\\\\n1   \\\\nCLB =\\\\nEH\\\\nlog\\\\n+\\\\n(1\\\\n+\\\\ntr\\\\n{R\\\\nQ})\\\\nH\\\\nHQ\\\\n\\\\fI\\\\n\\\\f .\\\\n \\\\nN\\\\n\\\\n2\\\\nt\\\\nH\\\\nL\\\\nL\\\\n\\\\n(11)\\\\n\\\\nIn this paper, the average capacity lower bound in (11) will be used as the figure of merit. We will\\\\nuse capacity lower bound and capacity interchangeably throughout the rest of this paper.\\\\n\\\\n\\\\fIII. N ON - FEEDBACK S YSTEMS\\\\nA. Spatially i.i.d. Channels\\\\nThe optimal pilot and data transmission scheme and optimal power allocation for non-feedback\\\\nsystems with spatially i.i.d. channels were studied in [2, 9], and their main results are summarized\\\\nas follows. The optimal transmission strategy is to transmit orthogonal pilots and independent data\\\\namong the transmit antennas with spatially equal power allocation to each antenna during both pilot\\\\nand data transmission. The optimal\\\\n\\\\n\\\\n\\\\n\\\\n\\\\n\\\\n\\\\n\\\\n =\\\\n\\\\n\\\\n\\\\n\\\\n\\\\n\\\\nwhere  =\\\\n\\\\nNt +PL\\\\nPL(1Nt /Ld ) .\\\\n\\\\nPSAM power factor  is given by\\\\n\\\\n1\\\\n2,\\\\n\\\\n+\\\\n\\\\np\\\\n\\\\n(  1),\\\\n\\\\np\\\\n\\\\n(  1),\\\\n\\\\nfor Ld > Nt\\\\nfor Ld = Nt\\\\n\\\\n(12)\\\\n\\\\nfor Ld < Nt\\\\n\\\\nWith the optimal , the optimal training length is Lp = Nt . For equal power\\\\n\\\\nallocation to pilot and data, i.e., Pp = Pd = P , Lp should be found numerically.\\\\n\\\\nB. Spatially Correlated Channels\\\\nIn non-feedback systems where the transmitter does not know the channel correlation, it is difficult\\\\nto find the optimal resource allocation and transmission strategies. Consequently, no results have been\\\\nfound on the optimal or suboptimal solution to  and Lp . Intuitively, the amount of training resource\\\\nrequired should reduce as the channels becomes more spatially correlated. Therefore, one may use the\\\\nsolution to  and Lp for i.i.d. channels as a robust strategy for correlated channels in non-feedback\\\\nsystems. Similarly, one may still use the optimal transmission strategies for i.i.d. channels to ensure\\\\na robust system performance for correlated channels, which can be justified by the following two\\\\ntheorems.\\\\nTheorem 1: For non-feedback systems with spatially correlated channels in PSAM schemes, the\\\\ntransmission of orthogonal training sequences among the transmit antennas with spatially equal\\\\npower allocation minimizes the channel estimation errors for the least-favourable channel correlation,\\\\ni.e., using X p X p  =\\\\n\\\\nPp Lp\\\\nNt I N t\\\\n\\\\nProof: see Appendix II.\\\\n\\\\nis a robust training scheme.\\\\n\\\\n\\\\fTheorem 2: For non-feedback systems with spatially correlated channels in PSAM schemes, the\\\\ntransmission of i.i.d. data sequences among the transmit antennas with spatially equal power allocation, i.e., Q =\\\\n\\\\nPd\\\\nNt I N t ,\\\\n\\\\n(a) maximizes the capacity for the least-favourable channel correlation at\\\\n\\\\nsufficiently low SNR, and (b) is the optimal transmission scheme at sufficiently high SNR.\\\\nProof: see [22].\\\\nRemark: From Theorem 1 and Theorem 2, we see that the optimal transmission strategy for i.i.d.\\\\nchannels is also a robust choice for correlated channels in non-feedback systems.\\\\n\\\\nIV. C HANNEL G AIN F EEDBACK (CGF) S YSTEMS\\\\nIn this section, we consider systems having a noiseless feedback link from the receiver to the\\\\ntransmitter (e.g., a low rate feedback channel). After the receiver performs pilot-assisted channel\\\\nestimation, it feeds the channel estimates back to the transmitter. Once the transmitter receives the\\\\nestimated channel gains, it performs spatial power adaptation accordingly. We consider the channels\\\\nto be spatially i.i.d.2 . Since the data transmission utilizes all the channels with equal probability, it is\\\\nreasonable to have at least as many measurements as the number of channels for channel estimation,\\\\nwhich implies that Lp  Nt . From [9], we know that the optimal training consists of orthogonal\\\\npilots with equal power allocated to each antenna.\\\\n\\\\nA. CGF System with No Feedback Delay\\\\nFirstly, we study an ideal scenario in which the transmitter receives the estimated channel gains\\\\nat the start of the data transmission, i.e., d = 0. For given Pd , the ergodic capacity lower bound per\\\\nchannel use in (9) can be rewritten as\\\\nCLB = EH\\\\n0\\\\n= E\\\\n\\\\nn\\\\n\\\\n\\\\f\\\\n\\\\f\\\\nlog2 \\\\fI Nt +\\\\n\\\\nNt\\\\nnX\\\\ni=1\\\\n\\\\n2\\\\n\\\\n\\\\u0010\\\\nlog2 1 +\\\\n\\\\n2\\\\nH\\\\n\\\\n2 P\\\\n1 + H\\\\n  d\\\\n2\\\\nH\\\\n\\\\n\\\\n\\\\fo\\\\n H\\\\n 0 Q\\\\f\\\\f ,\\\\nH\\\\n0\\\\n\\\\n2 P\\\\n1 + H\\\\n  d\\\\n\\\\ni qi\\\\n\\\\n\\\\u0011o\\\\n\\\\n,\\\\n\\\\nWe will provide some discussion for CGF system with correlated channels in Section V-E.\\\\n\\\\n(13)\\\\n\\\\n\\\\f2 =\\\\nwhere H\\\\n \\\\n\\\\n\\\\u0010\\\\n\\\\n1+\\\\n\\\\nPp Lp\\\\nNt\\\\n\\\\n\\\\u00111\\\\n\\\\n2 = 1   2 , and  = [  . . .  ]T denote the eigenvalues\\\\n, H\\\\n1 2\\\\nNt\\\\n \\\\n\\\\nH\\\\n\\\\n 0 H\\\\n 0 . It was shown in [10] that the capacity is maximized when the matrix Q has the same\\\\nof H\\\\n 0 H\\\\n 0 . The eigenvalues of Q can be found via the standard water-filling given by\\\\neigenvectors as H\\\\nh\\\\n\\\\u0010\\\\nqi =  \\\\n\\\\n2\\\\nH\\\\n\\\\n2 P\\\\n1 + H\\\\n  d\\\\n\\\\ni\\\\n\\\\n\\\\u00111 i+\\\\n\\\\nNt\\\\nX\\\\n\\\\nwith\\\\n\\\\nqi = Pd ,\\\\n\\\\n(14)\\\\n\\\\ni=1\\\\n\\\\nwhere  represents the water level, and [z]+ , max{z, 0}. We refer to the number of non-zero qi as\\\\nthe number of active eigen-channels, denoting this number by m. Therefore, (13) can be reduced to\\\\nCLB = E\\\\n= E\\\\n\\\\nm\\\\nnX\\\\n\\\\ni=1\\\\nm\\\\nnX\\\\n\\\\nlog2\\\\nlog2\\\\n\\\\ni=1\\\\n\\\\n\\\\u0010\\\\n\\\\n2\\\\nH\\\\n\\\\n2 P\\\\n1 + H\\\\n  d\\\\n\\\\ni \\\\n\\\\n\\\\u0010  2 Pd\\\\n\\\\nH\\\\n\\\\n2 P\\\\n1 + H\\\\n  d\\\\n\\\\n+\\\\n\\\\n\\\\u0011o\\\\n,\\\\n\\\\nm\\\\nX\\\\ni=1\\\\n\\\\n(15)\\\\n\\\\nm\\\\n\\\\u0011 X\\\\ni o\\\\nlog\\\\n+\\\\n,\\\\n1\\\\n2\\\\ni\\\\nm\\\\n\\\\n(16)\\\\n\\\\ni=1\\\\n\\\\nwhere (16) is obtained by substituting  from (14) into (15). It should be noted that E in (15) and\\\\n(16) is the expectation over the m largest values in .\\\\nUsing (16), we now look for optimal value of Pd . The following two theorems summarize the\\\\nresults on the optimal PSAM power factor  as well as the optimal training length Lp .\\\\nTheorem 3: For delayless CGF systems with i.i.d. channels in PSAM schemes, the optimal PSAM\\\\npower factor  is given by (12).\\\\nProof: see Appendix III.\\\\nTheorem 4: For delayless CGF systems with i.i.d. channels in PSAM schemes adopting the optimal\\\\nPSAM power factor  , the optimal training length equals the number of transmit antennas, that is\\\\nLp = Nt .\\\\n\\\\nProof: see Appendix IV.\\\\nRemark: Theorem 3 and Theorem 4 show that the optimal pilot design for delayless CGF systems\\\\ncoincide with that for non-feedback systems in Section III-A. That is to say, one can use the same\\\\ndesign to achieve optimal performance in both non-feedback and CGF systems.\\\\n\\\\nB. CGF System with Feedback Delay\\\\nFor practical systems, a finite duration of d symbol periods is required before feedback comes\\\\ninto effect at the transmitter as shown in Fig. 1. Therefore, the transmitter has no knowledge about\\\\n\\\\n\\\\fthe channel during the first data sub-block of d transmissions, which is equivalent to non-feedback\\\\nsystems. From [2], we know that the transmitter should allocate equal power to each transmit antenna\\\\nduring the first data sub-block (or the non-adaptive sub-block). After receiving the estimated channel\\\\ngains, the transmitter performs spatial power water-filling similar to Section IV-B during the second\\\\ndata sub-block (or the adaptive sub-block) of length Ld  d. Note that a CGF system with d = Ld\\\\nis equivalent to a non-feedback system.\\\\nIn order to optimize PSAM power factor , we apply a two-stage optimization approach. Firstly, we\\\\noptimize the data power division factor  for a given total data power constraint. Then, we optimize\\\\nthe PSAM power factor .\\\\nIn general, we find that there is no closed-form solution for the optimal data power division factor\\\\n . Furthermore when the channel estimation error is large, the capacity lower bound is not globally\\\\n\\\\nconcave on   [0, 1]. Nevertheless, the block length L of CGF systems is usually large (which will\\\\nbe discussed further at the end of Section IV). From the results on the optimal PSAM power factor \\\\nand optimal training length Lp in Section III-A and Section IV-B, we also expect that Pp  P when\\\\nL  1. This implies that the channel estimation errors in CGF systems are often small. Therefore,\\\\n\\\\nwe can investigate the optimal data power division assuming perfect channel estimation to obtain\\\\nsome insights into the optimal solution for imperfect channel estimation. In the following, we will\\\\nsee that a good approximation of the optimal solution is given by    for practical SNR values\\\\nunder perfect channel estimation.\\\\nFrom (3) we see that less power per transmission is allocated to the non-adaptive sub-block\\\\n(i.e., Pd,1 < Pd,2 ) if  <  , and vice versa. The average capacity lower bound for data transmission\\\\nwith perfect channel knowledge (i.e., no training) is given by\\\\nCLB\\\\n\\\\nNt\\\\nNt\\\\n\\\\u0010\\\\nn X\\\\no\\\\nX\\\\nPd \\\\u0011\\\\nlog2 1 + i\\\\n= E \\\\nlog2 (1 + i qi ) ,\\\\n+ (1  )\\\\nNt\\\\ni=1\\\\n\\\\n(17)\\\\n\\\\ni=1\\\\n\\\\nwhere the water-filling solution for qi with water level  is given by\\\\n+\\\\nqi = [  1\\\\ni ]\\\\n\\\\nwith\\\\n\\\\nNt\\\\nX\\\\ni=1\\\\n\\\\nqi =\\\\n\\\\n1\\\\nPd .\\\\n1\\\\n\\\\n(18)\\\\n\\\\n\\\\fOptimal data power division factor\\\\n\\\\n0.25\\\\n\\\\n=0.2\\\\n\\\\n0.2\\\\n\\\\n0.15\\\\n=0.1\\\\n0.1\\\\n\\\\nN = 4, N = 6\\\\n\\\\n0.05\\\\n\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 4\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 2\\\\nt\\\\n\\\\n0\\\\n10\\\\n\\\\nFig. 2.\\\\n\\\\n5\\\\n\\\\n0\\\\n\\\\n5\\\\n10\\\\n15\\\\nData transmission SNR in dB\\\\n\\\\n20\\\\n\\\\nr\\\\n\\\\n25\\\\n\\\\n30\\\\n\\\\nThe optimal data power division factor  vs. data transmission SNR Pd for different values of the delay factor\\\\n\\\\n and antenna sizes. Perfect channel estimation is assumed.\\\\n\\\\nIt can be shown that CLB in (17) is concave on   [0, 1].3 Using the Karush-Kuhn-Tucker (KKT)\\\\nconditions [23], the optimal data power division factor  can be found as\\\\n\\\\n\\\\n  = 0,\\\\nif E{i }  E{ 1 }\\\\no\\\\nn\\\\n\\\\n arg E  PNt\\\\ni\\\\n1 = 0,\\\\nif E{i } > E{ 1 }\\\\n\\\\n\\\\n\\\\n\\\\ni=1 Nt +i Pd\\\\n\\\\n(19)\\\\n\\\\nNote that the entries in  are the eigenvalues of a Wishart matrix with parameter (Nt , Nr ) [2].\\\\nFig. 2 shows the optimal data power division factor  given by (19) versus data transmission\\\\nSNR Pd for different delay factors  and antenna sizes assuming perfect channel estimation. It can\\\\nbe seen that  quickly increases from 0 to  at very low SNR. For moderate to high SNR,  stays\\\\nabove  and converges to  as Pd  .4 More importantly, we see that  is close to  at practical\\\\n3\\\\n\\\\nThis can be shown from the first and second derivative of CLB w.r.t.,  for any fixed number of active eigen-channels\\\\n\\\\nm. In particular, one can show that\\\\n\\\\nd\\\\nd\\\\n\\\\nis continuous on   [0, 1] and\\\\n\\\\nd2 CLB\\\\nd2\\\\n\\\\n< 0 for any fixed m. Combining these two\\\\n\\\\nfacts, one can conclude that CLB is concave on   [0, 1]. The detailed derivation is omitted for brevity.\\\\n4\\\\n\\\\n for the (Nt = 4, Nr = 2) system starts to converge back to  at a higher SNR, which is not shown in Fig. 2. This is\\\\n\\\\nbecause the use of spatial water-filling in data transmission gives a significant improvement in the capacity when Nt > Nr .\\\\n\\\\n\\\\fSNR range, e.g., Pd > 0 dB. Therefore, we conclude that  =  is a near optimal solution. From\\\\n(3) we see that  =  is actually the simplest solution which allocates the same amount of power\\\\nduring each data transmission in both non-adaptive and adaptive sub-blocks, i.e., Pd,1 = Pd,2 = Pd .\\\\nFurthermore, this simple solution does not require the knowledge of the feedback delay time.\\\\nHaving    for perfect channel estimation, we argue that    still holds for imperfect\\\\nchannel estimation and will verify its optimality using numerical results. This choice of  leads to\\\\na simple solution for the optimal PSAM power factor  , as well as the optimal training length Lp\\\\nfor delayed CGF system summarized in Corollary 1, which can be shown by combining the results\\\\nin Theorem 3, Theorem 4 and those for the non-feedback systems summarized in Section III-A.\\\\nCorollary 1: For delayed CGF systems with i.i.d. channels in PSAM schemes, temporally distributing equal power per transmission over both the non-adaptive and adaptive data sub-blocks is a\\\\nsimple and efficient strategy, i.e.,  =  . With this strategy, the optimal PSAM power factor  and\\\\nthe optimal training length Lp coincide with those in the delayless case given in Theorem 3 and 4.\\\\n\\\\nC. Numerical ",
    "Experiment": "Results\\\\nNow, we present numerical results to illustrate the capacity gain from optimizing the PSAM power\\\\nfactor. The numerical results also validate the optimality of the transmission strategy in Corollary 1.\\\\nFig. 3 shows the average capacity lower bound C LB in (11) versus SNR P for delayless CGF\\\\nsystems (i.e., d = 0) with i.i.d. channels and different antenna sizes. The solid lines indicate systems\\\\nusing  and Lp (Lp = 4 in this case). The dashed lines indicate systems using equal temporal\\\\npower allocation and Lp found numerically. Comparing the solid and dashed lines, we see that the\\\\ncapacity gain from optimal temporal power allocation is approximately 9% at 0 dB and 6% at 20\\\\ndB for all three systems. This range of capacity gain (5% to 10%) was also observed in [9] for\\\\nnon-feedback systems which can be viewed as an extreme case of delayed CGF system with d = Ld .\\\\nFrom the results for the extreme cases, i.e., d = 0 and d = Ld , we conclude that the capacity gain\\\\nfrom optimizing the PSAM power factor is around 5% to 10% at practical SNR for delayed CGF\\\\nsystems with i.i.d. channels.\\\\n\\\\n\\\\fAverage capacity lower bound in bits per channel use\\\\n\\\\n25\\\\nN = 4, N = 6, optimal\\\\nt\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 4, optimal\\\\n\\\\n20\\\\n\\\\nt\\\\n\\\\nr\\\\n\\\\nNt = 4, Nr = 4, equal\\\\nN = 4, N = 2, optimal\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 2, equal\\\\n\\\\n15\\\\n\\\\nt\\\\n\\\\nr\\\\n\\\\n10\\\\n\\\\n5\\\\n\\\\n0\\\\n\\\\nFig. 3.\\\\n\\\\nr\\\\n\\\\nN = 4, N = 6, equal\\\\n\\\\n0\\\\n\\\\n5\\\\n\\\\n10\\\\nSNR in dB\\\\n\\\\n15\\\\n\\\\n20\\\\n\\\\nAverage capacity lower bound C LB in (11) vs. SNR P for delayless CGF systems ( = 0) with i.i.d. channels\\\\n\\\\nand different antenna sizes. The block length is L = 100. Both optimal temporal power allocation to pilot and data as well\\\\nas equal power allocation are shown for comparison. For optimal temporal power allocation, the training length is Lp = 4;\\\\nwhile for equal power allocation, the pilot length is optimized numerically.\\\\n\\\\nWe now consider delayed CGF systems to verify Corollary 1. Fig. 4 shows the average capacity\\\\nlower bound C LB in (11) versus SNR P for delayed CGF systems with i.i.d. channels and different\\\\nantenna sizes. In this example, a transmission block of length L = 100 consists of a training sub-block\\\\nof Lp = 4 symbol periods, followed by a non-adaptive data sub-block of d = 20 symbol periods5 and\\\\nan adaptive data sub-block of Ld  d = 76 symbol periods. Therefore, the delay factor  = 0.208.\\\\nThe lines indicate the use of  =  , and the markers indicate optimal data power division found\\\\nthrough numerical optimization using C LB in (11). The values of  for SNR = 4 dB, 10 dB and\\\\n16 dB are shown in the figure as well. We see that the capacity difference between the system using\\\\n =  and  =  is negligible. That is to say the use of temporal equal power transmission over the\\\\n\\\\nentire data block is near optimal for systems with channel estimation errors. We have also confirmed\\\\n5\\\\n\\\\nThe delay length d takes into account the channel estimation and other processing time at the receiver and transmitter,\\\\n\\\\nas well as the time spent on the transmission of low-rate feedback.\\\\n\\\\n\\\\fAverage capacity lower bound in bits per channel use\\\\n\\\\n25\\\\nN = 4, N = 6, analytical\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 6, numerical\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 4, analytical\\\\n\\\\n20\\\\n\\\\nt\\\\n\\\\n =0.21\\\\n\\\\nr\\\\n\\\\n0\\\\n\\\\nNt = 4, Nr = 4, numerical\\\\nN = 4, N = 2, analytical\\\\nt\\\\n\\\\nr\\\\n\\\\nN = 4, N = 2, numerical\\\\n\\\\n15\\\\n\\\\nt\\\\n\\\\nr\\\\n\\\\n =0.21\\\\n\\\\n =0.22\\\\n0\\\\n\\\\n0\\\\n\\\\n10\\\\n =0.22\\\\n\\\\n =0.22\\\\n\\\\n =0.20\\\\n0\\\\n\\\\n0\\\\n\\\\n0\\\\n\\\\n5\\\\n\\\\n =0.21\\\\n\\\\n =0.19\\\\n0\\\\n\\\\n0\\\\n\\\\n =0.17\\\\n0\\\\n\\\\n0\\\\n\\\\n0\\\\n\\\\n5\\\\n\\\\n10\\\\nSNR in dB\\\\n\\\\n15\\\\n\\\\n20\\\\n\\\\nFig. 4. Average capacity lower bound in (11) vs. SNR P for delayed CGF systems with i.i.d. channels and different antenna\\\\nsizes. Within a block length of L = 100, the training length is Lp = 4, followed by a non-adaptive data transmission\\\\nsub-block of length d = 20 and an adaptive data transmission sub-block of length 76. The lines indicate the use of\\\\n =  = 0.208, and the markers indicate optimal data power division factor found numerically.\\\\n\\\\nthat this trend is valid for a wide range of block lengths (results are omitted for brevity). These results\\\\nvalidate Corollary 1.\\\\nIt is noted that we have assumed the feedback link to be noiseless. When noise is present, capacity\\\\nthat can be achieved by adaptive transmission reduces as the noise in the feedback link increases. The\\\\ncapacity reduction due to corrupted channel gain estimates was studied in [24]. It was shown that the\\\\ncapacity reduction can increase quickly with the noise in the estimated channel gains. Therefore, a\\\\nreliable feedback scheme which minimizes the noise in the estimated channel gains is important for\\\\nCGF systems. Furthermore, CGF systems need frequent feedback particularly when the block length\\\\nis relatively small. This requires a significant amount of feedback overhead in the reverse link (from\\\\nthe receiver to the transmitter), which may cause a direct reduction in the overall information rate,\\\\nespecially when both the forward and the reverse links are operating at the same time, e.g., in cellular\\\\nsystems. Therefore, the CGF scheme may not be appropriate in fast fading environments where the\\\\n\\\\n\\\\fblock length is small.\\\\nV. C HANNEL C OVARIANCE F EEDBACK (CCF) S YSTEMS\\\\nAs discussed in the previous subsection, CGF systems require frequent use of feedback due to the\\\\nrapid change in the channel gains. On the other hand, the statistics of the channel gains change much\\\\nslower than the channel gains themselves. As a result, it is practical for the receiver to accurately\\\\nmeasure the channel covariance matrix and feed it back to the transmitter at a much lower frequency\\\\nwith negligible feedback overhead and delay. Note that for completely i.i.d. channels, there is no need\\\\nfor CCF. In this section, we consider CCF systems with spatially correlated channels and investigate\\\\nthe optimal pilot and data transmission strategy, as well as the optimal power allocation.\\\\nA. Proposed Transmission Scheme\\\\nIntuitively, the amount of training resource required for spatially correlated channels should be\\\\nless than that for i.i.d. channels, as spatial correlation reduces the uncertainty in the channel gains.\\\\nFrom [9], we know for i.i.d. channels that the optimal training length Lp equals the number of\\\\ntransmit antennas provided that the optimal PSAM power factor  is used. Therefore, we expect\\\\nthat Lp  Nt for correlated channels if we optimize . However, most studies on the optimal pilot\\\\ndesign for correlated channels assume Lp  Nt [1517]. It was shown in [16] that the optimal training\\\\nstrategy is to train along the eigenvectors of the channel covariance matrix with training power being\\\\nwaterfilled according to the eigenvalues of the channel covariance matrix. Since we expect Lp  Nt ,\\\\nwe modify the training strategy such that only the Lp strongest eigen-channels are trained.\\\\nWe perform eigenvalue decomposition on RH as RH = U GU  , and let the eigenvalues of RH be\\\\nsorted in descending order in g = [g1 g2 . . . gNt ]T . The optimal training sequence which minimizes\\\\nthe channel estimation errors (i.e., tr{RH\\\\n  }) has the property that the eigenvalue decomposition of\\\\nX p X p  is given by X p X p  = U P U  [16], where P is a diagonal matrix. The entries of P which\\\\n\\\\nminimize the channel estimation errors follow a water-filling solution given by\\\\n\\\\nP\\\\n\\\\n [  g1 ]+ , i = 1, . . . , Lp , with Lp pi = Pp Lp\\\\ni=1\\\\ni\\\\npi =\\\\n\\\\n 0,\\\\ni = Lp + 1, . . . , Nt ,\\\\n\\\\n(20)\\\\n\\\\n\\\\fwhere  is the water level and p = [p1 p2 . . . pNt ]T are the eigenvalues of X p X p  . In practice, the\\\\ntransmitter can ensure that the number of non-zero pi equals Lp by changing Lp accordingly.\\\\nFor data transmission, it was shown that the optimal strategy is to transmit along the eigenvectors\\\\nof RH under the perfect channel estimation [46]. With channel estimation errors, one strategy is to\\\\ntransmit data along the eigenvectors of RH\\\\n . With the proposed training sequence, it is easy to show\\\\nfrom (6) and (7) that the eigenvectors of RH\\\\n  and RH\\\\n are the same as those of RH . Therefore, the\\\\n \\\\n \\\\neigenvalue decomposition of RH\\\\n can be written as RH\\\\n = U GU , and we set Q = U QU where\\\\n is a diagonal matrix with entries denoted by qi ,  i = 1, ..., Nt .\\\\nQ\\\\n\\\\nHowever, there is no closed-form solution to the optimal spatial power allocation even with perfect\\\\nchannel estimation [46]. Following the proposed training scheme, we propose to transmit data through\\\\nthe Lp trained eigen-channels with equal power. That is\\\\n\\\\n\\\\n Pd /Lp , i = 1, . . . , Lp ,\\\\nqi =\\\\n\\\\n 0,\\\\ni = Lp + 1, . . . , Nt .\\\\n\\\\n(21)\\\\n\\\\nFor the proposed training and data transmission scheme, the capacity lower bound per channel use\\\\n\\\\nin (9) reduces to\\\\n\\\\f\\\\n\\\\fo\\\\nn\\\\n\\\\n\\\\f\\\\n1\\\\n1 \\\\f\\\\n\\\\n\\\\n\\\\n\\\\nlog\\\\nCLB = EH\\\\nI\\\\n+\\\\nH\\\\nH\\\\nG\\\\nQ(1\\\\n+\\\\n\\\\nP\\\\n)\\\\n\\\\f ,\\\\n0\\\\n0\\\\nd\\\\n2 \\\\f Nt\\\\n0\\\\n\\\\n(22)\\\\n\\\\n are given by gi = gi  1 ,  i = 1, ..., Lp and gi = 0,  i =\\\\nwhere the (diagonal) entries of G\\\\nLp + 1, .., Nt , which is derived from (6), (7) and (20).\\\\n\\\\nB. Optimal Temporal Power Allocation\\\\nNow, we investigate the optimal PSAM power factor  using the capacity lower bound given in\\\\n(22). The result is summarized in the following theorem.\\\\nTheorem 5: For CCF systems in PSAM schemes with the transmission strategy proposed in Section V-A, the optimal PSAM power factor  is given by (12) with  =\\\\nPL \\\\n\\\\nP Lp\\\\n\\\\n1\\\\ni=1 gi .\\\\n\\\\nProof: see Appendix V.\\\\n\\\\nLd\\\\nLd Lp ,\\\\n\\\\nprovided that\\\\n\\\\n\\\\fRemark: It is noted that  in the optimal solution in Theorem 5 is essentially the same as the one\\\\ngiven in Section III-A when PL  1. The condition of PL \\\\n\\\\nP Lp\\\\n\\\\n1\\\\ni=1 gi\\\\n\\\\ncan be easily satisfied\\\\n\\\\nwhen the block length is not too small or the SNR is moderate to high (i.e., PL  1), and the spatial\\\\ncorrelation between any trained channels is not close to 1. Therefore, the result in Theorem 5 applies\\\\nto many practical scenarios. It is important to note that the optimal PSAM power factor  given\\\\nin Theorem 5 does not depend on the channel spatial correlation, provided the condition is met. In\\\\nother words, this unique design is suitable for a relatively wide range of channel spatial correlation.\\\\nThe following steps describe the algorithm for transmission design of CCF systems:\\\\n1. For each Lp (Lp  Nt ), design the pilot and data transmission according to Section V-A.\\\\n2. Perform temporal power allocation to pilot and data according to Section V-B.\\\\n3. Numerically compare the capacity lower bound in (11) for different Lp and choose Lp which\\\\nmaximizes the capacity.\\\\n\\\\nC. A Special Case: Beamforming\\\\nBeamforming is a special case of the proposed transmission scheme where only the strongest\\\\neigen-channel is used, i.e., Lp = 1. The use of beamforming significantly reduces the complexity of\\\\nthe system as it allows the use of well-established scalar codec technology and only requires the\\\\nknowledge of the strongest eigen-channel (not the complete channel statistics) [5]. For beamforming\\\\ntransmission, the capacity lower bound in (22) reduces to\\\\n\\\\u0010\\\\nn\\\\n\\\\u0011o\\\\n1\\\\nh\\\\n 0 (gmax   )Pd ,\\\\nCLB = Eh 0 log2 1 + h\\\\n0\\\\n1 + 1 Pd\\\\n\\\\u0011o\\\\n\\\\u0010\\\\nn\\\\nh\\\\n 0 gmax Pp Pd\\\\n,\\\\n= Eh 0 log2 1 + h\\\\n0\\\\n1\\\\ngmax\\\\n+ Pp + Pd\\\\n\\\\n(23)\\\\n\\\\n 0 is a Nr  1 vector with i.i.d. ZMCSCG and unit variance entries, gmax is the largest\\\\nwhere h\\\\n1 which can be found by letting L = 1 in (20).\\\\neigenvalue in g , and  = Pp + gmax\\\\np\\\\n\\\\nTheorem 6: For CCF systems in PSAM schemes with beamforming, the optimal PSAM power\\\\nfactor  is given in (12) with  =\\\\n\\\\n1+gmax PL\\\\ngmax PL(L2)/(L1) .\\\\n\\\\nProof: The proof can be obtained by letting Lp = 1 and gi = gmax in the proof of Theorem 5. \\\\u0003\\\\n\\\\n\\\\f0.9\\\\nL =1\\\\np\\\\n\\\\nL =2\\\\np\\\\n\\\\nL =3\\\\n\\\\nOptimal PSAM power factor\\\\n\\\\n0.85\\\\n\\\\np\\\\n\\\\nLp = 4\\\\n\\\\n0.8\\\\n\\\\n0.75\\\\n\\\\n0.7\\\\n\\\\n0.65\\\\n\\\\n0\\\\n\\\\n0.2\\\\n\\\\n0.4\\\\n0.6\\\\nChannel spatial correlation factor\\\\n\\\\n0.8\\\\n\\\\n1\\\\n\\\\nFig. 5. Optimal PSAM power factor  vs. channel spatial correlation factor  for CCF 4  4 systems with a block length\\\\nof L = 20 and SNR = 10 dB. All values of  are found numerically.\\\\n\\\\nRemark: It can be shown for the beamforming case that\\\\n\\\\nd\\\\ndgmax\\\\n\\\\n> 0. Therefore, the optimal PSAM\\\\n\\\\npower factor  increases as the channel spatial correlation increases, that is to say, more power\\\\nshould be allocated to data transmission when the channels become more correlated. When PL  1,\\\\n reduces to\\\\n\\\\nL1\\\\nL2 ,\\\\n\\\\nhence  does not depend on the channel correlation.\\\\n\\\\nD. Numerical Results\\\\nFor numerical analysis, we choose the channel covariance matrix to be in the form of [RH ]ij =\\\\n|ij| , where  is referred to as the spatial correlation factor [16, 25]. Our numerical results validate\\\\n\\\\nthe solution to the optimal PSAM power factor given in Theorem 5 and Theorem 6. The results\\\\nalso show that optimizing the training length can significantly improve the capacity, and the simple\\\\ntransmission scheme proposed in Section V-A gives near optimal performance.\\\\nFig. 5 shows the optimal PSAM power factor  found numerically versus the channel correlation\\\\nfactor  for CCF 4  4 systems with a block length of L = 20 and SNR of 10 dB. We see that \\\\nremains constant before the correlation factor gets close to 1 for Lp > 1, and this value of  is the\\\\n\\\\n\\\\fAverage capacity lower bound in bits per channel use\\\\n\\\\n4.5\\\\n\\\\n*\\\\nLp=2\\\\n\\\\n4\\\\n\\\\n3.5\\\\n\\\\nL =1\\\\np\\\\n\\\\nL = 2, spatially equal data power allocation\\\\np\\\\n\\\\nL = 2, spatially optimal data power allocation\\\\np\\\\n\\\\n3\\\\n\\\\nFig. 6.\\\\n\\\\n*\\\\n\\\\nLp=1\\\\n\\\\n0\\\\n\\\\n0.2\\\\n\\\\n0.4\\\\n0.6\\\\nChannel spatial correlation factor\\\\n\\\\n0.8\\\\n\\\\n1\\\\n\\\\nAverage capacity lower bound C LB in (11) vs. channel spatial correlation factor  for CCF 2  2 systems with a\\\\n\\\\nblock length of L = 20 and SNR of 10 dB. Training length of Lp = 1 and Lp = 2 are shown. For Lp = 2, both spatial\\\\nequal data power allocation (dashed lines) and optimal data power allocation found numerically (solid lines) are shown.\\\\n\\\\nsame as the analytical value computed from Theorem 5. For the beamforming case where Lp = 1,\\\\nwe see that  does not depend on the channel correlation, which agrees with our earlier observation\\\\nfrom Theorem 6. Similar to CGF systems, we have also compared the capacity achieved using \\\\nand that using equal power allocation over pilot and data, and the same trend is observed (results\\\\nare omitted for brevity), that is, capacity gain from optimizing PSAM power factor is around 5% to\\\\n10% at practical SNR.\\\\nIn our proposed transmission scheme for CCF systems, spatially equal power allocation is used\\\\nfor data transmission. Here we illustrate the optimality of this simple scheme in Fig. 6, which shows\\\\nthe average capacity lower bound C LB in (11) versus channel correlation factor  for CCF 2  2\\\\nsystems. We compute the capacity achieved using Lp = 1, and Lp = 2 with spatially equal power\\\\nallocation for data transmission (solid line) and optimal power allocation found numerically (dashed\\\\n\\\\n\\\\fAverage capacity lower bound in bits per channel use\\\\n\\\\n8\\\\n*\\\\np\\\\n\\\\nL =2\\\\n\\\\n7\\\\n6.5\\\\n6\\\\n5.5\\\\nL =1\\\\np\\\\n\\\\n5\\\\n\\\\nL =2\\\\np\\\\n\\\\nLp = 3\\\\n\\\\n4.5\\\\n\\\\nL =4\\\\np\\\\n\\\\n4\\\\n\\\\nFig. 7.\\\\n\\\\n*\\\\np\\\\n\\\\nL =3\\\\n\\\\n7.5\\\\n\\\\n0\\\\n\\\\n0.2\\\\n\\\\n0.4\\\\n0.6\\\\nChannel spatial correlation factor\\\\n\\\\n0.8\\\\n\\\\n1\\\\n\\\\nAverage capacity lower bound C LB in (11) vs. channel spatial correlation factor  for CCF 4  4 systems with a\\\\n\\\\nblock length of L = 20 and SNR = 10 dB. The optimal PSAM power factor  is used in all results.\\\\n\\\\nline) for a block length of L = 20.6 We also indicate the critical  at which Lp changes from 2 to 1\\\\nin Fig. 6. It is clear that the capacity loss from spatially optimal power allocation to spatially equal\\\\npower allocation increases as  increases. At the critical , this capacity loss is only around 1.5%.\\\\nWe also studied the results for different values of block lengths and the same trend was found (results\\\\nare omitted for brevity). These results imply that our proposed transmission scheme is very close to\\\\noptimal provided that the training length is optimized.\\\\nFig. 7 shows the average capacity lower bound C LB in (11) versus the channel correlation factor \\\\nfor CCF 4  4 systems with a block length of L = 20 and SNR of 10 dB. The optimal PSAM power\\\\nfactor  shown in Fig. 5 is used in the capacity computation. Comparing the capacity with different\\\\ntraining lengths, we see that Lp decreases as the channel becomes more correlated. More importantly,\\\\nthe capacity gain from optimizing the training length according to the channel spatial correlation can\\\\nbe significant. For example, the capacity at  = 0.5 using Lp = 4 (which is optimal for i.i.d. channels)\\\\n6\\\\n\\\\nWe see ",
    "Discussion": "that the capacity increases with channel spatial correlation in the case of beamforming, while it is not monotonic\\\\n\\\\nfor Lp = 2. These observations were explained in [22] using Schur-convexity of capacity in the channel correlation.\\\\n\\\\n\\\\fis approximately 6.3 bits per channel use, while the capacity at  = 0.5 using Lp = 2 is around 7\\\\nbits per channel use, that is to say, optimizing training length results in a capacity improvement of\\\\n11% at  = 0.5. Moreover, the capacity improvement increases as channel correlation increases. The\\\\nsame trends are found for different values of block lengths, although the capacity improvement by\\\\noptimizing the training length reduces as the block length increases (results are omitted for brevity).\\\\nTherefore, it is important to numerically optimize the training length for correlated channels at small\\\\nto moderate block lengths.\\\\nFurthermore, one can record the range of  for each value of Lp from Fig. 7, and observe the\\\\nvalue of  in the corresponding range of  in Fig. 5. It can be seen that within the range of  where\\\\na given Lp is optimal, the value of  for the given Lp is a constant given by Theorem 5 provided\\\\nthat PL  1. That is to say, the condition in Theorem 5 (i.e., PL \\\\nPL  1 provided that the training length is optimized.\\\\n\\\\nP Lp\\\\n\\\\n1\\\\ni=1 gi )\\\\n\\\\ncan be simplified to\\\\n\\\\nE. Hybrid CGF and CCF Systems\\\\nAfter studying the optimal transmission and power allocation strategy for CGF systems with i.i.d.\\\\nchannels and CCF system with correlated channels, we provide some discussion on systems utilizing\\\\nboth CGF and CCF with correlated channels. For spatially correlated channels, the optimal training\\\\nfollows a water-filling solution according to the channel covariance, and the optimal data transmission\\\\nfollows a water-filling solution according to the estimated channel gains. The two different waterfilling solutions make the problem of optimizing the PSAM power factor mathematically intractable.\\\\nFurthermore, the optimal training length Lp may be smaller than the number of transmit antennas,\\\\nand needs to be found numerically. However, from the results for CGF systems with i.i.d. channels\\\\nin Section IV and CCF system with correlated channel in Section V, one may expect that a good\\\\nsolution for the optimal PSAM power factor  in the hybrid system is given in Theorem 5.\\\\nVI. S UMMARY\\\\n\\\\nOF\\\\n\\\\nR ESULTS\\\\n\\\\nIn this paper, we have studied block fading MIMO systems with feedback in PSAM transmission\\\\nschemes. Two typical feedback systems are considered, namely the channel gain feedback and the\\\\n\\\\n\\\\fchannel covariance feedback systems. Using an accurate capacity lower bound as the figure of merit,\\\\nwe have provided the solutions for the optimal power allocation to training and data transmission as\\\\nwell as the optimal training length. Table I summarizes the design guidelines for both non-feedback\\\\nsystems and feedback systems.\\\\nTABLE I\\\\nS UMMARY OF D ESIGN G UIDELINES\\\\n\\\\nSystem\\\\n\\\\nChannel\\\\n\\\\nDesign Guidelines\\\\n\\\\nReference\\\\n\\\\n Transmit orthogonal pilots among antennas with spatially equal power.\\\\n Transmit independent data among antennas with spatially equal power.\\\\n\\\\nNoni.i.d.\\\\n\\\\n The optimal PSAM power factor  is given by (12) with  =\\\\n\\\\nfeedback\\\\n\\\\nNt +PL\\\\n.\\\\nPL(1Nt /Ld )\\\\n\\\\n[2, 9]\\\\n\\\\n The optimal training length Lp equals the number of transmit antennas Nt .\\\\ncorrelated\\\\n\\\\n Use the designs for i.i.d. channels as a robust choice.\\\\n\\\\nSec. III-B\\\\n\\\\n Transmit orthogonal pilots with spatially equal power.\\\\n Transmit independent data with spatially equal power in data sub-block 1\\\\nand spatial power water-filling in data sub-block 2 (see Fig. 1).\\\\nCGF\\\\n\\\\ni.i.d.\\\\n\\\\nSec. IV\\\\n Distribute equal power per transmission throughout data sub-blocks 1 and 2.\\\\n  and Lp for non-feedback system are (near) optimal for (delayed) CGF system.\\\\n For a given Lp (Lp  Nt ), transmit pilots along the Lp strongest\\\\neigen-channels with spatial power water-filling according to (20).\\\\n\\\\nCCF\\\\n\\\\ncorrelated\\\\n\\\\n Transmit data along the Lp trained eigen-channels with spatially equal power.\\\\nPLp 1\\\\nd\\\\n, provided that PL  i=1\\\\ngi .\\\\n  is given by (12) with  = L LL\\\\np\\\\n\\\\nSec. V\\\\n\\\\nd\\\\n\\\\n Lp should be numerically optimized.\\\\n For beamforming (i.e., Lp = 1),  is given by (12) with  =\\\\n\\\\n1+gmax PL\\\\n.\\\\ngmax PL(L2)/(L1)\\\\n\\\\nA PPENDIX I\\\\nA M EASURE\\\\n\\\\nOF\\\\n\\\\nC HANNEL S PATIAL C ORRELATION\\\\n\\\\nA vector a = [a1 a2 . . . an ]T is said to be majorized by another vector b = [b1 b2 . . . bn ]T if\\\\nk\\\\nX\\\\ni=1\\\\n\\\\nai \\\\n\\\\nk\\\\nX\\\\ni=1\\\\n\\\\nbi , k = 1, . . . , n  1,\\\\n\\\\nand\\\\n\\\\nn\\\\nX\\\\ni=1\\\\n\\\\nai =\\\\n\\\\nn\\\\nX\\\\ni=1\\\\n\\\\nbi ,\\\\n\\\\n(24)\\\\n\\\\n\\\\fwhere the elements in both vectors are sorted in descending order [26]. We denote the relationship\\\\nas a  b. Any real-valued function , defined on a vector subspace, is said to be Schur-convex, if\\\\na  b implies (a)  (b) [26]. Similarly  is Schur-concave, if a  b implies (a)  (b).\\\\n\\\\nFollowing [20], we have the following definition:\\\\nDefinition 1: Let a contain the eigenvalues of a channel covariance matrix such as Ra, and b\\\\ncontain the eigenvalues of another channel covariance matrix Rb. The elements in both vectors are\\\\nsorted in descending order. Then Ra is less correlated than Rb if and only if a  b.\\\\n\\\\nA PPENDIX II\\\\nP ROOF\\\\n\\\\nOF\\\\n\\\\nT HEOREM 1\\\\n\\\\nThis is a max-min problem where the MSE of the channel estimates is to be minimized by\\\\nX p X p  and to be maximized by RH . We need to show that infXp Xp  supRH tr{RH\\\\n  } is achieved\\\\n\\\\nby orthogonal pilot sequence with equal power allocated among the transmit antennas, i.e., X p X p  =\\\\nPp Lp\\\\nN t I Nt ,\\\\n\\\\nassuming Lp  Nt .\\\\n\\\\nFrom (6) we see that\\\\n 1\\\\n\\\\nsupRH tr{RH\\\\n  }  tr{(I Nt + X p X p )\\\\n\\\\n}=\\\\n\\\\nNt\\\\nX\\\\n\\\\n(1 + pi )1 ,\\\\n\\\\n(25)\\\\n\\\\ni=1\\\\n\\\\nwhere p = [p1 p2 . . . pNt ]T are the eigenvalues of X p X p  . Since the sum of a convex function of\\\\npi is Schur-convex in p [26], we conclude that (25) is Schur-convex in p. Since tr{X p X p  } = Pp Lp ,\\\\n\\\\nwe have\\\\nNt \\\\u0010\\\\nX\\\\nPp Lp \\\\u00111\\\\n1+\\\\nsupRH tr{RH\\\\n,\\\\n } \\\\nNt\\\\n\\\\n(26)\\\\n\\\\ni=1\\\\n\\\\nwhere we have used X p X p  =\\\\n\\\\nPp Lp\\\\nNt I N t .\\\\n\\\\nNote that (26) holds for any X p X p  . On the other hand\\\\n\\\\ninfXp Xp  supRH tr{RH\\\\n } \\\\n=\\\\n\\\\nn\\\\u0010\\\\n\\\\u00111 o\\\\nPp Lp\\\\n+\\\\nsupRH tr R1\\\\nI\\\\n,\\\\nNt\\\\nH\\\\nNt\\\\nNt \\\\u0010\\\\nX\\\\nPp Lp \\\\u00111\\\\n,\\\\ngi1 +\\\\nsupRH\\\\nNt\\\\ni=1\\\\n\\\\n\\\\n\\\\nNt \\\\u0010\\\\nX\\\\n\\\\n1+\\\\n\\\\ni=1\\\\n\\\\nPp Lp \\\\u00111\\\\n,\\\\nNt\\\\n\\\\n(27)\\\\n\\\\n\\\\feff\\\\n3 = \\\\n\\\\n2\\\\n\\\\n4\\\\n\\\\n1\\\\n\\\\nm=1\\\\n\\\\nFig. 8.\\\\n\\\\nm=2\\\\n\\\\nm=3\\\\n\\\\nm=4\\\\n\\\\n\\\\n\\\\nA sketch example of eff v.s. . The vertical dashed lines indicates the values of  at which m changes its value.\\\\n\\\\n1 , 2 , 3 and 4 indicate the local optimal values of  which gives local maximal eff .\\\\n\\\\nwhere (27) is obtained using the Schur-concavity of\\\\nwe conclude that\\\\ninfXp Xp \\\\n\\\\nPNt \\\\u0010 1 Pp Lp \\\\u00111\\\\nin g . From (26) and (27),\\\\ni=1 gi + Nt\\\\n\\\\nNt \\\\u0010\\\\nX\\\\nPp Lp \\\\u00111\\\\n,\\\\n1+\\\\nsupRH tr{RH\\\\n } =\\\\nNt\\\\ni=1\\\\n\\\\nwhich can be achieved by X p X p  =\\\\n\\\\nPp Lp\\\\nN t I Nt .\\\\n\\\\n\\\\u0003\\\\n\\\\nA PPENDIX III\\\\nP ROOF\\\\n2 =\\\\nWith H\\\\n \\\\n\\\\n\\\\u0010\\\\n1+\\\\n\\\\nPp Lp\\\\nNt\\\\n\\\\n\\\\u00111\\\\n\\\\nOF\\\\n\\\\nT HEOREM 3\\\\n\\\\n2 = 1   2 and (2), it can be shown that \\\\n, H\\\\neff ,\\\\n \\\\n\\\\nH\\\\n\\\\n2\\\\nH\\\\n Pd\\\\n2\\\\n1+H\\\\n  Pd\\\\n\\\\nis a\\\\n\\\\nconcave function of   [0, 1]. Also, m is discrete and non-decreasing on   [0, 1] as the number\\\\nof active eigen-channel cannot decrease as the data transmission power increases. Here we show a\\\\nsketch plot of eff versus  in Fig. 8 to visualize the proof. From (16) we see that CLB is maximized\\\\nwhen eff reaches its maximum for any fixed m. Therefore, we will have 1 , 2 , 3 and 4 as the\\\\nlocal optimal points in Fig. 8 which maximize CLB in corresponding regions of . From the property\\\\nof water-filling solution in (14), we know that qi is continuous on Pd and hence, is continuous on\\\\n  [0, 1]. Therefore, CLB in (13) is continuous on   [0, 1]. This implies that CLB is continuous\\\\n\\\\nacross the boundaries of different regions of , indicated by the dashed lines in Fig. 8. Consequently,\\\\n\\\\n\\\\fthe global optimal point 3 =  which maximizes eff in Fig. 8 is also the global optimal point\\\\nwhich maximizes CLB . It is noted that the objective function eff is the same as that in non-feedback\\\\nsystems given in [9]. Therefore, the solution of  coincides with the solution for non-feedback\\\\nsystems given in (12). \\\\u0003\\\\n\\\\nA PPENDIX IV\\\\nP ROOF\\\\nWe let eff ,\\\\n\\\\n2\\\\nH\\\\n Pd\\\\n,\\\\n2\\\\n1+H\\\\n  Pd\\\\n\\\\nPm\\\\n\\\\ni\\\\ni=1 ln m ,\\\\n\\\\ny=\\\\n\\\\nOF\\\\n\\\\nand z =\\\\n\\\\nin (11) can be rewritten using (16) as\\\\nC LB =\\\\n\\\\nT HEOREM 4\\\\nPm\\\\n\\\\n1\\\\ni=1 i .\\\\n\\\\nThen the average capacity lower bound\\\\n\\\\nLd 1\\\\nE{m ln(eff + z) + y}.\\\\nL ln 2\\\\n\\\\nDifferentiating C LB w.r.t., Ld for any fixed m gives\\\\ndC LB\\\\ndLd\\\\n\\\\n=\\\\n\\\\nLd deff\\\\n1 m\\\\u0010 n\\\\ny o\\\\u0011\\\\nE ln(eff + z) +\\\\n.\\\\n+\\\\nln 2 L\\\\neff + z dLd\\\\nm\\\\n\\\\nSimilar to [9], we need to show that\\\\n\\\\ndC LB\\\\ndLd\\\\n\\\\n(28)\\\\n\\\\n> 0. It can be shown that C LB is continuous on Ld\\\\n\\\\n(treating Ld as a positive real-valued variable) regardless the value of m. Therefore, the value of m\\\\ndoes not cause any problem in the proof.\\\\nHere we consider the case where Ld > Nt and omit the cases Ld = Nt and Ld < Nt which can be\\\\nhandled similarly. Taking the derivative of eff w.r.t., Ld with some algebraic manipulation, we have\\\\ns\\\\n!\\\\neff\\\\ndeff\\\\nNt (Nt + PL)\\\\n.\\\\n(29)\\\\n= \\\\n1\\\\ndLd\\\\nL d  Nt\\\\nLd (Ld + PL)\\\\nSubstituting (29) into (28), we get\\\\ndC LB\\\\n1 m\\\\n=\\\\ndLd\\\\nln 2 L\\\\n\\\\nE\\\\n\\\\nn\\\\n\\\\neff\\\\nLd\\\\nln(eff + z) \\\\neff + z Ld  Nt\\\\n\\\\n1\\\\n\\\\ns\\\\n\\\\nNt (Nt + PL)\\\\nLd (Ld + PL)\\\\n\\\\n!\\\\n\\\\n!\\\\nyo\\\\n+\\\\n.\\\\nm\\\\n\\\\nWith Ld > Nt , it can be shown that\\\\nLd\\\\nLd  Nt\\\\n\\\\n1\\\\n\\\\ns\\\\n\\\\nNt (Nt + PL)\\\\nLd (Ld + PL)\\\\n\\\\n!\\\\n\\\\n< 1.\\\\n\\\\nTherefore, it suffices to show that\\\\nn\\\\nE ln(eff + z) \\\\n\\\\neff\\\\nyo\\\\n 0.\\\\n+\\\\neff + z m\\\\n\\\\n(30)\\\\n\\\\n\\\\fFurthermore, one can show that\\\\nn\\\\neff\\\\nd\\\\nyo\\\\neff\\\\n=\\\\n+\\\\nE ln(eff + z) \\\\n0\\\\ndeff\\\\neff + z m\\\\n(eff + z)2\\\\n\\\\nfor any fixed m. Therefore, we only need to show (30) holds at eff = 0, that is\\\\nm\\\\nm\\\\nn X\\\\nn\\\\n1 X i o\\\\nyo\\\\n1\\\\n+\\\\n= E ln\\\\n,\\\\nln\\\\nE ln z +\\\\ni\\\\nm\\\\nm\\\\nm\\\\ni=1\\\\n\\\\ni=1\\\\n\\\\nm\\\\nm\\\\nn1 X\\\\n1\\\\n1 X i o\\\\n,\\\\nln i +\\\\nln\\\\n E\\\\nm\\\\nm\\\\nm\\\\nm\\\\n\\\\n= E\\\\n\\\\nn\\\\n\\\\ni=1\\\\n1\\\\ni\\\\n\\\\n(31)\\\\n\\\\ni=1\\\\n\\\\ni o\\\\nln\\\\n= 0,\\\\nm m\\\\n\\\\nwhere (31) is obtained using the concavity of ln(). Therefore, we conclude that\\\\n\\\\ndC LB\\\\ndLd\\\\n\\\\n> 0, which\\\\n\\\\nimplies the training length should be kept minimum, i.e., Lp = Nt . \\\\u0003\\\\n\\\\nA PPENDIX V\\\\nP ROOF\\\\n\\\\nOF\\\\n\\\\nT HEOREM 5\\\\n\\\\nFor any positive definite matrix A, log2 |A| is increasing in A [26]. Also, for any positive semi1 P )1 is a positive\\\\n H\\\\n 0 B is a positive definite matrix [2]. Since G\\\\n Q(1+\\\\n\\\\ndefinite matrix B , I + H\\\\nd\\\\n0\\\\n\\\\nsemi-definite matrix, the capacity lower bound in (22) is maximized when the diagonal entries of\\\\n Q(1\\\\n + 1 Pd )1 are maximized.\\\\nG\\\\n Q(1\\\\n + 1 Pd )1 is given by\\\\nThe ith non-zero diagonal entry of G\\\\neff,i =\\\\n\\\\n(gi  1 )Pd\\\\ngi Pp Pd + Pd (y  gi1 )\\\\n,\\\\n=\\\\n(1 + 1 Pd )Lp\\\\nLp\\\\nPp + Pd + y\\\\n\\\\nwhere we have used (20) and let y =   Pp =\\\\nsome algebraic manipulation, we get\\\\neff,i =\\\\n\\\\n1\\\\nLp\\\\n\\\\nPLp\\\\n\\\\n1\\\\ni=1 gi .\\\\n\\\\n(32)\\\\n\\\\nSubstituting  from (2) into (32) with\\\\n\\\\nLp\\\\n(1  ) +  PL\\\\n(y  gi1 )\\\\ngi PL\\\\n.\\\\nLp (Ld  Lp )\\\\n + PL+Lp y\\\\n\\\\n(33)\\\\n\\\\nPL(1Lp /Ld )\\\\n\\\\nHere we consider the case where Ld > Lp and omit the cases Ld = Lp and Ld < Lp which can be\\\\nhandled similarly. It can be shown that eff,i in (33) is concave in   (0, 1). Therefore, the optimal\\\\n occurs at\\\\nz=\\\\n\\\\nLp\\\\nPL (y\\\\n\\\\ndeff,i\\\\nd\\\\n\\\\n= 0, which is the root to 2  2 +  + z = 0, where  =\\\\n\\\\nPL+Lp y\\\\nPL(1Lp /Ld )\\\\n\\\\nand\\\\n\\\\n gi1 ). It is clear that  depends on gi through z . Therefore, there is no unique  which\\\\n\\\\n\\\\fmaximizes all eff,i . However, this dependence disappears when PL  Lp y =\\\\ncondition, one can show that  \\\\n\\\\nLd\\\\nLd Lp\\\\n\\\\nP Lp\\\\n\\\\n1\\\\ni=1 gi .\\\\n\\\\nUnder this\\\\n\\\\nand z  0. And there exists a unique solution of  which\\\\n\\\\n Q(1\\\\n + 1 Pd )1 , given by\\\\nmaximizes all the diagonal entries of G\\\\n =  \\\\n\\\\np\\\\n\\\\n(  1), where  =\\\\n\\\\nLd\\\\n. \\\\u0003\\\\nLd  Lp\\\\n\\\\nR EFERENCES\\\\n[1] G. J. Foschini and M. J. Gans, On the limits of wireless communications in a fading environment when using multiple\\\\nantennas, Wireless Pers. Commun., vol. 6, no. 3, pp. 311335, Mar. 1998.\\\\n[2] I. E. Telatar, Capacity of multi-antenna Gaussian channels, Eur. Trans. Telecomm., vol. 10, no. 6, pp. 585595, Nov.\\\\n1999.\\\\n[3] T. M. Cover and J. A. Thomas, Elements of Information Theory, 2nd ed.\\\\n\\\\nNew Jersey: Wiley, 2006.\\\\n\\\\n[4] E. Visotsky and U. Madhow, Space-time transmit precoding with imperfect feedback, IEEE Trans. Inform. Theory,\\\\nvol. 47, no. 6, pp. 26322639, Sept. 2001.\\\\n[5] S. A. Jafar and A. Goldsmith, Transmitter optimization and optimality of beamforming for multiple antenna systems,\\\\nIEEE Trans. Wireless Commun., vol. 3, no. 4, pp. 11651175, July 2004.\\\\n[6] E. A. Jorswieck and H. Boche, Channel capacity and capacity-range of beamforming in MIMO wireless systems\\\\nunder correlated fading with covariance feedback, IEEE Trans. Wireless Commun., vol. 3, no. 5, pp. 15431553, Sept.\\\\n2004.\\\\n[7] J. C. Roh and B. D. Rao, Multiple antenna channels with partial channel state information at the transmitter, IEEE\\\\nTrans. Wireless Commun., vol. 3, no. 2, pp. 677688, Mar. 2004.\\\\n[8] J. Li and Q. T. Zhang, Transmitter optimization for correlated MISO fading channels with generic mean and covariance\\\\nfeedback, IEEE Trans. Wireless Commun., vol. 7, no. 9, pp. 33123317, Sept. 2008.\\\\n[9] B. Hassibi and M. Hochwald, How much training is needed in multiple-antenna wireless links? IEEE Trans. Inform.\\\\nTheory, vol. 49, no. 4, pp. 951963, Apr. 2003.\\\\n[10] T. Yoo and A. Goldsmith, Capacity and power allocation for fading MIMO channels with channel estimation error,\\\\nIEEE Trans. Inform. Theory, vol. 52, no. 5, pp. 22032214, May 2006.\\\\n[11] S. M. Redl, M. K. Weber, and M. W. Oliphan, An introduction to GSM, 1st ed.\\\\n\\\\nBoston: Artech House, 1995.\\\\n\\\\n[12] J. K. Cavers, An analysis of pilot symbol assisted modulation for Rayleigh fading channels, IEEE Trans. Veh.\\\\nTechnol., vol. 40, no. 4, pp. 686693, Nov. 1991.\\\\n[13] V. Pohl, P. H. Nguyen, V. Jungnickel, and C. Helmolt, Continuous flat-fading MIMO channels: Achievable rate and\\\\noptimal length of the training and data phases, IEEE Trans. Wireless Commun., vol. 4, no. 4, pp. 18891900, July\\\\n2005.\\\\n\\\\n\\\\f[14] X. Zhou, T. A. Lamahewa, P. Sadeghi, and S. Durrani, Designing PSAM schemes: how optimal are SISO pilot\\\\nparameters for spatially correlated SIMO? in Proc. IEEE PIMRC, Sept. 2008.\\\\n[15] J. H. Kotecha and A. M. Sayeed, Transmit signal design for optimal estimation of correlated MIMO channels, IEEE\\\\nTrans. Signal Processing, vol. 52, no. 2, pp. 546557, Feb. 2004.\\\\n[16] M. Biguesh and A. B. Gershman, Training-based MIMO channel estimation: a study of estimator tradeoffs and\\\\noptimal training signals, IEEE Trans. Signal Processing, vol. 54, no. 3, pp. 884893, Mar. 2006.\\\\n[17] J. Pang, J. Li, L. Zhao, and Z. Lu, Optimal training sequences for MIMO channel estimation with spatial correlation,\\\\nin Proc. IEEE VTC, Oct. 2007, pp. 651655.\\\\n[18] J. Pang, J. Li, and L. Zhao, Optimal training length for MIMO systems with transmit antenna correlation, in Proc.\\\\nIEEE WCNC, Mar. 2008, pp. 425429.\\\\n[19] C. Chuah, D. Tse, J. Kahn, and R. Valenzuela, Capacity scaling in MIMO wireless systems under correlated fading,\\\\nIEEE Trans. Inform. Theory, vol. 48, no. 3, pp. 637650, Mar. 2002.\\\\n[20] E. A. Jorswieck and H. Boche, Optimal transmission strategies and impact of correlation in multiantenna systems\\\\nwith different types of channel state information, IEEE Trans. Signal Processing, vol. 52, no. 12, pp. 34403453,\\\\nDec. 2004.\\\\n[21] S. M. Kay, Fundamentals of Statistical Signal Processing: Estimation Theory.\\\\n\\\\nPrentice hall, 1993.\\\\n\\\\n[22] X. Zhou, T. A. Lamahewa, P. Sadeghi, and S. Durrani, Capacity of MIMO systems: Impact of spatial correlation\\\\nwith channel estimation errors, in Proc. IEEE ICCS, Nov. 2008.\\\\n[23] S. Boyd and L. Vandenberghe, Convex Optimization, 1st ed.\\\\n\\\\nCambridge: Cambridge University Press, 2004.\\\\n\\\\n[24] E. Baccarelli, M. Biagi, and C. Pelizzoni, On the information throughput and optimized power allocation for MIMO\\\\nwireless systems with imperfect channel estimation, IEEE Trans. Signal Processing, vol. 53, no. 7, pp. 23352347,\\\\nJuly 2005.\\\\n[25] T. Yoo, E. Yoon, and A. Goldsmith, MIMO capacity with channel uncertainty: Does feedback help? in Proc. IEEE\\\\nGlobecom., vol. 1, May 2004, pp. 96100.\\\\n[26] A. W. Marshall and I. Olkin, Inequalities: Theory of Majorization and Its Applications.\\\\n\\\\nAcademic Press, 1979.\\\\n\\\\n\\\\f\"}\\n'"
  },
  "key_words": {
    "Abstract": [
      [
        "mimo systems feedback",
        0.6303
      ],
      [
        "output mimo systems",
        0.5754
      ],
      [
        "mimo training design",
        0.5695
      ],
      [
        "training based mimo",
        0.5488
      ],
      [
        "mimo systems",
        0.5413
      ]
    ],
    "Introduction": [
      [
        "ccf systems optimal",
        0.5896
      ],
      [
        "optimal transmission",
        0.5316
      ],
      [
        "ccf systems derive",
        0.5297
      ],
      [
        "optimal transmission strategy",
        0.5216
      ],
      [
        "ccf systems",
        0.5182
      ]
    ],
    "Related Work": [
      [
        "mimo information capacity",
        0.6532
      ],
      [
        "mimo channel information",
        0.627
      ],
      [
        "channel estimates transmitter",
        0.6002
      ],
      [
        "channel information",
        0.5991
      ],
      [
        "mimo communication",
        0.5981
      ]
    ],
    "Methodology": [
      [
        "ergodic capacity channel",
        0.5777
      ],
      [
        "ergodic capacity upper",
        0.5202
      ],
      [
        "bound ergodic capacity",
        0.5027
      ],
      [
        "ergodic capacity lower",
        0.4892
      ],
      [
        "ergodic capacity",
        0.4757
      ]
    ],
    "Experiment": [
      [
        "gain optimizing psam",
        0.5379
      ],
      [
        "investigate optimal psam",
        0.5133
      ],
      [
        "temporal power allocation",
        0.5028
      ],
      [
        "provided optimal psam",
        0.5024
      ],
      [
        "optimal systems channel",
        0.4975
      ]
    ],
    "Discussion": [
      [
        "channel capacity",
        0.6295
      ],
      [
        "capacity channel correlation",
        0.6274
      ],
      [
        "channel capacity capacity",
        0.6178
      ],
      [
        "capacity increases channel",
        0.6177
      ],
      [
        "convexity capacity channel",
        0.6082
      ]
    ]
  },
  "summarization": {
    "Abstract": "Study the optimal training and data transmission strategies for block fading systems with feedback. Findings are important for practical MIMO training design, the authors say. For more, go to: http://www.narXiv.org/rnx/0903.0443.",
    "Introduction": "an optimal training length can be less than the number of transmit antennas. We propose a simple yet near optimal transmission strategy for CCF systems. We derive the optimal temporal power allocation over pilot and data transmission.    The paper was presented at the 2008 IEEE International Conference on Communication Systems.",
    "Related Work": "This paper presents a lower bound on the optimal design of pilot parameters for MIMO communication systems with feedback at the transmitter. We show the optimal power allocation to pilot and data symbols and the optimal training length for each channel. We also show that the optimal data transmission strategies can be found for non-feedback systems.",
    "Methodology": "an upper bound on the ergodic capacity per channel use is given in [10] The optimal transmission strategy is to transmit orthogonal data to antenna during transmission. The optimal pilot and data transmission scheme and optimal power allocation for spatially correlated i.d. channels were studied.",
    "Experiment": "numerical results validate the optimality of the transmission strategy in Corollary 1. The capacity gain from optimizing the PSAM power factor is around 5% to 10% at practical SNR for delayed CGF systems. We show the average capacity lower bound C LB in (11) versus SNR P for delayless CGF.",
    "Discussion": "that the capacity increases with channel spatial correlation in the case of beamforming. The capacity improvement increases as channel correlation increases, but it is not monotonic. We present the optimal power allocation strategy for CGF and CCF systems with correlated channels. We also present the design guidelines for block fading MIMO with feedback in PSAM transmission."
  }
}