{
  "sections": {
    "Abstract": "b'{\"search-keyword: clean-text| displaying exact matches\":\"Symposium on Theoretical Aspects of Computer Science 2010 (Nancy, France), pp. 645-656\\\\nwww.stacs-conf.org\\\\n\\\\narXiv:1001.0735v2 [cs.LO] 3 Feb 2010\\\\n\\\\nNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n1\\\\n \\\\nLUTZ SCHRODER\\\\nAND DIRK PATTINSON 2\\\\n1\\\\n\\\\nDFKI Bremen and Department of Computer Science, Universit at Bremen\\\\nE-mail address: Lutz.Schroeder@dfki.de\\\\n\\\\n2\\\\n\\\\nDepartment of Computing, Imperial College London\\\\nE-mail address: dirk@doc.ic.ac.uk\\\\nA BSTRACT. Hybrid logic extends modal logic with support for reasoning about individual states,\\\\ndesignated by so-called nominals. We study hybrid logic in the broad context of coalgebraic semantics, where Kripke frames are replaced with coalgebras for a given functor, thus covering a wide range\\\\nof reasoning principles including, e.g., probabilistic, graded, default, or coalitional operators. Specifically, we establish generic criteria for a given coalgebraic hybrid logic to admit named canonical\\\\nmodels, with ensuing completeness proofs for pure extensions on the one hand, and for an extended\\\\nhybrid language with local binding on the other. We instantiate our framework with a number of\\\\nexamples. Notably, we prove completeness of graded hybrid logic with local binding.\\\\n\\\\n",
    "Introduction": "Introduction\\\\nModal logics have traditionally played a central role in Computer Science, appearing, e.g., in the\\\\nguise of temporal logics, program logics such as PDL, epistemic logics, and later as description\\\\nlogics. The development of modal logics has seen extensions along (at least) two axes: the enhancement of the expressive power of basic (relational) modal logic on the one hand, and the continual\\\\nextension, beyond the purely relational realm, of the class of structures described using modal logics\\\\non the other hand. Hybrid logic falls into the first category, extending modal logic with the ability\\\\nto reason about individual states in models. This feature, originally suggested by Prior and first\\\\nstudied in the context of tense logics and PDL (see [5] for references), is of particular relevance in\\\\nknowledge representation languages and as such has found its way into modern description logics,\\\\nwhere it is de",
    "Related Work": "noted by the letter O in the standard naming scheme [2].\\\\nExtensions along the second axis  semantics beyond Kripke structures and neighbourhood\\\\nmodels  include various probabilistic modal logics, interpreted over probabilistic transition systems, graded modal logic over multigraphs [8], conditional logics over selection function frames [6],\\\\nand coalition logic [17], interpreted over so-called game frames. As a unifying semantic bracket\\\\ncovering all these logics and many further ones, coalgebraic modal logic has emerged ([7] gives a\\\\nsurvey). The scope of coalgebraic modal logic has recently been expanded to encompass nominals;\\\\nwe refer to the arising class of logics as coalgebraic hybrid logics. Existing results include a finite\\\\n1998 ACM Subject Classification: F.4.1 [Mathematical Logic and Formal Languages]: Mathematical Logic  modal\\\\nlogic; I.2.4 [Artificial Intelligence]: Knowledge Representation Formalisms and ",
    "Methodology": "Methods  modal logic, representation\\\\nlanguages.\\\\nKey words and phrases: Logic in computer science, semantics, deduction, modal logic, coalgebra.\\\\n\\\\nc L. Schroder\\\\n \\\\n\\\\nand D. Pattinson\\\\nCC\\\\n\\\\nCreative Commons Attribution-NoDerivs License\\\\n\\\\n\\\\f \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n646\\\\n\\\\nmodel result, an internalized tableaux calculus, and generic PSPACE upper bounds, but are so\\\\nfar limited to logics that exclude frame conditions and local binding [14]. What is missing from\\\\nthis picture technically is a theory of named canonical models [5]. Named canonical models yield\\\\nnot only strong completeness of the basic hybrid logic, but also completeness of pure extensions,\\\\ndefined by axioms that do not contain propositional variables (but may contain nominals; e.g. in\\\\nKripke semantics, the pure axiom i  i, with i a nominal, defines transitive frames). Moreover, named canonical models establish completeness for an extended hybrid language with a local\\\\nbinding operator  x. (x), read as the current state x satisfies (x). Both pure extensions and the\\\\nlanguage with  (not addressed in [14]) are, in general, undecidable [1] (it should be noted, however,\\\\nthat fragments of the language with  over Kripke frames are decidable and as such play a role, e.g.,\\\\nin conjunctive query answering in description logic [11]). As a consequence, completeness of pure\\\\nextensions and local binding is the best we can hope for  it establishes recursive enumerability of\\\\nthe set of valid formulas, and it enables automated reasoning, if not decision procedures.\\\\nSpecifically, we establish two separate criteria for the existence of named models. Although\\\\nthese criteria are (in all likelihood necessarily) less widely applicable than some previous coalgebraic results including those of [14], the generic results allow us to establish new completeness\\\\nresults for a wide variety of logics; in particular, we prove strong completeness of graded hybrid\\\\nlogic, and ultimately an extension of the description logic SHOQ, with the  binder over a wide\\\\nvariety of frame classes.\\\\n\\\\n1. Coalgebraic Hybrid Logic\\\\nTo make our treatment parametric in the syntax, we fix a modal similarity type  consisting of\\\\nmodal operators with associated arities throughout. For given countably infinite and disjoint sets\\\\nP of propositional variables and N of nominals, the set () of hybrid -formulas is given by the\\\\ngrammar\\\\n()  ,  ::= p | i |    |  | (1 , . . . , n ) | @i \\\\nwhere p  P, i  N and    is an n-ary modal operator. (Alternatively, we could regard propositional variables as nullary modal operators, thus avoiding their explicit mention altogether. We keep\\\\nthem explicit here, following standard practice in modal logic, as we have to deal with valuations\\\\nanyway due to the presence of nominals.) We use the standard definitions for the other propositional\\\\nconnectives , , . The set of nominals occurring in a formula  is denoted by N(), similarly\\\\nfor sets of formulas. A formula of the form @i  is called an @-formula. Semantically, nominals i\\\\ndenote individual states in a model, and @i  stipulates that  holds at state i.\\\\nTo reflect parametricity also semantically, we equip hybrid logics with a coalgebraic semantics\\\\nextending the standard coalgebraic semantics of modal logics [16]: we fix throughout a -structure\\\\nconsisting of an endofunctor T : Set  Set on the category of sets, together with an assignment\\\\nof an n-ary predicate lifting JK to every n-ary modal operator   , i.e. a set-indexed family of\\\\nmappings (JKX : P(X)n  P(T X))XSet that satisfies\\\\nJKX  (f 1 )n = (T f )1  JKY\\\\nfor all f : X  Y . In categorical terms, [[]] is a natural transformation Qn  Q  T op where\\\\nQ : Setop  Set is the contravariant powerset functor.\\\\nIn this setting, T -coalgebras play the roles of frames. A T -coalgebra is a pair (C, ) where\\\\nC is a set of states and  : C  T C is the transition function. When  is clear from the context,\\\\nwe refer to (C, ) just as C. A (hybrid) T -model M = (C, , V ) consists of a T -coalgebra (C, )\\\\ntogether with a hybrid valuation V , i.e. a map P  N  P(C) that assigns singleton sets to all\\\\n\\\\n\\\\fNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n\\\\n647\\\\n\\\\nnominals i  N. We say that M is based on the frame (C, ). The singleton set V (i) is tacitly\\\\nidentified with its unique element.\\\\nThe semantics of F() is a satisfaction relation |= between states c  C in hybrid T -models\\\\nM = (C, , V ) and formulas   (), inductively defined as follows. For x  N  P and i  N,\\\\nM, c |= x iff c  V (x)\\\\n\\\\nand\\\\n\\\\nM, c |= @i  iff M, V (i) |= .\\\\n\\\\nModal operators are interpreted using their associated predicate liftings, that is,\\\\nM, c |= (1 , . . . , n )  (c)  JKC (J1 KM , . . . , Jn KM )\\\\nwhere    is n-ary and JKM = {c  C | M, c |= } denotes the truth-set of  relative to M .\\\\nWe write M |=  if M, c |=  for all c  C. For a set   () of formulas, we write M, c |=  if\\\\nM, c |=  for all   , and M |=  if M |=  for all   . We say that  is satisfiable in a model\\\\nM if there exists a state c in M such that M, c |= . If A  () is a set of axioms, also referred to\\\\nas frame conditions, a frame (C, ) is an A-frame if (C, , V ) |=  for all hybrid valuations V and\\\\nall   A, and a model is an A-model if it is based on an A-frame. A frame condition is pure if it\\\\ndoes not contain any propositional variables (it may however contain nominals). We recall notation\\\\nfrom earlier work:\\\\nNotation 1. As usual, application of substitutions  : P  () to formulas  is denoted .\\\\nFor a set  of formulas and a set O of operators, we write O or O() for the set of formulas\\\\narising by prefixing elements of  with an operator from O; e.g. () = {(1 , . . . , n ) |  \\\\n n-ary, 1 , . . . , n  } and @ := {@i | i  N}() = {@i  | i  N,   }. Moreover,\\\\nProp(Z) denotes the set of propositional combinations of elements of some set Z. For   Prop(Z),\\\\nwe write X,  |=  if  evaluates to  in the boolean algebra P(X) under a valuation  : Z \\\\nP(X). For   Prop((Z)), the interpretation JKT X, of  in the boolean algebra P(T X) under\\\\n is the inductive extension of the assignment J(p1 , . . . , pn )KT X, = JKX ( (p1 ), . . . ,  (pn )).\\\\nWe write T X,  |=  if JKT X, = T X, and t T\\\\n|=T X,  if t  JKT X, . A set of formulas\\\\n  Prop((Z)) is one-step satisfiable w.r.t.  if  JKT X, 6= . We occasionally apply this\\\\nnotation to sets Z  P(X) with  being just inclusion, in which case mention of  is suppressed.\\\\nIn the sequel, we will be interested in both local and global semantic consequence, where local\\\\nconsequence refers to satisfaction in a single state and global consequence to satisfaction in entire\\\\nmodels. In fact, we consider local reasoning under global assumptions: given a set   () of\\\\nglobal assumptions (a TBox in description logic terminology) and a class C of models, we say that\\\\n is a local consequence of  under global assumptions  for C-models, in symbols ;  |=C ,\\\\nif for all M  C such that M |= , M, c |=  whenever M, c |=  (here, both  and  are\\\\nsets of arbitrary formulas, in particular not subject to any restrictions on the nesting depth of modal\\\\noperators). The standard notions of local and global consequence are regained from this general\\\\ndefinition by taking  or  to be empty, respectively.\\\\nThe distinguishing feature of the coalgebraic approach to hybrid and modal logics is the parametricity in both the logical language and the notion of frame: concrete instantiations of the general\\\\nframework, in other words a choice of modal operators  and a -structure T , capture the syntax\\\\nand semantics of a wide range of modal logics, as witnessed by the following examples.\\\\nExamples 1.1.\\\\n1. The hybrid version of the modal logic K, hybrid K for short, has a single\\\\nunary modal operator \\\\u0003, interpreted over the structure consisting of the powerset functor P (which\\\\ntakes a set X to its powerset P(X)) and the predicate lifting J\\\\u0003KX (A) = {B  P(X) | B  A}.\\\\nIt is clear that P-coalgebras (C,  : C  P(C)) are in 1-1 correspondence with Kripke frames, and\\\\nthat the coalgebraic definition of satisfaction specializes to the usual semantics of the box operator.\\\\n\\\\n\\\\f648\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n2. Graded hybrid logic has modal operators k in more than k successors, it holds that. It is\\\\ninterpreted over the functor B that P\\\\ntakes a set X to the set B(X) = X  N  {} of multisets over\\\\nX by [[k ]]X (A) = {B  B(X) | xA B(x) > k}. This captures the semantics of graded modalities over multigraphs [8], which are precisely the B-coalgebras. A more\\\\nPgeneral set of operators\\\\nis that of Presburger logic [9], which admits integer linear inequalities\\\\nai  #(i )  k among\\\\nformulas. Unlike in the purely modal case [19], hybrid multigraph semantics visibly differs from\\\\nthe more standard Kripke semantics of graded modalities, as the latter validates all formulas 1 i,\\\\ni  N. However, both semantics agree if we additionally stipulate 1 i as a global (pure) axiom.\\\\nThus, our completeness results for multigraph semantics derived below do transfer to Kripke semantics. In particular they apply to many description logics, which commonly feature both nominals\\\\nand graded modal operators in the guise of qualified number restrictions.\\\\n3. Hybrid CK , the hybrid extension of the basic conditional logic CK , has a single binary\\\\nmodal operator , written in infix notation. Hybrid CK is interpreted over the functor Cf that\\\\nmaps a set X to the set P(X)  P(X), whose coalgebras are selection function models [6], by\\\\nputting [[]]X (A, B) = {f : P(X)  P(X) | f (A)  B}.\\\\n4. Classical hybrid logic (the hybrid version of the logic E of neighbourhood frames, referred to\\\\nas (the minimal) classical modal logic in [6]) has a single, unary modal operator \\\\u0003 and is interpreted\\\\nover neighbourhood frames, that is, coalgebras for the functor N X = P(P(X)) (more precisely,\\\\nthe double contravariant powerset functor). The semantics of classical modal logic is defined by\\\\nthe lifting J\\\\u0003KX (A) = {S  N X | A  S}. Monotone hybrid logic has the same similarity\\\\ntype, but is interpreted over upwards closed neighbourhood frames, or coalgebras for the functor\\\\nM X = {S  N X | S upwards closed} where upwards closure refers to subset inclusion.\\\\n5. The syntax of coalition logic over a set N of agents is given by the similarity type {[C] | C \\\\nN }, and the operator [C] reads as coalition C has a joint strategy to enforce . . . . The formulas of\\\\n(hybrid) coalition logic are interpreted over game frames, i.e., coalgebras for the functor\\\\nQ\\\\nQ\\\\nG(X) = {(f, (Si )iN ) | iN Si 6= , f : iN Si  X}\\\\n(a class-valued functor, technically speaking, which however does not cause problems). The semantics arises via the liftings\\\\nJ[C]KX (A) = {(f, (Si )iN )  G(X) | (si )iC (si )iN \\\\\\\\C (f ((si )iN )  A}.\\\\nWe proceed to present a Hilbert-style proof system for coalgebraic hybrid logics, which we prove\\\\nto be sound and strongly complete. This requires that the logic at hand satisfies certain coherence\\\\nconditions between the axiomatization and the semantics  in fact the same conditions as in the\\\\npurely modal case, which are easily verified local properties that can be verified without reference\\\\nto T -models and are already known to hold for a large variety of logics [16, 19].\\\\nProof systems for coalgebraic logics are most conveniently described in terms of one-step rules,\\\\nas follows.\\\\nDefinition 1.2. A one-step rule over  is a rule / where   Prop(P) and   Prop((P))\\\\n(in fact,  may be restricted to be a disjunctive clause, which however is not relevant here). The\\\\nrule / is one-step sound if T X,  |=  whenever X,  |=  for a valuation  : P  P(X).\\\\nGiven a set R of one-step rules and a valuation  : P  P(X), a set   Prop((P)) is one-step\\\\nconsistent [20] if the set   { |  : P  Prop(P); /  R; X,  |= } is propositionally\\\\nconsistent.\\\\nOne-step sound rules are sound, and we will assume one-step soundness tacitly in the sequel. Completeness hinges on variants of the notion of one-step completeness [19], which we define further\\\\n\\\\n\\\\fNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n\\\\n649\\\\n\\\\nbelow. As the notion of one-step rule does not involve hybrid features, suitable rule sets can just be\\\\ninherited from the corresponding modal systems; for graded logics, conditional logics, and many\\\\nothers, such rule sets are found, e.g., in [22, 21]. We recall that the one-step complete rule set for\\\\n(hybrid) K consists of the rules\\\\nabc\\\\na\\\\n.\\\\n\\\\u0003a\\\\n\\\\u0003a  \\\\u0003b  \\\\u0003c\\\\nA set R of one-step rules now gives rise to a Hilbert system LR by adjoining propositional tautologies and the hybrid axioms, and closing under modus ponens, rule application, and @-necessitation.\\\\nFormally, we write  LR  for a set  of formulas, the global assumptions (or the TBox), and a\\\\nformula  if  is contained in the smallest set that\\\\n contains  and all instances of propositional tautologies\\\\n contains all instances of @-introduction i    @i  and make-or-break\\\\n(mob) @i p  ((q1 , . . . , qn )  (@i p  q1 , . . . , @i p  qn ))\\\\ntogether with all instances of the axioms @i , @i   @i , @i (  )  (@i  \\\\n@i )), @i i, @i j  @j i, @i k  @j p  @i p; and\\\\n is closed under instances of @-generalization p/@i p, instances of rules in R, and modus\\\\nponens.\\\\nThe second group of axioms ensures that i  j : @i j defines an equivalence relation on nominals\\\\nand that @i distributes over propositional connectives. The (mob) axiom captures the fact that the\\\\ntruth set of an @-formula is either empty or the whole model; in the case of hybrid K, it is equivalent\\\\nto the standard back axiom @i   \\\\u0003@i .\\\\nWe write ;  LR  if there are 1 , . . . , n   such that  LR 1      n  .\\\\nThat is, ;  LR  if there is a proof of  from global assumptions  that additionally assumes\\\\n locally. As we assume that all one-step rules in R are one-step sound, soundness for both local\\\\nand global consequence is immediate: we have ;  |=C  (for C the class of all models) whenever\\\\n;  LR . In [14], a criterion has been given for LR to be weakly complete, i.e. complete for\\\\nthe case where both the TBox  and the set  of local assumptions are empty. Here, we extend\\\\nthis result to combined strong global and strong local completeness, i.e. to cover both an arbitrary\\\\nTBox and an arbitrary set of local assumptions, even if LR is extended with pure frame conditions\\\\nand local binding.\\\\n\\\\n2. Strong Completeness of Pure Extensions\\\\nPure completeness is a celebrated result in hybrid logic [3, Chapter 7.3]. In a nutshell, adding\\\\npure axioms to an already complete proof system for the hybrid extension of the modal logic K\\\\n(Example 1.1), one retains completeness with respect to the class of frames that satisfy the additional\\\\naxioms. In contrast to arbitrary modal axioms, pure axioms do not contain propositional variables,\\\\nand therefore define  in the classical setting of hybrid K  first-order frame conditions. Here, we\\\\nshow that the same theorem is valid for a much larger class of logics, namely all coalgebraic hybrid\\\\nlogics satisfying one of two suitable sets of conditions. For the sake of readability, we restrict\\\\nthe technical development (not the examples) to the case of unary operators from now on until\\\\nSection 2.2.\\\\nDefinition 2.1. If A is a set of pure formulas and R is a set of one-step rules, we write\\\\n;  LRA+Name  if there are 1 , . . . , n   such that 1  . . . n   is LR-derivable\\\\n\\\\n\\\\f650\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\nfrom assumptions in  where additionally all substitution instances of axioms in A and the rule\\\\ni\\\\n(i \\\\n/ N())\\\\n(Name)\\\\n\\\\nmay be used in deductions. As before, we write  LRA+Name  if ;  LRA+Name .\\\\nIn the above system, the rule (Name ) @i / (i \\\\n/ N() and the rule\\\\n@j (  )\\\\n(j \\\\n/ N(, ))\\\\n  \\\\nare derivable. The system is clearly sound for both global and local consequence over A-models in\\\\nthe same sense that LR is sound over T -models.\\\\n(NameCong)\\\\n\\\\nDefinition 2.2. Let A  () be a set of pure axioms, and let   () be a TBox. A set\\\\n  () is (LRA + Name)--inconsistent if there are 1 , . . . , n   such that  LRA+Name\\\\n(1      n ). Otherwise,  is (LRA + Name)--consistent. A subset of @F(), i.e. a set\\\\nof @-formulas, is called an ABox (again borrowing terminology from description logic). A maximally (LRA + Name)--consistent ABox is a maximal element K among the (LRA + Name)-consistent ABoxes, ordered by inclusion. For such a K, we write SK = {Ki | i  N}, where\\\\nKi = {  () | @i   K}, and put VK (i) = {Ki } = {Kj  SK | i  Kj }.\\\\nFor the construction of a named model, we now fix a maximally (LRA+Name)--consistent ABox\\\\nK. Later, we will take K to be a maximally consistent extension of a given set  of formulas, where\\\\nwe may assume, thanks to the rule (Name ), that   @(). We note the following trivial facts:\\\\nLemma 2.3. We have   Ki for all   A and all substitutions , and moreover K    Ki .\\\\nOur goal is t",
    "Experiment": "he construction of named canonical models in the following sense:\\\\nDefinition 2.4. A named canonical K-model is a model (SK , , VK ) such that\\\\n(Ki )  [[]] iff   Ki\\\\nfor every nominal i, where  = {Kj  SK |   Kj }.\\\\nIt is clear that named canonical models are countable, as there are only countably many nominals.\\\\nLemma 2.5 (Truth lemma for named canonical models). If M = (SK , , VK ) is a named canonical\\\\nK-model and  is a hybrid formula, then for every Ki  SK ,\\\\nM, Ki |=  iff\\\\n\\\\n  Ki .\\\\n\\\\nHence, M |= , and M is an A-model.\\\\nThe last clause of the truth lemma follows from Lemma 2.3, the crucial point being that satisfaction\\\\nof all substitution instances of A implies frame satisfaction of A because every state in the model\\\\nis denoted by some nominal. We now establish two criteria for the existence of named canonical\\\\nmodels. The first criterion assumes a stronger form of one-step completeness than the second, which\\\\ninstead demands that the modalities are bounded.\\\\n\\\\n\\\\fNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n\\\\n651\\\\n\\\\n2.1. Pure Completeness for Strongly One-Step Complete Logics\\\\nThe construction of named models hinges on the following notion of pastedness, which assures that\\\\nnominals interact correctly across the whole model. For the rest of the section, we fix a one-step\\\\ncomplete rule set R, a set A of pure axioms, and a set   () of global assumptions, and we write\\\\nconsistent instead of (LRA + Name)-consistent.\\\\nDefinition 2.6. An ABox K is 0-pasted if whenever @j (  )  K for all nominals j, then\\\\n@i (  )  K for all nominals i.\\\\nIt is clear that K can induce a named model only if K is 0-pasted. The construction of pasted\\\\nABoxes requires a Henkin-like extension of the logical language by adding new nominals. Generally, we denote by ()+ an extended language with countably many new nominals not appearing in\\\\n(). We note the fact (slightly glossed over in the literature) that this extension is conservative:\\\\nLemma 2.7. If   () is consistent, then  remains consistent in ()+ .\\\\nLemma 2.8 (Extended Lindenbaum lemma for 0-Pasted Sets). If   F() is consistent, then\\\\nthere exists a 0-pasted maximally consistent ABox K  @()+ and a nominal i in ()+ such that\\\\n@i   K.\\\\n(The proof of the above version of the Lindenbaum lemma uses Lemma 2.7, and exploits the Name\\\\nrule to introduce the nominal i.) As we are aiming for strong completeness results, (weak) one-step\\\\ncompleteness as employed in weak completeness proofs using finite models [14, 19] is no longer\\\\nadequate. Accordingly, our first criterion assumes a stronger condition:\\\\nDefinition 2.9. A rule set R is strongly one-step complete if for every set X, every one-step consistent subset of Prop((P(X))) is one-step satisfiable.\\\\nLemma 2.10 (Named existence lemma, Version 1). If K is 0-pasted and R is strongly one-step\\\\ncomplete, then there exists a named canonical K-model.\\\\nIn summary, we have:\\\\nTheorem 2.11. If R is strongly one-step complete, then every extension of LR by pure axioms is\\\\nboth globally and locally strongly complete over countable hybrid models when equipped with the\\\\nName rule. That is, if ,   () and   (), then ;  LRA+Name  whenever ;  |=C ,\\\\nwhere C is the class of countable A-models.\\\\nProof. As usual, we show that every (LRA + Name)--consistent set   () is satisfiable in\\\\na countable A-model M such that M |=  (where satisfiability is clearly invariant under passing\\\\nfrom () to ()+ ). The extended Lindenbaum lemma yields a 0-pasted maximally consistent subset\\\\nABox K  ()+ and a nominal i in ()+ such that @i   K. By the named existence lemma,\\\\nwe find a named, hence countable, canonical K-model M = (SK , , VK ), and by the truth lemma\\\\n(Lemma 2.5), M is an A-model, M |= , and M, Ki |= .\\\\nRemark 2.12. In the literature (e.g. [3, Theorem 7.29]), the above completeness theorem is sometimes phrased as completeness with respect to named models, i.e. models where every state is\\\\nthe denotation of some nominal; such models also played a central role in the early development of\\\\nhybrid logic by the Sofia school (see e.g. [15]). In detail, this means that every state of the model\\\\nis the denotation of a nominal in a language extended with countably many new nominals. This\\\\nextension is necessary, as otherwise the consistent set {n | n  N} would be satisfiable in a\\\\nmodel where every state is named by a nominal n  N of the original language, which is clearly\\\\n\\\\n\\\\f \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n652\\\\n\\\\nimpossible. Completeness with respect to models where every state is named by a nominal in an\\\\nextended language, on the other hand, is an immediate consequence of completeness with respect\\\\nto countable models.\\\\nExample 2.13. The previous theorem establishes strong completeness results for pure extensions\\\\nof all hybrid logics with neighbourhood semantics (Example 1.1.4) that are defined by rank-1 axioms [20], i.e. modal formulas where the nesting depth of modalities is uniformly equal to 1 (such\\\\nas the monotonicity axiom \\\\u0003(a  b)  \\\\u0003b). For the monotonic cases, i.e. extensions of monotonic\\\\nhybrid logic, these results are essentially known [24], while they seem to be new for the nonmonotonic cases, i.e. extensions of classical hybrid logic not containing the monotonicity axiom,\\\\nincluding, e.g., various deontic logics [12]. Moreover, the theorem newly proves strong completeness of the hybridization of coalition logic, as Theorem 3.2 of [17] essentially states that coalition\\\\nlogic satisfies strong one-step completeness.\\\\n2.2. Pure Completeness for Bounded Logics\\\\nThe condition of strong one-step completeness used in the previous section is a comparatively rare\\\\nphenomenon [20]; the strength of the condition becomes clear in the fact that, unlike in the classical\\\\ncase of Kripke semantics, the above did not require a notion of 1-pastedness [5]. We proceed to\\\\npresent an alternative approach for the case where one does have an analogue of the (Paste-1) rule\\\\n this is the case if the operators are bounded, i.e., their satisfaction hinges, in each case, on only\\\\nfinitely and boundedly many states of a model.\\\\nDefinition 2.14. A modal operator  is k-bounded for k  N with respect to a -structure T if for\\\\nevery set X and every A  X,\\\\nS\\\\n[[]]X (A) = BA,#Bk [[]]X (B).\\\\n(This implies in particular that  is monotonic.) We say that  is bounded w.r.t. T if every modal\\\\noperator  in  is k -bounded for some k .\\\\nThe boundedness of an operator can now be internalized in the logical deduction system. In particular, for k-bounded operators , one has the paste rule\\\\n@j1       @jk   @i (j1      jk )  \\\\n(Paste(k))\\\\n@i   \\\\nwith the side condition that the jr are pairwise distinct fresh nominals.\\\\nWe write\\\\n LRA+Name+Paste  if  is derivable from assumptions in  in the system LR + Name where\\\\nadditionally the rule (Paste(k)) may be used in deductions for k-bounded operators . This induces the notion of (LRA+Name +Paste)--consistency, which we briefly refer to as consistency\\\\nas we fix , A, and R throughout. Again, the system is clearly sound, i.e. ;  |=C  whenever\\\\n;  LRA+Name+Paste , where C is the class of A-models.\\\\nExamples 2.15.\\\\n1. Hybrid K. The modal operator  is 1-bounded. The arising paste rule\\\\n(Paste(1)) is precisely the rule (paste) of [4].\\\\n2. Graded hybrid logic. The modal operator k is (k + 1)-bounded. One thus has a paste rule\\\\n(Pastek (k + 1))\\\\nwith side conditions as before.\\\\n\\\\n@j1       @jk+1   @i k (j1      jk+1 )  \\\\n@i k   \\\\n\\\\n\\\\fNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n\\\\n653\\\\n\\\\nP\\\\n3. Positive Presburger hybrid logic. A Presburger operator\\\\nai  #( i )  k (Example 1.1) is\\\\nk-bounded if the ai are positive. E.g., this still allows expressing the statement, generally believed\\\\nto be valid in the German national football league, that a team that has at least 37 points will not be\\\\nrelegated: 3  #win + 1  #draw  37  relegated.\\\\nThe generalized 1-pastedness condition for bounded operators is as follows.\\\\nDefinition 2.16. Let  be bounded. An ABox K is 1-pasted if whenever  is k-bounded and\\\\n@i   K, then {@j1 , . . . , @jk , @i (j1      jk )}  K for some nominals j1 , . . . , jk .\\\\nAgain, it is clear that if  is bounded, then K can induce a named model only of K is 1-pasted. It is\\\\neasy to see that if R is one-step complete and  is bounded (in fact already if R derives monotony\\\\nfor every   ), then every 1-pasted set is also 0-pasted (Definition 2.6).\\\\nLemma 2.17 (Extended Lindenbaum lemma for 1-pasted sets). Let  be bounded. If   F() is\\\\nconsistent, then there exist a 1-pasted maximally consistent ABox K  @()+ and a nominal i in\\\\n()+ such that @i   K, where ()+ is as in Section 2.1.\\\\nBounded operators now allow us to use a weaker version of one-step completeness. Instead of\\\\nrequiring that all one-step consistent sets are one-step satisfiable, we may restrict to finite extensions\\\\nof propositional variables.\\\\nDefinition 2.18. We say that R is strongly finitary one-step complete if for every set X, every\\\\none-step consistent subset of Prop((Pfin (X))) is one-step satisfiable.\\\\nClearly, any strongly one-step complete rule set is also strongly finitary one-step complete, but the\\\\nexample of graded hybrid logic witnesses that the converse is not true. We note that the weaker\\\\ncriterion still fails for probabilistic logics due to inherent non-compactness [23]; probabilistic logics\\\\nalso fail to be bounded, as a given probability p  [0, 1] can be split into any number of summands.\\\\nTogether with boundedness, the above condition enables a second version of the named existence\\\\nlemma.\\\\nLemma 2.19 (Named existence lemma, Version 2). If  is bounded, R is strongly finitary one-step\\\\ncomplete, and K is 1-pasted, then there exists a named canonical K-model.\\\\nSummarizing the above, we have the following extended completeness result.\\\\nTheorem 2.20. Let  be bounded, and let R be strongly finitary one-step complete. Then every\\\\nextension of LR by pure axioms is globally and locally strongly complete over countable hybrid\\\\nmodels when equipped with the Name and Paste rules. In other words, if ,   (),   (),\\\\nand C is the class of all countable A-models, then ;  LRA+Name+Paste  whenever ;  |=C .\\\\nThe proof follows the same route via extended Lindenbaum lemma, existence lemma, and truth\\\\nlemma as for Theorem 2.11.\\\\nExample 2.21. By Example 2.15 and the fact that the known complete axiomatizations of the\\\\nassociated modal logics are in fact strongly finitary one-step complete, the previous theorem proves\\\\ncompleteness of pure extensions of hybrid K, graded hybrid logic, and positive Presburger hybrid\\\\nlogic. Except for the standard case of hybrid K, these results seem to be new. In particular, we\\\\nobtain completeness of pure extensions of graded (or positive Presburger) hybrid logic defining the\\\\nfollowing frame classes in multigraph semantics:\\\\n The class of Kripke frames, seen as the class of multigraphs where the transition multiplicity\\\\nbetween two individual states is always at most 1, defined by the pure axiom 1 i.\\\\n\\\\n\\\\f654\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\n The class of reflexive multigraphs, defined by the pure axiom i  0 i.\\\\n The class of transitive multigraphs, defined by the pure axioms 0 n i  n i, n  0.\\\\n The class of symmetric multigraphs, i.e., those where the transition multiplicity from x to y\\\\nalways equals the one from y to x, which is defined by the pure axioms i  k j  @j k i.\\\\nOther frame classes of interest, see e.g. [3, Section 7.3], can be characterized similarly by translating\\\\nthe corresponding frame conditions from Kripke to multigraph semantics.\\\\n2.3. The Mixed Case\\\\nIn some cases, the two methods laid out in the preceding sections can be combined for modal\\\\noperators with several arguments that adhere, in each of their arguments, to one of the respective\\\\nsets of semantic conditions. For the sake of readability, we formulate this explicitly only for the\\\\nmixed binary case with a single modal operator, i.e. we assume in this section that  = {} with\\\\n binary; the generalization to arbitrary numbers of arguments, several modal operators etc. should\\\\nbe obvious, and essentially only requires more elaborate terminology and notation.\\\\nDefinition 2.22. We say that R is (strongly, strongly finitary) one-step complete if every one-step\\\\nconsistent subset of Prop((P(X)  Pfin (X))) is one-step satisfiable. Moreover, we say that  is\\\\nk-bounded\\\\nin the second argument for k  N if for every set X and all A, B  X, [[]]X (A, B) =\\\\nS\\\\nCA,#Ck [[]]X (A, C).\\\\nIn the same manner as for Theorems 2.11 and 2.20, we derive:\\\\nTheorem 2.23. If R is (strongly, strongly finitary) one-step complete and  is k-bounded in the\\\\nsecond argument, then every extension of LR by pure axioms is both locally and globally strongly\\\\ncomplete over countable hybrid models when equipped with the appropriate Name and Paste rules.\\\\nExample 2.24. Hybrid CK (Example 1.1) is easily seen to be (strongly, strongly finitary) one-step\\\\ncomplete, and the operator > defined from the conditional operator  by a > b : (a  b)\\\\nis 1-bounded in the second argument. By the above, it follows that every pure extension of hybrid\\\\nCK is strongly complete over countable hybrid selection function models. E.g. we may define\\\\nthe class of conditional frames where all expressible conditions induce transitive relations by pure\\\\naxioms ( >  > i)  ( > i). Such frames satisfy also the dual axiom (using a propositional\\\\nvariable a) (  a)  (  (  a)), an axiom for duplicating conditional assumptions. Similar\\\\nstatements apply to a combination of graded and conditional logic (obtainable compositionally using\\\\nthe methods of [21]), which has operators of the form a k b if a, then one normally has more\\\\nthan k instances of b.\\\\nThe semantics of conditional logics in general has complex ramifications, involving, e.g., preference orderings or systems of spheres (see, e.g., [10, 18]); application of our methods to conditional\\\\nlogics beyond CK is the subject of further investigation. We note that pure completeness of a hybrid\\\\nextension of Lewis logic of counterfactuals has been established recently [18].\\\\n\\\\n3. Local Binding\\\\nWe next investigate completeness of a stronger hybrid language that includes the  binder, which\\\\nbinds a state variable to the current state. Concretely, we allow formulas of the form  i. , wherein\\\\nthe nominal i is locally bound (for compactness of presentation, we give up the usual distinction\\\\nbetween nominals and state variables). Given a modal similarity type , we write  () for the\\\\n\\\\n\\\\fNAMED MODELS IN COALGEBRAIC HYBRID LOGIC\\\\n\\\\n655\\\\n\\\\nensuing extension of (). The reading of the formula  i. is  holds for the current state i. The\\\\nsatisfaction relation in the extended logic is defined by an additional clause for the  binder,\\\\n(C, , V ) |= i.  iff (C, , V [c/i]) |= \\\\nwhere c is a state in a coalgebra C and V [c/i] is obtained from V by modifying the value of i to c.\\\\nThe semantics of the  binder immediately translates into the axiom scheme (see e.g. [4])\\\\n(DA)\\\\n\\\\n@i (( j. )  [i/j]).\\\\n\\\\nGiven a set R of -rules, a set   () of formulas and a set A  @ () of pure axioms,\\\\nwe write  LRA+Name+Paste+DA  for the extension of the associated provability predicate\\\\nLRA+Name+Paste with (DA). Using (DA), one easily proves an extension of the truth lemma\\\\nfor named models (Lemma 2.5) to  (), so that the completeness results for pure extensions proved\\\\nbefore (Theorems 2.11, 2.20, and 2.23) transfer immediately to L . We make this explicit for the\\\\nbounded case:\\\\nTheorem 3.1. If  is bounded and R is strongly finitary one-step complete, then every pure extension of L is strongly locally and globally complete over countable hybrid models. In other words,\\\\n;  |=C  iff ;  LRA+Name+Paste+DA  for all   () and all ,   (), where C is the\\\\nclass of all countable A-models.\\\\nRemark 3.2. As noted in [24], the named model construction more generally yields completeness\\\\nfor any locally definable extension of the hybrid language, i.e. any extension whose semantics at\\\\nnamed states is defined by a formula similar to (DA).\\\\nExample 3.3. Continuing Example 2.15, Theorem 3.1 reproves not only the known completeness\\\\nof pure extensions of hybrid K with , but also the completeness of pure extensions of graded (or\\\\npositive Presburger) hybrid logic with . This extends easily to the multi-agent case, or, in description logic terminology, to description logics with multiple roles. As, moreover, both a role hierarchy\\\\nand transitivity of roles can be defined using pure axioms, we thus arrive at a complete axiomatization of an extension of the description logic SHOQ with satisfaction operators and , which has\\\\nbeen used in connection with conjunctive query answering [11], and allows, e.g., talking about the\\\\nnumber of stepchildren of a stepmother, in continuation of the stepmother example from [13], .\\\\n\\\\n4. ",
    "Discussion": "Conclusions\\\\nWe have laid out two criteria for the existence of named canonical models in coalgebraic hybrid\\\\nlogics  one that applies to cases where one has an analogue of the so-called Paste-1 rule of standard hybrid logic, and one which applies to cases where one does not need any such rule. While\\\\nthe latter means essentially that the logic is equipped with a neighbourhood semantics, the former\\\\nrequires that all modal operators of the logic are bounded, i.e. there is always only a bounded number of states relevant for their satisfaction at each point. Our main novel example of this type is\\\\ngraded hybrid logic (and an extension of it using certain Presburger modalities [9]). The named\\\\nmodel construction entails completeness of pure extensions and completeness of extended hybrid\\\\nlanguages with the local binder  (of which the Ime construct of [13] is a single-variable restriction), which we thus obtain as new results for, e.g., hybrid coalition logic, hybrid classical modal\\\\nlogic, several hybrid deontic logics, hybrid conditional logic, graded hybrid logic, and an extension\\\\nof the description logic SHOQ. An open question that remains is the existence of so-called orthodox axiomatizations [4] in the presence of , as well as to find an analogue of the characterization\\\\nresult of [24] stating that a variant of the Paste-1 rule characterizes the Kripke models among the\\\\n\\\\n\\\\f656\\\\n\\\\n \\\\nL. SCHRODER\\\\nAND D. PATTINSON\\\\n\\\\ntopological models of S4. A further topic of investigation is to find decidable fragments of the language with ; we note slightly speculatively that the fragment used in [13] may, in our terminology,\\\\nbe seen as requiring that a suitably defined NNF of a formula contains only positive occurrences of\\\\nbound nominals under bounded modal operators.\\\\n\\\\nReferences\\\\n[1] C. Areces, P. Blackburn, and M. Marx. A road-map on complexity for hybrid logics. In Computer Science Logic,\\\\nCSL 99, vol. 1683 of LNCS, pp. 307321, 1999.\\\\n[2] F. Baader, D. Calvanese, D. L. McGuinness, D. Nardi, and P. F. Patel-Schneider, eds. The Description Logic Handbook. Cambridge University Press, 2003.\\\\n[3] P. Blackburn, M. de Rijke, and Y. Venema. Modal Logic. Cambridge University Press, 2001.\\\\n[4] P. Blackburn and B. ten Cate. Pure extensions, proof rules, and hybrid axiomatics. Stud. Log., 84:277322, 2006.\\\\n[5] P. Blackburn and M. Tzakova. Hybrid languages and temporal logic. Logic J. IGPL, 7:2754, 1999.\\\\n[6] B. Chellas. Modal Logic. Cambridge University Press, 1980.\\\\n[7] C. Cirstea, A. Kurz, D. Pattinson, L. Schr oder, and Y. Venema. Modal logics are coalgebraic. The Computer Journal,\\\\n2009. In print.\\\\n[8] G. DAgostino and A. Visser. Finality regained: A coalgebraic study of Scott-sets and multisets. Arch. Math. Logic,\\\\n41:267298, 2002.\\\\n[9] S. Demri and D. Lugiez. Presburger modal logic is only PSPACE-complete. In Automated Reasoning, IJCAR 06,\\\\nvol. 4130 of LNAI, pp. 541556. Springer, 2006.\\\\n[10] N. Friedman and J. Y. Halpern. On the complexity of conditional logics. In Knowledge Representation and Reasoning, KR 94, pp. 202213. Morgan Kaufmann, 1994.\\\\n[11] B. Glimm, I. Horrocks, and U. Sattler. Conjunctive query answering for description logics with transitive roles. In\\\\nDescription Logics, DL 06, vol. 189 of CEUR Workshop Proceedings. CEUR-WS.org, 2006.\\\\n[12] L. Goble. A proposal for dealing with deontic dilemmas. In Deontic Logic in Computer Science, DEON 04, vol.\\\\n3065 of LNAI, pp. 74113. Springer, 2004.\\\\n[13] M. Marx. Narcissists, stepmothers and spies. In Description Logics, DL 02, CEUR Workshop Proceedings, 2002.\\\\n[14] R. Myers, D. Pattinson, and L. Schr oder. Coalgebraic hybrid logic. In Foundations of Software Science and Computation Structures, FOSSACS 09, LNCS. Springer, 2009. To appear.\\\\n[15] S. Passy and T. Tinchev. PDL with data constants. Inf. Process. Lett., 20:3541, 1985.\\\\n[16] D. Pattinson. Coalgebraic modal logic: Soundness, completeness and decidability of local consequence. Theoret.\\\\nComput. Sci., 309:177193, 2003.\\\\n[17] M. Pauly. A modal logic for coalitional power in games. J. Logic Comput., 12:149166, 2002.\\\\n[18] K. Sano. Hybrid counterfactual logics. J. Log. Lang. Inf., 18:515539, 2009.\\\\n[19] L. Schr oder. A finite model construction for coalgebraic modal logic. J. Log. Algebr. Prog., 73:97110, 2007.\\\\n[20] L. Schr oder and D. Pattinson. Rank-1 modal logics are coalgebraic. J. Logic Comput. In print.\\\\n[21] L. Schr oder and D. Pattinson. Modular algorithms for heterogeneous modal logics. In Automata, Languages and\\\\nProgramming, ICALP 07, vol. 4596 of LNCS, pp. 459471. Springer, 2007.\\\\n[22] L. Schr oder and D. Pattinson. PSPACE bounds for rank-1 modal logics. ACM Trans. Comput. Log., 10(2:13):133,\\\\n2009.\\\\n[23] L. Schr oder and D. Pattinson. Strong completeness of coalgebraic modal logics. In Theoretical Aspects of Computer\\\\nScience, STACS 09, Leibniz International Proceedings in Informatics, pp. 673684. Schloss Dagstuhl  LeibnizZentrum f ur Informatik, 2009.\\\\n[24] B. ten Cate and T. Litak. Topological perspective on the hybrid proof rules. In Hybrid Logic, HyLo 06, vol. 174 of\\\\nENTCS, pp. 7994, 2007.\\\\n\\\\nThis work is licensed under the Creative Commons Attribution-NoDerivs License. To view a\\\\ncopy of this license, visit http://creativecommons.org/licenses/by-nd/3.0/.\\\\n\\\\n\\\\f\"}\\n'"
  },
  "key_words": {
    "Abstract": [
      [
        "coalgebraic hybrid logic",
        0.7129
      ],
      [
        "hybrid logic broad",
        0.647
      ],
      [
        "hybrid logic",
        0.6362
      ],
      [
        "hybrid logic extends",
        0.6297
      ],
      [
        "study hybrid logic",
        0.6281
      ]
    ],
    "Introduction": [
      [
        "hybrid logic",
        0.6618
      ],
      [
        "logics later description",
        0.6359
      ],
      [
        "description logics nwhere",
        0.6154
      ],
      [
        "logics seen extensions",
        0.5879
      ],
      [
        "logics traditionally",
        0.586
      ]
    ],
    "Related Work": [
      [
        "logics coalgebraic",
        0.704
      ],
      [
        "logics ones coalgebraic",
        0.703
      ],
      [
        "coalgebraic modal logic",
        0.6995
      ],
      [
        "coalgebraic hybrid logics",
        0.6632
      ],
      [
        "logics coalgebraic hybrid",
        0.656
      ]
    ],
    "Methodology": [
      [
        "semantics modal logics",
        0.6545
      ],
      [
        "modal logic defined",
        0.6456
      ],
      [
        "logics conveniently described",
        0.6112
      ],
      [
        "classical modal logic",
        0.6104
      ],
      [
        "modal logics",
        0.6052
      ]
    ],
    "Experiment": [
      [
        "named canonical model",
        0.6861
      ],
      [
        "named canonical models",
        0.6802
      ],
      [
        "canonical models sk",
        0.6545
      ],
      [
        "canonical models",
        0.6422
      ],
      [
        "canonical model sk",
        0.6417
      ]
    ],
    "Discussion": [
      [
        "hybrid logics",
        0.7276
      ],
      [
        "logics hybrid",
        0.7179
      ],
      [
        "hybrid logic extension",
        0.6978
      ],
      [
        "logic hybrid classical",
        0.6957
      ],
      [
        "standard hybrid logic",
        0.6934
      ]
    ]
  },
  "summarization": {
    "Abstract": "hybrid logic extends modal logic with support for reasoning about individual states. We study hybrid logic in the broad context of coalgebraic semantics. We prove completeness of graded hybrid logic with local binding in the framework of coal algebraic hybrid logic.    the paper was presented at theSymposium on Theoretical Aspects of Computer Science.",
    "Introduction": "modal logics have traditionally played a central role in Computer Science. Hybrid logic extends modal logic with the ability to reason about individual states in models. This feature has found its way into modern description logics and other logics.    the idea of de-symmetry is introduced in this paper.",
    "Related Work": "noted by the letter O in the standard naming scheme. coalgebraic modal logic is a unifying semantic bracket for a range of other logics. It includes various models beyond Kripke structures and neighbourhood models. The class of logics is known as coal algebraic hybrid logics and nominals.",
    "Methodology": "modal logic is a theory of named canonical models for hybrid logics. We prove strong completeness of the basic hybrid logic, but also of pure extensions and local binding. We introduce a new form of coalgebraic semantics for the hybrid logic. We show how to play the roles of a set of states in a model.",
    "Experiment": "a named canonical K-model is a model with only countably many nominals. The construction of named models hinges on the notion of pastedness. We show that named canonical models are countable in a number of ways. We prove the existence of a strong form of one-step completeness in the logical language.",
    "Discussion": "name canonical models in coalgebraic hybrid logics. we show that they are possible. we also show that their existence requires that all modal operators of the logic are bounded. we conclude that the existence of such models can be verified using the Paste-1 rule of hybrid logic."
  }
}